{"title":"Notes From Underground (1995)","uid":7766706,"size":894808654,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:023cf13068d5aeca739b842f6dad53179cf50bd3&amp;dn=Notes+From+Underground+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sq3ak_","files":1,"time":1351396028,"description":"Format: mkv\nResolution: 720x352\nFramerate: 29.97\nAudio: AAC 320kbps\nVideo: H264.\n\n\nAdapted from the novel by Fyodor Dostoevsky of the same title, Notes From Underground has quite a cult following as a truly magnificent work of art. Download this.\n\n&quot;The self-defeating, somewhat neurotic protagonist manages to mess up every opportunity of improving his life that comes his way but manages to do so from a position of either moral or intellectual superiority. He justifies logically all his disastrous decisions and questions the sanity of anything he does that is motivated by emotion. He can't see the point.\n\nHe vacillates constantly between rejecting everyone around him and craving their love, friendship or forgiveness. Having met the &quot;hooker with a heart of gold&quot; who tidies his flat and, uniquely in the film, shows him respect and love, he drives her away with brutality and insults. In a momentary spell of remorse, he searches for her in the rain-soaked streets and looking back on this act in his video diary asks: &quot;Why did I look for her? If I had found her, I would just have got back with her and tormented her again&quot;\n\nThe acting is excellent, the photography tight and claustrophobic, which suits the protagonists tiny world. The editing cuts between his direct contributions to video diary, historical narrative and his flights of fancy at various points. It DID make me want to read the book but I think the film a work that stands up well on its own.&quot;","torrent":{"xt":"urn:btih:023cf13068d5aeca739b842f6dad53179cf50bd3","amp;dn":"Notes+From+Underground+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"023cf13068d5aeca739b842f6dad53179cf50bd3","infoHashBuffer":{"type":"Buffer","data":[2,60,241,48,104,213,174,202,115,155,132,47,109,173,83,23,156,245,11,211]},"announce":[],"urlList":[]}}