{"title":"Lightnin' Hopkins - 1974 - The Sonet Blues Story (2005) FLAC","uid":9319087,"size":285286930,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0244968ee28eaedc49e89ade5fa20bd6487c8072&amp;dn=Lightnin%27+Hopkins+-+1974+-+The+Sonet+Blues+Story+%282005%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"eika256","files":-1,"time":1386515292,"description":"Lightnin' Hopkins - 1974 - The Sonet Blues Story (2005)\n\nLightnin' Hopkins recorded so often and for so many labels that it's easy to get lost in it all, and there is virtually no such thing as the perfect Hopkins album. He did his thing each time out, whether acoustic or electric, solo or with a band, half improvising his lyrics over a small assortment of different blues shuffles, shifting chords and gears seemingly at whim (which made him frequently difficult to accompany, even for the sharpest session player). His tough, Texas take on the country blues, though, and his penchant for off the wall themes and lyrics, made Hopkins an utterly unique bluesman, and if he seems to be pulling the same rabbit out of the same hat time and time again, he somehow managed to make it seem like a new trick each time. This extremely loose set was recorded in Houston in 1974 and was originally released as part of Samuel Charters' Legacy of the Blues series that same year. It features Hopkins playing an acoustic guitar with an electric pick up backed by a valiant three-piece band that consisted of Ira James on harmonica, Larry &quot;Bones&quot; McCall on drums, and Rusty Myers and Ozell Roberts splitting time on bass. These guys try to make sense of Hopkins' personalized sense of rhythm as best they can, and together with Hopkins' skewed, half improvised lyrics, they manage to make a few things work here, including the conversational &quot;The Hearse Backed Up to the Door,&quot; the metaphor-filled &quot;I Been Burning Bad Gasoline,&quot; and the brisk instrumental, &quot;Doin' My Boogie,&quot; one of two bonus tracks included in this reissue. Most of these songs, though, feel like the kinds of things a band plays before actually recording a take, when little things like tempo and rhythm are still being worked on, and the end result seems even more ragged and random than the typical ragged and random Lightnin' Hopkins session. (AllMusic)\n\nTrack list:\n01 - Please Help Poor Me\n02 - Way Out In Abilene\n03 - Don't You Call That Boogie\n04 - Swing In The Backyard\n05 - The Hearse Is Backed Up To The Door\n06 - That Meat's A Little Too High\n07 - Let Them Little Things Be True\n08 - I Been Burning Bad Gasoline\n09 - Don't You Mess With My Woman\n10 - Water Fallin' Boogie\n11 - Born By The Devil\n12 - Doin' My Boogie\n\nPersonnel:\nLightnin' Hopkins - vocals, guitar\nIra James - harmonica\nLarry &quot;Bones&quot; McCall - drums\nOzell Roberts - bass\nRusty Myers - bass\n\nEnjoy and share!","torrent":{"xt":"urn:btih:0244968ee28eaedc49e89ade5fa20bd6487c8072","amp;dn":"Lightnin%27+Hopkins+-+1974+-+The+Sonet+Blues+Story+%282005%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0244968ee28eaedc49e89ade5fa20bd6487c8072","infoHashBuffer":{"type":"Buffer","data":[2,68,150,142,226,142,174,220,73,232,154,222,95,162,11,214,72,124,128,114]},"announce":[],"urlList":[]}}