{"title":"The Vines-Future Primitive-2011-JUST","uid":6508720,"size":70706635,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:028b1de5584d0c78d26c601da367e8078e7a8b21&amp;dn=The+Vines-Future+Primitive-2011-JUST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soupucia","files":-1,"time":1309544341,"description":"Artist.......: The Vines\nAlbum........: Future Primitive\nLabel........: Sony Music\nGenre........: Rock\nCatnr........: n/a\nSource.......: CD (LP)\nRip.date.....: 2011-06-30\nStr.date.....: 2011-06-20\nQuality......: 274kbps/44.1kHz/Joint Stereo\nUrl..........: http://www.thevines.com\n\ntrack  title                                          time\n\n1.    Gimme Love                                     1:51\n2.    Leave Me In The Dark                           1:59\n3.    Candy Flippin Girl                             2:32\n4.    A.S.4                                          3:20\n5.    Weird Animals                                  2:01\n6.    Cry                                            2:36\n7.    Future Primitive                               1:54\n8.    Riverview Avenue                               2:03\n9.    Black Dragon                                   3:29\n10.   All That You Do                                3:33\n11.   Outro                                          3:47\n12.   Goodbye                                        2:14\n13.   S.T.W                                          2:19\n\nRuntime  33:38\nSize     66.25\n\nRelease Notes:\n\nFormed in Australia in the late '90s, the Vines rose to\nprominence during the garage rock revival of the early\n2000s, joining bands such as the Hives, Jet, and the\nLibertines in their confident swagger and punky energy.\nWhile other groups took cues from the Stooges and MC5,\nhowever, the Vines found inspiration elsewhere,\nparticularly in the grungy craft of Nirvana and the\nmelodic, psychedelic appeal of vintage British pop. The\ncombination helped make their debut album, 2002's Highly\nEvolved, an international hit, while the erratic\nbehavior displayed by frontman Craig Nicholls (who was\nlater diagnosed with Asperger's Syndrome) attracted a\nconsiderable amount of media attention. Nicholls'\nuntreated condition came to a head several years later,\nforcing the band to take an indefinite hiatus from\nlarge-scale touring. Nevertheless, the Vines continued\nto play sporadic shows while issuing new albums, the\nbulk of which combined a garage rock foundation with\nflashes of melodic psychedelia.\n\nFuture bandmates Craig Nicholls and Patrick Matthews met\nwhile working at McDonalds in Sydney. With Matthews\nplaying bass, Nicholls handling guitar, and friend David\nOliffe playing drums, the three musicians began playing\nNirvana covers while steadily building a catalog of\noriginal material. By 2001, the band's own sound had\nattracted the attention of XL Records, the British label\nresponsible for issuing the White Stripes' albums in the\nU.K. XL released the Vines' debut single that November,\nleading to a European craze that saw NME praising the\nband for &quot;breathing new life into classic stuff.&quot; One\nmonth after the single's release, the Vines inked a\ncontract with Heavenly Records in the U.K., a move that\nafforded them enough leverage to sign with Australia's\nEMI branch the following year.\n\nAs their buzz built overseas, the band decamped to Los\nAngeles to record a full album with producer Rob\nSchnapf. Drummer Hamish Rosser was brought aboard to\nreplace the departing Oliffe, and guitarist Ryan\nGriffiths joined shortly thereafter. Now a competent\nquartet, the Vines toured the U.K. in support of their\nsecond single, the 90-second juggernaut &quot;Highly\nEvolved,&quot; and made their American debut at the Coachella\nMusic and Arts Festival in Indio, CA. The debut album\nHighly Evolved then arrived in July 2002, sporting a\nmelodically brash sound that led to platinum sales in\nAustralia and gold certifications in the U.K. and United\nStates. The band also graced the cover of Rolling Stone\nMagazine that October, accompanied by the headline &quot;Rock\nis Back: Meet the Vines.&quot;\n\nHowever, the sophomore effort Winning Days failed to\nlive up to its predecessor, falling short in overall\nsales and critical reception upon its release in 2004.\nFurthermore, Nicholls' bratty behavior had spiraled into\nsomething else entirely, culminating in a disastrous\nhometown performance that found him berating the crowd.\nPatrick Matthews responded by walking offstage and\nquitting the band, while Nicholls proceeded to attack a\nphotographer after the show's premature finish. Charges\nwere later pressed, and it was revealed during the\nresulting court date that Nicholls suffered from\nAsperger's syndrome. The singer agreed to seek treatment\nfor the disorder; in the meantime, however, the Vines\ncanceled all shows in support of Winning Days, and\nMatthews cemented his departure by joining the band\nYouth Group.\n\nThe Vines' third album, Vision Valley, appeared in 2006,\nfeaturing a back-to-basics combination of grunge anthems\nand tight, focused garage punk. The band seemed to be\nfinding its footing again, but sales were nonetheless\npoor, prompting the Vines' various labels (including\nCapitol, their representation in America) to drop the\nband in 2007. After partnering with the Sydney-based Ivy\nLeague Records shortly thereafter, the Vines reprised\ntheir relationship with producer Rob Schnapf and\nrecorded Melodia. Several tours were planned in advance\nof its 2009 release, but Nicholls' condition once again\nforced the Vines to take a break, resulting in the\ncancellation of their Japanese tour as well as a\nscheduled appearance at Homebake 2008.","torrent":{"xt":"urn:btih:028b1de5584d0c78d26c601da367e8078e7a8b21","amp;dn":"The+Vines-Future+Primitive-2011-JUST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028b1de5584d0c78d26c601da367e8078e7a8b21","infoHashBuffer":{"type":"Buffer","data":[2,139,29,229,88,77,12,120,210,108,96,29,163,103,232,7,142,122,139,33]},"announce":[],"urlList":[]}}