{"title":"Scientific and Technological Thinking {BBS}","uid":6825644,"size":23452379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:029c3821cf491cb84e0b5c56c5982d737d04c631&amp;dn=Scientific+and+Technological+Thinking+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321551154,"description":"At the turn of the 21st century, the most valuable commodity in society is knowledge--particularly new knowledge that may give a culture, company, or laboratory an adaptive advantage. Knowledge about the cognitive processes that lead to discovery and invention can enhance the probability of making valuable new discoveries and inventions. Such knowledge needs to be made widely available to ensure that no particular interest group &quot;corners the market&quot; on techno-scientific creativity. Knowledge can also facilitate the development of business strategies and social policies based on a genuine understanding of the creative process. Furthermore, through an understanding of principles underlying the cognitive processes related to discovery, educators can utilize these principles to teach students effective problem-solving strategies as part of their education as future scientists.\n\nThis book takes the reader out onto the cutting edge of research in scientific and technological thinking. The editors advocate a multiple-method approach; chapters include detailed case studies of contemporary and historical practices, experiments, computational simulations, and innovative theoretical analyses. The editors attempt a provocative synthesis of this work at the end.\n\nIn order to achieve true scientific and technological progress, an understanding of the process by which species are transforming the world is needed. This book makes an important step in that direction by leading to breakthroughs in the understanding of discovery and invention.\n\n\n# Hardcover: 472 pages\n# Publisher: Psychology Press; 1 edition (September 2004)\n# Language: English\n# ISBN-10: 0805845291\n# ISBN-13: 978-0805845297","torrent":{"xt":"urn:btih:029c3821cf491cb84e0b5c56c5982d737d04c631","amp;dn":"Scientific+and+Technological+Thinking+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"029c3821cf491cb84e0b5c56c5982d737d04c631","infoHashBuffer":{"type":"Buffer","data":[2,156,56,33,207,73,28,184,78,11,92,86,197,152,45,115,125,4,198,49]},"announce":[],"urlList":[]}}