{"title":"Filming Women in the Third Reich by Jo Fox","uid":11339948,"size":963122,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:030fb6aa8ea6675974dc7a4cea74ed494652943f&amp;dn=Filming+Women+in+the+Third+Reich+by+Jo+Fox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1414791094,"description":"In 1936, Goebbels stated that 'a government that controls art will remain forever', and the German film industry became inextricably linked with National Socialist propaganda. This book is an historical evaluation of the role and image of women in the feature films of the Third Reich. The author challenges current perceptions of the National Socialist position with regards to women and examines the creation of a female film culture, as well as the 'blurring' of gender distinctions as a result of the war.\n\nGoebbels and his wife personally selected young movie actresses at their home to portray mothers, vamps, girls-next-door and exotic love interests. His interest in film opens up an array of important issues central to this book: Were women compliant with Nazism or were they the victims of a regime imposing policies ultimately detrimental to their condition? Is it true that the war helped to emancipate women who were not only romantic and patriotic heroines on screen but employed as drivers, technicians and even managers of government affiliated film departments? Did all films produced under the auspices of the Third Reich serve as propaganda and if so, how successful were they? And finally, what can the study of cinema contribute to the historical debate surrounding National Socialism?\n\nThis book fills a considerable gap in the research of the Nazi star system and makes a crucial contribution not only to cinema history, but also to our view of the perceived role of women in the Third Reich","torrent":{"xt":"urn:btih:030fb6aa8ea6675974dc7a4cea74ed494652943f","amp;dn":"Filming+Women+in+the+Third+Reich+by+Jo+Fox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030fb6aa8ea6675974dc7a4cea74ed494652943f","infoHashBuffer":{"type":"Buffer","data":[3,15,182,170,142,166,103,89,116,220,122,76,234,116,237,73,70,82,148,63]},"announce":[],"urlList":[]}}