{"title":"Journey Into Mystery 083-125 (1962-1966|Digital|AnPymGold-Empire","uid":10110892,"size":439809043,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0314e10ee3b3ef0ea4eaf08186ea9b5227343219&amp;dn=Journey+Into+Mystery+083-125+%281962-1966%7CDigital%7CAnPymGold-Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1399513020,"description":"For more information on the publication history of JIM/Thor, please check the wikilink here:  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Thor_(Marvel_Comics)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Thor_(Marvel_Comics)&lt;/a&gt;\n\nIn 1962, in the midst of their most creative and legendary period of work, Stan Lee and Jack Kirby created the mighty Thor in the pages of Journey Into Mystery. Starting with Thor's debut in issue 83, the title became a regular Thor comic until issue 125, where-after the name was officially changed to The Mighty Thor from issue 12 onwards. Lee and Kirby remained on the title together until issue 177, after which Kirby left and Lee worked with several different artists (including John Buscema) until Gerry Conway took over writing duties from issue 193. However, Lee and Kirby's combined efforts here are nothing short of remarkable - they created many significant elements of the Thor canon that remain vital to understanding the character today - the conflict with Loki, the divisions of the realms, the Warriors Three, Sif, Heimdall, Thor's relationship with Odin and his duties as a prince of Asgard, Jane Foster, and on and on. These tales tackled the mythic and the epic, and many future writers of Thor would be heavily influenced by the immense mythology woven by the The Man &amp; The King (most notably, Walter Simonson in his own legendary take on Thor).\n\nThis torrent collects issues 083-125 of Journey Into Mystery Volume 1, before the title change. Each issue is in digital form thanks to AnPymGold-Empire. I have previously uploaded the same issues from HQPOINT in digital copies but these are significantly better versions. That torrent is now superseded and replaced by this one. Thanks to APG for their work; please seed and enjoy. ","torrent":{"xt":"urn:btih:0314e10ee3b3ef0ea4eaf08186ea9b5227343219","amp;dn":"Journey+Into+Mystery+083-125+%281962-1966%7CDigital%7CAnPymGold-Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0314e10ee3b3ef0ea4eaf08186ea9b5227343219","infoHashBuffer":{"type":"Buffer","data":[3,20,225,14,227,179,239,14,164,234,240,129,134,234,155,82,39,52,50,25]},"announce":[],"urlList":[]}}