{"title":"It's Only A Movie - Comics related Chicago 'zine 1990","uid":4410030,"size":71136348,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:037c20ce4fcfddf9640044b95d8587f74c809443&amp;dn=It%5C%27s+Only+A+Movie+-+Comics+related+Chicago+%5C%27zine+1990&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x30001wtm","files":5,"time":1222131398,"description":"\n\nHere are three issues of the &amp;#039;zine &quot;It&amp;#039;s Only A Movie&quot; published by The Psychotronic Film Society in Chicago in 1990.  These are all excellent quality scans about 1500 pixels wide.\n &lt;a href=&quot;\nhttp://www.dvdmadhouse.com/x09236wtm/itsonlyamovie.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dvdmadhouse.com/x09236wtm/itsonlyamovie.gif&lt;/a&gt;\n\n------------------------------------------------------------------------------\n\nScanner&amp;#039;s Comments:\n\nThis completely crazy and cool &amp;#039;zine was published by The Psychotronic Film Society in Chicago in 1990.  I got these three issues off eBay about a year ago and put up a watch for more at that time.  During that year I have seen several of these same issues come up for sale but never any others, so I suspect it may have ended after just three issues.\n\nThis noisy little rag is about a lot more than film, in fact, I&amp;#039;d bet that if you counted the pages you&amp;#039;d find less than a quarter of them dedicated to movies and video.  I ain&amp;#039;t going to count them to prove it, but there&amp;#039;s a wild variety of content starting with Monty Python and continuing through Mr. Ed, Dark Shadows, The Addams Family, Route 66, The Cramps, Bettie Page, Soundgarden, Clive Barker, Joe Bob Briggs, Dario Argento, John McNaughton, John Drake, KISS, 2 Live Crew, Elvis impersonators and oh so very much more.  When it does talk film it talks horror, mostly.\n\nThe ads are mostly for local Chicago enterprises, and they&amp;#039;re as cool as the content sometimes.  I&amp;#039;ve done all three books cover to cover with all ads included.\n\nThe best part about it in this generic scanner&amp;#039;s opinion is that each issue has at least one worthwhile article about comics.  The first issue has a comics article that goes from Clive Barker to Classics Illustrated, and if that sudden change of pace doesn&amp;#039;t sprain your brain you can continue to issue 2 and Keeping Censored Comix Alive, and then to the last issue for The Day Comics Died (about the demise of EC) and finally, Essential Comic Books For Your Psychotronic Coffee Table, which has me shopping the torrents, the newsgroups, and eBay all at the same time.  I gotta have some o&amp;#039; those books.  Anyway, these articles aren&amp;#039;t loosely written filler; they&amp;#039;re all very well presented essays on this hobby we love.\n\nIn closing: I believe that for only 68 megs you&amp;#039;ll find these scans of It&amp;#039;s Only A Movie a very worthwhile download.\n\n","torrent":{"xt":"urn:btih:037c20ce4fcfddf9640044b95d8587f74c809443","amp;dn":"It%5C%27s+Only+A+Movie+-+Comics+related+Chicago+%5C%27zine+1990","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"037c20ce4fcfddf9640044b95d8587f74c809443","infoHashBuffer":{"type":"Buffer","data":[3,124,32,206,79,207,221,249,100,0,68,185,93,133,135,247,76,128,148,67]},"announce":[],"urlList":[]}}