{"title":"Condition Monitoring and Assessment of Power Transformers ...","uid":6544810,"size":4464116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03e0b28ea4cf27ab5d4a5b95030aadbc975505f2&amp;dn=Condition+Monitoring+and+Assessment+of+Power+Transformers+...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1310812119,"description":"W.H. Tang, Q.H. Wu, &quot;Condition Monitoring and Assessment of Power Transformers Using Computational Intelligence&quot; \n Sp,,,er | 2011 | ISBN: 0857290517 | 218 pages | PDF | 4.25 MB \n\n In recent years, rapid changes and improvements have been witnessed in the field of transformer condition monitoring and assessment, especially with the advances in computational intelligence techniques. Condition Monitoring and Assessment of Power Transformers Using Computational Intelligence applies a broad range of computational intelligence techniques to deal with practical transformer operation problems. The approaches introduced are presented in a concise and flowing manner, tackling complex transformer modelling problems and uncertainties occurring in transformer fault diagnosis. Condition Monitoring and Assessment of Power Transformers Using Computational Intelligence covers both the fundamental theories and the most up-to-date research in this rapidly changing field. Many examples have been included that use real-world measurements and realistic operating scenarios of power transformers to fully illustrate the use of computational intelligence techniques for a variety of transformer modelling and fault diagnosis problems. Condition Monitoring and Assessment of Power Transformers Using Computational Intelligence is a useful book for professional engineers and postgraduate students. It also provides a firm foundation for advanced undergraduate students in power engineering.","torrent":{"xt":"urn:btih:03e0b28ea4cf27ab5d4a5b95030aadbc975505f2","amp;dn":"Condition+Monitoring+and+Assessment+of+Power+Transformers+...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03e0b28ea4cf27ab5d4a5b95030aadbc975505f2","infoHashBuffer":{"type":"Buffer","data":[3,224,178,142,164,207,39,171,93,74,91,149,3,10,173,188,151,85,5,242]},"announce":[],"urlList":[]}}