{"title":"Viruses, Plagues, and History - Past, Present and Future (Malest","uid":5447599,"size":3736876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:044391a0996ec4cc07a67ee7d0a4fc96956030b8&amp;dn=Viruses%2C+Plagues%2C+and+History+-+Past%2C+Present+and+Future+%28Malest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1269077608,"description":" &lt;a href=&quot;http://bayimg.com/gALAgaaCG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/gALAgaaCG&lt;/a&gt;\n\nMichael B. A. Oldstone M.D., &quot;Viruses, Plagues, and History: Past, Present and Future&quot;\nOxford University Press | 2009 | ISBN: 0195327314 | 400 pages | PDF\n\nThe story of viruses and humanity is a story of fear and ignorance, of grief and heartbreak, and of great bravery and sacrifice. Michael Oldstone tells all these stories as he illuminates the history of the devastating diseases that have tormented humanity, focusing mostly on the most famous viruses.\nOldstone begins with smallpox, polio, and measles. Nearly 300 million people were killed by smallpox in this century alone and the author presents a vivid account of the long campaign to eradicate this lethal killer. Oldstone then describes the fascinating viruses that have captured headlines in more recent years: Ebola, Hantavirus, mad cow disease (a frightening illness made worse by government mishandling and secrecy), and, of course, AIDS. And he tells us of the many scientists watching and waiting even now for the next great plague, monitoring influenza strains to see whether the deadly variant from 1918--a viral strain that killed over 20 million people in 1918-1919--will make a comeback. For this revised edition, Oldstone includes discussions of new viruses like SARS, bird flu, virally caused cancers, chronic wasting disease, and West Nile, and fully updates the original text with new findings on particular viruses.\nViruses, Plagues, and History paints a sweeping portrait of humanity's long-standing conflict with our unseen viral enemies. Oldstone's book is a vivid history of a fascinating field, and a highly reliable dispatch from an eminent researcher on the front line of this ongoing campaign.\n","torrent":{"xt":"urn:btih:044391a0996ec4cc07a67ee7d0a4fc96956030b8","amp;dn":"Viruses%2C+Plagues%2C+and+History+-+Past%2C+Present+and+Future+%28Malest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"044391a0996ec4cc07a67ee7d0a4fc96956030b8","infoHashBuffer":{"type":"Buffer","data":[4,67,145,160,153,110,196,204,7,166,126,231,208,164,252,150,149,96,48,184]},"announce":[],"urlList":[]}}