{"title":"Seigmen I Operaen - Seigmen in Opera - (Full Concert)(DVD-DL)","uid":15720626,"size":7771977621,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:05ba962f9563eaf2c67b7e024b9003bd5a17a256&amp;dn=Seigmen+I+Operaen+-+Seigmen+in+Opera+-+%28Full+Concert%29%28DVD-DL%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RenanMorkets","files":28,"time":1472673230,"description":"DVD, officially released July 15, 2012.\r\nPre-orders were signed by the band and shipped around July 1, 2012.\r\n\r\n \r\n\r\nOn June 21st and 22nd 2008, Seigmen performed two unforgettable concerts from the stage in the new opera building as the very first Norwegian rock band. The shows were the culmination of a year with preparations, from the first contact with the opera, to the intense weeks and days beforehand. Those who were present got to experience a magic atmosphere and a band that explored all sides of its expression. Seldom have a Norwegian band embraced the opera's soul with more respect, and never before has the Norwegian opera experienced a greater energy discharge.\r\n\r\nTransmission, with the producer Lars Martin Kræmer, followed Seigmen closely in the days before the concerts and filmed both nights. After a lot of pressure from the fans, these recordings were found and cut four years later. All available material has been examined and a lot of time and resources put down to recreate the atmosphere. Seigmen in Operaen is an authentic document of all the happened based on the material at hand and the way it was performed.\r\n\r\n-------------------------------------------------------------------------------\r\n\r\nDVD, lançado oficialmente em 15 de julho de 2012.\r\nPré-vendas foram assinados pela banda e enviados por volta de 01 de julho de 2012.\r\n\r\n \r\n\r\nEm 21 de junho e 22 de 2008, Seigmen realizou dois concertos inesquecíveis no palco do novo edifício de ópera como a primeira banda de rock norueguês. Os shows foram o culminar de um ano com os preparativos, desde o primeiro contato com a ópera, às intensas semanas e dias de antecedência. Aqueles que estavam presentes puderam experimentar uma atmosfera mágica e uma banda que explorou todos os lados de sua expressão. Raramente uma banda norueguesa abraça a alma da ópera com mais respeito, e nunca a ópera norueguesa sofreu uma descarga de energia tão grande.\r\n\r\nTransmission, com o produtor Lars Martin Kraemer, seguiu Seigmen de perto nos dias antes dos concertos e filmou ambas as noites. Depois de muita pressão dos fãs, estas gravações foram analisadas e preparadas quatro anos mais tarde. Todo o material disponível foi examinado, com muito tempo e recursos investidos para recriar a atmosfera. Seigmen in Operaen é um documento autêntico de tudo o que aconteceu com base no material disponível e a forma como foi realizado.\r\n\r\n-------------------------------------------------------------------------------\r\n\r\nContains:\r\n\r\nSeigmen i Operaen (1h 51min)\r\n\r\nAmeneon\r\nNephilia\r\nSort Tulipan\r\nFrost-Bite\r\nThe Modern End\r\nAgnus Dei\r\nJe Crois Entendre Encore\r\nPerformance Alpha\r\nMonument\r\nOhm\r\nSlaver Av Solen\r\nColosseum\r\nIn Limbo\r\nDöderlein\r\nMesusah\r\nMetropolis\r\nHjernen Er Alene\r\nNemesis\r\nAudio options: 5.1 surround/stereo\r\nImage format: 16:9 (bonus material 4:3)\r\n\r\n\r\n\r\n\r\n\r\nPreludium (52min)\r\n\r\n\r\nDocumentary from the Opera. We follow the band's preparations the days before the two big performances at the opera. At first we see the testing and preparations with the whole band and a few strings at the venue Parkteatret and then we see how the whole thing came together backstage and onstage at the opera including soundcheck and all the excitement. No subtitles.\r\n\r\n\r\n\r\n\r\nPreludium (52min)\r\n\r\n\r\nDocumentary from the Opera. Commentaries to the documentary by Kim Ljung and Sverre Økshoff. No subtitles.\r\n\r\n\r\n\r\nSlideshow\r\n\r\nSlideshow of pictures taken from the whole event.\r\n\r\n\r\n------------------------------------------------------------------------------\r\n\r\nNote: Please don't forget to seed, because many depend of it to have access to this content and especially because this is a torrent very hard to find in another places.\r\n\r\nNota: Por favor, não se esqueça de semear, pois muitos dependem disto para ter acesso a este conteúdo e, especialmente, porque esta é um torrent muito difícil de ser encontrado em outros lugares.\r\n\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n\r\n\r\nEnjoy!","torrent":{"xt":"urn:btih:05ba962f9563eaf2c67b7e024b9003bd5a17a256","amp;dn":"Seigmen+I+Operaen+-+Seigmen+in+Opera+-+%28Full+Concert%29%28DVD-DL%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05ba962f9563eaf2c67b7e024b9003bd5a17a256","infoHashBuffer":{"type":"Buffer","data":[5,186,150,47,149,99,234,242,198,123,126,2,75,144,3,189,90,23,162,86]},"announce":[],"urlList":[]}}