{"title":"Roccos.Psycho.Teens.2.XXX.DVDRip.XviD-Jiggly","uid":7422643,"size":1458825216,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:06028a055737969964e71ac9e25ad56619fc1d1e&amp;dn=Roccos.Psycho.Teens.2.XXX.DVDRip.XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":2,"time":1341712665,"description":"Roccos Psycho Teens 2 XXX DVDRip XviD - Jiggly\n\nStarring\tNelly, Henessy, Grace, Jessica Night, Rocco Siffredi, Markus, Mike Chapman, Ferrera Gomez, Marry Dream, Aiza, Art\n\n'Teens today are different than 10 years ago. You can see they are born with Internet pornography, it shows so much. No embarassment at all!' -Rocco Siffredi\n\nThe later teenage years can be a troubling time for a young woman. All sorts of strange and exciting urges might make a girl act just a little... nuts. Fortunately, legendary superstud Rocco Siffredi offers his special style of hands-on counseling. 'Rocco's Psycho Teens 2' stars seven luscious teenage beauties doing things no sane girl would admit to! Blonde party slut Marry Dreams is strolling outdoors with her breathtaking, dark-haired friend Aiza when Rocco and his buddy Art invite the fresh-faced babes home for a nasty four-way fuckfest. The gorgeous youngsters get anally ravaged until their rear ends gape widely, and Marry even takes both men's enormous cocks up her ass at the same time! Next, stunning brunette Ferrera Gomez rides her bike alongside pale, ultra-cute Jessica Neight.\n\nAmerican perv Mike Chapman tempts the Hungarian sweeties into experiencing the interracial delight of his big black dick. Ferrera and Jessica alternate sucking on frozen ice treats, rimming each other's asshole and tasting Mike's massive member. Mike butt-fucks Ferrera before delivering an oral cum load for the sexy teens to share. Henessy and Grase are a couple ofgirls with a lust for filthy sex. Their young rectums take the full brunt of sailor boy Markus' giant prick; the sexy students taste his shaft with ass-to-mouth flavor. And lastly, Rocco seduces bipolar bitch Nelly in an intimate session of anal penetration and deep-throat cocksucking. For Rocco, mental health is secondary to sexual fulfillment, and 'Rocco's Psycho Teens 2' is fucking crazy!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=oaf2lzdrrjd2ogquhft0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=oaf2lzdrrjd2ogquhft0.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=r1ek3qwsttt9pxezjnmn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=r1ek3qwsttt9pxezjnmn.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=geug8e6kdukrzk3gfxdu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=geug8e6kdukrzk3gfxdu.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:06028a055737969964e71ac9e25ad56619fc1d1e","amp;dn":"Roccos.Psycho.Teens.2.XXX.DVDRip.XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06028a055737969964e71ac9e25ad56619fc1d1e","infoHashBuffer":{"type":"Buffer","data":[6,2,138,5,87,55,150,153,100,231,26,201,226,90,213,102,25,252,29,30]},"announce":[],"urlList":[]}}