{"title":"Crown The Empire-The Resistance-Rise Of The Runaways 320k  mp3 a","uid":10611886,"size":126189868,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0709ebbe771848ba369a3fb6a53df87a7fee7d58&amp;dn=Crown+The+Empire-The+Resistance-Rise+Of+The+Runaways+320k++mp3+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":14,"time":1406048434,"description":"Crown The Empire-The Resistance-Rise Of The Runaways 320k  mp3 ak2014 What we got complete album of ...The band plan to release a two disc reissue of The Fallout including a rerecording of their EP, Limitless, with David Escamilla providing vocals, on December 10, 2013.\n\nOn November 14, 2013 the band released a statement about the re-recording of their first EP, Limitless. The band stated that they &quot;...re-recorded, we mean EVERYTHING was redone. Guitars, drums, production, vocals, etc. Andy and Dave are BOTH on it...&quot;. They also stated that the EP is in a completely different tuning.\n\nOn November 28, 2013 the band released the first single from the deluxe rerelease of The Fallout, &quot;Breaking Point&quot;. The song is a rerecording of a song from their EP, Limitless, now with Escamilla handling all the unclean vocals.\n\nOn November 28, 2013, it was announced that Crown the Empire would be going back into the studio &quot;very soon&quot; to begin their new album, which would release sometime in 2014. It has been described as not sounding anything like the Limitless EP, nor the re-recorded version of Limitless. However, they did say that it would sound like &quot;The Fallout on crack&quot; with &quot;better melodies, better riffs, better everything!&quot;\n\nOn December 17, 2013 the band was announced to be a part of Asking Alexandria's Break Down The Walls Tour taking place on March &amp; April, they will be joined by fellow acts August Burns Red, We Came As Romans and Born of Osiris. Drummer Brent Taddie revealed that this would take place after the band was done in the studio recording their new album. In a July 2013 interview, unclean vocalist David Escamilla stated that the album, which they were then working on, would release sometime in early 2014.\n\nOn January 15, 2014 it was announced by Vans Warped Tour that Crown The Empire would again be playing Warped this year.  The band are also playing the Slam Dunk Festival in the UK.\n\nOn February 4, 2014 AltPress.com reported Crown The Empire's teasing of a new song from their forthcoming sophomore LP. The site went on to clarify, &quot;Crown The Empire entered the studio with producer Joey Sturgis (The Word Alive, Blessthefall) in January and have been recording their sophomore full-length album.&quot; No titles, song or otherwise, have been announced. Later it was confirmed that they entered the studio with Dan Korneff.\n\nOn June 14, 2014 Crown the Empire played two new songs from their new album &quot;The Resistance: Rise of the Runaways&quot; called &quot;Mnstr&quot; and &quot;Initiation&quot; at Vans Warped Tour in San Antonio, Texas. Then On June 19, 2014 Rise Records Released the song &quot;Initiation&quot; on their Youtube channel and in just 12 hours the song reached 53,000 views. This one is complete,uncensored and ready to go.......","torrent":{"xt":"urn:btih:0709ebbe771848ba369a3fb6a53df87a7fee7d58","amp;dn":"Crown+The+Empire-The+Resistance-Rise+Of+The+Runaways+320k++mp3+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0709ebbe771848ba369a3fb6a53df87a7fee7d58","infoHashBuffer":{"type":"Buffer","data":[7,9,235,190,119,24,72,186,54,154,63,182,165,61,248,122,127,238,125,88]},"announce":[],"urlList":[]}}