{"title":"Andy Dick Show, The - Seasons 1-3+Extras (Complete)","uid":4734897,"size":5155692988,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:07398898daa9c47b3c685b670aea89182eb22c46&amp;dn=Andy+Dick+Show%2C+The+-+Seasons+1-3%2BExtras+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"BloodLogic","files":69,"time":1235232316,"description":"The Andy Dick Show - Seasons 1-3 + Extras (Complete)\n(2001-2002) (Music Television * MusicTelevision * MTV * M.T.V.)\n[Adult-Oriented Sketch-Comedy]\n\nSeasons 1-3 + Extras (Complete)\nExtras include the Album &quot;Andy Dick - Do Your Shows Always Suck&quot; (2007), the film &quot;Danny Roane: First Time Director&quot; (2006), and multiple interviews and appearances of Andy Dick\nDelivered to the Public by BloodLogic\n\nIMAGE: http://img145.imageshack.us/img145/2227/andydickshow.jpg\n\nDescription: Every episode of the series was written and directed by Dick. Generally, he would appear as different character in several mockumentary sketches, with that character appearing as a talking head narrating events shown in CinÃƒÂ©ma vÃƒÂ©ritÃƒÂ© and b-roll.\n\nHis most recognizable and frequent character was Daphne Aguilera, a rude, whorish pop star clearly modeled after the exploits and vices of Christina Aguilera and other pop icons. Daphne, according to &quot;herself&quot;, is Christina Aguilera's cousin; in &quot;her&quot; words: &quot;my mother's is her mother's cousin's friend... or they live on the same block. So, [Christina and I are] basically cousins&quot;. The Daphne character was heavily promoted by the real MTV in the weeks leading up to the premiere of The Andy Dick Show. The show's first episode featured the mock-single &quot;Naughty Baby Did a No-No&quot;, a take on Britney Spears' suggestive &quot;...Baby One More Time.&quot;\n\nDaphne would later appear in other segments, appearing on MTV's Cribs and a parody of The View. Daphne even managed to perform &quot;Naughty Baby Did a No-No&quot; at the 2001 MTV Video Music Awards, but cancelled her own performance in the beginning angry and then tried to attack Christina Aguilera, who was laughing all the time (obviously it was all a joke). After The Andy Dick Show's cancellation, Daphne made two appearances on MADtv.\n\nSeveral sketches featured Dick as imitating Tom Green, to the point where Tom Green once guest-starred, and the two played each other.\n\nDick was also fond of playing Marilyn Manson, whom he has satired in several sketches. In a 2001 interview on Late Night with Conan O'Brien, Dick said that Manson actually invited him to Manson's home, and after watching a sketch called &quot;Marilyn Poppins,&quot; Manson said it was the funniest thing he had ever seen.\n\nMany celebrities appeared on the show, including some of Dick's former co-stars such as Ben Stiller, Janeane Garofalo, Dave Foley, Maura Tierney, Stephen Root, and others such as Dave Grohl, Moby, Christian Slater, Nikka Costa, Rob Zombie, Sevendust, Drew Pinsky, Dr. Joyce Brothers, Da Brat, Vitamin C, and Edward Furlong.\n\nWIKI: http://en.wikipedia.org/wiki/The_Andy_Dick_Show\nIMDB: http://www.imdb.com/title/tt0274234/\n\nCreator: Andy Dick.\nDirectors: Andy Dick, Steve Priola.\nWriters: Andy Dick, Scott Tomlinson, Craig Doyle, Jonathan Green, Paul Henderson, John Matta, Rosa McCall, Ross McCall, Gabe Miller, Aaron Peters, Vito Viscomi.\nStarring: Andy Dick, Paul Henderson, Lacy Livingston, Lisa Donatz, Ashton Kutcher, Evan Lee Dahl, Craig Doyle, Robin Sydney, Jason Biggs, Declan Joyce, Eric Roberts, David Thomas Riley, Susan Engel, Joe Regelbrugge.\nProducers: Jim Biederman, Andee Kuroda, Brigid Walsh, Peter Spoerri, Jason Buchtel, Andy Dick, CK Gillen, Jonathan Green, Paul Henderson, John Lynch, Gabe Miller, R.P. Sekon, Norman Siderow, Scott Tomlinson, Darren Wadyko.\n\nVLC Player Compatible (verson # 0.8.6f): {Tested and Confirmed}\n\nSeason 1...\n\nS1E01 - 101\nS1E02 - 102\nS1E03 - 103\nS1E04 - 104\nS1E05 - 105\nS1E06 - 106\nS1E06 - 106\n\nSeason 2...\n\nS2E01 - 201\nS2E02 - 202\nS2E03 - 203\nS2E04 - 204\nS2E05 - 205\nS2E06 - 206\nS2E07 - 207\n\nSeason 3...\n\nS3E01 - 301\nS3E02 - 302\nS3E03 - 303\nS3E04 - 304\nS3E05 - 305\nS3E06 - 306\nS3E07 - 307\n\nExtras...\n\nAndy Dick - Do Your Shows Always Suck (2007)\n---01-andy_dick-therapy\n---02-andy_dick-squirrels\n---03-andy_dick-one_friends\n---04-andy_dick-im_adopted\n---05-andy_dick-ellen_degeneres\n---06-andy_dick-poke_a_hontas\n---07-andy_dick-beautiful_urinal\n---08-andy_dick-homecoming_king\n---09-andy_dick-niggaz\n---10-andy_dick-water_on_the_brain\n---11-andy_dick-cock_and_balls\n---12-andy_dick-my_mother\n---13-andy_dick-cancerous_testical\n---14-andy_dick-look_at_me\n---15-andy_dick-ballad_of_andy\n---16-andy_dick-punkin_lovin\n---17-andy_dick-before_ayds_came_out\n---18-andy_dick-good_luck_with_that\n---19-andy_dick-chocolate_martini\n---20-andy_dick-little_brown_ring\n---21-andy_dick-damn_good_pussy\n---22-andy_dick-do_your_shows_always_suck\n---23-andy_dick-dirty_sanchez-v-hot_karl\n---24-andy_dick-jerkin_off_a_wombat\n---25-andy_dick-trash-elle\n---26-andy_dick-would_you_rather\n---27-andy_dick-another_great_day_for_drugs\n---28-andy_dick-mom_you_fucking_whore\n---29-andy_dick-where_did_i_go_wrong\n---30-andy_dick-dip_your_cock_in_vodka\n---31-andy_dick-my_friend_drank_so_much_liquor\n---32-andy_dick-leonards_ass_is_bleeding\n---33-andy_dick-bartender_friendly\n---34-andy_dick-angry_pirate\nDanny Roane- First Time Director (2006)\nAppearance - On The Spot\nInterview - Clint Howard Variety Show, The\nInterview - Donnas, The, (2002)\nInterview - Greg Fitzsimmons Show, The (10-07-08).mp3\nInterview - Greg Kilborn on 'The Late Late Show,' (26-Jul-2001)\nInterview - Greg Kilborn on 'The Late Late Show'\nInterview - Ivanka Trump\nInterview - John DiCrosta, Westwood International Film Festival, (2005)\nInterview - Space Ghost, Coast to Coast (S4E20)\n\n[Episode Guide Included.]\n\nIf you enjoyed this show, then &quot;The Assistant&quot; is also recommended, since they're both starring and written by the same individual, with much of the same type of humor. Download it, complete season 1 with extras, here: http://thepiratebay.se/torrent/4744794/\n\n[BLX Note: As many of you may be aware, most of these files are a copy of a version of this show floating around at various ports of the internet. But each copy had the same fault: in the last episode of season three, S3E07, there was an audio sync error. Not just any type of audio sync error. It was a multiple progressive audio sync error. I had to chop the file up into tiny bits, reconstruct the audio channel by stretching it or shortening it, and then glue it back together. A most painful process, probably taking at least six or eight hours for the single file, as well as requiring massive quantities of Marijuana. Anyway, I reduced the audio sync error from 25% of the file to 0.5% of the file. That's right -- it's still there, for extremely brief moments of the show, lasting only a few seconds here and there. Except for that half percent, the rest of episode S3E07 is perfectly synced. And for that amount of time it required for the correction, yeah, I'm set. Enjoy, my sisters and brothers, my comrades and pirates!]\n\nThis torrent is a part of Operation: Massive Information Leak, Wave Three.\nBloodLogic","torrent":{"xt":"urn:btih:07398898daa9c47b3c685b670aea89182eb22c46","amp;dn":"Andy+Dick+Show%2C+The+-+Seasons+1-3%2BExtras+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07398898daa9c47b3c685b670aea89182eb22c46","infoHashBuffer":{"type":"Buffer","data":[7,57,136,152,218,169,196,123,60,104,91,103,10,234,137,24,46,178,44,70]},"announce":[],"urlList":[]}}