{"title":"DJ LOBSTERDUST - Mashup Anthology v2.0 (2006-2008)","uid":4577201,"size":611604037,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:07effcd9fe5fde5e70153a16fc3b0c35c9976ef1&amp;dn=DJ+LOBSTERDUST+-+Mashup+Anthology+v2.0+%282006-2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L0B5TA","files":84,"time":1229280210,"description":"this is version 2.0 (updated with 20 new tracks)\n81 mashups + 1 live set\nspanning 3 years of mashin'\n------------------------------------------------\n\nAmerican Justice (The Guess Who vs. MSTRKRFT)\nBaby Arrow (Marvin Gaye vs. The Album Leaf)\nBe Still My Burning Shadow (Sting vs. UNKLE)\nBigger Than Hip Seat (Dead Prez vs. Sniff n The Tears)\nBird Front (Birdman vs. The Who)\nBiscuit Kings (Young Buck T.I. Jeezy vs. Portishead)\nBooty Pressure--Bubba Sparxxx vs. Queen\nBorn On The Next Word (CCR vs. Tom Tom Club vs. Minimal Compact)\nBorny Rappinghood (CCR vs. Tom Tom Club)\nBring My Own Bell (System of a Down vs. Anita Ward)\nBritney The Pimp (Britney Spears vs. Don Julian)\nCall Me Already (Blondie vs. The Temptations)\nCan I Creep It Like That (Fedde Le Grand vs. Pharrell ft. Gwen)\nDeCexyLong (All American Rejects vs. Le Tigre vs. Rod Stewart)\nDiscoRumpChant (Beastie Boys vs. Micahel Zager Band)\nDo Ya Think DeceptiBack (Le Tigre vs. Justin Timberlake vs. Rod Stewart)\nDo Ya Think Im Decepti 2008 (Le Tigre vs. Rod Stewart)\nDown UnDa Club (50 Cent vs. Men At Work)\nDub Be Good To Three (Jack Johnson vs. Beats International)\nEasy Wall (Commodores vs. Oasis)\nEpic Black Rock (Faith No More vs. Queen vs. ACDC)\nEverybody Do It Again (Jay-Z vs. Missy vs. Chemical Brothers)\nForget The Warzone (Pete Rock ft. Dead Prez vs. Metric)\nGet A Low Orange (Ying Yang Twins vs. Metro Area vs. DFA)\nGlass Octopus 2008 (The Beatles vs. Blondie)\nGoin Down (Young Joc vs. Elite Force)\nHolla At Dem Girls On Film (Duran Duran vs. DJ Khaled)\nHot Hot Hot Thing (Talib Kweli vs. The Cure)\nHustlin 30z (Rick Ross vs. 30hz)\nI Got 5 Helicopters (Bloc Party vs. Luniz)\nIts Fun To Smoke Dust (Queen vs. Satan)\nJennys Superstitious (Stevie Wonder vs. The Killers)\nJump Dat Soulja (Soulja Boy vs. Van Halen)\nJurassic 42 (Jurassic 5 vs. Level 42)\nKrispy Eater (Kinfolk Kia Shine vs Hall n Oats)\nLadies Night\nLESLockdown_(Kanye West vs. Santogold)\nLive at Bootie San Francisco (FEB 2008)\nMama Bizzness (Will.I.Am vs. Beck vs. Free)\nMarley Maiden (Bob Marley vs. Iron Maiden)\nMidnight Star (Oasis vs. Chemical Brothers)\nMissin Kittin (The Rolling Stones vs. Miss Kittin)\nMy Irreplaceable (Beyonce vs. Tommy Heavenly6)\nNever Gonna Fool Your Gold (Rick Astley vs. The Stone Roses)\nNewYorkBattleMove (Nina Hagen vs. Busta Rhymes vs. Lo-Fi Allstars)\nOnly The Sweetest Girl (Wyclef Jean st. Akon vs. Hurricane #1)\nPapaKill-R (Timbaland vs. The Temptations vs. Adamski)\nPurple Bounce (Jimi Hendrix vs. Chemical Brothers)\nPussycats Gone To Heaven (Pixies vs. Pussycat Dolls)\nPut On The Red Light (Police vs. Coldplay)\nRestless Booty (Ying Yang Twins vs. UNKLE)\nRightNowRightNow - Beastie Boys vs. Love Psychedelico\nRiverBad (Meatloaf vs. Morcheeba)\nRocket Mon In Dub (Elton John vs. Scientist)\nSame Old Uniform (Four Tops vs. Bloc Party)\nSaySayism Allstar Jam\nScratch That Monkey (Lil Jon vs. Scratch Perverts)\nSenxxxual Sedunxxxion (Marvin Gaye vs. Snoop Dogg vs. Dirty South)\nShe Is Glamorous (Fergie vs. The Fray)\nShes Hearing In The Air Tonight (Phil Collins vs. Bloc Party)\nShes Like Sunday Wind (BlocParty vs. Tony Sunshine)\nSimeleon (Pharoahe Monch vs. Herbie Hancock)\nSkreamin Sidewayz (Skream vs. Paul Wall)\nSkyline Operator (Notorious BIG vs. The The)\nStand Up Like A Hurricane (Ludacris vs. Scorpions vs. Warrant vs. Winger)\nStar Mountain High (Marvin Gaye, Tammi Terrel, Diana Ross vs. Jody Wisternoff)\nSummer Eyes Motion (Cashis vs. The Young Gods)\nSureShotBoxerPistol (Beastie Boys vs. Chemical Brothers vs. DFA vs. Dub Pistols)\nTexas Tension (Bloc Party vs. Mike Jones &amp; Paul Wall)\nThe Rain (Missy Elliot vs. Eurythmics)\nTheres a Fire (Lloyd Banks vs. OK Go)\nThund O Clap O (Blast vs. Joe Bataan)\nTime Is Off The Books (Beatnuts vs. Muse)\nTrain It Up (The Clash vs. Marvin Gaye)\nTwo More Head (DJ Deeon vs. Bloc Party)\nUptown Banquet (Lord Tariq n Peter Gunz vs. Bloc Party)\nUrgent Situation (Foreigner vs. Yazoo)\nWalkin Out Yo Girlfriend (Unk vs. Avril Lavigne vs. Toni Basil))\nWanna Be Your Alala (Iggy Pop vs. CSS)\nWhen White Horses Cry (Prince vs. Laid Back) 12inch edit\nWhen White Horses Cry (Prince vs. Laid back) 7inch edit\nYazz The Mic (Beastie Boys vs. Yazoo)","torrent":{"xt":"urn:btih:07effcd9fe5fde5e70153a16fc3b0c35c9976ef1","amp;dn":"DJ+LOBSTERDUST+-+Mashup+Anthology+v2.0+%282006-2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07effcd9fe5fde5e70153a16fc3b0c35c9976ef1","infoHashBuffer":{"type":"Buffer","data":[7,239,252,217,254,95,222,94,112,21,58,22,252,59,12,53,201,151,110,241]},"announce":[],"urlList":[]}}