{"title":"Hulk Hogan 2","uid":8218288,"size":2205636608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07f12b820543d305687325bcefd5f3513b367bdb&amp;dn=Hulk+Hogan+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lonewolfmoon","files":3,"time":1362356281,"description":"Little Hercules (2009)\n\nLittle Hercules travels from Mt. Olympus to live life as a mortal in Los Angeles.\n\nSanta with Muscles (1996)\n\nAn evil millionaire (Hulk Hogan) gets amnesia and then belives that he is Santa Claus.\n\nThe Secret Agent Club (1996)\n\nTo the world Ray Chase is nothing more than a klutzy, overgrown toy seller whose wife passed away a few years ago; and his only son Jeremy doesn't get to see him very often, because he's always away on &quot;business trips.&quot; What no one knows-not even Jeremy-is that his dad is a secret agent who flies all around the world, completing highly classified missions for a top-secret peacekeeping agency. Unaware of his dad's dangerous, yet exciting, secret identity, Jeremy's world is utterly normal. But all that changes when Ray returns from a mission, bringing with him a high-powered laser gun he stole from a treacherous female foreign guns dealer. Ray tells his son the gun is only a toy, but his secret comes out when the dealer sends her henchmen to capture Ray and retrieve the gun. The nasty henchmen get Ray, but Jeremy escapes with the wanted firearm. After he learns how to use the laser gun, Jeremy gathers his friends, and together they hatch a clever plan to rescue Ray.","torrent":{"xt":"urn:btih:07f12b820543d305687325bcefd5f3513b367bdb","amp;dn":"Hulk+Hogan+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07f12b820543d305687325bcefd5f3513b367bdb","infoHashBuffer":{"type":"Buffer","data":[7,241,43,130,5,67,211,5,104,115,37,188,239,213,243,81,59,54,123,219]},"announce":[],"urlList":[]}}