{"title":"Drugs Collection - CBC - Afghanistans Opium trail","uid":7464881,"size":2405677056,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0940b1c72532ebaddb99e13d7b7acf49ec403c8c&amp;dn=Drugs+Collection+-+CBC+-+Afghanistans+Opium+trail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":-1,"time":1342917751,"description":"\n\nThe Drugs Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nCBC - the Passionate Eye - Afghanistans Opium Trail\n\nIn bleak Afghan villages, the lure of opium cultivation is clear. With no other viable alternative for farmers and no effective law enforcement by the Afghan police, growing poppies is the only way for locals to feed their hungry families. It is this opium that is sold to drug barons and their envoys, processed into heroin and then smuggled across borders.\n\nIn ever-increasing quantities, Afghanistan is flooding the world with heroin, supplying over 90 per cent of opium to the world market. Most startling is the effect on the country's youth, since the majority of Afghanistan's growing number of heroin addicts are under the age of 20. It is a problem that is further destabilizing the country by undermining tribal structures and traditions. In this shocking documentary, Afghanistan's Opium Trail takes viewers for a ride on the drug caravan-from cultivation, to process, to market- and lifts the curtain on the hidden world of the drug barons.\n\n\nCheck this account for updates regularly :)\n\nThanks to the peers all over the globe seeding in this collection.\n","torrent":{"xt":"urn:btih:0940b1c72532ebaddb99e13d7b7acf49ec403c8c","amp;dn":"Drugs+Collection+-+CBC+-+Afghanistans+Opium+trail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0940b1c72532ebaddb99e13d7b7acf49ec403c8c","infoHashBuffer":{"type":"Buffer","data":[9,64,177,199,37,50,235,173,219,153,225,61,123,122,207,73,236,64,60,140]},"announce":[],"urlList":[]}}