{"title":"Practical Aspects of Computational Chemistry - Methods, Concepts","uid":14531500,"size":4946433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:099b27404f28ee99f75071d337e25844dacc220a&amp;dn=Practical+Aspects+of+Computational+Chemistry+-+Methods%2C+Concepts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462448184,"description":"Practical Aspects of Computational Chemistry - Methods, Concepts and Applications (Springer, 2009).pdf\r\n\r\nISBN 978-90-481-2686-6\r\n\r\n&quot;Practical Aspects of Computational Chemistry&quot; presents contributions on a range of aspects of Computational Chemistry applied to a variety of research fields. The chapters focus on recent theoretical developments which have been used to investigate structures and properties of large systems with minimal computational resources. Studies include those in the gas phase, various solvents, various aspects of computational multiscale modeling, Monte Carlo simulations, chirality, the multiple minima problem for protein folding, the nature of binding in different species and dihydrogen bonds, carbon nanotubes and hydrogen storage, adsorption and decomposition of organophosphorus compounds, X-ray crystallography, proton transfer, structure-activity relationships, a description of the REACH programs of the European Union for chemical regulatory purposes, reactions of nucleic acid bases with endogenous and exogenous reactive oxygen species and different aspects of nucleic acid bases, base pairs and base tetrads","torrent":{"xt":"urn:btih:099b27404f28ee99f75071d337e25844dacc220a","amp;dn":"Practical+Aspects+of+Computational+Chemistry+-+Methods%2C+Concepts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"099b27404f28ee99f75071d337e25844dacc220a","infoHashBuffer":{"type":"Buffer","data":[9,155,39,64,79,40,238,153,247,80,113,211,55,226,88,68,218,204,34,10]},"announce":[],"urlList":[]}}