{"title":"Liz Durrett - Outside Our Gates [2008][EAC,log,cue. FLAC]","uid":8433844,"size":270481316,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:09ad8781bdccd0aea185ee6d2d646841903a7e88&amp;dn=Liz+Durrett+-+Outside+Our+Gates+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1367568253,"description":"Artist: Liz Durrett\nRelease: Outside Our Gates\nDiscogs: 3104978\nReleased: 2008-09-09\nLabel: Warm Electronic Recordings\nCatalog#: WRM120CD\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Folk, World, &amp; Country, \n\nTracklisting:\n\n01. Wake To Believe (4:02)\n02. Wild As Them (3:40)\n03. In The Eaves (4:23)\n04. We Build Bridges (3:52)\n05. Lost Hiker (2:45)\n06. All Of The All (4:42)\n07. Note For A Girl (3:55)\n08. You Live Alone (3:58)\n09. Always Signs (3:33)\n10. Not Running (4:44)\n11. The Sea A Dream (4:32)\n\nTwo things have dogged Liz Durrett since she released her debut album three years ago. First, the insistent and decreasingly newsworthy declaration that she is the niece of Athens eccentric Vic Chesnutt, who lent his homespun production and tissue-paper voice to her first two albums. Second, the constant comparison to other Southern female singer-songwriters like Athens' Madeline, Memphis' Megan Reilly, New Orleans' Blair, and the grandmother of them all, Cat Power. Like them, Durrett sings in a dusky voice that does gothic evocation extremely well but doesn't allow for much variety of expression, which has kept her tempos slow and her songs muted.\n\nOn her third album, Outside Our Gates, Durrett takes tentative steps toward the spotlight, challenging herself to quit her wallflower ways. If the main criticism of her previous albums was that they sounded pulseless-- all low-key numbers and pretty-but-aloof vocals-- then her new producer Eric Bachmann, from Crooked Fingers and Archers of Loaf, shakes things up a bit, bolstering her dark songs with strings and occasionally a full band to create an airy and unpredictable sound that gently prods Durrett out of her comfort zone. Stand-out &quot;Wild As Them&quot; builds on a repeating riff bolstered by a crunchy electric guitar and a counterrhythm courtesy of Chesnutt's blaring omnichord. Eerie, ambient percussion clatters in the background of &quot;All of Them All&quot; and &quot;Always Sign&quot;, the latter sounding like a gussied-up Tom Waits track.\n\nOutside Our Gates' titular pronoun is intentional: This is not a loner's record, but a community's collection of songs. Appropriately, the credits read like a who's-who of the Athens scene. Tin Cup Prophette's Amanda Kapousouz lends expressionist strings, while Ham1 and former members of Man or Astro-Man? and Olivia Tremor Control (hey, who isn't a former member of Olivia Tremor Control?) back Durrett, adding spark and texture to these songs. The result is Durrett's liveliest and rangiest record to date, as purposeful as her previous efforts but somehow more surefooted and traipsing.\n\nWhich brings us back to Thing Two: Slowly but surely, Durrett is outgrowing all of those comparisons, developing her own particular nuances, mannerisms, and tics. Her vocals define these songs, pushing &quot;All of Them All&quot; along its subtle but certain crescendo and corralling all the glowering distortion on &quot;Not for a Girl&quot;. Uncle Vic harmonizes softly with her on the lush, patient &quot;We Build Bridges&quot;, their voices blending so naturally and beautifully that she might have asked him to sing regardless of any family connection. She closes with the nearly a cappella &quot;The Sea a Dream&quot;, on which she layers her vocals into a choir of Lizes. Outside Our Gates may be her most satisfying album to date, but more crucially, despite the crowd of guests, it's definitely the most hers.","torrent":{"xt":"urn:btih:09ad8781bdccd0aea185ee6d2d646841903a7e88","amp;dn":"Liz+Durrett+-+Outside+Our+Gates+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ad8781bdccd0aea185ee6d2d646841903a7e88","infoHashBuffer":{"type":"Buffer","data":[9,173,135,129,189,204,208,174,161,133,238,109,45,100,104,65,144,58,126,136]},"announce":[],"urlList":[]}}