{"title":"Tom Godwin - the cold equations (.doc, .txt, .rtf, .pdf)","uid":4648623,"size":466915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09f94cd06bef5f431f8b4dc3e05837982eab4091&amp;dn=Tom+Godwin+-+the+cold+equations+%28.doc%2C+.txt%2C+.rtf%2C+.pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"annalator","files":-1,"time":1231967706,"description":"&quot;The Cold Equations&quot; is a science fiction short story by Tom Godwin, first published in Astounding Magazine in 1954. It is widely regarded as one of the most notable stories in the history of science fiction. Allegations have been made, however, that the story was taken from an EC Comics publication from the previous year.\n\n\n\n    summary\n\nA starship makes the rounds of Earth's colonies, adhering to a schedule from which it cannot deviate. When reports of a fever outbreak on the frontier planet Woden reach the starship, it drops off an Emergency Dispatch Ship, a space vessel of limited range, with a pilot and the serum that will cure them. The pilot discovers a stowaway, an 18-year-old girl named Marilyn who wants to see her brother, a colonist on Woden. The girl believes that she will have to pay a fine, but the situation is far more serious. The ship only has enough fuel for the pilot and his cargo. Her additional mass will cause the ship to run out of fuel before it can land, dooming both the pilot and the sick colonists. The pilot tries frantically to come up with a solution, but there is no way around the &quot;cold equations&quot;; he does not have sufficient fuel. The best he can do is to alter the ship's course enough to give her a single hour's reprieve before she must be jettisoned. In that time, she writes letters to her parents and her brother, talks with the pilot about death and, in the last few minutes, is able to speak with her brother on the radio, allowing them to say their goodbyes. When the horizon of the planet breaks up the radio contact, the girl enters the airlock and is ejected into space.\n\n\n\n\nseed (=nice gesture at this size)\nsay thanks if you like it","torrent":{"xt":"urn:btih:09f94cd06bef5f431f8b4dc3e05837982eab4091","amp;dn":"Tom+Godwin+-+the+cold+equations+%28.doc%2C+.txt%2C+.rtf%2C+.pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09f94cd06bef5f431f8b4dc3e05837982eab4091","infoHashBuffer":{"type":"Buffer","data":[9,249,76,208,107,239,95,67,31,139,77,195,224,88,55,152,46,171,64,145]},"announce":[],"urlList":[]}}