{"title":"Gettin' Gooey From The Guys! Sex Party 2 [DDF Production]","uid":13695411,"size":423226786,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0a44505bcee7edc6ce4665bd9e5111beec3b85eb&amp;dn=Gettin%27+Gooey+From+The+Guys%21+Sex+Party+2+%5BDDF+Production%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1456684703,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=9520514220\r\n \nhttp://imagedisco.net/?g=5119345328\r\n\r\n\r\n\r\nDescription:\r\n\r\n\r\nTwo incredibly curvy beauties, Cuban bombshell Katia De Lys and French temptress Eva Parcker, take on Mugur and Totti in the bathtub, and the action is non-stop! Wait until you see the round bottoms on these chicks, who are ready to be enjoyed by these lucky studs...and get plenty of enjoyment for themselves too, naturally! Slipping out of their beautiful robes and panties, the girls get into the bubbly water and tenderly kiss and playfully caress each other with the foam. Then Mugur and Totti arrive and the gals’ attention shifts as Katia goes down on Totti’s tool, its upthrusting inches making a fine accessory for her sensual mouth! Meanwhile Mugur gets to lick Eva’s supremely firm and lush 40C titties, before she takes his tool deeply into her lips. Katia gets to blow both dicks, taking on Mugur’s as well, jacking it while she’s throating Totti and then shifting to Mugur’s meat, which Eva thoughtfully directs with her hand into Katia’s hungry face. Kneeling in the tub, Mugur laps at Eva’s quim, and don’t miss those great shots of her very photogenic torso as she leans back to enjoy his attentions. There’s also a great pic of Eva’s pussy being spread by Mugur’s fingers, opening her lips into a little pink tent!! Eva shifts over to Totti’s prick, blowing him while Katia rides Mugur’s dick cowgirl-style. Then Katia and Eva suck Totti while Mugur bangs Katia’s ass, priming her for the main event: a double-penetration with Mugur in her snatch and Totti in her tush! Meanwhile Katia licks Eva’s clam. Katia takes double-tool in her pussy ass standing up, laying down, and riding it doggie style, until finally Mugur blasts a huge shipment of spunk all over her asshole and cheeks. Eva then holds Totti’s rod up so that Katia can receive his exploding load into her mouth as well. To wind up, Katia then lets Totti’s cum puddle drip from her mouth all over Eva’s tits! A gooey time is had by all \r\n\r\nName: Katia De Lys &amp; Eva Parcker - Gettin 'Gooey From The Guys! / Sex Party 2\r\nOriginal:\r\nYear: 2013\r\nGenre: Gang Bang\r\nDirected by: DDF Production\r\nStarring: Katia De Lys, Eva Parcker, Mugur, Totti","torrent":{"xt":"urn:btih:0a44505bcee7edc6ce4665bd9e5111beec3b85eb","amp;dn":"Gettin%27+Gooey+From+The+Guys%21+Sex+Party+2+%5BDDF+Production%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a44505bcee7edc6ce4665bd9e5111beec3b85eb","infoHashBuffer":{"type":"Buffer","data":[10,68,80,91,206,231,237,198,206,70,101,189,158,81,17,190,236,59,133,235]},"announce":[],"urlList":[]}}