{"title":"FS9 FS2004 : L-1049 Super Constellation","uid":3957166,"size":141986865,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0aef2a8a40dd5fac17d5b4f311b3e21c6a91613e&amp;dn=FS9+FS2004+%3A+L-1049+Super+Constellation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"samayot","files":1,"time":1199226214,"description":"The Lockheed Constellation, affectionately known as the Connie, was a four-engine propeller-driven airliner built by Lockheed between 1943 and 1958 at its Burbank, California, USA, facility. A total of 856 aircraft were produced in four models, all distinguished by a distinctive triple-tail design and graceful, dolphin-shaped fuselage. It was used as both a civilian airliner and U.S. military air transport plane, seeing service in the Berlin Airlift and as the presidential aircraft for U.S. President Dwight D. Eisenhower.\n\nThe Constellation was produced in both civil and military versions. The initial military versions carried the Lockheed designation of L-049; as World War II came to a close, some were completed as civil L-049 Constellations. The first purpose-built passenger Constellation was the more powerful L-649, followed by the L-1049 Super Constellation and L-1649 Starliner. Military versions included the C-69 and C-121 for the Army Air Forces/Air Force and the R7O R7V-1 WV-1 (L-1049G) WV-2 (L-1049H) (famously Willie Victor) and many variant EC-121 designations for the Navy (Navy ref Swanborough &amp; Bowers, United States Navy Aircraft since 1911, Funk &amp; Wagnalls, NY, 1968, also Fahey The Ships and Aircraft of the U.S. Fleet, 8th Ed, US Naval Institute, Anapolis, 1965).\n\nConstellations were used by dozens of airlines and air forces around the world. After TWA&amp;#039;s initial order was filled following World War II, customers rapidly accumulated, with over 800 aircraft built. In military service, the US Navy and Air Force operated the EC-121 Warning Star variant until 1978, nearly 40 years after work on the L-049 began. Pakistan International Airlines was the first airline from an Asian country to fly the Super Constellation.\n\nThis is the Breitling one with serial and update.\n","torrent":{"xt":"urn:btih:0aef2a8a40dd5fac17d5b4f311b3e21c6a91613e","amp;dn":"FS9+FS2004+%3A+L-1049+Super+Constellation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aef2a8a40dd5fac17d5b4f311b3e21c6a91613e","infoHashBuffer":{"type":"Buffer","data":[10,239,42,138,64,221,95,172,23,213,180,243,17,179,226,28,106,145,97,62]},"announce":[],"urlList":[]}}