{"title":"Douglas Perry - The Girls of Murder City [96] Unabridged","uid":7691691,"size":449487961,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0b254c44a1c1cca48c3fc6c1703f5b1c78503247&amp;dn=Douglas+Perry+-+The+Girls+of+Murder+City+%5B96%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1349222697,"description":"Douglas Perry - The Girls of Murder City: Fame, Lust, and the Beautiful Killers Who Inspired Chicago\n\n96 kbps, Unabridged\n\nOverview\nThe true story of the murderesses who became media sensations and inspired the musical Chicago\n\nChicago, 1924.\n\nThere was nothing surprising about men turning up dead in the Second City. Life was cheaper than a quart of illicit gin in the gangland capital of the world. But two murders that spring were special - worthy of celebration. So believed Maurine Watkins, a wanna-be playwright and a &quot;girl reporter&quot; for the Chicago Tribune, the city's &quot;hanging paper.&quot; Newspaperwomen were supposed to write about clubs, cooking and clothes, but the intrepid Miss Watkins, a minister's daughter from a small town, zeroed in on murderers instead. Looking for subjects to turn into a play, she would make &quot;Stylish Belva&quot; Gaertner and &quot;Beautiful Beulah&quot; Annan - both of whom had brazenly shot down their lovers - the talk of the town. Love-struck men sent flowers to the jail and newly emancipated women sent impassioned letters to the newspapers. Soon more than a dozen women preened and strutted on &quot;Murderesses' Row&quot; as they awaited trial, desperate for the same attention that was being lavished on Maurine Watkins's favorites.\n\nIn the tradition of Erik Larson's The Devil in the White City and Karen Abbott's Sin in the Second City, Douglas Perry vividly captures Jazz Age Chicago and the sensationalized circus atmosphere that gave rise to the concept of the celebrity criminal. Fueled by rich period detail and enlivened by a cast of characters who seemed destined for the stage, The Girls of Murder City is crackling social history that simultaneously presents the freewheeling spirit of the age and its sober repercussions.\n\nEditorial Reviews\nPublishers Weekly\nA series of murders committed by women in Chicago in the 1920s provide juicy material for drama in this racy history, as well as the musical. Perry paints a vividly detailed picture of the events with a range of viewpoints, from interviews with the murderers to police reports. Peter Berkrot has a deep and projecting voice that's easy to follow and enjoy. He handles the straightforward narrative smoothly, using pause and emphasis to highlight more important passages. If his female voices require more work, he excels at quoting newspapers and other firsthand accounts, cleverly mimicking their sensationalized, breathless tone. ","torrent":{"xt":"urn:btih:0b254c44a1c1cca48c3fc6c1703f5b1c78503247","amp;dn":"Douglas+Perry+-+The+Girls+of+Murder+City+%5B96%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b254c44a1c1cca48c3fc6c1703f5b1c78503247","infoHashBuffer":{"type":"Buffer","data":[11,37,76,68,161,193,204,164,140,63,198,193,112,63,91,28,120,80,50,71]},"announce":[],"urlList":[]}}