{"title":"20130117-Stossel-[TX vs. CA].Fox News (replay).CF.avi","uid":8046252,"size":275058030,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ba019365bcb2df803d27e6280a09383e3258cc2&amp;dn=20130117-Stossel-%5BTX+vs.+CA%5D.Fox+News+%28replay%29.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1358753288,"description":"----------\n\nSTOSSEL - [Texas versus California] - Fox Business Network (via FNC replay)\n2013, January 17, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nThis week, a showdown between the 2 states. Their differences reflect the battle for America's future.\n\nMoving to California was once the dream for many Americans. Its population grew at more than double the national average--until 1990. Last decade, 2 million more Americans moved out of California than moved in. They moved to states like Texas. In the last decade, Texas' total population grew at double the national rate.\n\nWhy?\n\nReason Magazine's Matt Welch and Chuck Devore of the TX Public Policy Foundation give a few reasons: Texans pay less in taxes. There's more job creation. And government takes less of your paycheck.\n\nBoth states have too many government workers--in fact, Texas has more than California. But California pays them so much more that California's pensions are bleeding the state dry, says Dan Mitchell of the CATO Institute. Kevin James, a mayoral candidate in Los Angeles, says L.A. City Council members are given cars, and they earn more than $170,000 per year.\n\nCalifornia has bankrupt cities, like San Bernardino. 3/4ths of the city's money goes to what they call public safety--unionized cops and firemen. Politicians promised them more than they have, but the public doesn't seem to realize WHY their city went belly up. Our special correspondent, Kennedy, went to what she says looks like &quot;ghost town&quot; for answers.\n\nTexas doesn't win all the California-Texas comparisons. Government is more likely to seize your property in Texas. Scott Bullock from the Institute for Justice says that asset forfeiture is a big problem in Texas, as well as eminent domain abuse.\n\nBut Texans do have the freedom to easily arm themselves, whereas California has some of the strictest gun control laws in the country. California plans stricter gun limits. By contrast, Texas politicians want to allow more teachers to be armed. California state senator Leland Yee debates these issues with Suzanna Hupp, a former Texas legislator whose parents were murdered by a lunatic gunman.","torrent":{"xt":"urn:btih:0ba019365bcb2df803d27e6280a09383e3258cc2","amp;dn":"20130117-Stossel-%5BTX+vs.+CA%5D.Fox+News+%28replay%29.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ba019365bcb2df803d27e6280a09383e3258cc2","infoHashBuffer":{"type":"Buffer","data":[11,160,25,54,91,203,45,248,3,210,126,98,128,160,147,131,227,37,140,194]},"announce":[],"urlList":[]}}