{"title":"Genesis - I Can't Dance  (2nafish)","uid":5641140,"size":169840644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0c402dfca9ba5678b146ff8ba2e8dd861a1d3dec&amp;dn=Genesis+-+I+Can%5C%27t+Dance++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1277113591,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Can't Dance&quot; is the fourth track from the Genesis album We Can't Dance and was the second single from the album (&quot;No Son of Mine&quot; being the first). The song peaked at number seven on both the U.S. Billboard Hot 100 and the UK Singles Chart.\n\nThe music video to this song (directed by Jim Yukich) is a humorous one, illustrating the artifice and fake glamour of television advertisements. Phil Collins himself said that the video was designed to make fun of the models in jeans commercials, and each verse refers to the things that the models in these commercials do. The ending is a parody to the &quot;Black or White&quot; music video, depicting Collins doing the &quot;Panther ending&quot; in which Michael Jackson dances erratically. &quot;Weird Al&quot; Yankovic also created a parody of the &quot;I Can't Dance&quot; video in which he appears alongside the band. Mismatched lighting suggests his shots were separate from the others.\n\nThe song created the &quot;I Can't Dance dance&quot; (a series of stiff, stylized motions). Phil Collins explained in an interview that when he was at stage school, that he would see kids that would always use the same hand and the same foot when they were tap dancing, meaning they couldn't coordinate. So he copied their movements and the &quot;dance&quot; was born.\n\nDuring one recording session, Mike Rutherford first created the main riff of the song he called &quot;Heavy A Flat&quot;, to which Phil Collins suddenly improvised &quot;I Can't Dance!&quot; Originally the band didn't think of it as anything more than a joke, because the song was too simple, too bluesy and completely unlike Genesis' style. Tony Banks said in an interview &quot;It was one of those bits you thought was going to go nowhere. It sounded fun, but wasn't really special&quot;.\n\nIt wasn't until Banks added the keyboard sound effects that the song took on a whole different feeling, with a slight edge of humour in it, which made the band decide to record it.\n\nBanks also said in an interview that it showed a kind of direction Genesis could have gone in. Opposite to what Genesis used to do in the past, taking an idea and turning it into a long or complex composition. Instead just taking an idea, and leaving it alone.\n\nWe Can't Dance, recorded and released in 1991, is the 14th studio album by Genesis. Although, on CD  and Cassette, it's a single album, on vinyl, it's a double album. It reached #1 in the UK, where it remained in the charts for 61 weeks. It was their last studio album featuring vocalist/drummer Phil Collins, who would leave Genesis amicably in 1996 to focus on his solo career.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0c402dfca9ba5678b146ff8ba2e8dd861a1d3dec","amp;dn":"Genesis+-+I+Can%5C%27t+Dance++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c402dfca9ba5678b146ff8ba2e8dd861a1d3dec","infoHashBuffer":{"type":"Buffer","data":[12,64,45,252,169,186,86,120,177,70,255,139,162,232,221,134,26,29,61,236]},"announce":[],"urlList":[]}}