{"title":"Soundgarden - Superunknown (EAC.FLAC)","uid":5200301,"size":490556544,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cbad23ed35a745fc27951a783a13e5611440fc2&amp;dn=Soundgarden+-+Superunknown+%28EAC.FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobnjeff","files":18,"time":1260126525,"description":"Soundgarden - Superunknown\n\nOriginal Release Date: March 8, 1994 \nNumber of Discs: 1 \n\nall music files are in flac format with a bitrate of 1024 kBit/s\nwith cue &amp; m3u files\n# of files 17 \n\n&quot;Black Hole Sun&quot; won the 1995 Grammy Award for Best Hard Rock Performance, and &quot;Spoonman&quot; won the Grammy for Best Metal Performance. &quot;Black Hole Sun&quot; was also nominated for Best Rock Song, and SUPERUNKNOWN was nominated for Best Rock Album.\n\nAs ...    Full Descriptionthe first grunge band to be signed by a major label, Seattle's Soundgarden opened the pop floodgates, and a deluge of thrash-o-rama bands began swamping the airwaves. Following a series of trend-setting releases on the independent Sub Pop and SST labels, Soundgarden's initial A&amp;M releases LOUDER THAN LOVE and BADMOTORFINGER signaled the return of the classic guitar band to popular consciousness.\n\nUsing the time-honored Led Zeppelin/Aerosmith approach as a jump-off point--not to mention influential bands like Black Sabbath, MC5, The Stooges and Killing Joke--Soundgarden has formalized their own approach to raw power. Their stylized melodic hooks, however, along with their sometimes surreal lyrics, set them apart from the pack. Whether they get dazed and confused on the vamping &quot;Limo Wreck,&quot; or cut loose with a wham- bam-thank-you-ma'am 4/4 cruncher like &quot;Kickstand,&quot; Soundgarden can rock and roll with all the jet-propelled, no-nonsense crunch of all your favorite bands, from Zeppelin to the Ramones--and lead guitarist Kim Thayil's chops never outrace his melodic imagination.\n\nBut Soundgarden is doing a lot more than simply recycling their best bits for another run up the charts. With SUPERUNKNOWN, they're stretching out and putting some distance between themselves and their imitators, incorporating different styles into their own mix, and creating a fresh modern sound. Certainly, there are not many bands who could rock convincingly in 5/4 time without sounding like slumming jazzbos, but Soundgarden's &quot;My Wave&quot; is a fist-shaking anthem that suggests the tone of the Stones' &quot;Get Off My Cloud.&quot; The curious mixture of psychedelic blues elements, Near-Eastern tonalities and Indian ragas which make &quot;Head Down,&quot; &quot;Black Hole Sun&quot; and &quot;Half&quot; so distinctive indicates that Soundgarden didn't simply cop their ideas from a Hollywood soundtrack. With his guttural Steve Tyler-like growl, frontman/songwriter Chris Cornell can turn a spoon player into a street shaman on &quot;Spoonman,&quot; give in to despair on &quot;Let Me Drown,&quot; or rail against authoritarian types on &quot;Head Down.&quot; With slamming production by Michael Beinhorn, SUPERUNKNOWN is the hard rock event of 1994.\n\nRecorded at Bad Animals Studio, Seattle, Washington.\n\nPersonnel: Chris Cornell (vocals, guitar); Ben Shepherd (vocals); Kim Thayil (guitar); April Acevez (viola); Natasha Shneider (Clavinet); Matt Cameron (drums, percussion).\n\nRecording information: Bad Animals Studio, Seattle, WA.\n\nSoundgarden: Chris Cornell (vocals, guitar); Ben Shepherd (guitar, bass, drums, percussion, background vocals); Kim Thayil (guitar); Matt Cameron (drums, percussion, Mellotron).\n\nAdditional personnel: April Acevez (viola); Justine Foy (cello); Michael Beinhorn (piano); Natasha Shneider (Clavinet); Gregg Keplinger (drums, percussion); Artis The Spoonman (spoons).\n\n\nCategory  Rock, Pop, Heavy Metal, Alternative, Rock/Pop, Grunge \nLabel  A &amp; M \nOrig Year  1994 \nAll Time Sales Rank    858   \nCD Universe Part number  1094230 \nCatalog number  540198 \nDiscs  1 \nRelease Date  Mar 08, 1994 \nStudio/Live  Studio \nMono/Stereo  Stereo \nProducer  Michael Beinhorn; Soundgarden \nEngineer  Jason Corsaro \nPersonnel  Chris Cornell - vocals, guitar\nMatt Cameron - drums, percussion, Mellotron\nKim Thayil - guitar\nBen Shepherd - vocals\n \n\n\n   1. Let Me Drown \n   2. My Wave \n   3. Fell On Black Days \n   4. Mailman \n   5. Superunknown \n   6. Head Down \n   7. Black Hole Sun \n   8. Spoonman \n   9. Limo Wreck\n   10. The Day I Tried To Live \n   11. Kickstand \n   12. Fresh Tendrils   \n   13. 4th Of July \n   14. Half \n   15. Like Suicid \n","torrent":{"xt":"urn:btih:0cbad23ed35a745fc27951a783a13e5611440fc2","amp;dn":"Soundgarden+-+Superunknown+%28EAC.FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cbad23ed35a745fc27951a783a13e5611440fc2","infoHashBuffer":{"type":"Buffer","data":[12,186,210,62,211,90,116,95,194,121,81,167,131,161,62,86,17,68,15,194]},"announce":[],"urlList":[]}}