{"title":"Physics of Coal and Mining Processes - Anatoly D. Alexeev","uid":12915377,"size":11980727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d06de4025ee8c43a8e418c9512f4c596c3d7494&amp;dn=Physics+of+Coal+and+Mining+Processes+-+Anatoly+D.+Alexeev&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1449339176,"description":"Physics of Coal and Mining Processes - Anatoly D. Alexeev (CRC, 2012).pdf\r\n\r\nISBN 9781439876350\r\n\r\nAround the world, on average, four coal miners die for each million tons of coal recovered. Improving the safety of mining work while responding to the need for increased coal production, however, is impossible without further development of the physics of mining processes. A relatively new branch of science, it tackles problems that arise during mineral products recovery, particularly safety issues such as rock failures, coal and gas outbursts, and methane explosions.\r\n\r\n\r\n\r\nThe first book to present a unifying methodology for addressing problems such as outbursts and explosions of methane in coal mining, Physics of Coal and Mining Processes integrates theoretical and experimental research on coal and bearing rocks and examines the anthropogenic processes that occur during deep underground mining.\r\n\r\n\r\n\r\nThe book summarizes the results of recent and established research, including studies conducted at the Institute of Physics of Mining Processes of the National Academy of Sciences of Ukraine, headed by the author. Key topics covered include rock mass in multi-component compressive stress fields and phase conditions of methane in coal. The book also examines state-of-the-art instrumentation and physical methods of analysis, among them x-ray analysis of coal structures combined with computer simulation and nuclear magnetic resonance (NMR) spectroscopy combined with gas chromatography.\r\n\r\n\r\n\r\nBridging the gap between the academic theory and the practice of coal mining, the book proposes novel methods to predict rock mass condition, control gas-dynamic phenomena, and estimate safe mining loads. A useful reference for scientists, technicians, and engineers working in the coal industry, it also offers an overview of the physics of mining processes for students pursuing careers in the field","torrent":{"xt":"urn:btih:0d06de4025ee8c43a8e418c9512f4c596c3d7494","amp;dn":"Physics+of+Coal+and+Mining+Processes+-+Anatoly+D.+Alexeev","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d06de4025ee8c43a8e418c9512f4c596c3d7494","infoHashBuffer":{"type":"Buffer","data":[13,6,222,64,37,238,140,67,168,228,24,201,81,47,76,89,108,61,116,148]},"announce":[],"urlList":[]}}