{"title":"Alison Krauss &amp; Union Station - Lonely Runs Both Ways [2004]","uid":9273522,"size":307965708,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0d1ed0b539989cc2aba99e8b615f9b9e26f8c9fe&amp;dn=Alison+Krauss+%26amp%3B+Union+Station+-+Lonely+Runs+Both+Ways+%5B2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":18,"time":1385821856,"description":"Artist: Alison Krauss &amp; Union Station\nRelease: Lonely Runs Both Ways\nReleased: 2004\nLabel: Rounder\nCatalog#: 11661-0525-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Americana,folk\n\nimage\n\n\n\n01. Gravity (03:36)\n02. Restless (02:51)\n03. Rain Please Go Away (02:29)\n04. Goodbye Is All We Have (03:53)\n05. Unionhouse Branch (02:55)\n06. Wouldn't Be So Bad (03:10)\n07. Pastures of Plenty (03:45)\n08. Crazy as Me (03:13)\n09. Borderline (03:26)\n10. My Poor Old Heart (03:08)\n11. This Sad Song (02:21)\n12. Doesn't Have to Be This Way (03:33)\n13. I Don't Have to Live This Way (02:03)\n14. If I Didn't Know Any Better (03:48)\n15. A Living Prayer (03:34) \n\n\n\nAlison Krauss &amp; Union Station continue their winning streak on the aptly titled Lonely Runs Both Ways. While they have in some part grown away from their earthy, rollicking bluegrass roots, they've been able to craft a really polished and honest-sounding brand of mid-American adult contemporary that never dips into the schlockiness of mainstream AC or the formula-driven sound of young country. Instead, Krauss, co-songwriter Dan Tyminski, and the Station dig deep into the classic themes of rural American music, polishing them with terrific production, the finest instrumentation, and two of the best voices around. Lonely Runs Both Ways shifts back and forth between Krauss' angelic love songs and Tyminski's earthier tales of rain, roads, and rivers, with one blazing Jerry Douglas-led instrumental entitled &quot;Unionhouse Branch.&quot; Banjo player Ron Block takes a vocal turn on his own &quot;I Don't Have to Live This Way,&quot; but allows Krauss to take vocal lead on another of his songs (and the album's highlight), &quot;A Living Prayer.&quot; This gentle lullaby rocks the album to sleep with its light instrumentation and quietly soaring vocals, appropriately putting the ribbon on the whole tidy package. Although bluegrass purists may long for the days when Krauss rosined up her fiddle with the Cox Family, the pure beauty and craftsmanship of Alison Krauss &amp; Union Station's more commercial sound is undeniable, and somehow they manage to avoid sounding slick and formulaic, still retaining the spark of honesty that seems to be missing from the recordings of so many of their contemporaries. While the group made plenty of longtime fans nervous with its sexed-up 2001 release, New Favorite, Lonely Runs Both Ways should reinstill their faith in the fact that this band is far and away the best contemporary bluegrass act recording today..\n","torrent":{"xt":"urn:btih:0d1ed0b539989cc2aba99e8b615f9b9e26f8c9fe","amp;dn":"Alison+Krauss+%26amp%3B+Union+Station+-+Lonely+Runs+Both+Ways+%5B2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d1ed0b539989cc2aba99e8b615f9b9e26f8c9fe","infoHashBuffer":{"type":"Buffer","data":[13,30,208,181,57,152,156,194,171,169,158,139,97,95,155,158,38,248,201,254]},"announce":[],"urlList":[]}}