{"title":"techexpert - russian technical standarts database","uid":4453296,"size":12040644764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d50b4c3b2ab6da0cbe8ac63e3c1a4c6449fd1b4&amp;dn=techexpert+-+russian+technical+standarts+database&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bill_g","files":156,"time":1224361283,"description":"b] Year [/ b]: 2008 \n[b] author [/ b]: ZAO Code \n[b] Feature [/ b]: Normative documentation \n[b] Publishing [/ b]: ZAO Code \n[b] Format [/ b]: DjVu \n[b] quality [/ b]: scanned pages \n[b] description [/ b]: Thanks to the cooperation of Russian network of legal and technical documentation (Russian network TSNTD) with the Federal State Unitary Enterprise Center design products for construction &quot;(Russian LAC&quot; Rosstroy) came in light of new electronic systems &quot;Model project documentation. constructions, products and components. Index &quot;and&quot; Typical design documentation. constructions, products and sites (selected series) &quot;brand&quot; Tehekspert. &quot; \n\n      Systems are designed for enterprises participating the construction process, the oversight bodies and licensing customers build and represent a multi-library project documentation of model construction, products and components. \n\n      Systems will become an indispensable assistant for professional use in their work in type design: for architects, designers, engineers, designers, etc. \n\n      The user can select the most suitable system for themselves. \n\n       &quot;Typical design documentation. Constructions, products and components. Index&quot; - an electronic index of the design documents. The composition of the product includes information on the data model design used in the design and construction of buildings and facilities. Such data includes information on the status, and developer of exclusion. Also here contains information on the principle technical (design) solutions and techno-economic performance model construction, products and components (catalog lists). \n\n      &quot;Typical design documentation. Constructions, products and sites (selected series)&quot; - in addition to an electronic index includes design documentation (drawings galleries). The basis of the product are the most popular series of design documentation of model construction, articles and sites buildings and facilities. \n\n      Documents in the systems presented in a graphical objects (scanner-copy). Thus, the user gets the opportunity to work with the relevant original material accurately. \n[b] Extras. Information [/ b]: His database format. The program works with the hardware key. Emulator haspa missing, if someone has let a link where to download. \nA database with the update for the 3 rd quarter of 2008.","torrent":{"xt":"urn:btih:0d50b4c3b2ab6da0cbe8ac63e3c1a4c6449fd1b4","amp;dn":"techexpert+-+russian+technical+standarts+database","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d50b4c3b2ab6da0cbe8ac63e3c1a4c6449fd1b4","infoHashBuffer":{"type":"Buffer","data":[13,80,180,195,178,171,109,160,203,232,172,99,227,193,164,198,68,159,209,180]},"announce":[],"urlList":[]}}