{"title":"29 Februari","uid":7673519,"size":374673819,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d6df317e5fbd6282639d8eca7e776ce7a43b7a2&amp;dn=29+Februari&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zaini711","files":-1,"time":1348639734,"description":"Classification: U \n\nGenre: Muzikal Drama\n\nRunning Time: 1 Hour 44 Minutes\n\nDistributor: Kru Films\n\nCast: Remy Ishak, Jojo Goh, Izzue Islam\n\nDirector: Edry Abdul Halim\n\n&quot;29 Februari&quot; leads you through the exceptional life of Budi (Remy Ishak), who only ages once every four years as his birthday falls on 29 February. We are shown how he deals with this fate, which includes him facing the death of his loved ones and losing the love of his life, a Chinese girl called Lily (Jojo Goh) while witnessing the enormous changes that take place in Malaysia throughout the decades.\n\nFor those of you who have watched Hollywood classics like &quot;Forest Gump&quot;, you will not be surprised with the concept of &quot;29 Februari&quot;, as it also links an individual's personal life with that of a nation's historical moments. But director Edry is clever enough to utilize such approach to make the film seem fresh for audiences by blending in local cultural references with Malaysia's historical events, which helps brings us closer to the bittersweet story.\n\nOne of the biggest attractions of the movie, the stereoscopic 3D, is not a completely successful attempt made by the director and producers. If you watch it in 3D, you will realise that most of the 3D effects are only used widely in the beginning of the movie until part of the climax of the story. Besides pleasuring our visual senses with historical artefacts during the scenes set in the Malaya era and the main characters' scenes near a beautiful lake with the impressive effects and cinematography, audience will find that most of the scenes could still be well-presented to them without the label of stereoscopic 3D.\n\nIt is a good move to set the relationship between Budi and Lily against the racial wars that used to occur back then in the country. Their differences in background, religion and culture remind us about the importance of living together in harmony in a multi-cultural society as it is truly a tragedy to see people surviving in a same community getting rough on each other just because of racial differences.","torrent":{"xt":"urn:btih:0d6df317e5fbd6282639d8eca7e776ce7a43b7a2","amp;dn":"29+Februari","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d6df317e5fbd6282639d8eca7e776ce7a43b7a2","infoHashBuffer":{"type":"Buffer","data":[13,109,243,23,229,251,214,40,38,57,216,236,167,231,118,206,122,67,183,162]},"announce":[],"urlList":[]}}