{"title":"George.Orwell.1984.BD.pdf","uid":7506607,"size":704798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d9396a3e7c99417ae39570aabe5b17b9e48e999&amp;dn=George.Orwell.1984.BD.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"betadoctor","files":1,"time":1344196902,"description":"Nineteen Eighty-Four is a novel by George Orwell published in 1949. It is a dystopian and satirical novel about Oceania, a society tyrannized by The Party and its totalitarian ideology.\nThe Oceanian province of Airstrip One is a world of perpetual war, omnipresent government surveillance, and public mind control, dictated by a political system euphemistically named English Socialism (Ingsoc) under the control of a privileged Inner Party elite that persecutes all individualism and independent thinking as thoughtcrimes.\n\nTheir tyranny is headed by Big Brother, the quasi-divine Party leader who enjoys an intense cult of personality, but who may not even exist.\nBig Brother and the Party justify their rule in the name of a supposed greater good. The protagonist of the novel, Winston Smith, is a member of the Outer Party who works for the Ministry of Truth (Minitrue), which is responsible for propaganda and historical revisionism. His job is to re-write past newspaper articles so that the historical record always supports the current party line. Smith is a diligent and skilful worker, but he secretly hates the Party and dreams of rebellion against Big Brother.\n\nAs literary political fiction and as dystopian science-fiction, Nineteen Eighty-Four is a classic novel in content, plot, and style. Many of its terms and concepts, such as Big Brother, doublethink, thoughtcrime, Newspeak, and memory hole, have entered everyday use since its publication in 1949.\nMoreover, Nineteen Eighty-Four popularised the adjective Orwellian, which describes official deception, secret surveillance, and manipulation of the past by a totalitarian or authoritarian state.","torrent":{"xt":"urn:btih:0d9396a3e7c99417ae39570aabe5b17b9e48e999","amp;dn":"George.Orwell.1984.BD.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9396a3e7c99417ae39570aabe5b17b9e48e999","infoHashBuffer":{"type":"Buffer","data":[13,147,150,163,231,201,148,23,174,57,87,10,171,229,177,123,158,72,233,153]},"announce":[],"urlList":[]}}