{"title":"VA - Summer Party 2014 320kbps","uid":10247340,"size":650086180,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0ed9aa2eae44bae7c42eb858e7a0009a4c514e43&amp;dn=VA+-+Summer+Party+2014+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"6pack1204","files":51,"time":1401307834,"description":"Tracklist:\n\n\n01. Dj Logo - I. O. U. (Logolectric Radio Mix)\n02. Dj Saphire Project - Bye Boy (Club Mix)\n03. Edlington &amp; Naxwell - Night to Remember (Naxwell Mix)\n04. Frozen Skies Feat. Yana Vetrova - Always (Club Mix)\n05. Chris Rockford &amp; Dj Credo Feat. The Phat Mack - Brooklyn! (Club Mix)\n06. Female In2ition Feat. Stephen Pickup - I Found Love (Phil Giava Club Mix)\n07. Frozen Skies - Where Are We Going (Club Mix)\n08. Giselle - Heaven (Tosch Feat. Pit Bailay Remix)\n09. Hannover House Mafia - O Sarracino (Club Mix)\n10. Housemaxx feat. Linda Clifford - Going Back to My Roots (Studio 54 Club Mix)\n11. Marc Reason - Yo Soi Chicano (Club Mix)\n12. Victor Milas feat. Monty Wells - Pandemonium (Radio Version)\n13. J T Project Feat. Ron Ravolta - Addicted 2 Bass\n14. Jason Creator &amp; Staz feat. Renny Mc Lean - Samba (Tarabass Remix)\n15. Jason Parker - Castles in the Sky (Club Mix)\n16. Jay Outback - Affenstyle (Club Mix)\n17. Tosch feat. Pit Bailay - Maid of Orleans (Booty Mix)\n18. Jay Outback Feat. Ron Ravolta - All Night Long (Club Mix)\n19. John Done Syndicate - Mr. Boombastic (Club Mix)\n20. Latin Disco Rockerz - Tiempo (Club Mix)\n21. Global Disco Rockerz Feat. Carlos Chavez - Latin Lover (Club Mix)\n22. Leemar Project - All Night Long (Rick Lee Clubmix)\n23. Marc Reason - Lost Man (Club Mix)\n24. Michael Fall Feat. The Sunseekers - Vixen (Frozen Skies Remix)\n25. Miguel &amp; Chris - By Your Side (Phil Giava Electro Mix)\n26. The Booty Jocks - Movin' On Up\n27. Mike Ayden Feat. Dylan - Stronger (U Rock Extended Mix)\n28. Mr. Doll &amp; Nigel - Shake Your Booty (Jason Parker Remix)\n29. Natalie Grant - I Will Survive (Club Mix)\n30. Flash Brothers - Glitch (Club Mix)\n31. Botoxx &amp; Tom Belmond - Good Vibrations (Club Mix)\n32. Groovebirds - Yo Soy Indio (Mike Van Doorn Party 97 Bootleg Mix)\n33. Alicia - Hasta la Vista (Club Mix)\n34. Charlie Vallely Feat. Terri B. - You Are Not Alone (Extended Mix)\n35. Vortecs - Ohrbassmuss (Club Mix)\n36. Dj Ti-S feat. Natalie Grant - Pompeii (Club Mix)\n37. Chris Excess - Vamos a la Playa (Phil Giava Remix)\n38. Damien S Feat. Lee Thomas - Long Lost Summer Love\n39. Anthony Simons feat. Anna Berardi - Think About the Way (Extended Mix)\n40. Damon Paul Feat. Patricia Banks - Balada (Extended Mix)\n41. Dj Sanny J Feat. Ice M C &amp; Neon - Alegria\n42. DJ Ferre &amp; Sammy Love - We Are Friends (Jason Parker Remix)\n43. Frozen Skies Feat. Mark Engels - Hymn (Radio Version)\n44. Deadstar feat. Manu - I'm No More Impressed (Michael Fall Remix)\n45. Discotronix - The Power of Love (Bytes Brothers Remix)\n46. Damon Paul Feat. Patricia Banks - Ai Se Eu Te Pego (Female Club Mix)\n47. DJ Backslash &amp; J T Project feat. Johnny Catch - Never Been Honest (Club Mix)\n48. Dj Diavolo - Orgasmic Fantastic (Extended Mix)\n49. Dj Guila - Dream (Soundhouse7 Remix)\n50. Aerotrancer - Mature (Club Mix)\n\n\n\n\nSeed &amp; enjoy\n","torrent":{"xt":"urn:btih:0ed9aa2eae44bae7c42eb858e7a0009a4c514e43","amp;dn":"VA+-+Summer+Party+2014+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ed9aa2eae44bae7c42eb858e7a0009a4c514e43","infoHashBuffer":{"type":"Buffer","data":[14,217,170,46,174,68,186,231,196,46,184,88,231,160,0,154,76,81,78,67]},"announce":[],"urlList":[]}}