{"title":"Geo-Data, The World Geographical Encyclopedia 3rd Ed - (Malestro","uid":4915631,"size":87210443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10154d524f07ff0bce5c3deb4f2f0a6c067fbc23&amp;dn=Geo-Data%2C+The+World+Geographical+Encyclopedia+3rd+Ed+-+%28Malestro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1243412656,"description":" &lt;a href=&quot;http://www.image-upload.net/images/kkg2g4ewnwbtmbhhjas.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/kkg2g4ewnwbtmbhhjas.jpeg&lt;/a&gt;\n\nGeo-Data: The World Geographical Encyclopedia by John McCoy\nPublisher: Gale; 3rd edition (November 2002) | 704 pages | ISBN: 0787655813 |  PDF \n\nThe first new edition since 1989 of Geo-Data, formerly edited by George Kurian, is a splendid example of what a reference book can be. Its purpose is to provide the reader with the most detailed and comprehensive description available of the physical geography of the countries of the world. It achieves this purpose in an easy-to-use alphabetical arrangement for all of the world's 207 countries and dependencies. Each entry begins with the key facts about that country including longest rivers and highest mountains and other key statistics. All place-names and geographical features such as mountains and lakes have been listed in the most easily recognized versions of their names.\n\nEntries adhere to the same basic structure with key facts followed by overall geography and geology; then mountains and hills; inland waterways, coasts and oceans; climate and vegetation; human population; natural resources; and finally further readings. This information is enhanced by a relief map of the country that is both clear and easy to read. Additional features of the volume include an extensive index plus 19 tables of world rankings and a glossary. The glossary is perhaps the weakest feature, as it could have been more extensive.\n\nOther geographical dictionaries such as The Columbia Gazetteer of the World (Columbia Univ., 1998) and Merriam Webster's Geographical Dictionary (1997) define place-names in one A-Z listing. Geo-Data 's arrangement lends itself to readers who want to take a country-by-country approach. This is an excellent reference book that will be valuable for high schools and public libraries as well as academic reference collections. Highly recommended. RBB","torrent":{"xt":"urn:btih:10154d524f07ff0bce5c3deb4f2f0a6c067fbc23","amp;dn":"Geo-Data%2C+The+World+Geographical+Encyclopedia+3rd+Ed+-+%28Malestro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10154d524f07ff0bce5c3deb4f2f0a6c067fbc23","infoHashBuffer":{"type":"Buffer","data":[16,21,77,82,79,7,255,11,206,92,61,235,79,47,10,108,6,127,188,35]},"announce":[],"urlList":[]}}