{"title":"Kortatu - Azken Guda Dantza (1988). A Historic Concert of Rebel","uid":4776876,"size":45568882,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11b91c756f53907ac441dbd4fd3e68ac481a5df7&amp;dn=Kortatu+-+Azken+Guda+Dantza+%281988%29.+A+Historic+Concert+of+Rebel+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Melomman","files":27,"time":1237241550,"description":"Kortatu\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nKortatu was a ska punk band from the Basque Country formed in Irun in the summer of 1984.\n\nKortatu was born in the context of the first democracy years in Spain since 1936. The Spanish constitution was passed in 1978 and the Basque Statute of Autonomy in 1979, despite of a high abstention. Basque nationalism was struggling between the acceptance of the autonomy degree or the fighting for independence (at least, autodetermination). Kortatu had a big significance for the left-wing basque nationalism (which rejected the autonomist project) as precursors of a new wave of music: the Radical Basque Rock (Rock Radikal Vasco or RRV). They reached a huge influence in basque and Spanish punk, as other bands like La Polla Records, Cicatriz or Eskorbuto that became famous in the 80's underground scene.\n\nAlthough labeled from the beginning as a radical Basque rock, Kortatu tried to fight against any classification, even if political links with Herri Batasuna were evident. They also faced some censorship problems, especially when they tried to add a picture of Spanish monarch Juan Carlos I depicted as a robot. In the five year life span of the band they moved from ska to punk and even hip hop, eventually disbanding the formation after seeing Public Enemy in Paris and creating a bigger project, Negu Gorriak. Although their lyrics also evolved from &quot;party-ska&quot; to &quot;combat-rock&quot; (in their last record all the songs were sung in Basque) the main tone stayed intact: police torture, oppression of the Basque people and the need for social justice are recurrent subjects in their songs.\n\nThey were clearly influenced by The Clash, in fact, their frontman Fermin Muguruza decided to create a ska punk band after seeing Strummer's band in a 1980 gig in Donostia.\n\nThey recorded a demo which included their first three songs in 1985. In the same year, they included those songs in the landmark album known as &quot;Four's Album&quot;, because of the sharing with other three new bands: Cicatriz, Jotakie and Kontuz-Hi.\n\nThat year they toured first time around all the Basque Country, and they also played in Madrid and Barcelona. May 31 they played in Martutene Prison (Donostia) with Barricada. Some months later, Joseba Sarrionaindia, a recognized writer and poet who was imprisoned because of his ETA membership, escaped with another prisoner, IÃƒÂ±aki Pikabea, inside a loudspeaker, after a gig by Imanol. Kortatu and Barricada were accused of preparing the escapes, and they were banned in any prison to play, but nothing was proved. After that they wrote their best-known song, Sarri Sarri, about the escape of Sarrionaindia. In fact, it was a cover, including new lyrics, of Toots &amp; the MaytalsÃ‚Â´ Chatty Chatty.\n\n\n[edit] Members\nFermin Muguruza: Guitar and vocals \nIÃƒÂ±igo Muguruza: Bass \nTreku Armendariz: drums \nKaki Arkarazo: Guitar (From 1988) \n\n[edit] Discography\n(No title) (SoÃƒÂ±ua, 1985) together with Cicatriz, Jotakie and Kontuz-Hi!. Reedited on CD by Oihuka in 2000. \nKortatu (SoÃƒÂ±ua, 1985). \nA la calle (Maxi single featuring 3 themes) (SoÃƒÂ±ua, 1986). \nEl estado de las cosas (SoÃƒÂ±ua, 1986). \nA Front Line Compilation (best of) (Red Rhino-Organik, 1988). Reedited on CD by Oihuka in 1998. \nKolpez kolpe (Oihuka, 1988). Reedited on CD by Esan-Ozenki in 1998. \nAzken guda dantza (live, double album) (Nola!, 1988).","torrent":{"xt":"urn:btih:11b91c756f53907ac441dbd4fd3e68ac481a5df7","amp;dn":"Kortatu+-+Azken+Guda+Dantza+%281988%29.+A+Historic+Concert+of+Rebel+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11b91c756f53907ac441dbd4fd3e68ac481a5df7","infoHashBuffer":{"type":"Buffer","data":[17,185,28,117,111,83,144,122,196,65,219,212,253,62,104,172,72,26,93,247]},"announce":[],"urlList":[]}}