{"title":"Band of Brothers 2001 480p BRRip","uid":5521332,"size":1986424049,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:128bd133da18462b02114612e86f88faabb839e1&amp;dn=Band+of+Brothers+2001+480p+BRRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"agentpiratebay","files":-1,"time":1272628710,"description":"They depended on each other. And the world depended on them.\n\nThe story of Easy Company of the US Army 101st Airborne division and their mission in WWII Europe from Operation Overlord through V-J Day.\n. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0185906/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0185906/&lt;/a&gt;\n\nList of contents:\n\nEpisode 1: Currahee\nIn 1942, men from across the USA are in Camp Toccoa, Georgia to undergo paratrooper training. For the men of 'E' Easy Company the training is particularly difficult as a result of their demanding commander, Captain Herbert Sobel. He drives them incessantly to excel, canceling their weekend passes on a whim. His favorite chore is to have the men undertake a run up a hill known as Currahee...\n\nEpisode 2: Day of Days\nIn the very early hours of the D-Day invasion, Easy Company along with thousands of other Allied paratroopers land behind enemy lines in Normandy. In the chaos of the jump however, they are spread far and wide with many landing far from their expected drop zone. Lt. Winters assembles the few men they can find and slowly make their way to their rendezvous point...\n\nEpisode 3: Carentan\nEasy Company's next objective is to take the town of Carenten where they engage in street to street fighting with a doggedly determined enemy. The fighting is hard and there are many casualties. Having pushed the Germans out, Easy Company now has to hold the position and soon face a counter-attack from German forces, including artillery and tanks...\n\nEpisode 4: Replacements\nEasy Company's stay in England is far too short when they are ordered to participate in operation Market Garden. This major engagement is to thrust north into Holland seizing the bridges along the way with a view to giving the Allies a clear route into Germany. The men of Easy Company are told that they will be leaving for good and they parachute into near Eindhoven, where they get a huge welcome from the war-weary population. With significant losses in Normandy invasion, Easy also has to welcome new recruits who, in the eyes of the now veteran combat soldiers who have survived, as much a liability as a benefit. The battle is not easy with the Germans putting up fierce resistance...\n\nEpisode 5: Crossroads\nCaptain Winters leads Easy Company in an attack on what they thought was a machine gun nest but turns out to 2 Companies of German SS who also have artillery support. The attack is successful in that they virtually wipe out the enemy but they do suffer many casualties. He soon finds himself promoted as the 2nd Battalion's Executive Officer and while he has concern about leaving Easy Company, he knows they are in good hands with Lt. Moose Heyliger...\n\nEpisode 6: Bastogne\nIt's a cold, harsh Christmas 1944 for the men of Easy Company as they try to hold the line around Bastogne against attacking German forces. They have no winter clothing, limited rations and little ammunition. For Eugene Rowe, one of the medics, the problem is getting basic medical supplies. He's been scrounging what he can, but it simply isn't enough...\n\nEpisode 7: The Breaking Point\nEasy Company is still in the Ardennes forest but the Germans are in retreat. The men are cold and living in foxholes knowing that they will likely be ordered to try and take the town. The Germans have been pushed back to the town of Foy but they are well positioned and have heavy artillery. Their artillery barrages take a heavy toll and several of the veterans of Easy Company are severely wounded including Bill Guarnere and Joe Toye...\n\nEpisode 8: The Last Patrol\nIt's February 1945 and a depleted Easy Company is now in Haguenau, France on the Rhine just across from Germany. Pvt. David Webster, who was injured during Operation Market Garden, returns to the Company but finds that his absence from the fighting in Bastogne has alienated the others and he is treated as an outsider. The Company also has a new junior officer, Lt. Henry Jones, a West Point graduate who has yet to get any battlefield experience. The war is clearly coming to an end and the men are starting to think they might just survive the war...\n\nEpisode 9: Why We Fight\nThe men of Easy Company are now in Germany, aware that the Germans are surrendering by the thousands and that the war is winding down. With more time to reflect, some of the men are wondering if it was all worth it and begin to question whether the sacrifices they and their absent colleagues have made were worth it. That question is answered when they come across a concentration camp and they see first hand the atrocities committed by the Nazis...\n\nEpisode 10: Points\nIt's May 1945 and Easy Company finds itself the first Allied troops to enter Bertchesgarden, Hitler's Bavarian retreat. They find the village virtually empty with only a few people working in the hotel. They're there only a short time when they get the news they've been waiting for: the German army surrenders and the war in Europe is over...","torrent":{"xt":"urn:btih:128bd133da18462b02114612e86f88faabb839e1","amp;dn":"Band+of+Brothers+2001+480p+BRRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"128bd133da18462b02114612e86f88faabb839e1","infoHashBuffer":{"type":"Buffer","data":[18,139,209,51,218,24,70,43,2,17,70,18,232,111,136,250,171,184,57,225]},"announce":[],"urlList":[]}}