{"title":"Barclay James Harvest - Everyone Is Everybody Else 1974","uid":6746290,"size":258194391,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13e76fff32842097c56f736c9ebacbbda710daaa&amp;dn=Barclay+James+Harvest+-+Everyone+Is+Everybody+Else+1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1318701726,"description":"Everyone Is Everybody Else is a 1974 album by British Rock Band Barclay James Harvest. It was released in the UK on the 14th June 1974 and was their first album for the Polydor label after they had parted company with EMI.\n\nThe album was produced by Rodger Bain, who had previously worked with Black Sabbath in producing their first three albums. He also produced heavy rock bands Judas Priest and Budgie. There was said to be strained relations between Bain and the band, due to the preference of his musical style, with the band unhappy with the results of the song Child of the Universe in particular; Woolly Wolstenholme's only contribution was also left off the original album.\n\nWhile the band were said not to be entirely happy with the results, the album was regarded by many as their artistic high point. It was played extensively on Radio Caroline, particularly the tracks For No One (whose lyrics contain the title of the album) and Child of the Universe. Radio Caroline subsequently broadcast a documentary on the band, secretly mixed at the studios of Capital Radio in London. The Album was subsequently voted by Radio Caroline listeners at no 13 on the Top 100 All Time Album Chart. It also led to a BBC Radio 1 session with John Peel.\n\nAlthough the album did not chart, it was nevertheless an important album that directly contributed to subsequent limited UK success and considerable European success for the band, particularly in Germany, France and Switzerland. (wikipedia)\n\n- - -\n\nFortunately the crisis which threatened to finish the band 1973 was averted when they were signed up by Polydor and began to enjoy greater commercial success. 1974s studio set, Everyone Is Everybody Else, was followed later that year by Barclay James Harvest Live, a double LP which became their first chart album. Time Honoured Ghosts (1975) and Octoberon (1976) saw them building on their achievements and selling out the now-traditional autumn tours of the UK, whilst exploring new territory abroad with short tours of West Germany and the U.S.A. 1977s Gone To Earth opened up a new market for them in Germany, where the LP became a fixture in the charts, prompting EMI to repackage their back catalogue and belatedly to issue Johns solo album, A Major Fancy, recorded in 1972 but shelved when the band left Harvest. (bjharvest.co.uk)\n\n- - -\n\nBarclay James Harvest - Everyone is Everybody Else 1974\n(Polydor 1987)\n\n 1. Child of the universe\n 2. Negative earth\n 3. Paper wings\n 4. The great 1974 mining disaster\t\n 5. Crazy city\n 6. See me see you\n 7. Poor boy blues\n 8. Mill boys\n 9. For no one\n\n\nJohn Lees - acoustic guitar, guitar, vocals, backing vocals\nLes Holroyd - acoustic guitar, bass, rhythm guitar, vocals, backing vocals\nStewart Wooly Wolstenholme - keyboards, vocals\nMel Pritchard - percussion, drums\n\nRecording Studios: Olympic Studios, London \n(which was owned by John Kongos, the South-African born singer-songwriter who had hit singles with He's Gonna Step On You Again and Tokoloshe Man in 1971). \nMixed at Trident Studios, London.\nRecording Dates: March/April 1974\n\nProducer: Rodger Bain\nRodger was best known for his production work on the first three albums by the archetypal heavy metal band, Black Sabbath; his speciality was certainly heavy rock, as he also produced bands such as Judas Priest and Budgie. This may have been one of the reasons why he didn't always see eye to eye with Barclay James Harvest, who were never fully satisfied with the end result, especially Child Of The Universe, which they spent hours mixing and remixing. Woolly's only contribution to the album was also omitted from the final listing for the same reason, leaving him unrepresented as a songwriter - the song, incidentally, was Maestoso! Having said that, the album's warm sound and subtle, understated production still sound superb to these ears, and at least three of the songs from it went on to became live classics. (bjharvest.co.uk)\n","torrent":{"xt":"urn:btih:13e76fff32842097c56f736c9ebacbbda710daaa","amp;dn":"Barclay+James+Harvest+-+Everyone+Is+Everybody+Else+1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e76fff32842097c56f736c9ebacbbda710daaa","infoHashBuffer":{"type":"Buffer","data":[19,231,111,255,50,132,32,151,197,111,115,108,158,186,203,189,167,16,218,170]},"announce":[],"urlList":[]}}