{"title":"Alejandro Escovedo - By the Hand of the Father [2002][EAC/FLAC]","uid":10435248,"size":341706407,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:146b18be5edd411ef85eb42e71b275a9661f9527&amp;dn=Alejandro+Escovedo+-+By+the+Hand+of+the+Father+%5B2002%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1403830351,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Blue Rose #BLUCD 0287\nCountry: USA\nYear: June 24, 2002\nGenre: Americana\nFormat: CD,Album\n\n[b]\n\n1. By The Hand Of The Father Theme\n2. Wave\n3. Did You Tell Me?\n4. Dos Hermanos / Two Brothers\n5. Ballad Of The Sun And The Moon (with Rosie Flores)\n6. Mexico Americano\n7. Seven Years\n8. Rosalie\n9. Hard Road\n10. 59 Years\n11. Inside The Dance (with Pete Escovedo)\n12. Cancion Mexico (with Ruben Ramos)\n13. With These Hands\n14. Silence\n15. And Yet / Theme\n\n\n\n\nThe depth and feeling of By the Hand of the Father is a bit shocking. The project began as a play that premiered in Los Angeles in 2000 and has been stripped down to a handful of songs accompanied by voice-over texts. These songs and voice-overs weave a complex tapestry that explores the Mexican-American experience in the 20th century. Individuals leave their homeland, search for the American Dream, and attempt to hold on to their heritage. Alejandro Escovedo, who has written most of the lyrics and sings most of the vocals, stands at the center of this multi-faceted venture. &quot;Rosalie&quot; tells the tale of two lovers separated by &quot;An ocean of powder and dust,&quot; who finally marry after a seven-year courtship punctuated by only seven visits. At the beginning of &quot;Mexico Americano,&quot; the narrator recalls how his father always felt more Mexican than American until he joined the U.S. Army to defend a country &quot;that was barely even his.&quot; These songs move forward in time, from the early 1900s to World War II to the Vietnam War. Heavy drums and a galloping guitar punctuate &quot;Hard Road,&quot; a series of vignettes about the working lives of Mexican-Americans. Like other Americans, they hope their sons and daughters will be able to do better than them. By the Hand of the Father is a contemplative work of rare depth. By attempting to find meaning in the lives and stories of those who have come before them, Escovedo and friends have crafted a penetrating work of art that's also a joy to listen to. ","torrent":{"xt":"urn:btih:146b18be5edd411ef85eb42e71b275a9661f9527","amp;dn":"Alejandro+Escovedo+-+By+the+Hand+of+the+Father+%5B2002%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"146b18be5edd411ef85eb42e71b275a9661f9527","infoHashBuffer":{"type":"Buffer","data":[20,107,24,190,94,221,65,30,248,94,180,46,113,178,117,169,102,31,149,39]},"announce":[],"urlList":[]}}