{"title":"The Clansman: An Historical Romance of the Ku Klux Klan","uid":11825579,"size":20842725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1664e63d804446f96c20b696784e7043223ea691&amp;dn=The+Clansman%3A+An+Historical+Romance+of+the+Ku+Klux+Klan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429482783,"description":"The Clansman: An Historical Romance of the Ku Klux Klan is a novel published in 1905. It was the second work in the Ku Klux Klan trilogy by Thomas F. Dixon, Jr. that included The Leopard's Spots and The Traitor. It was influential in providing the ideology that helped support the revival of the Ku Klux Klan (KKK). The novel was immediately adapted by its author as a play entitled The Clansman (1905) and by D. W. Griffith as the groundbreaking 1915 silent movie The Birth of a Nation. The play particularly inspired the second half of The Birth of a Nation, as it was concerned with the KKK and Reconstruction rather than the American Civil War. According to Professor Russell Merritt, key differences between the play and film are said to include that Dixon was more sympathetic to Southerners' pursuing education and modern professions, whereas Griffith stressed ownership of plantations.[1] Dixon wrote The Clansman as a message to Northerners to maintain racial segregation, as the work claimed that blacks when free would turn savage and violent, committing crimes such as murder, rape and robbery far out of proportion to their percentage of the population","torrent":{"xt":"urn:btih:1664e63d804446f96c20b696784e7043223ea691","amp;dn":"The+Clansman%3A+An+Historical+Romance+of+the+Ku+Klux+Klan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1664e63d804446f96c20b696784e7043223ea691","infoHashBuffer":{"type":"Buffer","data":[22,100,230,61,128,68,70,249,108,32,182,150,120,78,112,67,34,62,166,145]},"announce":[],"urlList":[]}}