{"title":"A Passage to India (1984)","uid":4767924,"size":1129401194,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:169899a2ebe3d1fa80fa54e5e677c37fb5c89189&amp;dn=A+Passage+to+India+%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jgordon20904","files":2,"time":1236943690,"description":"When my wife suggested that we watch A Death in Venice a few days ago, I realized that there were a few more movies in our collection that we hardly watch any more. I thought that maybe I ought to upload them and watch the reaction of the viewing public. This &quot;torrent&quot; world has taught me that my preferences don't necessarily coincide with those of you viewers. \n\nAnd so I sent A Room With a View. This was a film I hardly remembered and it's a real surprise to see how well it is being received. \n\nThe next two, A Passage to India and Picnic at Hanging Rock, are even worse. I never intended to watch them again. After uploading them today I will watch their course through the world of uTorrent, Bittorrent, Mininova and Pirate Bay. That, along with all the commentary opinions I've been reading, has shown me that I'm a &quot;Babe in the Woods&quot; when it comes to movie watching.\n\nI hope they are enjoyed. If, by chance, all this downloading causes anyone's ISP (Internet Service Provided) to slow them down or block them for exceeding their limit, I apologize. I will take a breather and finish up my income taxes.\n\n\n","torrent":{"xt":"urn:btih:169899a2ebe3d1fa80fa54e5e677c37fb5c89189","amp;dn":"A+Passage+to+India+%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"169899a2ebe3d1fa80fa54e5e677c37fb5c89189","infoHashBuffer":{"type":"Buffer","data":[22,152,153,162,235,227,209,250,128,250,84,229,230,119,195,127,181,200,145,137]},"announce":[],"urlList":[]}}