{"title":"Marvel Anime Wolverine Ep1-2 (2011) TVRip Eng Sub NLT-Release","uid":6114996,"size":412591009,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:16d72eb72098907d91515258b3c26c6e5385ce98&amp;dn=Marvel+Anime+Wolverine+Ep1-2+%282011%29+TVRip+Eng+Sub+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"luiehond69","files":-1,"time":1295516929,"description":"Marvel Anime Wolverine Ep1-2 (2011) TVRip Eng Sub NLT-Release\n\n\n\nOne night in New York, Logan saves a man named Tesshin Asano who was being attacked by members of AIM equipped with cloaking devices and metal destroying weaponry.\nAsano tells Wolverine about the whereabouts of his missing love, Mariko Yashida, and the crime organisation Kuzuryu, the leader of\nwhich is Mariko's father, Shingen. Mariko is allegedly arranged to be married to a man named Hideki Kurohagi in order to expand his operations.\nIn order to find Mariko, who was kidnapped from New York a year ago, Logan flies to Tokyo and infiltrates the Yashida household, but is detected by Shingen.\nAfter his henchmen are defeated, Shingen challenges Logan to a bokken fight. Logan barely manages to withstand Shingen's swordsman skills, but is shot with a drugged dart by Hideki,\nbefore going into a rage and bringing out his claws.\n========================================================\nEen nacht in New York, Logan slaat een man genaamd Tesshin Asano, die werd aangevallen door leden van AIM uitgerust met verhul apparaten en metalen vernietigen wapens.\nAsano vertelt Wolverine over de verblijfplaats van zijn vermiste liefde, Mariko Yashida, en de misdaad organisatie Kuzuryu, de leider van dat is Mariko's vader, Shingen.\nMariko is naar verluidt geregeld om te trouwen met een man genaamd Hideki Kurohagi om zijn activiteiten uit te breiden.\nOm uit te vinden Mariko, die werd ontvoerd uit New York een jaar geleden, Logan vliegt naar Tokio en infiltreert de Yashida huishouden, maar wordt gedetecteerd door Shingen.\nNa zijn handlangers zijn verslagen, Shingen uitdagingen Logan een bokken vechten.\nLogan beheert nauwelijks te weerstaan Shingen's zwaardvechter vaardigheden, maar is geschoten met een gedrogeerd dart door Hideki.\nVoordat u gaat in een woede en het uitbrengen van zijn klauwen.\nDit zijn de eerste twee afleveringen er komen er 12 verder is er nog een serie van iron man in de zelfde japanse stijl\nEn er komt nog een serie van de X-men en Blade ik zal ze allemaal plaatsen het zijn mkv bestanden maar die kan je op de meeste players\ngewoon afspelen zit geen Nederlandse ondertiteling bij maar Engels veel kijk plezier en dit is geen serie voor jonge kijkers ;)\n\nGEGEVENS:\ncategorie: anime/ manga\nkwaliteit: TVRip\ntaal: Japanse\nsub: Engels ingebakken\nland van herkomst : Japan\njaar: 2010\nbestand: Mkv\n\nINFO:\nWIKI\n\nYoutube: sLYjywXyyDI\n\nLUIEHOND69;)\n============================================================================================================================================================= &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\nENJOY THE SHOW :D ","torrent":{"xt":"urn:btih:16d72eb72098907d91515258b3c26c6e5385ce98","amp;dn":"Marvel+Anime+Wolverine+Ep1-2+%282011%29+TVRip+Eng+Sub+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d72eb72098907d91515258b3c26c6e5385ce98","infoHashBuffer":{"type":"Buffer","data":[22,215,46,183,32,152,144,125,145,81,82,88,179,194,108,110,83,133,206,152]},"announce":[],"urlList":[]}}