{"title":"Simon R. Green - Nightside-10,11,12","uid":11314348,"size":1031238144,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:177c07bf78058268cbb2bdb9f9935b79b78ee88d&amp;dn=Simon+R.+Green+-+Nightside-10%2C11%2C12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"twocows","files":169,"time":1414534830,"description":"Nightside-10-The Good, The Bad &amp; The Uncanny\n\nThings were going so well for P.I. John Taylor, that it was only a matter of time before everything hit the fan. Walker, the powerful, ever-present, never?to-be-trusted agent who runs the Nightside on behalf of The Authorities, is dying. And he wants John to be his successor-a job that comes with more baggage, and more enemies, than anyone can possibly imagine. \n\n\nNightside-11-A Hard Days Knight\n\nJohn Taylor is a P.I. with a special talent for finding lost things in the dark and secret center of London known as the Nightside. He's also the reluctant owner of a very special-and dangerous-weapon. Excalibur, the legendary sword. To find out why he was chosen to wield it, John must consult the Last Defenders of Camelot, a group of knights who dwell in a place that some...\n\n\nNightside-12-The Bride Wore Black Leather\n\nIn the secret heart of London, under the cover of endless darkness, the Nightside caters to anyone with any unusual itch that needs to be scratched. But enter at your own risk. The party animals who live here may be as inhuman as their appetites...\n\nMy name is John Taylor. The Nightside is my home. I didn't plan it that way. In fact, I once tried to get away. But I came back. And now it seems I'm settling down, with a full-time job (in addition to my work as a very private eye) as Walker-the new Voice of the Authorities in the Nightside-and a wedding in the offing.\n\nI'm marrying the love of my life, Suzie Shooter, the Nightside's most fearsome bounty-hunter. But nothing comes easy here. Not life. Not death. And for certain, not happily-ever-after. Before I can say &quot;I do,&quot; I have one more case to solve as a private eye-and my first assignment as Walker","torrent":{"xt":"urn:btih:177c07bf78058268cbb2bdb9f9935b79b78ee88d","amp;dn":"Simon+R.+Green+-+Nightside-10%2C11%2C12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"177c07bf78058268cbb2bdb9f9935b79b78ee88d","infoHashBuffer":{"type":"Buffer","data":[23,124,7,191,120,5,130,104,203,178,189,185,249,147,91,121,183,142,232,141]},"announce":[],"urlList":[]}}