{"title":"Miles Davis-Jack Johnson Sessions D2~5-2003 [EAC - FLAC](oan)","uid":4802478,"size":444055066,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1850d83b90accb576786e8a041957aab1eaf5359&amp;dn=Miles+Davis-Jack+Johnson+Sessions+D2%7E5-2003+%5BEAC+-+FLAC%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"oneanight","files":-1,"time":1238087701,"description":"Miles Davis - Complete Jack Johnson Sessions D2~5-2003 [EAC - FLAC] (oan)\n\n\n\n\nBy Rod Sibley\n\nThe Complete Jack Johnson Sessions, Columbia's latest\naddition to the Miles Davis reissue series, documents the period\nfrom January 27, 1970 to June 4, 1970 and contains unedited\ntakes from the sessions plus previously unreleased material.\n\nA bit of background: Jack Johnson was the world heavyweight\nboxing champion from 1908-1915. Miles felt an affinity toward\nJohnson; not only because Miles himself boxed, but because of\nthe racial issues of being a Black man in America both men\nfaced. Director William Clayton made a documentary movie\nabout Johnson's life. A Tribute To Jack Johnson is the\nsoundtrack to the film. The album was released in the summer\nof 1971.\n\nA Tribute To Jack Johnson was a continuation of Miles' musical\ndirection away from more traditional jazz forms. The densely\nlayered music of Bitches Brew, recorded in August of 1969, was\nstripped down and became funkier and more groove oriented.\nThe music also incorporated more elements of rock with the\nguitar work of John McLaughlin. For listeners whose only Miles\nDavis recording is Kind Of Blue and want to hear some &quot;electric\nMiles,&quot; The Complete Jack Johnson Sessions may be the\nstarting point to work your way backward, as well as forward,\nthrough the Miles Davis catalog\n\nDisc Two: March 1970\n\nThe unedited takes of the song &quot;Go Ahead John&quot; are the\ncenterpiece of Disc Two. Miles' producer, Teo Macero, had free\nreign in editing his music. One of the most commonly cited\nexamples of the excessive use of that freedom is his postproduction\nwork on &quot;Go Ahead John,&quot; where he used an\nelectronic switcher that moved tracks around like an extreme\npanning effect and a device that created the illusion of\ninstruments playing together. Despite the technology, Miles fans\ntend to agree that the effects were used well past the point of\nannoyance, especially when listened to with headphones. The\nunaltered takes are presented for the first time in the box set.\nThe final version is not included, but it is available on the Big\nFun CD.\n\nThe first take has Miles soloing over a solo blues progression,\nas only he can. Miles is the master of doing so much with so\nlittle. The delay effect on the final version sounds like there are\ntwo trumpets playing together, so hearing the original trumpet\npart will make Miles fans very happy.\n\nThe switching effect makes Jack DeJohnette sound like two\ndrummers. The unaltered takes reveal DeJohnette's forceful\nand wickedly syncopated drumming. The box set's remastering\nmakes the drums sound thunderous. The real shame of this\npiece is not Teo's use of the switcher on the drums, but that the\ndrums were not recorded in stereo in the first place. The\nextreme switching effect has also been removed from the take\nthat contains McLaughlin's highly distorted guitar solo, but does\nnot differ much from the final version.\n\nAnother highlight is the &quot;part 1 remake,&quot; which has Johnny Mac\nplaying over the same slow blues as Miles did on &quot;part 1.&quot;\nHearing him out of his element is a revelation. This track differs\nfrom his playing on &quot;Archie Moore.&quot; Instead of straight-ahead\nblues riffing, we hear more of McLaughlin's personal style,\nwhich had a raw quality at that time. His extreme string bending,\nhis double-stops, and his picking attack all foreshadow the time\nwhen he kicks his chops up a notch or two and refines these\nlicks in the Mahavishnu Orchestra. Miles also takes a solo,\nwhich is just as smooth as the first take version. Miles and the\nblues...was there ever a better match made in heaven?\n\nTwo more of the boxer named tracks round out Disc Two:\n&quot;Duran&quot; and &quot;Sugar Ray.&quot; The two takes named for Roberto\nDuran are funk grooves that you can almost dance to. Miles\nthought that he might have had a hit record had it been\nreleased at the time. Billy Cobham is in the drummer's seat and\nhe stays in the pocket. McLaughlin overdubs lead guitar on the\nfirst take that Miles obviously likes, saying at the end, &quot;That's\nsome raunchy shit, John.&quot; The second version was released on\nthe Directions album in 1981, adding Wayne Shorter and\nBennie Maupin on horns. It's the same groove, but with more\nintensity and drive than the first version. McLaughlin and\nCobham play off of each other as if they were already\ntelepathically linked: a sign of things to come.\n\nIt doesn't matter whether the &quot;Sugar Ray&quot; track is named for\n&quot;Robinson&quot; or &quot;Leonard&quot; because the tune is lame and totally\nforgettable.\n\nPERSONNEL\n\nMiles Davis - Trumpet; John McLaughlin, Sonny Sharrock -\nGuitar; Michael Henderson, Dave Holland, Ron Carter, Gene\nPerla - Bass; Billy Cobham, Jack DeJohnette - Drums; Chick\nCorea, Keith Jarrett, Herbie Hancock - Keyboards; Steve\nGrossman, Wayne Shorter - Saxophone; Bennie Maupin - Bass\nClarinet; Airto- Percussion; Hermeto Pascoal - Vocals\n\n\n\n   1. (13:09) - Go Ahead John (part 1)\n   2. (07:02) - Go Ahead John (part two A)\n   3. (10:07) - Go Ahead John (part two B)\n   4. (03:40) - Go Ahead John (part two C)\n   5. (11:06) - Go Ahead John (part one remake)\n   6. (05:39) - Duran (take 4)\n   7. (11:22) - Duran (take 6)\n   8. (06:16) - Sugar Ray\n\n\nPlaying Time.........: 01:08:20\nTotal Size...........: 419.85 MB\n\n\nAll tracks accurately ripped\n\nNo errors occurred\n\nEnd of status report\n &lt;a href=&quot;\nhttp://www.discogs.com/Miles-Davis-The-Complete-Jack-Johnson-Sessions/release/490807&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/Miles-Davis-The-Complete-Jack-Johnson-Sessions/release/490807&lt;/a&gt;\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:1850d83b90accb576786e8a041957aab1eaf5359","amp;dn":"Miles+Davis-Jack+Johnson+Sessions+D2%7E5-2003+%5BEAC+-+FLAC%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1850d83b90accb576786e8a041957aab1eaf5359","infoHashBuffer":{"type":"Buffer","data":[24,80,216,59,144,172,203,87,103,134,232,160,65,149,122,171,30,175,83,89]},"announce":[],"urlList":[]}}