{"title":"Antiques.Roadshow.S37E20.Lowther.Castle.2.mp4","uid":11856306,"size":650558025,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:189a73372fac64529d8c4332808b62811cb9ae03&amp;dn=Antiques.Roadshow.S37E20.Lowther.Castle.2.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xela_5","files":1,"time":1430162875,"description":"Antiques Roadshow UK - S37E20 - Broadcast Sunday 26 April.\n\n\nI create these using a programme called &quot;get-iplayer&quot; so the files are quite large.\n\n\nThe Antiques Roadshow makes a return visit to Lowther Castle in Cumbria where they discover an army of Action Man figures, a giant skeleton clock and rarely seen watercolours by Beatrix Potter.\n\nHilary Kay admires a huge collection of Action Man figures while the owner of a working child-sized car from the 1930s reveals that its missing seats were washed away in the Cockermouth flood of 2009.\n\nClocks and watches specialist Ben Wright reveals the secrets of a spectacular skeletonised pendulum wall clock from the 1870s, and the owner of a diamond and ruby ring is told it might contain a Burmese gem worth hundreds of thousands of pounds - or a synthetic imitation. \n\nFiona Bruce delves into the colourful history of Lowther Castle, meeting Hugh, the 8th Earl of Lonsdale, who was once was a long-distance lorry driver. \n\nThe team also receive a fascinating insight into a little-known side of author Beatrix Potter when they examine a series of her detailed, scientific watercolour pictures of woodland plants and animals - and learn about her controversial work on the sex life of fungi","torrent":{"xt":"urn:btih:189a73372fac64529d8c4332808b62811cb9ae03","amp;dn":"Antiques.Roadshow.S37E20.Lowther.Castle.2.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"189a73372fac64529d8c4332808b62811cb9ae03","infoHashBuffer":{"type":"Buffer","data":[24,154,115,55,47,172,100,82,157,140,67,50,128,139,98,129,28,185,174,3]},"announce":[],"urlList":[]}}