{"title":"Gwen Stefani - Cool  (2nafish)","uid":5337005,"size":136912900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:18e7b9d228f08e54d81786019e89c92cc499f94b&amp;dn=Gwen+Stefani+-+Cool++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265353707,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Cool&quot; is a pop rock song written by Gwen Stefani and Dallas Austin for Stefani's debut solo album, Love. Angel. Music. Baby. (2004). The song's musical style and production were heavily inspired by pop and New Wave music from the 1980s, and its lyrics chronicle a relationship in which two lovers have separated, but remain &quot;cool&quot; with each other as good friends. &quot;Cool&quot; received praise from pop music critics, and the media have drawn parallels between the song's lyrical content and the romantic relationship that Stefani had with Tony Kanal, a fellow group member of No Doubt.\n\nThe song was released as the album's fourth single in mid-2005 and entered the top twenty of the majority of the charts it appeared on. Although &quot;Cool&quot; failed to match the success of its predecessor &quot;Hollaback Girl&quot;, it reached number one in Canada.\n\nThe song's music video was directed by Sophie Muller and filmed in Lake Como, Italy. The video follows the song's theme very closely and depicts the relationship that Stefani has with a former boyfriend, who is played by Spanish actor Daniel GonzÃƒÂ¡lez. GonzÃƒÂ¡lez and his new girlfriend (played by Tony Kanal's girlfriend, Erin Lokitz) are shown walking to a house. Stefani answers the door, and the three of them are seen in each other's company, with intercut scenes of Stefani rolling around on a bed. There are brief flashbacks to the time when Stefani and her former boyfriend were dating, where she wears a brunette wig, representing her younger self (her natural brown hair has not been seen since she was in ninth grade). Flashbacks and modern day are linked with match cut cinematography. The lyrical theme of &quot;Cool&quot; is maintained in the video, frames are incorporated to portray Stefani feeling &quot;cool&quot;. She is depicted as &quot;cool&quot; with her former boyfriend and his girlfriend throughout most of the video.\n\nThe video showcases the scenery of Como's forests, lakes and restaurants and was the first from Love. Angel. Music. Baby. not to include Stefani's Harajuku Girls, who were present throughout the majority of the album's promotion. The complete version of &quot;Cool&quot; featured in the music video was released commercially on CD single and digital download formats and introduced an orchestral arrangement that differs from the original 1980s composition on Love. Angel. Music. Baby.\n\n&quot;Cool&quot; premiered on MTV's top ten chart program Total Request Live on June 30, 2005, where it reached number three. On VH1's Top 20 Video Countdown, the video peaked at number two. After its July 8 debut on MuchMusic's Countdown, it reached number one for the week of October 7. &quot;Cool&quot; debuted and peaked at number nine on LAUNCHcast's top one hundred most-watched videos for the week of July 23.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:18e7b9d228f08e54d81786019e89c92cc499f94b","amp;dn":"Gwen+Stefani+-+Cool++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e7b9d228f08e54d81786019e89c92cc499f94b","infoHashBuffer":{"type":"Buffer","data":[24,231,185,210,40,240,142,84,216,23,134,1,158,137,201,44,196,153,249,75]},"announce":[],"urlList":[]}}