{"title":"Naturally Good Magazine - Issue 1","uid":4789678,"size":4491496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:198252b5edf2755aacb1cbee5150573d6ce08632&amp;dn=Naturally+Good+Magazine+-+Issue+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1237668251,"description":"Naturally Good Magazine is a revolutionary new magazine which covers health-related topics, ranging from pharmaceutical-induced school shootings to the treatments for strep throat.  We cover the articles that other health magazines are afraid to, out of fear of the F.D.A..  We routinely exercise our right to freedom of the press, as guaranteed to us by the United States Constitution.  We do not use anonymous sources, and we stake our names and reputations to our words, and never hesitate to sign our names.  We offer old-fashioned investigative journalism that was lost amid a new trend of misinformation, pandering to corporate agendas, and deceit.  All of our pages include well-researched material, because our credibility, and your trust are important to us. \n\nWe teach our readers about good nutrition, maintaining their own health, preventing and curing disease, detoxing, and cooking naturally; all with God's medicines.  We place your health above big industries, money, and even the government.  We guarantee that we will always be completely honest, because we have nothing to gain from lying to you.  We are a different kind of publication, and a rarity in the printed media.  Most retailers refuse to carry Naturally Good Magazine, because it is not merely an advertisement delivery system, but it covers real content that can save lives.  It threatens an entire industry which keeps people sick for profit.\n\nThe Naturally Good Magazine Staff have released this to the public for free.","torrent":{"xt":"urn:btih:198252b5edf2755aacb1cbee5150573d6ce08632","amp;dn":"Naturally+Good+Magazine+-+Issue+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"198252b5edf2755aacb1cbee5150573d6ce08632","infoHashBuffer":{"type":"Buffer","data":[25,130,82,181,237,242,117,90,172,177,203,238,81,80,87,61,108,224,134,50]},"announce":[],"urlList":[]}}