{"title":"Chefren's Pyramid 3.0","uid":3410866,"size":273250304,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1aa1478031100ff2c2e2061b6fa1824d332c4994&amp;dn=Chefren%5C%27s+Pyramid+3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":1,"time":1132325256,"description":"This is Chefren's Pyramid 3.0. If you have any questions about this game, you can ask me. I would seed so much I can, but I don&amp;acute;t have so fast upload speed.\nThis is what you gonna do:\n1st: Burn or extract the .iso.\n2st: Install.\n3st Run and Enyoy.\nAnd here are the official read me file:\n\nCHEFREN'S PYRAMID\n\nYOUR MISSION\nSolve the tasks and you will climb up!\nAt the bottom of the pyramid there is an\nexit - look at the map!\nYou must escape before the time runs out!\n\nYou can save your position in the pyramid and then\ngo on from there next time you run the program.\nYou have to hurry - when your time has run out something\nTERRIBLE will happen!\n\n\nTHE EXERCISES\nIf you don't succeed with one task you must find out \nhow to do it. Take it easy - make sure you understand -\nit is then, and only then, you will find out that mathematics \nis great fun. Ask someone, borrow a maths book for\nmiddle secondary school or higher secondary school.\nDon't give up! You can do it!\n\n\nTHE BUTTONS\nSHOW THE BUTTONS PANEL\nClick on the Chefren's face or press alt+Z (zoom in!).\n\nHELP (F1)\nWhen in a room you can get advice about how to think to \nsolve the problems. In the Help square there are also some \nmaths formulae and rules that you will need in that room. \nRead slowly - think!\n\nRULES (F2)\nBefore you enter a new room the rules for \nthat room will be shown. Click on Rules if you \nwant to read them again.\n\nTHE ROPE LADDER (F3)\nAt the beginning you brought a rope ladder with\nyou into the pyramid. If you get stuck you may use\nthe ladder to climb passed a room.\nDon't understand how to use it?\nTest it - try it out - You're heading up!\nIn some of the rooms you can win new ladders. \nThese may be useful further up the pyramid where\nthe tasks get more difficult.\n\nTHE MAP (F4)\nThe map shows your position in the pyramid. It also tells \nyou a little about what will happen in the coming rooms.\nThe big X shows your position.\n\nPRINT (F5)\nPrint the current screen.\n\nSOUND (F6)\nIf you don't want to hear the sound effects and music \n- turn them off!\n\nBIGMODE (F7)\nTo maximize the screen.\n\nSAVE (F8)\nYou can save your position in the pyramid. Next time you\nrun Chefren you can start from the room you have saved.\nWrite your name and your code, e.g. name:  ANNA   code: AH\t\nYour room number, your time and the number of rope ladders \nyou have earned will be saved as a data file called \nANNA.DAT. It is not possible for someone else to read \nyour code. Don't forget it!\n\nGET (F9)\nIf you have saved your room number earlier on it is possible \nto get back to it. Do just the same as when you saved your \nroom number, write your name and your code.\nIf you have forgotten your code you will have to start \nfrom the beginning again!\n\nCHANGE (F10) \nYou can change room, but it is only possible to change \nto a room which you passed earlier, i.e. a room with \na lower room number.\n\nINFO (F11)\nThe text you are reading right now!\n\nBUTTONS (F12)\nShow/hide the buttons.\n\nEXIT (Esc)\nWhen you want to finish working on your computer \nand go out into the real world!\n\n\nSCREEN PROBLEMS\nIf the screen flickers or the colours look strange - \nadjust your PC to more colours, e.g. 32,000!\n\nIf in Windows you use more than 800x600 pixels, \nyou must install small fonts:\nWin 3.1 - see Installation/Alternatives screen\nWin95   - see Unit ...../fonts \n\n\nMOVIE PROBLEMS\nIf you use Windows 3.1 or 3.11 you must install\nthe avi-player from Microsoft.. \nRun setup.exe! You will find it in the avi directory \non the CD.\n\n\nTHE NETWORK LICENCE\nA school with a network licence has the right to run \nthe program on a network. The whole program can be \ndownloaded to the server's hard disk. \nThe program needs approx. 160 MB of hard disk space. \n\nA school with no network can load the program onto \nindividual PCs. If you are short of space you can erase\nall the video clips except 'camels.avi', which reduces \nthe space needed to approx. 100 MB.\n\n\nWITH AN EDUCATION LICENCE YOU CAN ADJUST THE PROGRAM\nIN CHEFREN MANAGER\n* The time allowed can be adjusted from 1 up to 9 hours.\n\n* If you can't hear any sound or music, even though you \n  selected these alternatives, the sound and music are \n  turned off. To turn them on again re-run \n  CHEFRENMANAGER.EXE.\n\n* Some schools only want their students to be able to save\n  their files on diskette and not on the hard disk.\n\n* You can study and print statics of all pupils.\n\n...\n\n\nFURTHER CHALLENGES\nDid you manage Chefren's pyramid?\nTry Cheops' pyramid!\nIn Cheops' the mathematics is a bit harder - from 7th \nyear of secondary school to the final year of upper school.\n\nLate 2001 we will release: \n&quot;The Flying Carpet&quot; for ages 7-11.\n\n\nINTERNET\nVisit our Web site: www.alega.se\nMore programs, demos, tricky things, etc.\n\n\nFINALLY\nThe Chefren will be upgraded! We are striving to\nmake it as exciting, rewarding and informative as possible!\nPlease let me know if you have any ideas or wishes\nconcerning the program!\n\nG&amp;ouml;ran Hjalmarsson, Alega Skolmateriel AB, Sweden 2001\n\nSorry for my English, but I&amp;acute;m only a 13 years old guy from Sweden.","torrent":{"xt":"urn:btih:1aa1478031100ff2c2e2061b6fa1824d332c4994","amp;dn":"Chefren%5C%27s+Pyramid+3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa1478031100ff2c2e2061b6fa1824d332c4994","infoHashBuffer":{"type":"Buffer","data":[26,161,71,128,49,16,15,242,194,226,6,27,111,161,130,77,51,44,73,148]},"announce":[],"urlList":[]}}