{"title":"Malwarebytes Anti-Malware Premium 2.0.2.1012 With Patch by GHOST","uid":10380460,"size":17361408,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1aa45d958c3187a1d5bdb8d1e8a64107f968f584&amp;dn=Malwarebytes+Anti-Malware+Premium+2.0.2.1012+With+Patch+by+GHOST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"---GHOST---","files":4,"time":1403064327,"description":"Malwarebytes Anti-Malware Premium 2.0.2.1012 With Patch by GHOST\n\n Whether you know it or not, your computer is always at risk of becoming infected with\nviruses, worms, Trojans, rootkits, dialers, spyware, and malware of every kind.\nMalicious software is constantly evolving and becoming harder to detect and remove.\nOnly the most sophisticated anti-malware technologies can detect and remove malicious\nprograms from your computer. Malwarebytes Anti-Malware combines powerful new technologies\ndesigned to seek out, destroy, and prevent malware infections.\n\n Malwarebytes Anti-Malware is an easy-to-use anti-malware application available in both a\nFree and PRO version. With over 100 million downloads, the Free version is well-known\nfor its detection and removal capabilities, and the PRO version uses advanced protection\ntechnologies to proactively stop malware infections. Additionally, Malwarebytes offers\na host of extra utilities as well as an approachable forum community to help you combat\nany piece of malware that exists in the wild.\n\n Find out why IT experts, businesses and technical support centers all over the world\nemploy Malwarebytes in their arsenal when fixing and defending their machines.\n\nHomepage: https://malwarebytes.org/","torrent":{"xt":"urn:btih:1aa45d958c3187a1d5bdb8d1e8a64107f968f584","amp;dn":"Malwarebytes+Anti-Malware+Premium+2.0.2.1012+With+Patch+by+GHOST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa45d958c3187a1d5bdb8d1e8a64107f968f584","infoHashBuffer":{"type":"Buffer","data":[26,164,93,149,140,49,135,161,213,189,184,209,232,166,65,7,249,104,245,132]},"announce":[],"urlList":[]}}