{"title":"Bar-Kays - Soul Finger (1967) [FLAC]","uid":8152241,"size":186417293,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1aaf91d6df3fe19c3ea4784ff7437c614a7272f6&amp;dn=Bar-Kays+-+Soul+Finger+%281967%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1361071814,"description":"CD: Bar-Kays - Soul Finger\n\n01. Soul Finger    [0:02:22.58]\n02. Knucklehead    [0:02:22.50]\n03. With A Child's Heart    [0:03:00.27]\n04. Bar-Kay's Boogaloo    [0:02:18.28]\n05. Theme From Hell's Angels    [0:02:49.25]\n06. You Can't Sit Down    [0:03:09.30]\n07. House Shoes    [0:02:49.12]\n08. Pearl High    [0:02:38.33]\n09. I Want Someone    [0:03:12.65]\n10. Hole In The Wall    [0:02:35.00]\n11. Don't Do That    [0:02:51.65]\n\nReview by Lindsay Planer, AMG\n\nThe Bar-Kays were an aggregate born of the same inspiration behind Booker T. &amp; the MG's -- performing the double-duty of being a backing combo for the significant canon of vocalists on the Memphis-based Stax and Volt labels, as well as a self-contained unit. The original lineup of James Alexander (bass), Jimmy King (guitar), Ronnie Caldwell (organ), Phalon Jones (sax), Carl Cunningham (drums), and Ben Cauley (trumpet) were only together long enough to have issued this album prior to the tragic loss of everyone sans Alexander and Cauley in the December '67 plane crash that also claimed the life of Otis Redding. Soul Finger (1967) commences with the title track, which quickly became a Top 20 crossover pop hit in addition to one of the band's best-known works, not to mention a certifiable 'feel good' party anthem. The remainder of the platter follows suit offering up ten further instrumentals that stay true to the precedent that had guided Booker T. &amp; the MG's , blending fun upbeat numbers with the occasional slower-tempo side complementing the otherwise teen-oriented and definitely danceable selections. Here, the cover of the Mad Lads' &quot;I Want Someone&quot; -- co-written by Stax co-founder Estelle Axton aptly fits the bill, with Caldwell providing a lovely and affective lead over the languid, melodic ballad. &quot;Theme From Hells Angels&quot; is interesting as there is no designation given to either the song's author or precisely what Hells Angels refers to. A movie? The infamous biker club? The staccato rhythm recalls Maurice Ravel's &quot;Bolero,&quot; while King's distinctly distorted fretwork helps to further the composition's undeniably dramatic quality. Another highlight is the &quot;Bar-Kays Boogaloo,&quot; while definitely a product of its time, it exemplifies the unit's cohesion as purveyors of the unmistakably swinging Stax/Volt sound.\n","torrent":{"xt":"urn:btih:1aaf91d6df3fe19c3ea4784ff7437c614a7272f6","amp;dn":"Bar-Kays+-+Soul+Finger+%281967%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aaf91d6df3fe19c3ea4784ff7437c614a7272f6","infoHashBuffer":{"type":"Buffer","data":[26,175,145,214,223,63,225,156,62,164,120,79,247,67,124,97,74,114,114,246]},"announce":[],"urlList":[]}}