{"title":"The Iguanas - Jumpin' With","uid":5138347,"size":85339294,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b7843ae6ba623a488e2857c9cb05922d6c3d3f0&amp;dn=The+Iguanas+-+Jumpin%5C%27+With&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pirate_Leoneed","files":-1,"time":1256681494,"description":"The Iguanas earned their place in rock and roll history as the launching pad for a teenaged drummer named Jim Osterberg, better known today as the influential punk pioneer Iggy Pop. Formed in Ann Arbor, MI in 1963, the Iguanas originally comprised Osterberg and guitarist Jim McLaughlin, who together made their public debut at a junior high school talent show; upon entering high school that fall, they recruited saxophonist Sam Swisher, soon after landing their first paid gig at a local school dance. The trio then recorded an instrumental demo at McLaughlin's father's home studio before swelling to a five-piece with the additions of guitarist Nick Kolokithas and bassist Don Swickerath. By 1964 they were a major attraction on the Ann Arbor rock scene, regularly playing local dances, teen clubs and frat parties; a second demo session followed later that year. In the spring of 1965, the Iguanas entered Detroit's United Sound Recording Studio to cut three more tracks, among them a cover of Bo Diddley's &quot;Mona&quot; (issued as a single on the group's own Forte label) and &quot;Again and Again&quot; (the first-ever Osterberg original). That summer they were tapped as the house band at the Club Ponytail, a nightspot located in the Harbor Springs resort area; there the Iguanas opened for acts including the Four Tops, the Shangri-Las and the Kingsmen, frequently backing the headliners onstage as well. Osterberg exited the line-up in 1966 to join the Prime Movers; the remaining Iguanas hired a new drummer and played club dates in Boston and New York, but when a deal with Columbia Records failed to materialize the band dissolved in 1967. Decades later, McLauglin, Kolokithas and Swickerath announced their intentions to revive the group in the wake of the 1996 release of the retrospective Jumpin' with the Iguanas.\n\nIGGY POP ON DRUMS...WUA... A WONDERFUL ALBUM........\n\n-----------------------------------------------------------------------------------\n\nUPLOADED BY Leoneed Record's (c) 2000-2009","torrent":{"xt":"urn:btih:1b7843ae6ba623a488e2857c9cb05922d6c3d3f0","amp;dn":"The+Iguanas+-+Jumpin%5C%27+With","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b7843ae6ba623a488e2857c9cb05922d6c3d3f0","infoHashBuffer":{"type":"Buffer","data":[27,120,67,174,107,166,35,164,136,226,133,124,156,176,89,34,214,195,211,240]},"announce":[],"urlList":[]}}