{"title":"Stephen Houston - The Memory of Bones. Body, Being, and Experien","uid":10502062,"size":22564221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b86a1e3312554b43c4e91c91d5e6252eb9ee849&amp;dn=Stephen+Houston+-+The+Memory+of+Bones.+Body%2C+Being%2C+and+Experien&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1404717213,"description":"Description\nProduct Details\nBook Title: The Memory of Bones: Body, Being, and Experience among the Classic Maya (Joe R. and Teresa Lozano Long Series in Latin American and Latino Art and Culture)\t\nBook Author: Stephen Houston (Author), David Stuart (Author), Karl Taube (Author)\nSeries: Joe R. and Teresa Lozano Long Series in Latin American and Latino Art and Culture\nHardcover: 334 pages\nPublisher: University of Texas Press; First Edition edition (June 1, 2006)\nLanguage: English\nISBN-10: 0292712944\nISBN-13: 978-0292712942\n\n===================================================================================\nBook Description\nPublication Date: June 1, 2006\nAll of human experience flows from bodies that feel, express emotion, and think about what such experiences mean. But is it possible for us, embodied as we are in a particular time and place, to know how people of long ago thought about the body and its experiences? In this groundbreaking book, three leading experts on the Classic Maya (ca. AD 250 to 850) marshal a vast array of evidence from Maya iconography and hieroglyphic writing, as well as archaeological findings, to argue that the Classic Maya developed a coherent approach to the human body that we can recover and understand today.\nThe authors open with a cartography of the Maya body, its parts and their meanings, as depicted in imagery and texts. They go on to explore such issues as how the body was replicated in portraiture; how it experienced the world through ingestion, the senses, and the emotions; how the body experienced war and sacrifice and the pain and sexuality that were intimately bound up in these domains; how words, often heaven-sent, could be embodied; and how bodies could be blurred through spirit possession.\nFrom these investigations, the authors convincingly demonstrate that the Maya conceptualized the body in varying roles, as a metaphor of time, as a gendered, sexualized being, in distinct stages of life, as an instrument of honor and dishonor, as a vehicle for communication and consumption, as an exemplification of beauty and ugliness, and as a dancer and song-maker. Their findings open a new avenue for empathetically understanding the ancient Maya as living human beings who experienced the world as we do, through the body.\n\n===================================================================================\nAbout the Author\nStephen Houston is Professor of Anthropology at Brown University.\nDavid Stuart is the Linda and David Schele Professor of Mesoamerican Art and Writing at the University of Texas at Austin.\nKarl Taube is Professor of Anthropology at the University of California, Riverside.\n===================================================================================","torrent":{"xt":"urn:btih:1b86a1e3312554b43c4e91c91d5e6252eb9ee849","amp;dn":"Stephen+Houston+-+The+Memory+of+Bones.+Body%2C+Being%2C+and+Experien","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b86a1e3312554b43c4e91c91d5e6252eb9ee849","infoHashBuffer":{"type":"Buffer","data":[27,134,161,227,49,37,84,180,60,78,145,201,29,94,98,82,235,158,232,73]},"announce":[],"urlList":[]}}