{"title":"Journey Inside The Mind of an Islamic Terrorist- M. Gabriel","uid":12798644,"size":5641357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d1a77b8bae4124274d167673917633a66c384a0&amp;dn=Journey+Inside+The+Mind+of+an+Islamic+Terrorist-+M.+Gabriel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"onh4","files":4,"time":1448016941,"description":"Journey Inside The Mind of an Islamic Terrorist : Why They Hate Us and How We Can Change Their Minds - M Gabriel\r\n\r\nepub/mobi\r\nProduct Details\r\nPaperback: 224 pages\r\nPublisher: Frontline; First Edition edition (December 13, 2005)\r\nLanguage: English\r\nISBN-10: 1591857139\r\nISBN-13: 978-1591857136\r\n\r\nHow can you know what a terrorist thinks?\r\n\r\nThe Western media are so busy analyzing who, what, where, when and how that they never answer the question of why. This book is about the why behind Islamic terrorism.\r\n\r\nTerrorists have written many books and pamphlets explaining their position, but most westerners are unable to understand them. Dr. Mark Gabriel makes a major breakthrough by identifying the five pillars of radical philosophy- the bedrock beliefs that cut through all radical writings. Dr. Gabriel uses the writings of Osama bin Laden, Ayman al-Zawahiri, and others to show how terrorists justify their actions through the Quran, the life of Muhammad and Islamic history. Finally, Dr. Gabriel describes how earlier terrorist groups were stopped and shows how the world can work together to stop the terrorists of today.\r\n\r\nIgnorance is no ally in the struggle against Islamic terrorism.\r\n\r\nGo beyond what is happening and find out why it is happening. The struggle against terrorism may seem to be at a stalemate, but there is hope for the future.\r\n\r\nAnother fine book by a former professor of Islamic history at Al-Azhar University in Cairo, Egypt. This Egyptian author of Muslim background had memorized the Muslim's holy book: the Koran/Quran in Arabic by the time he was 12. He has had to change his birth name due the fact of receiving death threats and to protect his family who still live in Egypt.\r\n\r\nPlease seed. Thanks","torrent":{"xt":"urn:btih:1d1a77b8bae4124274d167673917633a66c384a0","amp;dn":"Journey+Inside+The+Mind+of+an+Islamic+Terrorist-+M.+Gabriel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d1a77b8bae4124274d167673917633a66c384a0","infoHashBuffer":{"type":"Buffer","data":[29,26,119,184,186,228,18,66,116,209,103,103,57,23,99,58,102,195,132,160]},"announce":[],"urlList":[]}}