{"title":"Expand Social Security Now! (2016).epub Gooner","uid":15054258,"size":598378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d999cbfd4dad163f48c0b911f1a3b8d34e58d58&amp;dn=Expand+Social+Security+Now%21+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466689343,"description":"Expand Social Security Now! - How to Ensure Americans Get the Retirement They Deserve (2016).epub Gooner\r\n\r\nPublisher: Beacon Press (20 May 2016)\r\nLanguage: English\r\nISBN-10: 0807028436\r\nISBN-13: 978-0807028438\r\n\r\nWhy Social Security is not only sustainable but should be substantially expanded\r\n\r\nSocial Security is bankrupting us. It s outdated. It s a Ponzi scheme. It s stealing from young people. These are some of the biggest lies about one of the most popular and successful programs in our nation s history.\r\n\r\nThree-quarters of Americans depend heavily on Social Security in their elderly years and nearly half would be poor without it. The program lifts 14 million elderly Americans out of poverty. For 65 percent of beneficiaries, it s the majority of their cash income, and for more than 36 percent, it provides about 90 percent of their income. It s one of the few fully funded government programs that serve as essential insurance for keeping us out of poverty in our older years. But as important and popular as it is, Social Security is constantly on the political chopping block. A well-financed campaign backed mostly by conservatives has told Americans for decades that Social Security is going bankrupt when, in fact, it s projected that the program can pay all benefits out of its own tax revenue through at least 2033 (and then 75 percent thereafter).\r\n\r\nTimely, informative, and written by a recognized expert, this book accessibly pulls together reasons why Social Security is under attack and should be defended","torrent":{"xt":"urn:btih:1d999cbfd4dad163f48c0b911f1a3b8d34e58d58","amp;dn":"Expand+Social+Security+Now%21+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d999cbfd4dad163f48c0b911f1a3b8d34e58d58","infoHashBuffer":{"type":"Buffer","data":[29,153,156,191,212,218,209,99,244,140,11,145,31,26,59,141,52,229,141,88]},"announce":[],"urlList":[]}}