{"title":"World Atlas of UFOs - John Spencer PDF","uid":10081964,"size":15310738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1db0adbcc43ca53367a2ba0a4b787f6c419caa96&amp;dn=World+Atlas+of+UFOs+-+John+Spencer+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr.docs","files":-1,"time":1399026576,"description":"A s the International Director of the Mutual UFO Network\n(MUFON), the world's largest and most geographically\nwidespread independent UFO research organization, I am\naware, perhaps more than most, that the UFO phenomenon\nis a truly global one. Unidentified Flying Objects are\nexperienced by people all over the world and the World Atlas of\nUFO's shows this continent by continent.\nThe World Atlas of UFO's also highlights areas of large\ncountries - remote or less technological countries - where\nUFO's are rarely reported. It becomes apparent that UFO\nreporting is confined to those areas that have UFO investigators\nto whom these events can be reported. Those of us involved in\nthe study of this phenomenon are convinced that if there were\nmore people to whom sightings could be reported, then more\ncases deserving of serious study would reach UFO researchers.\nDuring my twenty years at MUFON I have determined at\nleast two important things: first, that the UFO subject is serious\nand deserves to be treated with greater respect by scientists,\nworld governments and the public than it presently is; second,\nthat this subject is bringing people together across the world, and\nin a way that brings out their best talents. Thousands of people\nare donating hundreds of hours per year without fmancial\ncompensation to helping those who do not seem to understand\ntheir own experiences or who may be unwilling victims of\ntraumatic experiences.\nThe annual MUFON International UFO Symposium attracts\nhundreds of people from all over the world who come together in\na spirit of joint endeavourÂ· that breaks down international\nboundaries. Both the Mutual UFO Network (MUFON) and the\nBritish UFO Research Association (BUFORA) are organizations\nto which the author and many of the contributors belong. They\nhave a stated objective to educate the public in a responsible and\nauthoritative manner, to encourage other groups and organizations\naround the world to share their work, and to proceed\ntowards a solution to this intriguing and mysterious subject. This\nbook is part of that process.","torrent":{"xt":"urn:btih:1db0adbcc43ca53367a2ba0a4b787f6c419caa96","amp;dn":"World+Atlas+of+UFOs+-+John+Spencer+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db0adbcc43ca53367a2ba0a4b787f6c419caa96","infoHashBuffer":{"type":"Buffer","data":[29,176,173,188,196,60,165,51,103,162,186,10,75,120,127,108,65,156,170,150]},"announce":[],"urlList":[]}}