{"title":"The Mentalist S1 E11 (2008)nl.subs.NLT-Release (DivX)","uid":4685999,"size":435105870,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ddb9d67f4d86eefab1413aba8e239600fea97a9&amp;dn=The+Mentalist+S1+E11+%282008%29nl.subs.NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1233234848,"description":"De nieuwe Amerikaanse hitserie The Mentalist is vanaf 1 januari wekelijks te zien op SBS 6. Deze crimeserie vertelt het verhaal van Patrick Jane: een zeer bekende, voormalig televisieparagnost die, nadat hij ontmaskert is als fraudeur, nu zijn echte vaardigheden als mentalist gebruikt om het Californie Bureau of Investigation te helpen met het oplossen van misdrijven. Als mentalist, gebruikt Patrick Jane zijn zeer ontwikkelde kundigheden: observeren, afleiden en manipuleren, om het Serious Crime Team te ondersteunen. Hij is charismatisch, een beetje vreemd - en stuurs, en zijn moderne Sherlock Holmes achtige, opzienbarende methodes overschrijden vaak een grens, maar deze methodes geven hem uiteindelijk vaak gelijk.\n\nSeason 1: Episode 11: Red John's Friends\n\nAn inmate, serving twenty-five to life for murdering his family housekeeper,s daughter, contacts Jane about having information on Red John that he ll reveal if Jane will prove his innocence. Minelli disproves of reopening the case, but Jane needs to find out the truth so he quits CBI, and the rest of the team takes a weeks suspension to help him. After delving into the Renfrew family affairs, Jane makes a disturbing discovery that Jareds mother committed the murder and framed Jared, after learning he was in love with the housekeepers daughter and that the girl was her husbands child from an affair. Following the mothers confession, Jared is released, but slips from sight before revealing anything about Red John. When CBI hunts him down in Mexico, they find Red John has gotten to him first, leaving behind only some cryptic words to the information he had.    \n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\nEnjoy The Movie!!!!!","torrent":{"xt":"urn:btih:1ddb9d67f4d86eefab1413aba8e239600fea97a9","amp;dn":"The+Mentalist+S1+E11+%282008%29nl.subs.NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ddb9d67f4d86eefab1413aba8e239600fea97a9","infoHashBuffer":{"type":"Buffer","data":[29,219,157,103,244,216,110,239,171,20,19,171,168,226,57,96,15,234,151,169]},"announce":[],"urlList":[]}}