{"title":"Father Daughter Seductions XXX (NEW) DVDRip x264","uid":13205931,"size":2503860637,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:1f7dd201d8261e7baab79a252a6f1d71e63d6563&amp;dn=Father+Daughter+Seductions+XXX+%28NEW%29+DVDRip+x264&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImgSnaps","files":2,"time":1452593944,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/M2\r\n \nhttp://imgsnaps.com/image/MO\r\n\r\nCategory: Incest, Family Roleplay, Older Men, Teens\r\n\r\nCast: Camille Black, Amor Hilton, Brittany Shae, Lola Vaughn\r\n\r\n\r\n.:Description:.\r\nSure, some dads fuck their daughter's friends, but your're not supposed to fuck them with your daughter! Britney Shae I was pretty sick so Daddy started interviewing babysitters to take care of me. This sexy, young girl named Brittany came for an interview. Imagine her surprise when she found out I was already a mature, sexy girl. She was even more shocked when Daddy put his cock in my mouth to give me my &quot;medicine.&quot; I could tell Brittany was really turned on so I asked her to give me a bath. I could tell by the way she undressed me that she was eager to take care of me... and Daddy. We love our new babysitter! Lola Vaughn While I was at the coffee shop, I noticed this sexy girl. I started talking to her and I invited Lola back to my house. We sat on the couch talking and I noticed Lola checking out my tits so I leaned in and kissed her. We explored each others bodies on the couch for quite awhile before I brought her into daddy's bedroom. When Daddy came home, I called him into the room. Lola and I stripped him and he fucked us both really hard! When he exploded in Lola's pussy he made me clean up the creampie! Amor Hilton After several drinks with Amor, we headed back to my place. At home, I began kissing her. We fell onto the bed and kissed even more, our hands touching each others intimate places. A bit later Daddy came home and thought I was alone so he came into my room. Daddy stripped and crawled into bed rubbing the naked body next to him. He and Amor were both surprised but it all worked out just fine!","torrent":{"xt":"urn:btih:1f7dd201d8261e7baab79a252a6f1d71e63d6563","amp;dn":"Father+Daughter+Seductions+XXX+%28NEW%29+DVDRip+x264","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7dd201d8261e7baab79a252a6f1d71e63d6563","infoHashBuffer":{"type":"Buffer","data":[31,125,210,1,216,38,30,123,170,183,154,37,42,111,29,113,230,61,101,99]},"announce":[],"urlList":[]}}