{"title":"Building Online Stores with osCommerce-Professional Edition, 200","uid":4101297,"size":6979341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f8fce96494230f92a9a25b296aa0f6efb5f14bb&amp;dn=Building+Online+Stores+with+osCommerce-Professional+Edition%2C+200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scotscam","files":1,"time":1206588085,"description":"As featured on Slashdot :\n&quot;... David Mercer&amp;#039;s book is the book you have been looking for and is available in either a beginner&amp;#039;s or professional edition. It is written in a straightforward, easy to understand manner, yet does not compromise on technical knowledge and provides all the essentials of getting your website up and running with OsCommerce&quot;\n\nBuilding Online Stores with osCommerce: Professional Edition will teach you how to use, build and maintain a complex, powerful e-commerce website using osCommerce. As well as everything you need to get started with osCommerce, this book goes onto cover how to:\n\n    * Increase your sales through cross-selling and up-selling\n    * Offer custom discounts and support the use of gift certificates\n    * Incorporate your own RSS feed to enhance the content of the site\n    * Use and control banners to market popular or profitable products within your store\n    * Customize the osCommerce code to make your site more robust, eliminate bugs, and increase flexibility and customer appeal\n    * Understand the security technologies involved in e-commerce and develop your own security and backup strategies\n    * Build your business by utilizing various advertising techniques, search engine optimization, affiliate and drop-shipping schemes\n    * Learn the principles and methods used by professional programmers to empower you to continue creating and building your online business\n\nThese techniques will enable you to build a unique and powerful site, giving you an ideal platform to enter the competitive world of e-commerce.\n\nThrough this complete, comprehensive education in osCommerce you will develop the confidence to experiment with your own enhancements and modifications, leaving you with a truly unique online store. Practical demonstrations and well considered advice will ensure that your store will always be developed to the highest standards.\n\nAs you become serious with osCommerce, this book will show you how to make the most of osCommerce&amp;#039;s open source development process and community. You will see how to use the community as an excellent resource for developing your business strategies and practices, as well as making it easy to continuously enhance your customers&amp;#039; shopping experience.","torrent":{"xt":"urn:btih:1f8fce96494230f92a9a25b296aa0f6efb5f14bb","amp;dn":"Building+Online+Stores+with+osCommerce-Professional+Edition%2C+200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8fce96494230f92a9a25b296aa0f6efb5f14bb","infoHashBuffer":{"type":"Buffer","data":[31,143,206,150,73,66,48,249,42,154,37,178,150,170,15,110,251,95,20,187]},"announce":[],"urlList":[]}}