{"title":"Burnt Ones - Gift (2014) [FLAC]","uid":9847473,"size":243464661,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1ff985c9c55a31453a8581e9f2f1f2cb7f1d8d0b&amp;dn=Burnt+Ones+-+Gift+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1396102309,"description":"\n  Burnt Ones - Gift (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Psychedelic, Noise Pop, Garage\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Pulse\n  02 Money Man\n  03 Submarine\n  04 Bye Bye Floating Charm\n  05 Spell Breakers\n  06 Is it Over\n  07 Airplane Ride\n  08 Caterpillar\n  09 New Heroes of Subscription Services\n  10 Mirror Too,You &amp; Me\n  11 Sleeping Inn\n  12 Pineapple Program No.31\n  13 US Wheels\n  14 Morning Drum\n\n  Since their beginnings as a band of fuzztone-wielding, lo-fi garage stompers with a T. Rex fixation, San Francisco's Burnt Ones haven't changed their core beliefs much, and you can still hear their roots loud and clear on their third album, 2014's Gift. What they have done is some subtle refining and expanding of their sound, delving into more psychedelic territory and boosting the overall level of craft and care put into the arrangements. Not that their sound needed much improvement, since both their 2001 album, Black Teeth and Golden Tongues, and 2013's You'll Never Walk Alone were filled with great songs and some nicely scruffed-up noise pop. This time out they add some new sounds, like the occasional crappy drum machine, rollicking piano, and tape loops; some melodies that are poppier than any they've yet played, and lots of songs that take their template and spin it out into new, very promising areas. &quot;Money Men&quot; plays like the Kinks if they were into dropping acid instead of feeling nostalgia, &quot;Pineapple Program No. 31&quot; has warped loops, clattering drum machines, and the intensity of early Suicide, and &quot;New Heroes of Subscription Services&quot; is a dramatic weld job of Spacemen 3, T. Rex, and the Beatles. While it's nice to hear the band experimenting and making it work so well, what the band do best on this record is write a bunch of excellent garage-noise songs, then play and sing the hell out of them. &quot;Mirror Too/You &amp; Me,&quot; &quot;Submarine,&quot; and &quot;Sleeping Inn&quot; are three fine examples. It's not as easy as it sounds, as witnessed by the scores of bands who have tried it and failed to come up with anything interesting. Burnt Ones have the right sound, the right songs, and the fiery energy to make it work. Gift is another excellent album from a group who deserve way more attention than they get.","torrent":{"xt":"urn:btih:1ff985c9c55a31453a8581e9f2f1f2cb7f1d8d0b","amp;dn":"Burnt+Ones+-+Gift+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff985c9c55a31453a8581e9f2f1f2cb7f1d8d0b","infoHashBuffer":{"type":"Buffer","data":[31,249,133,201,197,90,49,69,58,133,129,233,242,241,242,203,127,29,141,11]},"announce":[],"urlList":[]}}