{"title":"Deliver.Us.From.Evil.LIMITED.DVDRip.","uid":4136109,"size":739055100,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:204723e47b7a67ddf219e692f72345050292b5bc&amp;dn=Deliver.Us.From.Evil.LIMITED.DVDRip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BUBBBAS","files":52,"time":1208276111,"description":"Moving from one parish to another in Northern California during the 1970s, Father Oliver O&amp;#039;Grady quickly won each congregation&amp;#039;s trust and respect. Unbeknownst to them, O&amp;#039;Grady was a dangerously active pedophile that Church hierarchy, aware of his predilection, had harbored for over 30 years, allowing him to abuse countless children. Juxtaposing an extended, deeply unsettling interview with O&amp;#039;Grady himself with the tragic stories of his victims, filmmaker Amy Berg bravely exposes the deep corruption of the Catholic Church and the troubled mind of the man they sheltered.\n\n----------------------------------------------------------------------------------\n\nIn my opinion, this film is a front-runner for the Oscar for Best Documentary for 2006.\n\nIt&amp;#039;s absolutely riveting. If you are a fan of &quot;Silence of the Lambs,&quot; you should see this because Oliver O&amp;#039;Grady is just as chilling as Hannibal Lecter -- more so because he is real. Filmmaker Amy Berg did a news piece on O&amp;#039;Grady, a Catholic priest who raped dozens -- possibly hundreds -- of children in California. On a whim, she called him in his exile in Ireland and got him to agree to an extensive three day interview. It is a confession unlike any other.\n\nOn one level, Deliver Us From Evil is a righteous indictment of the Catholic Church: its inaction, its enabling, its bureaucracy, its male-dominated backwardness.\n\nAt the same time, the film is a profile of some incredibly decent people: Catholic parents and children who were victims in this rampage. Their character is inspiring -- their pain is as raw as anything you will ever see on film.\n\nFinally, it&amp;#039;s the study about the way a psychopath can play every human emotion to his own advantage.\n\nThere is Hell to pay for this man&amp;#039;s sins. And some victims are living that hell \nevery day\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0814075/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0814075/&lt;/a&gt;","torrent":{"xt":"urn:btih:204723e47b7a67ddf219e692f72345050292b5bc","amp;dn":"Deliver.Us.From.Evil.LIMITED.DVDRip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"204723e47b7a67ddf219e692f72345050292b5bc","infoHashBuffer":{"type":"Buffer","data":[32,71,35,228,123,122,103,221,242,25,230,146,247,35,69,5,2,146,181,188]},"announce":[],"urlList":[]}}