{"title":"Encyclopedia of Ancient Asian Civilizations{BBS}","uid":6857392,"size":5377541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2121015664a06db6a125bd119163c589df0c5aa2&amp;dn=Encyclopedia+of+Ancient+Asian+Civilizations%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322749066,"description":"Beginning with an informative introduction that gives an overview of the major stands of Asian civilization from 5,000 B.C.E. to 1,100 C.E., this alphabetically arranged encyclopedia presents clear information on a wide variety of archaeological sites, significant persons, dynasties, and religious and other cultural practices. More than 900 articles cover Central and East Asia, the Southeastern Asian islands, the Indian subcontinent, and Japan and Korea. The entries are written clearly, though without much verve, and include cross-references in small capitals within the body. Entries for people begin with an italicized summary of the person's status and importance. Some articles include see also references at the end, with longer treatments generally terminating with lists of sources (usually two to six) for further reading. Weighting on the entries is appropriate, with shorter treatments for less significant people, places, or concepts (e.g., Chongdi, a Han emperor who ruled briefly) and more in-depth coverage for topics like Buddhism or Harappa (a great city of the Indus Valley Civilization).\n\nMore than 50 well-placed black-and-white photographs enhance the presentation. Five maps at the beginning of the volume show the locations of archaeological sites throughout Asia and the Indian subcontinent. All are in black and white, with the elevations indicated only in grey scale, making them a little harder to read than color maps would be. However, they still serve quite ably in terms of locating sites from the text entries. A three-page chronology and extensive bibliography follow the body of the work, as does an accurate index, with main headings indicated by boldface numbers and illustrations by italics.\n\nA sound companion to Asian History on File (Facts On File, 1995), this is a good beginning point for research, especially in regard to archaeological excavations. Suitable for most public and academic library collections and for those high schools with a focus on world or ancient history. Ann Welton\nCopyright Ã‚Â© American Library Association. All rights reserved\nProduct Details\n\n    * Hardcover: 464 pages\n    * Publisher: Facts on File (April 2004)\n    * Language: English\n    * ISBN-10: 0816046409\n    * ISBN-13: 978-0816046409","torrent":{"xt":"urn:btih:2121015664a06db6a125bd119163c589df0c5aa2","amp;dn":"Encyclopedia+of+Ancient+Asian+Civilizations%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2121015664a06db6a125bd119163c589df0c5aa2","infoHashBuffer":{"type":"Buffer","data":[33,33,1,86,100,160,109,182,161,37,189,17,145,99,197,137,223,12,90,162]},"announce":[],"urlList":[]}}