{"title":"BillP Studios Task Catcher v1.4.0.0 with Key [iahq76]","uid":7780019,"size":396975,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2199ecb5050cf7bc6441db72bc67466178a03c1b&amp;dn=BillP+Studios+Task+Catcher+v1.4.0.0+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1351757660,"description":"Task Catcher\n\nTask Catcher allows you to efficiently monitor programs running on your computer without slowing you down or hogging all your memory. It's so tiny you'll never know Task Catcher is even running. Task Catcher will block unwanted programs from running and restart your favorite programs if they are disabled or crash. As always, our goal is to put YOU back in control of your computer \n\n#1 Feature: Verify your favorite critical programs are running\nThis has always been the primary use of Task Catcher. Our long time users say they have programs that are critical to have running at all times.\n\nTask Catcher will keep an eye on important tasks you always want running on your system. Our feline friend won't allow Spyware to shutdown your protection. \n\nIf you want to know what Task Catcher does, this is it. If your server has been known to crash or you worry malware will shut down your security, the little known Task Catcher provides a solution.\nLet Task Catcher know which programs you depend on and it will make sure that your program is always running. If Task Catcher doesn't see your &quot;Watched&quot; program, it will automatically restart it for you. \n\n\nPrevent Unwanted Programs from running \nSometimes there are programs you never want started on your system. Programs added to your Black List will automatically be shut down when detected by Task Catcher.\nTask Catcher will allow let you create a Black List of programs you want to make sure the kids can never run. \n\nSupported OS:\n\nWindows 7/vista/xp\nSome features are not supported on 64 bit machines\n\nHomepage: http://www.taskcatcher.com/\n\nInstallation Instructions:\n\n1. Install Program.\n2. Use given serial to Register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:2199ecb5050cf7bc6441db72bc67466178a03c1b","amp;dn":"BillP+Studios+Task+Catcher+v1.4.0.0+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2199ecb5050cf7bc6441db72bc67466178a03c1b","infoHashBuffer":{"type":"Buffer","data":[33,153,236,181,5,12,247,188,100,65,219,114,188,103,70,97,120,160,60,27]},"announce":[],"urlList":[]}}