{"title":"Tom Russell...Indians Cowboys Horses Dogs(2004)[FLAC]","uid":5426861,"size":333798983,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21dc96714ae46846f7d1567cbf71ea6a41ce626b&amp;dn=Tom+Russell...Indians+Cowboys+Horses+Dogs%282004%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":14,"time":1268285331,"description":"Americana singer/songwriter Tom Russell was born in Los Angeles in 1950. Raised on the cowboy music of the American West, he grew up to be a talented songwriter, and began issuing albums under his own name in the early '70s. However, Russell's material was also recorded by such luminaries as Johnny Cash, Guy Clark, Dave Alvin, and Doug Sahm, and k.d. lang, to name only a few. While much of Russell's work mined the country tradition, he was also known to flavor his work with Tex-Mex, folk, and the cowboy music of his youth. After an acclaimed career spanning two decades, Russell found another gear with 1999's Man from God Knows Where. A concept album eight years in the making, the LP presented a song cycle inspired not only by America's pioneers, but by Russell's own immigrant ancestors. Borderland, a set inspired by Russell's newfound home in the Juarez border region of Texas, followed in 2001. Modern Art appeared in April 2003 and Hotwalker -- a conceptual work inspired by Russell's encounters with author Charles Bukowski -- followed in 2005. A year later Russell released Love and Fear, an album focusing on what he called &quot;the ragged outback of love.&quot; Wounded Heart of America, a compilation of Russell classics performed by everyone from Johnny Cash and Iris DeMent to Tom himself, arrived in 2007. In 2009, Russell re-emerged on Shout Factory with Blood and Candle Smoke, recorded at Tucson's Wave Audio with owner Craig Schumacher co-producing. Players include songwriter Gretchen Peters on backing and duet vocals, and members of Calexico, among others. ~ Johnny Loftus, All Music Guide\n\nAudio CD (February 24, 2004) \nOriginal Release Date: February 24, 2004 \nNumber of Discs: 1 \nLabel: Hightone Records \nASIN: B0001DMWWK \nTracklist:\n\n1. Tonight We Ride\n2. Seven Curses\n3. El Paso\n4. All This Way For The Short Ride\n5. Bucking Horse Moon\n6. Lily, Rosemary, And The Jack Of Hearts\n7. No Telling\n8. Bacon Rind, Chief Seattle, The Ballad Of Ira Hayes\n9. Old Blue\n10. East Texas Red\n11. The Ballad Of Edward Abbey\n12. Little Blue Horse \n\nTom Russell returns to the Old West with a renewed vision, as this collection of inspired originals and choice covers attests. The album's centerpiece features Eliza Gilkyson and Joe Ely trading verses with Russell on Bob Dylan's epic &quot;Lily, Rosemary and the Jack of Hearts,&quot; while another Dylan tune, the little-heard &quot;Seven Curses,&quot; proves a highlight as well. Russell's reading of &quot;El Paso&quot; refreshes the classic by refusing to mimic Marty Robbins's original, while a pair of Russell's spoken-word vignettes provide preamble to &quot;The Ballad of Ira Hayes.&quot; While the songbooks of Woody Guthrie and Linda Thompson also inspire evocative interpretations, Russell's own songs hold their own in such distinguished company. He applies his literary sensibility to a Western legacy that extends from bounty hunters to rodeo bull riders, while his &quot;Ballad of Edward Abbey,&quot; a tribute to the naturalist, serves as an environmental broadside on how the new West has raped the old\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:21dc96714ae46846f7d1567cbf71ea6a41ce626b","amp;dn":"Tom+Russell...Indians+Cowboys+Horses+Dogs%282004%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21dc96714ae46846f7d1567cbf71ea6a41ce626b","infoHashBuffer":{"type":"Buffer","data":[33,220,150,113,74,228,104,70,247,209,86,124,191,113,234,106,65,206,98,107]},"announce":[],"urlList":[]}}