{"title":"The Fearless Vampire Killers (1967) (US-UK) [Roman Polanski]","uid":3386798,"size":987543379,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21f201d7429aa7239b5cd80409c9686835badd8f&amp;dn=The+Fearless+Vampire+Killers+%281967%29+%28US-UK%29+%5BRoman+Polanski%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"slocombe","files":4,"time":1127448796,"description":"&quot;The Fearless Vampire Killers&quot; (1967), aka &quot;The Fearless Vampire Killers, or Pardon Me but Your Teeth Are in My Neck&quot;\n\nA horror/comedy classic directed by Roman Polanski, featuring Jack MacGowran, Roman Polanski, Alfie Bass, Sharon Tate and Ferdy Mayne.\n\nIMDb plot summary: &quot;The old bat researcher, professor Abronsius and his assistant, Alfred, go to a remote Transylvanian village looking for vampires. Alfred falls in love with the inn-keeper's young daughter Sarah. However, she has been spotted by the mysterious count Krolock who lives in a dark and creepy castle outside the village...&quot;\n\nAmazon review: &quot;One of Roman Polanski's more overt comedies, this 1966 monster spectacle stars Jack MacGowran and Polanski as a clunky but heroic pair of vampire killers. Called upon to rescue the beautiful and buxom daughter (Sharon Tate) of an innkeeper from a Draculalike bloodsucker, the duo muddle through all sorts of scrapes, the most intense being a scene in which a room full of dancing vampires realize the human interlopers are the only ones in the room who are reflected in a mirror. Scary and funny, the film has some unforgettable set pieces, a terrific score, one of the few records of Tate's extraordinary beauty, and vibrant performances. Not exactly Polanski in a relaxed mode, but clear evidence of his estimable skills as a director of both brilliance and polish.&quot;\n\nIncludes the 10-minute promotional featurette &quot;The Fearless Vampire Killers: Vampires 101&quot; (http://us.imdb.com/title/tt0445366/).\n\nRipped from region 2 DVD. 107 minutes, widescreen. XviD, 640x352 (1.82:1), 25fps, 160kbps VBR MP3, mono soundtrack.","torrent":{"xt":"urn:btih:21f201d7429aa7239b5cd80409c9686835badd8f","amp;dn":"The+Fearless+Vampire+Killers+%281967%29+%28US-UK%29+%5BRoman+Polanski%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f201d7429aa7239b5cd80409c9686835badd8f","infoHashBuffer":{"type":"Buffer","data":[33,242,1,215,66,154,167,35,155,92,216,4,9,201,104,104,53,186,221,143]},"announce":[],"urlList":[]}}