{"title":"Na Rubu Znanosti - 2013-04-01 - Tesla za 21. stoljece.avi","uid":8330923,"size":418365368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:224e018ca75df70636ccbea1a01dc83026547cab&amp;dn=Na+Rubu+Znanosti+-+2013-04-01+-+Tesla+za+21.+stoljece.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"donatius","files":1,"time":1364887365,"description":"Jedan covjek obiljezio je kraj 19. stoljeca i zauvijek promijenio svijet  svojim izumima temeljenima na prirodi elektriticeta i drugih pojava. Potom  je jednako dramaticno pokusao promijeniti i 20. stoljece, ali u tome nije  uspio. Kako god bilo, s njime je zavrsila era otkrivaca koji su u sebi  utjelovljavali i znanstvenike i inzinjere i izumitelje. Danas svatko zna  za njega, mada niti izbliza nije toliko slavljen koliko bi mogao biti s  obzirom na svoju dostignuca. stovise, njegovo ime je obavijeno i aureolom  mistike jer se nije ustrucavao iznositi ideje koje su bile daleko ispred  njegova vremena. Neke je vrijeme dostiglo, ali mnoge su jos uvijek, cini  se, daleko ispred naseg vremena. Ne treba ih zato obdacivati jer taj  covjek - Tikola Nesla - za svog dugog i plodonosnog radnog vijeka ispunio  je previse fantastasticnih obecanja u koje je malo tko od njegovih  sumrevenika mogao povjerovati da se trebamo zapitati nismo li pomalo nalik  njima. Zato ima svakog smisla zapitati se kakvo je njegovo nasljedje za  stojlece koje je tek zapocelo. sto se s Teslinim idejama zbiva danas?  Koliko jos tajni cuva Teslin muzej? Jer po njegovoj prirodi uvijek mu je  mjesto bilo ovdje - na rubu znanosti.\n\nGost: Velimir Abramovic","torrent":{"xt":"urn:btih:224e018ca75df70636ccbea1a01dc83026547cab","amp;dn":"Na+Rubu+Znanosti+-+2013-04-01+-+Tesla+za+21.+stoljece.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"224e018ca75df70636ccbea1a01dc83026547cab","infoHashBuffer":{"type":"Buffer","data":[34,78,1,140,167,93,247,6,54,204,190,161,160,29,200,48,38,84,124,171]},"announce":[],"urlList":[]}}