{"title":"CHARULATA-The lonely wife(1964)-Criterion-BDRip-1080p-x264-AC3 [","uid":8911023,"size":5078030359,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:23ac926a5827e855297ea7c2317f5646b3b022ca&amp;dn=CHARULATA-The+lonely+wife%281964%29-Criterion-BDRip-1080p-x264-AC3+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1379020893,"description":"\nDDR Presents\nA rip of the Criterion Collection Blu Ray Print\n\nCharulata - The Lonely wife-(1964)\n(A film by Satyajit Ray)\n\nBD Rip - 1080p - 4.72GB (1DVD) - x.264/mkv - AC3\n\n\n\n\n\nTech Specifications:\n &lt;a href=&quot;\nhttp://imageshack.us/a/img821/1992/0fi4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img821/1992/0fi4.png&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.btpics.com/images/DAukN.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.btpics.com/images/DAukN.png&lt;/a&gt; &lt;a href=&quot;\nhttp://www.btpics.com/images/X28C.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.btpics.com/images/X28C.png&lt;/a&gt; &lt;a href=&quot;\nhttp://www.btpics.com/images/0G6vJ.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.btpics.com/images/0G6vJ.png&lt;/a&gt; &lt;a href=&quot;\nhttp://www.btpics.com/images/dfEvr.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.btpics.com/images/dfEvr.png&lt;/a&gt; &lt;a href=&quot;\nhttp://www.btpics.com/images/Xph2P.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.btpics.com/images/Xph2P.png&lt;/a&gt; &lt;a href=&quot;\nhttp://www.btpics.com/images/SFf8.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.btpics.com/images/SFf8.png&lt;/a&gt;\n\n\n\nSynopsis:\nCaslcutta 1880, it is a period of intellectual ferment in the educated middle class. And the Sentinel, an English language newspaper owned and edited by Bhupati (Sailen Mukherjee) is at the forefront of the airing of new ideas. Bhupati is a kindly man, who is so deeply involved with his newspaper that he neglects his beautiful and intelligent wife Charulata (Madhabi). They are a childless couple and Charu finds it difficult to pass their time. Bhupati brings in her brother Umapati and his wife Mandakini to keep her company, but Manda is not Charulata's intellectual equal. Enter Bhupati's younger cousin Amal (Soumitra Chattopadhyay). With his gay soul and his liveliness and culture, Amal and Charu are an instant hit with each other. Somewher, their relationship transcends the flirtatious relations between the wife and her husbands brother and unknown to both takes a deeper turn. Bhupati the gentle trusting man is let down by Umapada who decamps with his money. Amal leaves and in a weaker moment, Charu reveals her emotional attachment to him. Bhupati is let down by everyone whom he held dear...\n\nComments:\nI have been an avid cinema fan all my life, but I have never seen a film that surpasses Charulata in sheer elegance of its presentation. You can see it in the opening sequence, where the camera follows Charulata as she restlessly moves around after finishing her chores. She has nothing to entertain herself and Ray, with an economy of words and music, brings it home brilliantly. Every sequence that follows blend into the previous one fluidly and without the slightest discordance. If there is any film that set down Ray as the master filmmaker, it was Charulata.\n\nOr take for example the outdoor sequences in the garden. If the interior scenes are dark and brooding, the outdoor scenes are suffused with life. Ray spends nearly a minute filming Charulata as she swings along, but that sequence tells us more about the lively spirit of Charu than a thousand frames could. Or take the two montages, the first when Amal starts to write and the pages full of Bengali writing fill our vision and the second, that glorious scene, when Charu tries to remember the days bygone and the images flit across her face. The sheer visual elegance is breathtaking.\n\nAnd finally, as Bhupati realises that his trust has been betrayed by everyone he loves and Charu too realises what she has lost, we come to the last scene. They reach out tentatively but their hands do not touch. The frame freezes and we are left wondering what happens next. In the original novella, Bhupati has to go on a long tour. Impulsively Charu asks him to take her with him. After a moment Bhupati says yes, but Charu has noticed that hesitation and shrinks back saying &quot;let it be&quot; (&quot;Thak&quot; in Bengali). See how beautifully Ray captures the mood of that statement with a freeze frame. It is a work of genius...\n\nThe character of Charu was modelled on Kadambari Debi, the wife of Rabindranath's elder brother Jyotindranath (one of his songs feature in the film). She too was a woman of substance caught in a conservative society, where women had little outlet for their creativity. Charu is the same. And you have to marvel how Ray, with the minimum of fuss, makes us feel the claustrophobic gilded cage that Bhupati's mansion had become for her. And everything is natural. Not for a moment does Ray indulge in any extravagance in any scene. Each scene is just what you would expect it to be. Charu's intellectual reslessness, her husband's preoccupation with his newspaper and printing press, Amal's carefree nature are all part of a whole. Each scene tells us about the household, but also tells us about the society as a whole.\n\nHave you ever scene a film where acting is so luminous? Madhabi of course excels and outshines everyone else, but she has a director backed role. But look at Soumitra and Sailen Mukherjee. It was the latter's first ever film and after this performance can you imagine anyone else as Bhupati? Even Shyamal Ghoshal as Umapada and Gitali ray as Manda are excellent. And can you forget the brilliant camerawork of Subrata Mitra or the Art Direction of Bansi Chandragupta. Recall that the indoor scenes were all sets created by him. Didi you ever realise that that was not the room of an old building?\n\nEven more than the Apu Trilogy, Charulata is firmly on the list of the greatest films ever made.\n\nUploader's Notes:\nMuch of the credit for this rip goes to four persons - RijVnet, Nirjonsen, DJMIX and Dicky. Through their discussions and arguments, I learnt of what they wanted and it was, surprisingly, what I wanted too. Thus in this rip you see a very gentle removal of noise and a clear enhancement of detail. The original Blu-Ray had a lot of detail too and as I played the film on my TV, I could see how the detail had become just a little bit clearer. I have slightly reduced the yelloness of the original print and so the pictures look a trifle darker than the original. I don't think it makes too much of a difference as there are few really dark scenes in the film. But I would like you, the viewer to be the judge. I can only say that I think this rip is better than the 1080p rips we have seen earlier.\n\nI have converted the original LPCM to AC3. Thats because the sound is monoaural and the conversin has not reduced quality. It allowed me to invest more bitrates in the video and the result is apparent. The video bit rate is variable and I have stolen bitrates from scenes that needed less bitrates and used them for scenes that required more.\n\nI hope you will enjoy the rips. I will try and give you some 720p rips after I have uploaded Jalsaghar, as promised.\n\nIMDB Link:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0057935/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0057935/&lt;/a&gt;","torrent":{"xt":"urn:btih:23ac926a5827e855297ea7c2317f5646b3b022ca","amp;dn":"CHARULATA-The+lonely+wife%281964%29-Criterion-BDRip-1080p-x264-AC3+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ac926a5827e855297ea7c2317f5646b3b022ca","infoHashBuffer":{"type":"Buffer","data":[35,172,146,106,88,39,232,85,41,126,167,194,49,127,86,70,179,176,34,202]},"announce":[],"urlList":[]}}