{"title":"Kerbal Space Program 0.20 (Linux)","uid":8510890,"size":395350673,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:23c1fe41a25a7e0533edd848c40bbe1c6f27c620&amp;dn=Kerbal+Space+Program+0.20+%28Linux%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buss1000","files":1,"time":1369582291,"description":"Here fine here is KSP for Linux.\n &lt;a href=&quot;\nhttps://kerbalspaceprogram.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://kerbalspaceprogram.com/&lt;/a&gt;\n\n\n*******************************************\n        __   ___  ______      ______                                         \n      /  /  /  / /  __     /   _                                 \n     /  / /  /  /  /  |_|  /   / |  |                        \n    /  //  /   |  |___    /   /_/  /                         \n   /     /     ___     /   ____ /                                        \n  /  /|  |   ___     | /   /                                   \n /  / |  |     _/  / /   /                                       \n/__/  |__|    _____/ /___/                                 \n\n*******************************************\n(I'm terrible at ASCII art :P)\n\nThank you for downloading the Kerbal Space Program!\n\nVersion 0.20.0\n\n================================================================================\nInstallation:\n\n* Unzip the contents of this package onto a directory of your choice (ex. C:/Program Files/KSP)\n* If you plan to overwrite a previous version of KSP with this one, please delete the contents of the folder before unzipping.\n\nIMPORTANT NOTE FOR MAC USERS:\n* The Update Tool requires version 2.8 of the Mono Framework to run. The Mono 2.10.9 Runtime installer is included in the .zip file. Please install it if you are running a version earlier than 2.8, before running the game or patcher. (If you're unsure about your version of Mono, just run the installer).\nYou can check for the latest version of the Mono Framework Runtime here: http://www.go-mono.com/mono-downloads/download.html\n\nWARNING: It's very likely that parts and/or ships created on previous versions will be incompatible with the latest release. At this point in development it is quite impossible to ensure backward-compatibility at each step, so please keep this in mind. If you encounter something that could be a bug, try again on a fresh installation and no addon parts. It may just be an incompatibility issue.\n\n\n================================================================================\nDisclaimer:\nTHIS SOFTWARE IS CONSIDERED TO BE IN ALPHA STATE, AND MAY CONTAIN BUGS. SQUAD AND SQUAD STAFF TAKE NO\nRESPONSIBILITY FOR ANY DAMAGE OR LOSS OF DATA THAT MAY OCCUR AS A DIRECT OR INDIRECT RESULT OF USING\nTHIS SOFTWARE, AND CANNOT GUARANTEE ANY DEGREE OF PERFORMANCE OR STABILITY, OR EVEN THAT THE SOFTWARE\nWILL BE USABLE AT ALL. USE AT YOUR OWN RISK.\t\t\n\n(not that any of the above should happen anyway, but it's good to be on the safe side)\n\n\nChangeLog:\n\n======= v0.20.0 Exp===================\n\nBug Fixes and Tweaks:\n\n- Decoupled vessels now properly inherit the action group state of the original vessel.\n- &quot;Root-dropping&quot; decoupling now properly preserves the staging count for the new decoupled vessel.\n- Fixed the EVA flags looking weird during the initial part of the flag-plant animation.\n- Fixed staging icons on decoupled parts not being removed from the staging list.\n- Fixed the suspension jitter on the Medium Wheels.\n- Several improvements to how collisions are detected and handled in the editors.\n- Symmetrical counterparts now properly glow red or green based on whether they can attach or not.\n- Added a sound for when placing/releasing parts in the editor isn't possible.\n- Added the flag pole to the editor scene background.\n- Adjusted collision and torque values for the medium wheels so they're a bit faster and tougher.\n- Adjusted wheel breaking logic to take into account the relative velocities of rigidbodies.\n\n================ v0.20.0 ===========================\n\nNew:\n\n* Parts:\n- Command Seats for Kerbals on EVA.\n- New Cupola pod with IVA.\n- New Small Lander pod with IVA.\n- 2 new Probe Cores.\n- New Large Docking Clamp.\n- New Medium Wheel.\n\n* Flags:\n- Kerbals on EVA can now plant Flags on terrain.\n- Several Stock flags to choose from.\n- Flags are moddable. Create your own!\n- Planting a Flag allows you to name the site, which becomes a focusable object in flight and on the Tracking Station.\n- Planted flags have a Plaque, which can be written during placement, and read only when approached by an EVA.\n- Added a Flag selector to the Game Start Dialog.\n- Added a Flag Pole Facility to the Space Center.\n- Added a FlagDecal part module. Allows any part to have a part of its model textured with the selected flag.\n\n* Editor:\n- Added Flag selector to Editor scenes, to select a flag for the mission (defaults to space program flag).\n- The Editor no longer requires that the first part on a vessel be a Command Pod.\n- Any part which allows both stacking and surface-attaching can be used as the vessel root.\n- Added a new part filtering system to the parts list, which allows excluding and greying-out parts based on any criteria.\n- It is now possible to delete the first part on a vessel, and replace it.\n\n* UI:\n- Added the first iteration of the Kerbal Knowledge Base: A collection of vessel and planetary information on the Map and Tracking Station.\n- The Knowledge Base shows information about known Celestial Bodies, displays the crews inside vessels, and much more.\n- Added Filtering by vessel type on the Tracking Station.\n- Added Filtering to the Map View as well (hover around the top-center of the screen)\n- New Loading Screens, with hints.\n\n* I/O:\n- GameDatabase: Completely overhauled the loading process with a completely new system.\n- Mods and Stock Parts can now have their own separate folders for organization.\n- Added a Flags folder to collect flag bitmaps.\n- Added a scene transition buffer system, to ensure optimal memory cleanup when switching scenes.\n\n* Controls:\n- Switching vessels no longer resets throttle and other input whenever possible.\n- Going on EVA and boarding a vessel (or boarding a seat) also no longer reset the vessel's input state.\n- Decoupled vessels inherit the old vessel's control state. \n- All parts on a stage will get activated now, even if that stage causes some of those parts to get jettisoned away.\n\n\nBug Fixes and Tweaks:\n\n- Streamlined PQS Terrain Assets, reduced memory usage by up to 30%.\n- Upgraded Debug Menu, allows reloading parts and cfg files while playing.\n- The Map View now properly prioritizes selecting moused-over map nodes when multiple orbits overlap.\n- It's now possible to 'pin' the Ap and Pe nodes, so their captions remain visible after moving the mouse away.\n- Removed the Splash Screen scene. Now the game starts loading as soon as the application starts.\n- Rewrote and organized many scattered game events into a single coherent GameEvents System, which plugins can use.\n- If you crash/explode, focus now shifts to the nearest controllable vessel (if any) instead of going straight to the End Flight dialog.\n- Many more small bug fixes and tweaks.\t\t","torrent":{"xt":"urn:btih:23c1fe41a25a7e0533edd848c40bbe1c6f27c620","amp;dn":"Kerbal+Space+Program+0.20+%28Linux%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23c1fe41a25a7e0533edd848c40bbe1c6f27c620","infoHashBuffer":{"type":"Buffer","data":[35,193,254,65,162,90,126,5,51,237,216,72,196,11,190,28,111,39,198,32]},"announce":[],"urlList":[]}}