{"title":"I Cover The Waterfront {Claudett Colbert} [1933] @","uid":5540011,"size":909901875,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2425829918dacfccc7a245bfcbbcccbff8f1452a&amp;dn=I+Cover+The+Waterfront+%7BClaudett+Colbert%7D+%5B1933%5D+%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":5,"time":1273191650,"description":" &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0024151/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0024151/&lt;/a&gt;\n\nUser Rating: 6.3/10 \n\nGenre: Drama | Romance\n\nRelease Date: 19 May 1933 (USA)\n\n\tBen Lyon\t ... \tH. Joseph 'Joe' Miller\n\tClaudette Colbert\t... \tJulie Kirk\n\tErnest Torrence\t... \tEli Kirk (Julie's father)\n\tHobart Cavanaugh\t... \tOne Punch McCoy\n\tMaurice Black\t... \tOrtegus (Kirk's First Mate)\n\t\n\n The presence of luminous Claudette Colbert lifts this standard and somewhat dreary effort to an entirely different level. Her shocking entrance has her buck-naked after skinny-dipping in the ocean, where Ben Lyon holds her bathing suit hostage as Claudette hides behind a boulder. She demands to know how he found her in this remote beach. He tells her that a neighbor with a telescope objected to her nudity. &quot;It must have been a woman,&quot; replies Claudette. &quot;Yes,&quot; answers Lyon, &quot;no man would object.&quot;\n\nObviously, Claudette Colbert appears at the pinnacle of her legendary beauty, with her distinctive wide cheekbones complemented by her enormous eyes. Her wardrobe here is cheap yet sexy, often in tight sweaters, and her slim form cuts a glorious figure across the screen. She's cute in the best sense, never self-conscious or cloying, and it's easy to see why she'd take the nation by storm the following year in &quot;It Happened One Night&quot; and &quot;Cleopatra.&quot; It's a joy to even watch her make toast in an adorable bit of business when she catchs an errant glob of jelly from dropping onto the table. One of the sweetest ad-libs I've ever noticed, done with humor and style.\n\nThe movie itself offers other enjoyments too. Like the gnarled Ernest Torrance as Claudette's sea-salty father, who smuggles illegal Chinese immigrants into port -- sometimes inside the bellies of sharks! Naturalistic undertones abound when the viewer goes aboard this captain's ship, where it's an unfortunate incident when a Chinese man is chained and thrown overboard when the Coast Guard is spotted nearby. &quot;He knew he was takin' a risk,&quot; is how the Captain justifies his actions.\n\nAll-in-all a worthwhile effort, this movie has much to recommend it, although it is somewhat marred by annoying Ben Lyon as the lead. If another actor had essayed that role, perhaps Clark Gable or Spencer Tracy, the entire movie could have been lifted to greatness. \n\n","torrent":{"xt":"urn:btih:2425829918dacfccc7a245bfcbbcccbff8f1452a","amp;dn":"I+Cover+The+Waterfront+%7BClaudett+Colbert%7D+%5B1933%5D+%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2425829918dacfccc7a245bfcbbcccbff8f1452a","infoHashBuffer":{"type":"Buffer","data":[36,37,130,153,24,218,207,204,199,162,69,191,203,188,204,191,248,241,69,42]},"announce":[],"urlList":[]}}