{"title":"Night of the Creeps","uid":4465841,"size":736233472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:24377036f727faa87f8625d48292418806693ff5&amp;dn=Night+of+the+Creeps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cj19766","files":-1,"time":1224908572,"description":"R,1hr 29min\n\nGenres:Horror,Comedy\n\nReleased: August 22, 1986\n\nDirector:Fred Dekker\n\nDistributor:TriStar Pictures\n\nStarring:Jason Lively, Steve Marshall, Jill Whitlow \n\nSynopsis \n \nVirtually unnoticed during its brief theatrical run, this wildly entertaining horror-comedy achieved healthy cult status following its home-video and cable TV releases. The directorial debut of Fred Dekker (writer of the successful horror parody House), this low-budget effort throws alien monsters, axe-wielding killers, flesh-eating zombies, nudity, and (gasp!) drunken fraternity shenanigans into a blender, spiced with witty one-liners and references to dozens of horror classics (and anti-classics). The result is a satisfying treat that will tickle the tastebuds of horror fans. The film's nominal protagonists are a pair of randy fraternity pledges (Jason Lively, Steve Marshall) who open a literal can of worms when they steal a corpse from the campus medical facility and release a horde of space-leeches, which proceed to infest the bodies of everyone in sight. The host bodies subsequently become homicidal zombies with a penchant for popping in on unsuspecting (and undressing) sorority girls. The town's only hope (such as it is) seems to be a hard-boiled ex-cop (Tom Atkins), who has uncovered the secret link between the zombie invasion and a 30-year-old axe-murder case... and who's also several sandwiches shy of a picnic. Dekker keeps things moving at a brisk pace thanks to some outrageous set-pieces (some of which happen so quickly they'll have viewers reaching for the pause button) and clever dialogue, particularly for Atkins (&quot;Girls, the good news is your dates are here; the bad news is, they're dead&quot;), who dives into his crusty character with relish. ~ Cavett Binion, All Movie Guide  \n   \nHope you like this torrent and please comment and seed for as long as you can.\n\nI will be bringing more torrents and hope you enjoy them!!!\n","torrent":{"xt":"urn:btih:24377036f727faa87f8625d48292418806693ff5","amp;dn":"Night+of+the+Creeps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24377036f727faa87f8625d48292418806693ff5","infoHashBuffer":{"type":"Buffer","data":[36,55,112,54,247,39,250,168,127,134,37,212,130,146,65,136,6,105,63,245]},"announce":[],"urlList":[]}}