{"title":"OTIS GIBBS - DISCOGRAPHY","uid":7092657,"size":369151998,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2544c1c401a9bb5fd8112d4c7b45fd4dc1a39d00&amp;dn=OTIS+GIBBS+-+DISCOGRAPHY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Amigo45","files":70,"time":1331419876,"description":"OTIS GIBBS - DISCOGRAPHY\n\n\nSounding like a typical troubadour, Otis Gibbs takes an acoustic slant to most of the songs on 49th and Melancholy, starting with &quot;East Texas Sutra.&quot; With a gravel-like vocal and basic guitar strumming, the track has a lovable country twang in the style of Steve Earle circa Guitar Town or Ralph Boyd Johnson. Unfortunately, it tends to drag too long near the ending. &quot;Waltzin With You&quot; is a down-tempo ballad that resembles Soul Asylum or a polished Tom Waits. It has the same feeling as &quot;Here Comes a Regular&quot; by the Replacements, but packs a little less punch. &quot;Don't Have to Take It So Hard&quot; features some harmony vocals and dobro. It's also one of the less than stellar tracks here. &quot;The Great American Monkey Choir&quot; is a nice melodic track that finally gives some percussion to the album, however subtle. &quot;This town sucks, this town sucks,&quot; Gibbs sings over the song, which would fit in well with John Mellencamp's Lonesome Jubilee. His strong lyrics are one of the album's many selling points, creating some vivid imagery with simple words. &quot;Both Sides of the Line&quot; is similar to an earlier track, but is more heartfelt in its tone. When he stretches his vocals on the Americana-sounding &quot;Bernadine,&quot; Gibbs brings to mind Bruce Springsteen. Some Celtic touches on &quot;Thinkin 'Bout Jolene,&quot; courtesy of a mandolin, are a welcome change for the album. The song also features a bit more instrumental work, while Gibbs wishes for Los Angeles to &quot;fall into the sea.&quot; &quot;Wanamaker&quot; is the oddest track, a rambling story about getting out of town with some tinny vocals and an accordion. &quot;Ghost of the 587&quot; has an eerie Nebraska flavor, with Gibbs giving his best performance. Hopefully, this isn't the last listeners will hear of this talented singer/songwriter\n\n1. Otis Gibbs - 49th and Melancholy 2002\n2. Otis Gibbs - One Day Our Whispers 2004\n3. Otis Gibbs - Grandpa Walked A Picketline 2009\n4. Otis Gibbs - Joe Hill's Ashes 2010\n5. Otis Gibbs - Harder Than Hammered Hell 2012\n\nBitrate:mp3, 192 - 320  kbps\n\n\nEnjoy!","torrent":{"xt":"urn:btih:2544c1c401a9bb5fd8112d4c7b45fd4dc1a39d00","amp;dn":"OTIS+GIBBS+-+DISCOGRAPHY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2544c1c401a9bb5fd8112d4c7b45fd4dc1a39d00","infoHashBuffer":{"type":"Buffer","data":[37,68,193,196,1,169,187,95,216,17,45,76,123,69,253,77,193,163,157,0]},"announce":[],"urlList":[]}}