{"title":"Gentoo Linux","uid":13581488,"size":2944650240,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:25bf3486c8e7dd18e8b7615ebab5e5f782fbbf6c&amp;dn=Gentoo+Linux&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"john80701","files":1,"time":1455749645,"description":"Gentoo Linux é uma distribuição Linux um tanto quanto diferente das demais. Enquanto as outras distros costumam vir completas, com vários programas, aplicativos, e acessórios, o Gentoo Linux necessita que você compile pacote por pacote para instalá-la, de modo que você monte a distribuição apenas com aqueles que você achar conveniente.\r\n\r\nIsso faz com que, na verdade, Gentoo Linux não seja considerada exatamente uma distribuição, mas sim uma metadistribuição, Pode-se dizer também que o Gentoo Linux é uma distribuição modularizada.\r\n\r\nOs pacotes desta distro são todos compilados a partir do código-fonte, sendo que pouquíssimos programas possuem pacotes com binários pré-compilados. Isso faz com que as dependências sejam flexíveis em relação aos pacotes em binários pré-compilados que são utilizados pelas demais distribuições, o que significa que você pode escolher se quer ou não ativar determinado pacote de dependência.\r\n\r\nGentoo Linux\r\n\r\n\r\nPor que montar cada pacote?\r\n\r\nAo escolher apenas os pacotes que você achar necessários, sua distribuição ficará enxuta, o que irá proporcionar leveza e agilidade. Com isso, você não terá instalado no computador diversos programas que muitas vezes você nem sabe para que servem.\r\n\r\nCuriosidade sobre o nome\r\n\r\nMuitas pessoas não sabem, mas Gentoo é o nome da espécie de pinguim que consegue nadar mais rápido! E a distribuição leva esse nome pois o desenvolvedor inicial, Daniel Robbins, gostaria que a distribuição dele fosse mais veloz que as demais","torrent":{"xt":"urn:btih:25bf3486c8e7dd18e8b7615ebab5e5f782fbbf6c","amp;dn":"Gentoo+Linux","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25bf3486c8e7dd18e8b7615ebab5e5f782fbbf6c","infoHashBuffer":{"type":"Buffer","data":[37,191,52,134,200,231,221,24,232,183,97,94,186,181,229,247,130,251,191,108]},"announce":[],"urlList":[]}}