{"title":"Angry Birds Anthology","uid":7956909,"size":280060945,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:275bb0ece693e99740fb8b9cdf6e12dc7e08e4f8&amp;dn=Angry+Birds+Anthology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Taker009","files":18,"time":1356454852,"description":"Angry Birds Anthology\n\n\n1.Angry Birds\n\n\n\nExcellent arcade game in which you must help the birds away back eggs stolen by evil pigs. Attack the pig with its battle birds, destroying their fortifications. Each level is unique and requires its own approach. v2.1.0\n\n\n2.Angry Birds Seasons\n\n\n\nNew adventures Angry Birds came out on PC!.Soak up the spirit of Halloween, Christmas, Valentine's Day, St. Patrick's Day, Easter and other holidays. v2.3.0\n\n\n3.Angry Birds Rio\n\n\n\nA product of partnership Rovio and 20th Century Fox. The game takes place in the magical city of Rio, where, after the abduction, have been delivered, loved by many,evil birds. They eventually go away from the kidnappers and sent to rescue his friends, Blu and Jewel - rare parrots and heroes multfilma &quot;Rio&quot; from 20th Century Fox. v1.4.4\n\n4.Angry Birds Space\n\n\nIncludes 60 levels for interstellar planets and in zero gravity, which provides exciting gameplay - from leisurely to the fast-paced action puzzle. It is the whole galaxy, which you will explore!. After a giant paw stole eggs Angry Birds, they follow it through the tunnel in space and find themselves floating in the mysterious galaxy surrounded by space hog! .Fortunately, Angry Birds have their own super powers ... v1.2.0\n\n\n5.Angry Birds Star Wars\n\n\n\nStart Angry Birds Star Wars classic: a long time ago, in a far, far galaxy ... a group of birds, the rebels faced a galactic threat: the evil imperial svinoshturmovikami. Dealing a blow to the secret base, bird Rebels won their first victory over the evil imperial pigs. During the battle, Rebel spies managed to steal secret plans to the Empire superweapon, Svinozvezdy Death, and they race to deliver plans birds-rebels. Right now they need help.\n\n6.Bad piggies\n\n\n\nExternally, the game very much looks like the original Angry Birds set of elements - animation, sound design and mood. The new arcade game you will need to collect from the materials at hand tool to move, in which &quot;bad pigs&quot; can reach the cherished Stars. This can be a fun three-wheeled vehicle with wings, flying in two balls box or hybrid bike with an airship.\n\n\nSystem requirements:\n\nOperating system: Windows XP / Vista / 7\nProcessor: 1 GHz\nMemory: 512 MB\nVideo: 256 MB\nSound card: compatible with DirectX 9.0\n\nFOR 1-4\n1. Install the game.(Dont Run)\n2. Install Patch, run from the folder Patch file Patch.exe.\n3. Run the game.\n4. Activate the game with the key in the file Readme.txt.\n5. Play.\nFOR 5\n1. Install the game.(Dont Run)\n2. Copy Patch to the installation folder, run as administrator,\n3. Run the game.\n4. Activate the game with the key in the file Readme.txt.\n5. Play\nFOR 6\n1. Install the game.(Dont Run)\n2. Install Patch, run from the folder Patch file Patch.exe.\n3. Run the game. ( NO KEY NEEDED)\n","torrent":{"xt":"urn:btih:275bb0ece693e99740fb8b9cdf6e12dc7e08e4f8","amp;dn":"Angry+Birds+Anthology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"275bb0ece693e99740fb8b9cdf6e12dc7e08e4f8","infoHashBuffer":{"type":"Buffer","data":[39,91,176,236,230,147,233,151,64,251,139,156,223,110,18,220,126,8,228,248]},"announce":[],"urlList":[]}}