{"title":"Easy WiFi Radar[Tabsman][H33T][Release]","uid":3974323,"size":2302794,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:27b90b9d2d5218b66d4a3b2a34403c50d5d7dd9e&amp;dn=Easy+WiFi+Radar%5BTabsman%5D%5BH33T%5D%5BRelease%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"waterdale","files":6,"time":1200173243,"description":"Easy WiFi Radar helps you to find and connect to free wireless access points with a single mouseclick. It&amp;#039;s WiFi for Dummies. Connect to open hotspots automatically. Get your mail and browse the web without connection charges. The ideal WiFi-tool for frequent travellers and mobile professionals.\n\nNEW Easy WiFi Radar Pro\n\n* Shows more free hotspots in your area on an interactive map\n\n* Lets you set your own landing page (no more ads)\n\n* Automatically gets your email when connected\n\n* Allows you to set a home or office WEP-key\n\n* Get software on CD (optional)\n\n\n1. Installation\n\nRun the Easy WiFi Radar Installer. The application will be installed in the Programs folder. You find it in the Windows XP Start Menu  All Programs  Easy WiFi Radar. There will also be a desktop shortcut.\n \n2. Automatic Operation\n\nStart the software and Easy WiFi Radar wil begin scanning for wireless access points. It will give you information about the ongoing process in the floating text box. You may optionally hide that info-window, the scanning will continue. Easy WiFi Radar may find three possible types of access points, indicated by three colors:\n\nÂªGreen squares represent an open access point, not encrypted, with a strong signal. Easy WiFi Radar will try to connect to those first.\n\nYellow squares represent an open access point, not encrypted, but with a weak signal. Easy WiFi Radar will try to connect to those if it can&amp;#039;t connect to a green acces point..\n\nÂªRed squares represent a closed access point, encrypted with a WEP-key. Easy WiFi Radar will only try to connect to those if you provided a WEP-key in the Options Menu. If you provide an incorrect WEP-key, it will not be able to connect. Currently, Easy WiFi Radar does not support WPA-encryption or other forms of security.\n\nIf the radar finds an access point and connects to it, it will automatically try to request an IP-number from the access point. If it succesfully receives the IP-number, it will automatically test the connection. And if that test is positive, it will automatically open your webbrowser and connects to the internet. You will hear a sound effect to indicate a successfull connection.\n\nThe Radar will hide in the lower right corner of your screen (the so called &amp;#039; system tray icon&amp;#039;).\n\nIf it fails to connect properly, it will jump to the next strongest acces point and tries that one. And so on. Even while driving in your car, you may use Easy WiFi Radar to detect and connect to wireless access points.\n\n3. Tray Menu\n\nYou may click on the little icon in the system tray and a pop-up menu will show with several options.\n\nQuit - ends the application and will restore windows default wireless settings\n\nNew Scan - will initiate a new search for an internet connection. You may use this if the connection got lost for whatever reason.\n\nShow Radar - will show you the current overview of all access points in reach and the one you&amp;#039;re connected to will be displayed in the status box.\n\nAbout - shows copyright information and allows you to connect to our online Frequently Asked Questions page.\n\nOptions (picture left) - brings up the advanced options menu :\n\na) Radar Sound - allows you to turn off the &amp;#039;swoosh&amp;#039; sound. Next time you start Easy WiFi radar, it won&amp;#039;t play.\n\nb) When connected - This feature is only available in the paid version, not in the free versin. It allows you to set the webpage that Easy WiFi radar opens when it finds and connects succesfully to an access point. If you need this feature, you can buy a version of Easy WiFi Radar that allows that. For example, you can set it to connect to your webmail when it finds a free wifi connection.\n\nc) Home / Office WEP Key - allows you to enter the security code that may have been set on your home or office access point. Easy WiFi Radar will only try to connect to secured access points if you provided a WEP-key in the Options Menu. If you provide an incorrect WEP-key, it will not be able to connect.\t","torrent":{"xt":"urn:btih:27b90b9d2d5218b66d4a3b2a34403c50d5d7dd9e","amp;dn":"Easy+WiFi+Radar%5BTabsman%5D%5BH33T%5D%5BRelease%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27b90b9d2d5218b66d4a3b2a34403c50d5d7dd9e","infoHashBuffer":{"type":"Buffer","data":[39,185,11,157,45,82,24,182,109,74,59,42,52,64,60,80,213,215,221,158]},"announce":[],"urlList":[]}}