{"title":"Aarohan (2010) Bengali Movie dvd rip AVI","uid":10282927,"size":390485950,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a24ea7e159204f35592f3100a28faf02d342171&amp;dn=Aarohan+%282010%29+Bengali+Movie+dvd+rip+AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pint3359","files":1,"time":1401731804,"description":" &lt;a href=&quot;http://s28.postimg.org/4ua14qzwd/Aarohan.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://s28.postimg.org/4ua14qzwd/Aarohan.jpg&lt;/a&gt;\n\n\n\nà¦†à¦°à§‹à¦¹à¦¨ (2010) dvd rip AVI\n\nAarohan (2010)\n\n\nDirector: Pinaki Choudhury\nMusic Director: Suparna Kanti Ghosh\nGenre: Drama\nCast:  Soumitra Chatterjee, Sandhya Ray, Rituparna Sengupta, Samadarshi Dutta\n\nSynopsis: The patriarch Surya Shekhar Chattopadya, steeped in traditional values, is deeply religious person, and a man of firm principals. He treats the predictions of his horoscope like axiomatic truth, little realizing that such predictions, often interpreted in equivocal language, can be quite misleading. His obduracy distances him from his son, Alok, who refuses to put up with his father's unbending attitude to the horoscope. Alok marries outside his caste, and tears up his horoscope, and settles abroad. Suryasekhar's wife an accomplished and educated lady, is reduced to being a mute witness to all this. She has accepted him a lot and never registered protest. She bears everything with quite resigned dignity. Their grandson Arijit comes to stay with them through a strange turn of events and they were overjoyed. But Suryasekhar has decided that that he will die in Benaras (Kashi) to rid himself of the bondage of the eternal cycle of rebirth. He decides to check in Moksha Bhavan a house where people come to die. There Arijit meets Kasturi, Behari women whose mother in law awaits death. Her husband Shyam cannot father a child and the blame falls on Kasturi who refuses to be abused and called &quot;&quot;barren&quot;'. She makes it clear that her husband is no 'man' that he claims to be, because he is attracted to other man. Kasturi takes it up as challenge to prove that she is capable of carrying a child. By yet another turn of events, Arijit decides to marry Kasturi once he knows that he has sired the child she has conceived. As Arijit's parents come to Beneras, and come to know of their relationship, they refuse to accept their son's decision. Alok has a massive heart attack and dies. Suryasekhar is shattered. As the embers of his son's pyre die out, Suryasekhar's wife confronts him for the first time, questioning his unbending faith, and the truth of the prediction of the horoscope. The patriarch realizes what a blunder he has committed. He leads his grandson to the river Ganga to immerse the ashes, and tears up his horoscope and throws it into the river. As the last gesture of atonement, he accepts Kasturi, taking her with him to his house in kolkata, as the first rays of the early morning sun light up the horizon.\n\n\nScreenshot:\n &lt;a href=&quot;\nhttp://s27.postimg.org/oqbzk5l4j/Aarohan_thumbs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s27.postimg.org/oqbzk5l4j/Aarohan_thumbs.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2a24ea7e159204f35592f3100a28faf02d342171","amp;dn":"Aarohan+%282010%29+Bengali+Movie+dvd+rip+AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a24ea7e159204f35592f3100a28faf02d342171","infoHashBuffer":{"type":"Buffer","data":[42,36,234,126,21,146,4,243,85,146,243,16,10,40,250,240,45,52,33,113]},"announce":[],"urlList":[]}}