{"title":"The Steal: A Cultural History of Shoplifting -epub","uid":6651312,"size":287844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a5384c852456fb2b5b695199cb3d9fb75fce883&amp;dn=The+Steal%3A+A+Cultural+History+of+Shoplifting+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1315159675,"description":"A history of shoplifting, revealing the roots of our modern dilemma.\n \nRachel Shteir's The Steal is the first serious study of shoplifting, tracking the fascinating history of this ancient crime. Dismissed by academia and the mainstream media and largely misunderstood, shoplifting has become the territory of moralists, mischievous teenagers, tabloid television, and self-help gurus. But shoplifting incurs remarkable real-life costs for retailers and consumers. The &quot;crime tax&quot;-the amount every American family loses to shoplifting-related price inflation-is more than $400 a year. Shoplifting cost American retailers $11.7 billion in 2009. The theft of one $5.00 item from Whole Foods can require sales of hundreds of dollars to break even.\n\n The Steal begins when shoplifting entered the modern record as urbanization and consumerism made London into Europe's busiest mercantile capital. Crossing the channel to nineteenth-century Paris, Shteir tracks the rise of the department store and the pathologizing of shoplifting as kleptomania. In 1960s America, shoplifting becomes a symbol of resistance when the publication of Abbie Hoffman's Steal This Book popularizes shoplifting as an antiestablishment act. Some contemporary analysts see our current epidemic as a response to a culture of hyper-consumerism; others question whether its upticks can be tied to economic downturns at all. Few provide convincing theories about why it goes up or down.\n\n Just as experts can't agree on why people shoplift, they can't agree on how to stop it. Shoplifting has been punished by death, discouraged by shame tactics, and protected against by high-tech surveillance. Shoplifters have been treated by psychoanalysis, medicated with pharmaceuticals, and enforced by law to attend rehabilitation groups. While a few individuals have abandoned their sticky-fingered habits, shoplifting shows no signs of slowing.\n\n In The Steal, Shteir guides us through a remarkable tour of all things shoplifting-we visit the Woodbury Commons Outlet Mall, where boosters run rampant, watch the surveillance footage from Winona Ryder's famed shopping trip, and learn the history of antitheft technology. A groundbreaking study, The Steal shows us that shoplifting in its many guises-crime, disease, protest-is best understood as a reflection of our society, ourselves.\n\nPenguin 2011","torrent":{"xt":"urn:btih:2a5384c852456fb2b5b695199cb3d9fb75fce883","amp;dn":"The+Steal%3A+A+Cultural+History+of+Shoplifting+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a5384c852456fb2b5b695199cb3d9fb75fce883","infoHashBuffer":{"type":"Buffer","data":[42,83,132,200,82,69,111,178,181,182,149,25,156,179,217,251,117,252,232,131]},"announce":[],"urlList":[]}}