{"title":"Fairytale Retellings Series - Jackson Pearce","uid":13347759,"size":3132844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2aa4da86ce5a63e150ec5ae56c036fced231ccb8&amp;dn=Fairytale+Retellings+Series+-+Jackson+Pearce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":12,"time":1454066135,"description":"01. Sisters Red [Fairytale Retellings, #1] - Jackson Pearce\r\n\r\n\r\n\r\nScarlett March lives to hunt the Fenris--the werewolves that took her eye when she was defending her sister Rosie from a brutal attack. Armed with a razor-sharp hatchet and blood-red cloak, Scarlett is an expert at luring and slaying the wolves. She's determined to protect other young girls from a grisly death, and her raging heart will not rest until every single wolf is dead.\r\n\r\nRosie March once felt her bond with her sister was unbreakable. Owing Scarlett her life, Rosie hunts ferociously alongside her. But even as more girls' bodies pile up in the city and the Fenris seem to be gaining power, Rosie dreams of a life beyond the wolves. She finds herself drawn to Silas, a young woodsman who is deadly with an ax and Scarlett's only friend--but does loving him mean betraying her sister and all that they've worked for?\r\n\r\n\r\n\r\n02. Sweetly [Fairytale Retellings, #2] - Jackson Pearce\r\n\r\n\r\n\r\nThe forest invites you in . . . but will never let you go.\r\n\r\nAs a child, Gretchen's twin sister was taken by a witch in the woods. Ever since, Gretchen and her brother, Ansel, have felt the long branches of the witch's forest threatening to make them disappear too.\r\n\r\nYears later, when their stepmother casts Gretchen and Ansel out, they find themselves in sleepy Live Oak, South Carolina. They're invited to stay with Sophia Kelly, a beautiful candy maker who molds sugary magic: coveted treats that create confidence, bravery, and passion.\r\n\r\nLife seems idyllic, and Gretchen and Ansel gradually forget their haunted past -- until Gretchen meets handsome local outcast Samuel. He tells her the witch isn't gone -- it's lurking in the forest, preying on girls after Live Oak's infamous chocolate festival each year, and looking to make Gretchen its next victim. Gretchen is determined to stop running and start fighting back. Yet, the further she investigates the mystery of what the witch is and how it chooses its victims, the more she wonders who the real monster is.\r\n\r\nGretchen is certain of only one thing: a monster is coming, and it will never go away hungry.\r\n\r\n\r\n\r\n03. Fathomless [Fairytale Retellings, #3] - Jackson Pearce\r\n\r\n\r\n\r\nCelia Reynolds is the youngest in a set of triplets and the one with the least valuable power. Anne can see the future, and Jane can see the present, but all Celia can see is the past. And the past seems so insignificant - until Celia meets Lo.\r\n\r\nLo doesn't know who she is. Or who she was. Once a human, she is now almost entirely a creature of the sea - a nymph, an ocean girl, a mermaid - all terms too pretty for the soul-less monster she knows she's becoming. Lo clings to shreds of her former self, fighting to remember her past, even as she's tempted to embrace her dark immortality.\r\n\r\nWhen a handsome boy named Jude falls off a pier and into the ocean, Celia and Lo work together to rescue him from the waves. The two form a friendship, but soon they find themselves competing for Jude's affection. Lo wants more than that, though. According to the ocean girls, there's only one way for Lo to earn back her humanity. She must persuade a mortal to love her... and steal his soul.\r\n\r\n\r\n\r\n04. Cold Spell [Fairytale Retellings, #4] - Jackson Pearce\r\n\r\n\r\n\r\nKai and Ginny grew up together--best friends since they could toddle around their building's rooftop rose garden. Now they're seventeen, and their relationship has developed into something sweeter, complete with stolen kisses and plans to someday run away together.\r\n\r\nBut one night, Kai disappears with a mysterious stranger named Mora--a beautiful girl with a dark past and a heart of ice. Refusing to be cast aside, Ginny goes after them and is thrust into a world she never imagined, one filled with monsters and thieves and the idea that love is not enough.\r\n\r\nIf Ginny and Kai survive the journey, will she still be the girl he loved--and moreover, will she still be the girl who loved him?\r\n\r\nJackson Pearce, author of the acclaimed Sisters Red and Fathomless, has returned with a unique vision of Hans Christian Andersen's &quot;The Snow Queen,&quot; one about power and redemption, failure and hope, and the true meaning of strength","torrent":{"xt":"urn:btih:2aa4da86ce5a63e150ec5ae56c036fced231ccb8","amp;dn":"Fairytale+Retellings+Series+-+Jackson+Pearce","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aa4da86ce5a63e150ec5ae56c036fced231ccb8","infoHashBuffer":{"type":"Buffer","data":[42,164,218,134,206,90,99,225,80,236,90,229,108,3,111,206,210,49,204,184]},"announce":[],"urlList":[]}}