{"title":"WrestleCrap: The Very Worst of Professional Wrestling","uid":11951531,"size":4780182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b2a523d07376537ecc6066984bacc5918bf8214&amp;dn=WrestleCrap%3A+The+Very+Worst+of+Professional+Wrestling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1432172607,"description":"WrestleCrap: The Very Worst of Professional Wrestling examines some of the ridiculously horrible characters and storylines that pro wrestling promoters have subjected their fans to over the past twenty years. Why would any sane person think that having two grown men fight over a turkey was actually a reasonable idea? Was George Ringo, the Wrestling Beatle, really the best gimmick that a major promotional organization could come up with? And who would charge fans to watch a wrestler named the Gobbeldy Gooker emerge from an egg? In an attempt to answer such questions and figure out just what the promoters were thinking, authors Randy Baer and R.D. Reynolds go beyond what wrestling fans saw on the screen and delve into the mindset of those in the production booth. In some instances, the motivations driving the spectacle prove even more laughable than what was actually seen in the ring. Covering such entertainment catastrophes as an evil one - eyed midget and a wrestler from the mystical land of Oz, not to mention the utterly comprehensible Turkey - on - a - Pole match (a gimmick which AWA fans might recall), WrestleCrap is hysterically merciless in its evaluation of such organizations as the WCW and the WWF. This retrospective look at the wrestling world's misguided attempts to attract viewers will leave wrestling fans and critics alike in stitches","torrent":{"xt":"urn:btih:2b2a523d07376537ecc6066984bacc5918bf8214","amp;dn":"WrestleCrap%3A+The+Very+Worst+of+Professional+Wrestling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b2a523d07376537ecc6066984bacc5918bf8214","infoHashBuffer":{"type":"Buffer","data":[43,42,82,61,7,55,101,55,236,198,6,105,132,186,204,89,24,191,130,20]},"announce":[],"urlList":[]}}