{"title":"J.J. Cale - Naturally (1972) [Jazz][mp3 320][h33t][schon55]","uid":4882096,"size":77903195,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b5116806c7da35282cc3ab02305bf843abb0e33&amp;dn=J.J.+Cale+-+Naturally+%281972%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":18,"time":1241445663,"description":"J.J. Cale - Naturally\nYear: 1972\nLabel: Mercury\nTotal playing: 32:07\nBitrate: 320 kbps\n\nThis quiet and leisurely album from an excellent guitarist, vocalist, and songwriter is a charmer.  J.J. Cale has a unique approach to funk, blues, and country and all it involves is taking things at just as relaxed and mellow a pace as the human metabolism will allow.  Here it results in one of the most enjoyable debut albums heard in some time.  Cale is currently hitting the AM charts with a very unlikely number, &quot;Crazy Mama,&quot; a typical Cale blues, done with a small rhythm section and his own incredibly controlled lead guitar playing.  Its tempo is so unusually calm it is the last thing you would expect to hear blasting over your local Bill Drake outlet.  The same contrast in pace is evident in the difference between Eric Clapton's version of &quot;After Midnight&quot; and the one done here by the song's author. Cale doesn't so much slow it down as ease it up. With the bass carrying the modest band arrangement via an intricately repeated line, Cale lets the guitar, voice, and song speak for themselves while the production provides just enough color to keep the song moving. It is a perfect blend for the number and results in one of the album's highlights. Part of Cale's talent consists in his ability to unify disparate elements. Even when he uses horns on &quot;Nowhere to Run&quot; or &quot;Bringing It Back&quot; the album suffers from no interruption in mood, as this additional element is perfectly blended with the more skeleton framework heard on the rest of the cuts. Likewise his ability to unify tempos, for no matter what real pace he takes a song at, it comes out sounding like nothing more than an extension of basic J.J. Cale time, which is heard from the record's beginning to end. Cale's lyrics are appropriately simple but always effective. Many of his songs deal with missing women and the resulting problems; others with feeling bad for no explicit reason.  Possibly the album's best cut, and its simplest, is of the latter type.  &quot;Crying Eyes&quot; contains all the musical virtues of Cale's style as well as its most emotional, personal and affecting statement of them. The only problem with this album is that Cale is not yet strong enough to pull off his goal, which was to produce a record completely unified in mood and sound. Occasionally the continuity he achieves leads to a feeling of sameness and then boredom.  Which is only to say that the excellence of this album rests more in its individual highpoints than in the record as a complete entity. That accomplishment lies ahead of J.J. Cale but there is every reason to think he'll get it next time around.  ~ Jon Landau (www.rollingstone.com)\n\nPersonnel:\nJ.J. Cale (Guitar and Vocals) \nKarl Himmel (Drums) - 4-8,10-12 \nChuck Browning (Drums) - 3,9 \nTim Drummond (Bass Guitar) - 4-6,8,11 \nCarl Radle (Bass Guitar) - 7,10,12 \nNorbert Putnam (Bass Guitar) - 3,9 \nBob Wilson (Piano) - 4-6,8,11 \nDavid Briggs (Piano and Organ) - 3,9 \nJerry Whitehurst (Piano) - 3,9 \nWeldon Myrick (Steel Guitar) - 1,2 \nBuddy Spiker (Fiddle) - 6 \nShorty Lavender (Fiddle) - 6 \nWalter Haynes (Dobro) - 6 \nEd Colis (Harmonica) - 4-6,8,11 \nMac Gayden (Slide Guitar) - 7,10 \nDiane Davidson (Backing Vocals) - 7,10\n\nJ.J. Cale - Naturally Tracks:\n01 Call Me The Breeze (J.J. Cale) 2:41 \n02 Call The Doctor (J.J. Cale) 2:27 \n03 Don't Go To Strangers (J.J. Cale) 2:27 \n04 Woman I Have (J.J. Cale) 2:37 \n05 Magnolia (J.J. Cale) 3:27 \n06 Clyde (J.J. Cale/C.W. Beavers) 2:35 \n07 Crazy Mama (J.J. Cale) 2:24 \n08 Nowhere To Run (J.J. Cale) 2:29 \n09 After Midnight (J.J. Cale) 2:25 \n10 River Runs Deep (J.J. Cale) 2:44 \n11 Bringing It Back (J.J. Cale) 2:32 \n12 Crying Eyes (J.J. Cale) 3:12","torrent":{"xt":"urn:btih:2b5116806c7da35282cc3ab02305bf843abb0e33","amp;dn":"J.J.+Cale+-+Naturally+%281972%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b5116806c7da35282cc3ab02305bf843abb0e33","infoHashBuffer":{"type":"Buffer","data":[43,81,22,128,108,125,163,82,130,204,58,176,35,5,191,132,58,187,14,51]},"announce":[],"urlList":[]}}