{"title":"The.Mysterious.Cities.of.Gold.Secret.Paths-SKIDROW","uid":9239982,"size":1601048263,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2bb045921045cc22344e7222566c19abeab7d5cf&amp;dn=The.Mysterious.Cities.of.Gold.Secret.Paths-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mr.Stifmeister","files":2,"time":1385244957,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nMysterious Cities of Gold Secret Paths (c) Plug in Digital\n\n21.11.2013........Release Date - Protection...............Steam\nDVD...............Release Type - Game Genre...........Adventure\n\nRELEASE NOTES\n\nPlay Esteban, Zia and Tao through numerous tricky levels full of\npuzzles, traps and infiltration phases in a wide variety of diverse\ngorgeous settings. Explore every nook and cranny of China, and escape\nZars hostile men, searching for the local City of Gold.\n\nFaithful to the story-line and art style of the famous Mysterious\nCities of Gold anime cartoon, Secret Paths lets you dig deep in this\nwonderful cross-media universe. You get to play with all the main\ncharacters, and each hero has his own set of qualities that you will\nneed to use smartly when approaching the different challenges. Pick\nbetween them wisely - Their personality matters\n\nFeatures:\n\nGorgeous graphics completely faithful and loyal to the original\nMysterious Cities of Gold art style that we all love.\n\nNumerous tricky levels: Expand the Mysterious Cities of Gold cartoon\nuniverse by playing the levels that unlock for free at the same pace\nthe episodes air on television.\n\nBeautiful settings: Explore various environments, from the deep asian\nforests, to the heart of the Forbidden City, to the mythic Chinese\nCity of Gold.\n\nCollectibles: Unlock high-quality cinematic cut-scenes extracted\nstraight from the Mysterious Cities of Gold cartoon and bunch of\nexclusive artworks and virtual items.\n\nThink before you act: Use the specific skills and attributes of the\nthree friends to your advantage when facing the multiple traps,\npuzzles and hurdles thrown in your way.\n\nInfiltration: Escape arch-enemy Zars and his men by untangling the\nriddled paths to discover the secret of the Mysterious Cities of Gold.\n\nMade by Fans for Fans: the developers behind the Mysterious Cities of\nGold are true fans of the anime, who have grown up watching the first\nseason of the cartoon in their childhood some 30 years ago\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:2bb045921045cc22344e7222566c19abeab7d5cf","amp;dn":"The.Mysterious.Cities.of.Gold.Secret.Paths-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bb045921045cc22344e7222566c19abeab7d5cf","infoHashBuffer":{"type":"Buffer","data":[43,176,69,146,16,69,204,34,52,78,114,34,86,108,25,171,234,183,213,207]},"announce":[],"urlList":[]}}