{"title":"Over The Top  (1987)  DVD-R  NTSC","uid":4965555,"size":4304982016,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2daab0220fc6deefbc05ba6a18675a61eef5e088&amp;dn=Over+The+Top++%281987%29++DVD-R++NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1245516878,"description":"Over the Top (1987)\n\n\n\n\nDirected by Menahem Golan \nProduced by Menahem Golan\nYoram Globus \nWritten by Gary Conway &amp;\nDavid Engelbach (story)\nStirling Silliphant &amp;\nSylvester Stallone (screenplay) \nStarring Sylvester Stallone\nRobert Loggia\nSusan Blakely\nRick Zumwalt\nDavid Mendenhall \nMusic by Giorgio Moroder \nCinematography David Gurfinkel \nEditing by James R. Symons\nDon Zimmerman \nDistributed by Warner Bros. Pictures (USA)\nCannon Films (non-USA) \nRelease date(s) February 12, 1987 \nRunning time 93 min. \nLanguage English \n\n\n\nOver the Top is a 1987 dramatic chase film starring Sylvester Stallone, produced and directed by Menahem Golan about a long haul truck driver who tries to win back his alienated son while becoming a champion arm wrestler. The screenplay was written by Stirling Silliphant and Sylvester Stallone. The original music score is composed by Giorgio Moroder.\n\nLincoln Hawk is a struggling trucker who arm wrestles on the side to make extra cash while trying to rebuild his life. Hawk's wife Christina is very ill at the beginning of the film, and asks that Hawk pick up their son Michael from military school so that he may get to know his son since they have been apart since Hawk left them ten years earlier. His father-in-law Jason Cutler is enraged since he feels his daughter was deserted by Hawk, that his daughter and Hawk should never have been married in the first place, and that Hawk has no right to be in his grandson's life.\n\nOver the course of a cross country trip, Mike comes to trust his father until learning about his mother's death while they are on the road. Feeling he would have been there with her if not for Hawk, he leaves for his grandfather's estate. The film continues with Mike realizing that his grandfather has been hiding the truth about his father - the grandfather did everything possible to drive his parents apart and has been intercepting and hiding the regular letters Hawk had written to his son over the last few years. Eventually, Lincoln competes in the world arm wrestling competition, held at the Las Vegas Hilton. His hope is to win the grand prize of an expensive, new semi-truck and thus be able to start his own independent trucking business. Mike, stunned by his grandfather's deceptions, goes to the Hilton and finds Hawk. Apologizing for misjudging him, Mike gives Hawk the emotional support he needs to compete and he emerges from the contest victorious. As father and son celebrate, Cutler (who had followed Mike to the competition) looks on in silence, realizing he has lost any chance at regaining Mike's love.\n\n\n\nLanguages:  English, French (2.0)\nSubs:       English, French, Spanish\nAspect Ratio: 2.35:1 \nWidescreen 16:9\nClosed Captioned\nNTSC\n\n\n\n\nUntouched\n\n\n\n","torrent":{"xt":"urn:btih:2daab0220fc6deefbc05ba6a18675a61eef5e088","amp;dn":"Over+The+Top++%281987%29++DVD-R++NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2daab0220fc6deefbc05ba6a18675a61eef5e088","infoHashBuffer":{"type":"Buffer","data":[45,170,176,34,15,198,222,239,188,5,186,106,24,103,90,97,238,245,224,136]},"announce":[],"urlList":[]}}