{"title":"Iron Maiden - The Soundhouse Tapes [320k MP3]","uid":11404977,"size":32881205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e1734bec9c9d96732941883c2467b4ae5bc8b30&amp;dn=Iron+Maiden+-+The+Soundhouse+Tapes+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1415467179,"description":"The Soundhouse Tapes is the debut EP by Iron Maiden, and features the very first recordings by the band. Released on 9 November 1979, it features three songs taken from the demo tape recorded at Spaceward Studios on New Year's Eve 1978. The three tracks - &quot;Prowler&quot;, &quot;Invasion&quot; and &quot;Iron Maiden&quot; - appear in a rougher form than they would on the first Iron Maiden album and subsequent singles as they were all recorded in one session.\n\nAlthough major retail chains tried to order large quantities of the record, the band only distributed 5,000 copies, available by mail order alone, which eventually sold out in just a few weeks. Because of this, the EP is now a valuable collectors item, which has been sold at up to Â£800 online.\n\nIn late 1979, while waiting to sign their deal with EMI, the band decided to release the demo on their own label, Rock Hard Records, on 9 November 1979. Entitled The Soundhouse Tapes after Kay's club, Steve Harris explains that they decided to release the EP &quot;because everywhere we'd go we'd do really well at the gigs, and then afterwards there'd be, like, all these fans asking where they could buy one of our records and when we told 'em there wasn't any yet they couldn't believe it. They'd seen the charts in Sounds and a lot of 'em just assumed we must already have a record deal of some kind, but we didn't. Not then. So then, they'd be, like, 'Well, where can we get a copy of the tape?' And I think that's when we really got the idea of putting the Spaceward demo out as an actual record.&quot;  Although the original demo had included four songs, &quot;Strange World&quot; was excluded from the record as the band were unsatisfied with the quality of the track's production.\n\nTrack Listing [320k MP3]\n\n1. \t&quot;Iron Maiden&quot;   \t4:01\n2. \t&quot;Invasion&quot;   \t3:07\n3. \t&quot;Prowler&quot;   \t4:20","torrent":{"xt":"urn:btih:2e1734bec9c9d96732941883c2467b4ae5bc8b30","amp;dn":"Iron+Maiden+-+The+Soundhouse+Tapes+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e1734bec9c9d96732941883c2467b4ae5bc8b30","infoHashBuffer":{"type":"Buffer","data":[46,23,52,190,201,201,217,103,50,148,24,131,194,70,123,74,229,188,139,48]},"announce":[],"urlList":[]}}