{"title":"Dallas 10x01 Return to Camelot part1.avi","uid":4750769,"size":223327372,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2e80e9d550ed88170baabf95477263b6b52602e9&amp;dn=Dallas+10x01+Return+to+Camelot+part1.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juuzto","files":1,"time":1236174931,"description":"The long dream is over.\nYes boys and girls, autobots and decepticons, illegal aliens and crossdressers all-alike: DALLAS is back with season 10!\n\n\nPam's stunned to find Bobby alive in her shower, the events from his death onward all a dream; J.R. seeks to divorce Sue Ellen; Cliff tries to unite independent oil companies; Ray and Donna's marital strife continues.\n\nFirst Aired: 9/26/1986\nPam had her infamous dream the night Bobby slept over after proposing to her in &quot;Swan Song&quot;, but Bobby was already being stalked. This storyline was never revisited after she woke up, nor was the resolution to Marchetta's death or Dusty's split from his wife.\nThe revelation of the dream had effects on other characters besides Bobby Ewing. Katherine Wentworth was now alive again, Mark Graison returned to the &quot;presumed dead&quot; status. Jamie Ewing Barnes and Sue Ellen Ewing were also likely revived (the final episode of the previous season did not confirm their deaths but they were deemed likely by events).\nDallas executive producer Leonard Katzman told TV Guide that he regards Bobby's return from the dead (in this episode) and the shooting of J.R. as his greatest Dallas coups. Regarding Bobby's return as a dream, he stated &quot;We took a lot of heat, but it was the thing that revived the show.&quot;\nSeveral fake resolutions to Patrick Duffy's return were filmed and leaked to the tabloids in an effort to keep the resolution of Pam's dream a secret. Among the false resolutions was 1) Duffy was back as Bobby's twin, 2)Duffy was back as an impostor impersonating Bobby and 3) Bobby hadn't really died in 8th season finale but was secretly revived at the last minute.\n\n\n\nnote: IÃ‚Â´m still in progress of downloading season 10 episodes myself, will post them here when able.","torrent":{"xt":"urn:btih:2e80e9d550ed88170baabf95477263b6b52602e9","amp;dn":"Dallas+10x01+Return+to+Camelot+part1.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e80e9d550ed88170baabf95477263b6b52602e9","infoHashBuffer":{"type":"Buffer","data":[46,128,233,213,80,237,136,23,11,170,191,149,71,114,99,182,181,38,2,233]},"announce":[],"urlList":[]}}