{"title":"Tony Fletcher A Light That Never Goes Out The Enduring Saga of t","uid":12174766,"size":6123413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ec746fadd364a80393f887708ca8036247946d8&amp;dn=Tony+Fletcher+A+Light+That+Never+Goes+Out+The+Enduring+Saga+of+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Hand_of_Doom","files":3,"time":1438291693,"description":"They were, their fans believe, the best band in the world. Critics and sales figures told a similar story: six albums between 1984 and 1988 made number one or number two in the UK charts. Twenty-five years after their break-up, the band remain as adored and discussed as ever. To this day, there is a collective understanding that The Smiths were one of the greatest of all British bands. The Smiths - Morrissey, Johnny Marr, Andy Rourke and Mike Joyce - were four working-class youths who came together, by fate or chance, in Manchester in the early 1980s. Their sound was both traditional and radically different, a music that spoke to a generation, and defied the dark social-economic mood of the Thatcher years. By early 1984, barely a year after their first headlining gig, they were the hottest - certainly the hippest - name in modern music. In the years that followed the group produced an extraordinary body of work: seventeen classic singles, seven albums, and [some] seventy songs composed by the team of Morrissey and Marr. Yet for all their brilliance and adoration - their famously energetic live shows routinely interrupted by stage invasions - The Smiths were continually plagued by their own reticence to play the game, and by the time of 1987's Strangeways Here We Come, they had split. The Smiths have never played together again - their enormous contribution to pop culture forever condensed into a prolific and prosperous halcyon period, their legacy intact and untarnished. Thirty years after their formation, twenty-five since they broke up, The Smiths' firmament remains as bright as ever. It's time their tale was told. Tony Fletcher's A Light That Never Goes Out is a meticulous and evocative group biography - part celebration, part paean - moving from Manchester in the nineteenth-century to the present day to tell the complete story of The Smiths. Penned by a contemporary and life-long fan, and the product of extensive research, dozens of interviews, and unprecedented access, it will serve to confirm The Smiths as one of the greatest, most important and influential rock groups of all time","torrent":{"xt":"urn:btih:2ec746fadd364a80393f887708ca8036247946d8","amp;dn":"Tony+Fletcher+A+Light+That+Never+Goes+Out+The+Enduring+Saga+of+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec746fadd364a80393f887708ca8036247946d8","infoHashBuffer":{"type":"Buffer","data":[46,199,70,250,221,54,74,128,57,63,136,119,8,202,128,54,36,121,70,216]},"announce":[],"urlList":[]}}