{"title":"The Best of the Runaways [FLAC+MP3]","uid":9512876,"size":422109901,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2fac3245eece8099ddd9d7367599802618abfe05&amp;dn=The+Best+of+the+Runaways+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"Big-Papi","files":-1,"time":1390449320,"description":"The Best of the Runaways [FLAC+MP3] (Big Papi)\n\nSource: 1987 CD\n\n\nBy hyperbolium\nAt the time this was originally issued, it was one of only two Runaways CDs in print domestically. Yet even with their catalog freely available, this compilation still provides a valuable, condensed overview of their career. A good introduction for those unfamiliar, or those who simply want a single disc's worth of their music.\nThe 13 tracks include cuts from their 3 US studio albums (&quot;The Runaways&quot;, &quot;Queens of Noise&quot; and &quot;Waitin' for the Night&quot;), as well as their Japanese/Canadian live LP &quot;Live in Japan&quot;, and the English release &quot;Flaming School Girls.&quot;\n\nThe track selection heavily emphasizes Joan Jett's contribution to the band, which is reasonable when you look at their overall history. Original vocalist Cherie Curie sings lead on only three of the eight tracks taken from the four albums (three studio, one live) on which she was present. Jett takes the lead vocals on 10 of the disc's 13. Jett wrote or co-wrote all but two.\n\nIn some sense this seems a slight to Curie, but over the lifetime of the band it's clear that Jett was the dominant force. Initially it seems that their manager/Svengali, Kim Fowley, was the dominant factor, but Jett quickly asserted herself, both as a songwriter and vocalist. By the third LP (and with the departure of Curie), Jett had completely cemented her leadership.\n\nThe track selection is quite good, though I might have picked different tracks here and there (e.g., the vault track &quot;C'mon&quot; could be lost without damaging the program). Jett's grungy rhythm guitar and Sandy West's pounding drum style push this music along. Lita Ford's lead guitar playing is a lot better on these late 70's studio tracks than it was in the live shows.\n\nOf the live tracks, &quot;Queens of Noise&quot; and &quot;You Drive Me Wild&quot;, I like the latter better. The live version of &quot;Queens of Noise&quot; really doesn't add anything to that done in the studio, the production doesn't have the same pop, and Cherie Curie's vocals sound more forced. I would have rather seen them include a non-studio track from the live LP (e.g., Sandy West's version of &quot;Wild Thing&quot;.)\n\nStrangely, condensing the Runaways canon onto a single disc seems to give their music a lot more legitimacy. The embarrassing cover versions (e.g., their version of &quot;Rock 'n' Roll&quot; with the big gap where the guitar solo should've been, or the later, horrid version of &quot;Strawberry Fields&quot;) are gone, and what's left sounds good.\n\nThe liner notes give a short history of the Runaways, the track notes are basically non-existent (giving only the LP the track was taken from). The pictures used on the front insert are taken from the full-color 12x12 photos that were included in the original Japanese pressing of the live LP.\n\nFor those who are new to the Runaways, this is a good introduction. The impression it will create, devoid of the hype surrounding the band (e.g., monthly articles and photos in magazines such as Creem, Circus and Craw- daddy) is likely to be rather different than that created when the music was first issued. Especially now that female-rockers are a bit more commonplace (and especially since Joan Jett and Lita Ford have had successful solo careers).","torrent":{"xt":"urn:btih:2fac3245eece8099ddd9d7367599802618abfe05","amp;dn":"The+Best+of+the+Runaways+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fac3245eece8099ddd9d7367599802618abfe05","infoHashBuffer":{"type":"Buffer","data":[47,172,50,69,238,206,128,153,221,217,215,54,117,153,128,38,24,171,254,5]},"announce":[],"urlList":[]}}