{"title":"RealtimeBondage--Tagteamed Cherry Torn utterly destroyed by cock","uid":9701556,"size":1925295143,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:30821beb95aebcb7aa7f2a9b7f78c73d833c31de&amp;dn=RealtimeBondage--Tagteamed+Cherry+Torn+utterly+destroyed+by+cock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1394005345,"description":"Tagteamed Cherry Torn utterly destroyed by cock! Brutal deepthroat, massive 10 inch BBC! | Cherry Torn\n\nMarch 4, 2014\n\n\nMP4 only.\n\n\nFor the first time, Sexuallybroken is doing live shows. All action flowing in real time right in front of your eyes. And there is no better person to in the the inaugural debut of our live Sexuallybroken shows then Cherry Torn. Cherry is a natural born pervert that craves the rough handling and bondage that Sexuallybroken specializes in. Today this cum slut will get worked over until her brain meat melts.\n\nYou do not need fancy bondage to bind a bitch. A neck rope that makes a convenient handle and elbows and wrists tied together is all it takes. Cherry is rendered completely helpless. A wooden tongue trap keeps her pink tongue out and jutting, signaling her eagerness for rock hard cock to be introduced to the back of her throat. The tongue trap makes it so that she can not block or push out the dick. All she can to is accept her throat being plowed.\n\nWhich is exactly what we do. We simply walk right up and own her face. Cherry sputters and gasps and the drools pours out as her eyes glaze over. The cocks run a train on her face, but this is just the warmup. Moving quickly, we haul out a table and throw Cherry down on it so that she can be properly spit roasted with cock. Cherry is dicked down from both ends, and the vacant blissful look on her face shows just how far she has done down the sexual rabbit hole.\n\nThe show is only just getting started, Cherry has a lot more in store for all 3 of her holes. We yank her off the fuck table and pull up her arms into a strict strappado. This position again exposes both ends of her for the dick. We ream her from both ends, making a Cherry Torn sandwich. She cums helplessly as the cock owns her cunt. This is the first of a four part show, as throughly as Cherry has been fucked, this was just the warm up. We unbind her and have her kneel, legs spread wide to properly display her pussy and tongue out wide, a perfect slave position to await her upcoming fate. \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/03_04ctorn4/RealTimeBondage-Cherry-Torn-Tagteamed-Cherry-Torn-utterly-destroyed-by-cock-Brutal-deepthroat-massive-10-inch-BBC.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/03_04ctorn4/RealTimeBondage-Cherry-Torn-Tagteamed-Cherry-Torn-utterly-destroyed-by-cock-Brutal-deepthroat-massive-10-inch-BBC.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:30821beb95aebcb7aa7f2a9b7f78c73d833c31de","amp;dn":"RealtimeBondage--Tagteamed+Cherry+Torn+utterly+destroyed+by+cock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30821beb95aebcb7aa7f2a9b7f78c73d833c31de","infoHashBuffer":{"type":"Buffer","data":[48,130,27,235,149,174,188,183,170,127,42,155,127,120,199,61,131,60,49,222]},"announce":[],"urlList":[]}}