{"title":"Bad English - Straight To Your Heart  (2nafish)","uid":5336750,"size":159254532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:318d60a1b45fbbe7c068de495cf85c66abd34106&amp;dn=Bad+English+-+Straight+To+Your+Heart++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265343674,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis videos has no logos or titles.\n\n\nBacklash, is the second and final album by American AOR supergroup Bad English, released in 1991.\n\nBad English was an American rock band supergroup formed in 1988, reuniting keyboardist Jonathan Cain with singer John Waite and bassist Ricky Phillips, his former bandmates in The Babys.\n\nThe members decided on a name for the band while playing pool. John Waite missed a shot and Jonathan Cain made a comment on how bad his &quot;english&quot; was (referring to the spin a player puts on the cue ball) and the band decided to use the phrase.\n\nJonathan Cain and guitarist Neal Schon, who had enjoyed enormous success in Journey, continued on to form Bad English with Waite after Journey disbanded. The first album, eponymously titled, was a big seller with three hit singles, including the number one hit &quot;When I See You Smile&quot; written by Diane Warren, the top 10 hit &quot;Price of Love,&quot; and &quot;Possession.&quot; Another track from the debut album, the AOR song &quot;Best of What I Got&quot;, was featured in the soundtrack to 1989's Tango and Cash[3].\n\nThe band's second album, 1991's &quot;Backlash&quot; came and went without any fanfare. The only single, &quot;Straight To Your Heart,&quot; just missed the Top 40, peaking at #42. Ricky Phillips writes on his website that the group had parted company before the second album had been mixed. Both Phillips and guitarist Neal Schon expressed frustration with the &quot;pop&quot; side of the bands songs and wanted a harder edge. In the end, it proved to be the band's undoing as everyone left to pursue other projects.\n\nIn later interviews Waite revealed that although he loved playing to stadium-sized audiences, he was uncomfortable with the corporate rock image that he felt the band had presented and has been a solo artist ever since.\n\nBad English drummer Deen Castronovo later went on to join a reformed Journey with singer Steve Augeri, Neal Schon, Jonathan Cain, and Ross Valory. He also played on Ozzy Osbourne's album Ozzmosis in 1995.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:318d60a1b45fbbe7c068de495cf85c66abd34106","amp;dn":"Bad+English+-+Straight+To+Your+Heart++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"318d60a1b45fbbe7c068de495cf85c66abd34106","infoHashBuffer":{"type":"Buffer","data":[49,141,96,161,180,95,187,231,192,104,222,73,92,248,92,102,171,211,65,6]},"announce":[],"urlList":[]}}