{"title":"The Strokes - Comedown Machine [24 bit FLAC] vinyl","uid":8365226,"size":883545959,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31e3d3c02308b177d97fc9ceb92dfe7c7ec3f844&amp;dn=The+Strokes+-+Comedown+Machine+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1365745256,"description":"  The Strokes - Comedown Machine (2013) [24 bit FLAC] vinyl\n\n  Released: 2013\n  Source: 88765 45579 1 / Europe\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Tap Out\n  A2. All The Time\n  A3. One Way Trigger\n  A4. Welcome To Japan\n  A5. 80s Comedown Machine\n  B1. 50/50\n  B2. Slow Animals\n  B3. Partners In Crime\n  B4. Chances\n  B5. Happy Ending\n  B6. Call It Fate, Call It Karma\n\n  Arriving a relatively quick two years after Angles, Comedown Machine reunites the Strokes with producer Gus Oberg, but the results sound a lot less slick and overwrought. Instead, Oberg provides a clean, intimate sound that feels like a natural progression for the band, with a mix of chugging guitars and synths that feels more organic and less like blatant '80s worship (and also bears a striking similarity to Julian Casablancas' solo album Phrazes for the Young). Likewise, most of Angles' uneven but entertaining tangents are smoothed away, making it one of the Strokes' more consistent albums in some time. True to its name, however, Comedown Machine is also some of the band's most subdued music: there are fewer uptempo songs than might be expected, and even when their amps are cranked, the Strokes aren't exactly carefree. &quot;All the Time&quot;'s refrain of &quot;You're livin' too fast&quot; is a far cry from &quot;Room on Fire&quot;'s &quot;Please don't slow me down if I'm going too fast,&quot; and on the album's most quintessential rocker, &quot;50/50,&quot; Casablancas snarls &quot;Don't judge me&quot; over artfully mussed guitars in a way that feels more defensive than defiant. For most of Comedown Machine, the band uses some of its prettiest melodies -- and some impressive falsetto vocals -- to craft a vulnerable, quietly confrontational mood on songs like &quot;Tap Out&quot; and &quot;Slow Animals,&quot; which has an almost soulful roundness to its melody as Casablancas wonders, &quot;Is it gone?&quot; They venture deeper into this softer territory on the album's title track, which rivals First Impressions of Earth's &quot;Ask Me Anything&quot; in its dreamy introspection, and on &quot;Chances,&quot; which boasts soft-focus keyboards that flirt with chillwave. At times, the band's precise playing and Oberg's pristine production border on airless and only emphasize the fact that the Strokes left the reckless charm of Is This It behind years ago. However, their flair for hooks and melodies is as strong as ever, particularly on &quot;Partners in Crime,&quot; &quot;Welcome to Japan,&quot; and &quot;One Way Trigger,&quot; which sets pre-life crisis laments to a perky keyboard riff reminiscent of a-ha's &quot;Take on Me.&quot; the Strokes' most mature music yet, Comedown Machine is a solidly enjoyable album, even if it lacks some of the band's previous spark.","torrent":{"xt":"urn:btih:31e3d3c02308b177d97fc9ceb92dfe7c7ec3f844","amp;dn":"The+Strokes+-+Comedown+Machine+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31e3d3c02308b177d97fc9ceb92dfe7c7ec3f844","infoHashBuffer":{"type":"Buffer","data":[49,227,211,192,35,8,177,119,217,127,201,206,185,45,254,124,126,195,248,68]},"announce":[],"urlList":[]}}