{"title":"Yes - Yes (1969) [FLAC] {2003 Rhino Remaster} -  {troma}","uid":5142706,"size":503202849,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31fb27571628f9127f1dc0d434ac98540e052bd1&amp;dn=Yes+-+Yes+%281969%29+%5BFLAC%5D+%7B2003+Rhino+Remaster%7D+-++%7Btroma%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tromaster","files":32,"time":1257033792,"description":"Yes - Yes [2003 Rhino Remaster]\n\n\nAMG's Bruce Eder says:\nYes' debut album is surprisingly strong, given the inexperience of all those involved at the time. In an era when psychedelic meanderings were the order of the day, Yes delivered a surprisingly focused and exciting record that covered lots of bases (perhaps too many) in presenting their sound. The album opens boldly, with the fervor of a metal band of the era playing full tilt on &quot;Beyond and Before&quot;, but it is with the second number, a cover of the Byrds' &quot;I See You&quot;, that they show some of their real range. The song is highlighted by an extraordinary jazz workout from lead guitarist Peter Banks and drummer Bill Bruford, that runs circles around the original by Roger McGuinn and company. &quot;Harold Land&quot; was the first song on which Chris Squire's bass playing could be heard with anything resembling the prominence it would eventually assume in their sound, and anticipates in its structure the multi-part suites the group would later record, with its extended introduction and its myriad shifts in texture, timbre, and volume. And then there is &quot;Every Little Thing&quot;, the most daring Beatles' cover ever to appear on an English record, with an apocalyptic introduction and extraordinary shifts in tempo and dynamics; Banks' guitar and Bruford's drums are so animated that they seem to be playing several songs at once. This song also hosts an astonishingly charismatic performance by Jon Anderson. There were numerous problems in recording this album, owing to the inexperience of the group, the producer, and the engineer, in addition to the unusual nature of their sound. Many of the numbers give unusual prominence to the guitar and drums, thus making it the most uncharacteristic of all the group's albums. Its first decent-sounding edition anywhere came with the 1997 remastering by Atlantic.\n\nIn January of 2003, Yes was reissued by Rhino Records in a newly expanded and remastered edition, with crisper, much closer, more intimate and powerful sound, new notes by Mike Tiano, and six bonus tracks that enlarge the running time by 38 minutes. The latter are comprised of two early renditions of &quot;Dear Father&quot; (a single that surfaced in a very different rendition after the LP), early and finished versions of the &quot;lost&quot; B-side &quot;Something's Coming&quot;, and &quot;Everydays&quot; in its single version and an early attempt. The main virtue even for the casual listener will be the improved sound, which captures the nuances and the delicacy of the playing better than any prior edition, matching the 2001-vintage Japanese &quot;paper sleeve&quot; series remastered version, which had none of these bonus tracks.[/color]\n\nTracklist:\n01. Beyond and Before\n02. I See You\n03. Yesterday and Today\n04. Looking Around\n05. Harold Land\n06. Every Little Thing\n07. Sweetness\n08. Survival\nBonus tracks:\n09. Everydays [Single Version]\n10. Dear Father [Early Version #2]\n11. Something's Coming\n12. Everydays [Early Version]\n13. Dear Father [Early Version #1]\n14. Something's Coming [Early Version]\n\nThe musicians:\nJon Anderson - lead singer, incidental percussion\nPeter Banks - guitar, vocals\nTony Kaye - organ, piano\nChris Squire - bass, vocals\nBill Bruford - drums, vibes\n\nRecorded at Advision Studios, London, and Trident Studios, London, in Spring 1969.\nReleased on 25 July 1969.\nProduced by Paul Clay &amp; Yes.\nEngineered by Gerald Chevin.\nThis remastered and expanded edition released on 14 January 2003.\nLabel: Elektra/Rhino.\nGenre: Progressive Rock.\n\nRipped with EAC in Secure mode, Test &amp; Copy.\nEncoded with FLAC Frontend at level 8, with full tagging.\nIncludes full artwork, EAC CUE and LOG files, AudioChecker log, and NFO file.\n\nBe fair &amp; share!\n","torrent":{"xt":"urn:btih:31fb27571628f9127f1dc0d434ac98540e052bd1","amp;dn":"Yes+-+Yes+%281969%29+%5BFLAC%5D+%7B2003+Rhino+Remaster%7D+-++%7Btroma%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31fb27571628f9127f1dc0d434ac98540e052bd1","infoHashBuffer":{"type":"Buffer","data":[49,251,39,87,22,40,249,18,127,29,192,212,52,172,152,84,14,5,43,209]},"announce":[],"urlList":[]}}