{"title":"Body of Secrets Anatomy of the Ultra Secret N S A [B.B.S.]","uid":6606509,"size":5972858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32d9061d96f15979753393b4a4c14b61ffaefc4d&amp;dn=Body+of+Secrets+Anatomy+of+the+Ultra+Secret+N+S+A+%5BB.B.S.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313419383,"description":"    Body of Secrets: Anatomy of the Ultra-Secret National Security Agency \n\n\n\n\n\n\nEverybody knows about the CIA--the cloak-and-dagger branch of the U.S. government. Many fewer are familiar with the National Security Agency, even though it has been more important to American espionage in recent years than its better-known counterpart. The NSA is responsible for much of the intelligence gathering done via technology such as satellites and the Internet. Its home office in Maryland &quot;contains what is probably the largest body of secrets ever created.&quot;\n\nLittle was known about the agency's confidential culture until veteran journalist James Bamford blew the lid off in 1982 with his bestseller The Puzzle Palace. Still, much remained in the shadows. In Body of Secrets, Bamford throws much more light on his subject--and he reveals loads of shocking information. The story of the U-2 crisis in 1960 is well known, including President Eisenhower's decision to tell a fib to the public in order to protect a national-security secret. Bamford takes the story a disturbing step forward, showing how Eisenhower &quot;went so far as to order his Cabinet officers to hide his involvement in the scandal even while under oath. At least one Cabinet member directly lied to the committee, a fact known to Eisenhower.&quot; Even more worrisome is another revelation, from the Kennedy years: &quot;The Joint Chiefs of Staff drew up and approved plans for what may be the most corrupt plan ever created by the U.S. government. In the name of anticommunism, they proposed launching a secret and bloody war of terrorism against their own country in order to trick the American public into supporting an ill-conceived war they intended to launch against Cuba.&quot;","torrent":{"xt":"urn:btih:32d9061d96f15979753393b4a4c14b61ffaefc4d","amp;dn":"Body+of+Secrets+Anatomy+of+the+Ultra+Secret+N+S+A+%5BB.B.S.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32d9061d96f15979753393b4a4c14b61ffaefc4d","infoHashBuffer":{"type":"Buffer","data":[50,217,6,29,150,241,89,121,117,51,147,180,164,193,75,97,255,174,252,77]},"announce":[],"urlList":[]}}