{"title":"Moving Mountains (2013) [FLAC]","uid":8941998,"size":279826349,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3310ef24f82e20921b0c445933acfffe4d6e6b61&amp;dn=Moving+Mountains+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1379685612,"description":"\n  Moving Mountains (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Post-Rock, Indie Rock\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Swing Set \n  02 Burn Pile \n  03 Hands \n  04 Seasonal \n  05 Eastern Leaves \n  06 Hudson \n  07 Under a Falling Sky \n  08 Chords \n  09 Apsides \n\n  Based out of Purchase, New York, Moving Mountains is a post-rock band who have made a name for themselves with their expansive approach to songwriting, building on the atmospheric, emo-infused sound of bands like the Appleseed Cast. The band was originally formed as a duo consisting of singer and guitarist Gregory Dunn and drummer Nicholas Pizzolato. Dunn, who was in high school at the time, was looking for a way to write songs that captured moments of his life in music, and with the help of Pizzolato, the two created the intricate, sweeping sound that would define Moving Mountains as a musical entity. In 2006, the pair recorded a self-titled demo EP that was leaked to the public without their knowledge through a music blog. While the duo was initially upset by the leaked material, it proved to be a boon, providing the band not only with feedback on their work, but also a small fan base. In 2007, Moving Mountains made their proper debut on their first full-length effort, Pneuma, which was initially self-released before eventually being put out through Deep Elm Records. That year the pair also upgraded to a quartet, recruiting guitarist Frank Graniero and bassist Mitchell Lee to round out the lineup so the band could begin performing live. With this new lineup intact, the band released another EP, Foreword, in 2008, and began touring heavily, setting out on the road with like-minded bands like Thursday and The Dear Hunter before eventually being invited to join the Vans Warped Tour in 2011. Later that year, the band released their sophomore full-length, Waves, through Triple Crown Records.","torrent":{"xt":"urn:btih:3310ef24f82e20921b0c445933acfffe4d6e6b61","amp;dn":"Moving+Mountains+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3310ef24f82e20921b0c445933acfffe4d6e6b61","infoHashBuffer":{"type":"Buffer","data":[51,16,239,36,248,46,32,146,27,12,68,89,51,172,255,254,77,110,107,97]},"announce":[],"urlList":[]}}