{"title":"Anti-Flag - Die For The Government VO","uid":3859114,"size":78858880,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:33c62a14cdaeef8a16a4af59fc441d65bf7c9983&amp;dn=Anti-Flag+-+Die+For+The+Government+VO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shdwwarlord","files":17,"time":1193375457,"description":"From AllMusic:\n&quot;Admittedly, it&amp;#039;s strange that an old school-sounding punk trio would criticize punk scene denizens thusly: &quot;Covered in leather, or plaid patches, or metal studs/Your hair is dyed or spiked with glue/You only talk to those who look and act the way you do/You scoff at how the cops treat you/But they&amp;#039;re no worse than dicks like you!&quot; (&quot;Punk by the Book&quot;). It&amp;#039;s even more strange in light of Anti-Flag&amp;#039;s Discharge/Rancid haircuts, a dog collar, and even a shirt that says &quot;destroy.&quot; But since they point out that what you think is more important than how you dress, fair enough, because they carry on a more crucial custom: warning MTV-polluted, 85-TV-channel youth that punk means doing something productive instead of being passive or getting drunk and into fights, and becoming aware of politics and history is a prerequisite before bitching about the government (such as the Pentagon&amp;#039;s attempts to pretend there is no Gulf War syndrome, as Anti-Flag points out). Criticism from within is the only kind that&amp;#039;s listened to. As well, on songs such as &quot;Safe Tonight&quot; and &quot;Police State in the U.S.A.,&quot; Anti-Flag tosses up the kind of vintage, early-&amp;#039;80s, So-Cal, melodic punk that B.Y.O., Frontier, Posh Boy, and other labels specialized in, and a ska song is welcome.&quot;\n\nThese are torrents I have brought to you from the expired OiNK. I give them to you as a token of memory for the dead OiNK and in the hope that a new site will rise to take its place. Enjoy.","torrent":{"xt":"urn:btih:33c62a14cdaeef8a16a4af59fc441d65bf7c9983","amp;dn":"Anti-Flag+-+Die+For+The+Government+VO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33c62a14cdaeef8a16a4af59fc441d65bf7c9983","infoHashBuffer":{"type":"Buffer","data":[51,198,42,20,205,174,239,138,22,164,175,89,252,68,29,101,191,124,153,131]},"announce":[],"urlList":[]}}