{"title":"Cars - A Celebration (DK Ebook).pdf","uid":13701811,"size":86070431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34051ea790b785b1c9186a4ea0b3459f50c699e9&amp;dn=Cars+-+A+Celebration+%28DK+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1456782938,"description":"Cars: A Celebration\r\nDorling Kindersley | 2001 | ISBN 0789481553 | English | 580 pages | PDF | 82 MB\r\n\r\nA fascinating road trip through almost half a century of classic car history, by well-known TV commentator and best-selling author Quentin Willson. Quentin Willson, the undisputed king of classic cars, takes a nostalgic spin through the golden days of motoring. Covering everything from kitsch cars to sleek roadsters in his inimitable style, he unveils a fabulous collection of over 150 classic cars. An encyclopedia of true classics. With a keen eye for performance and styling, Quentin Wilson has chosen a superb line-up of cars, mouthwateringly photographed, and furnished with all the facts and figures you'll ever need. From the curvaceous E-type to the legendary GT40, Wilson dishes up the detail on classic cars from all over the world. You can cruise through alphabetically arranged profiles, technical specifications, and construction data right down to every last spoked wheel and swing half-axle. High-performance history. Wilson provides an engaging history of these coveted classics, with everything from the retro appeal of America's &quot;muscle cars&quot; – Mustangs, Corvettes, and Firebirds–to the advent of classic car auctions, and the huge price swings that accompanied them. Style trends and engineering developments are also covered in Wilson's usual entertaining fashion. A series of illustrated sketches neatly capture the famous and infamous personalities of the car world. This is essential reading for anyone who, like the author, can't resist engines that sound &quot;like someone tearing sheets.&quot;","torrent":{"xt":"urn:btih:34051ea790b785b1c9186a4ea0b3459f50c699e9","amp;dn":"Cars+-+A+Celebration+%28DK+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34051ea790b785b1c9186a4ea0b3459f50c699e9","infoHashBuffer":{"type":"Buffer","data":[52,5,30,167,144,183,133,177,201,24,106,78,160,179,69,159,80,198,153,233]},"announce":[],"urlList":[]}}