{"title":"Project Runway S11E00 Road To The Runway WS DSR XviD NY2 avi","uid":8065200,"size":366714880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:343e6b2441e2e6e8613d52246ef63dcb64abcdeb&amp;dn=Project+Runway+S11E00+Road+To+The+Runway+WS+DSR+XviD+NY2+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy638","files":1,"time":1359159415,"description":"The 16 designers will be competing as teams for the duration of season 11. They will be split into two teams of eight. One person from the losing team will go home each week. &quot;Project Runway&quot; has always shown the most drama when the designers are working in teams. The cast is going to hate the new team set-up but it should be good entertainment for the viewers.\n\n Take a look at the 16 new designers that will compete as teams on season 11 of &quot;Project Runway.&quot; The links below will connect to a photo of each &quot;Project Runway&quot; season 11 contestant.\n\n Amanda Valentine is a 31-year-old designer who grew up in Lincoln, Neb., and is currently living in Nashville, Tenn.\n\n Benjamin Mach is a 35-year-old designer who grew up in Australia and is currently living in London, England.\n\n Cindy Marlatt is a 59-year-old designer from Kent, Wash. She was a funeral director for over 20 years.\n\n Daniel Esquivel is a 48-year-old designer from Austin, Texas and was never formally trained.\n\n Emily Pollard is a 24-year-old designer who grew up in Richfield, Ohio, and is currently living in Falls Church, Va.\n\n James Martinez (II) is a 29-year-old designer from Dallas.\n\n Joseph Aaron Segal is a 30-year-old designer who grew up in Framingham, Mass., and is currently living in Providence, RI.\n\n Katelyn Pankoke is a 23-year-old designer who grew up in Parkland, Fla. She graduated from Florida State University.\n\n Layana Aguilar is a 28-year-old designer and Brazilian native who is currently living in New York City.\n\n Mat Arthur is a 30-year-old, self-taught designer who is currently living in New Orleans.\n\n Michelle Lesniak Franklin is a 34-year-old designer from Portland, Ore., she has no formal fashion training.\n\n Patricia Michaels is a 46-year-old designer from Taos, N.M. She is the first Native American to compete on &quot;Project Runway.&quot;\n\n Richard Hallmarq is a 40-year-old designer from Sacramento, Calif.\n\n Samantha Black is a 28-year-old designer who is currently living in Brooklyn, N.Y.\n\n Stanley Hudson is a 45-year-old designer who is currently living in West Hollywood, Calif.\n\n Tu Nakchat is a 26-year-old designer originally from Chacheangsao, Thailand.\n\nPlease note this file was not produced by me so by all means complain about the quality, just not to me.Thanks\n\nThanks to all original cappers and posters","torrent":{"xt":"urn:btih:343e6b2441e2e6e8613d52246ef63dcb64abcdeb","amp;dn":"Project+Runway+S11E00+Road+To+The+Runway+WS+DSR+XviD+NY2+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"343e6b2441e2e6e8613d52246ef63dcb64abcdeb","infoHashBuffer":{"type":"Buffer","data":[52,62,107,36,65,226,230,232,97,61,82,36,110,246,61,203,100,171,205,235]},"announce":[],"urlList":[]}}