{"title":"Sofia Talvik - Morning has broken.mp3","uid":4348331,"size":3459920,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:34b22c4dd1a750effc6fad9b5b2b4ba84ce2c336&amp;dn=Sofia+Talvik+-+Morning+has+broken.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"papiraul","files":1,"time":1219005287,"description":"Artist: Sofia Talvik\nSong: Morning has broken\n &lt;a href=&quot;\nhttp://www.sofiatalvik.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sofiatalvik.com&lt;/a&gt;\n\n\n\nThis is the whole song from the &quot;Tv4 Nyhetsmorgon&quot; commercial that runs now and then on Tv4 in Sweden.\n\n\n---------\n\nThe author of this song is &quot;Cat Stevens&quot;\n\nYusuf Islam,[1] (born Steven Demetre Georgiou on 21 July 1948), best known by his former stage name Cat Stevens, is a British musician of Greek Cypriot and Swedish ancestry. He is a singer-songwriter, multi-instrumentalist, educator, philanthropist and prominent convert to Islam.\n\nAs Cat Stevens, he sold over 60 million albums around the world since the late 1960s. His albums Tea for the Tillerman and Teaser and the Firecat were both certified as Triple Platinum by the RIAA in the United States (three million sales each); his album Catch Bull at Four sold half a million copies in the first two weeks of release alone, and was Billboard&amp;#039;s number-one LP for three consecutive weeks. His songwriting has also earned him two ASCAP songwriting awards for &quot;The First Cut Is the Deepest,&quot; which has been a hit single for five different artists, and has been instrumental for others in establishing their musical careers.\n\nStevens converted to Islam at the height of his fame in 1977. The following year, he adopted his Muslim name Yusuf Islam, sold all his instruments and awards for charity,[2] and left his music career to devote himself to educational and philanthropic causes in the Muslim community. He turned to his mother to help him decide the best candidate to wed, and thus, in an arranged marriage, took his vows with Fauzia Mubarak Ali, eventually producing five living children from the union.\n\nHe has been given several awards for his work in promoting peace in the world, including 2003&amp;#039;s World Award,[3] the 2004 Man for Peace award, and the 2007 Mediterranean Prize for Peace. In 2006, he returned to pop music, with his first album of new pop songs in 28 years, entitled An Other Cup.\n\nHe lives with his wife, children and grand-child in London. Yusuf Islam spends part of each year in Dubai.[4]\n","torrent":{"xt":"urn:btih:34b22c4dd1a750effc6fad9b5b2b4ba84ce2c336","amp;dn":"Sofia+Talvik+-+Morning+has+broken.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34b22c4dd1a750effc6fad9b5b2b4ba84ce2c336","infoHashBuffer":{"type":"Buffer","data":[52,178,44,77,209,167,80,239,252,111,173,155,91,43,75,168,76,226,195,54]},"announce":[],"urlList":[]}}