{"title":"Alex Jones Show - 2012 July 25 WE [sebaygo1]","uid":7474606,"size":67740351,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:350488cd89c74d713e1657fd7bc7b2505b56926d&amp;dn=Alex+Jones+Show+-+2012+July+25+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":10,"time":1343256377,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 25 July 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nOn the Wednesday, July 25th edition of the Alex Jones Show, Alex welcomes long-time returning guest, economist, and contributing writer Paul Craig Roberts to discuss the assault on gun rights in the aftermath of the Colorado shooting, the West's unsuccessful efforts to muster support for Syrian intervention, and the impact the recent Libor scandal will have on world markets. \n\nAlso former federal prosecutor, writer, and former member of the United States House of Representatives Bob Barr returns to expand on his recent Daily Caller article titled, &quot;Homeland Security Continues to Demonize Conservatives and Libertarians&quot; in which he notes that supporters of he or Ron Paul were targeted by a MIAC report warning readers to be weary of &quot;militias&quot; and those that display Gadsden (&quot;Don't tread on me&quot;) bumper stickers. \n\nNot included in the official description, in the later part of hour 3 Alex talks with Bill Andreoli about a FREE &quot;Discount Pharmacy Benefits Card&quot; that promises to save users &quot;10% to 85%&quot; on prescription drug purchases. Alex has another new marketing site for this -- InfowarsRx.com. This is connected in some way to the Youngevity company, whose products are sold at InfowarsTeam.com [see Andreoli's entry at http://youngevity.com/company/management/]. There's also a program allowing people to get these cards in bulk, give them away to people, and then earn a commission each time one of those cards is used. Sounds like a free lunch to me.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:350488cd89c74d713e1657fd7bc7b2505b56926d","amp;dn":"Alex+Jones+Show+-+2012+July+25+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"350488cd89c74d713e1657fd7bc7b2505b56926d","infoHashBuffer":{"type":"Buffer","data":[53,4,136,205,137,199,77,113,62,22,87,253,123,199,178,80,91,86,146,109]},"announce":[],"urlList":[]}}