{"title":"El Imaginario Del Doctor Parnassus DVDRip Spanish 2009","uid":5530544,"size":1982347264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3528db3a02df93af68707a5ea44361e9e8657ef2&amp;dn=El+Imaginario+Del+Doctor+Parnassus+DVDRip+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1272911656,"description":"&quot;El Imaginario del Doctor Parnassus&quot; es una moraleja del gÃƒÂ©nero fantÃƒÂ¡stico que transcurre en la ÃƒÂ©poca actual. Cuenta la historia del Dr. Parnassus y su extraordinario &quot;Imaginario&quot;, un show itinerante donde el pÃƒÂºblico tiene la irresistible oportunidad de elegir entre la luz y la alegrÃƒÂ­a, o entre la oscuridad y la tristeza.\n\nEl Doctor Parnassus posee el extraordinario don de guiar la imaginaciÃƒÂ³n de los demÃƒÂ¡s, pero sobre ÃƒÂ©l recae una oscura maldiciÃƒÂ³n secreta. Jugador empedernido, miles de aÃƒÂ±os atrÃƒÂ¡s hizo una apuesta con el demonio, Mr. Nick, con la que se ganÃƒÂ³ la inmortalidad. Siglos mÃƒÂ¡s tarde, al conocer a su amor verdadero, Dr. Parnassus hizo otro trato con el diablo, comerciando su inmortalidad por su juventud, con la condiciÃƒÂ³n de que cuando su hija alcanzara la edad de 16 aÃƒÂ±os, pasara a ser propiedad de Mr. Nick.\n\nValentina estÃƒÂ¡ cada vez mÃƒÂ¡s cerca de esta importante fecha y el Dr. Parnassus estÃƒÂ¡ desesperado por protegerla de su inminente destino. Mr. Nick se presenta para llevÃƒÂ¡rsela pero como siempre estÃƒÂ¡ dispuesto a hacer una nueva apuesta, renegocia el envite. Se quedarÃƒÂ¡ con Valentina el que primero seduzca a cinco almas. En su viaje recluta a una serie de personajes salvajes, cÃƒÂ³micos y convincentes, y el Dr. Parnassus entregarÃƒÂ¡ ÃƒÂºnicamente la mano de su hija a aquel que le ayude a ganar.\n\nEn esta contrarreloj fascinante, explosiva y tremendamente imaginativa, el Dr. Parnassus deberÃƒÂ¡ luchar para salvar a su hija en un entorno donde los obstÃƒÂ¡culos se suceden de manera interminable y asÃƒÂ­ deshacer los errores de su pasado de una vez por todas.","torrent":{"xt":"urn:btih:3528db3a02df93af68707a5ea44361e9e8657ef2","amp;dn":"El+Imaginario+Del+Doctor+Parnassus+DVDRip+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3528db3a02df93af68707a5ea44361e9e8657ef2","infoHashBuffer":{"type":"Buffer","data":[53,40,219,58,2,223,147,175,104,112,122,94,164,67,97,233,232,101,126,242]},"announce":[],"urlList":[]}}