{"title":"Audiophile qualitty demo disk, various artists, EAC FLAC","uid":12452272,"size":451562205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3541a20e572d300527bebb630c19b810d8002232&amp;dn=Audiophile+qualitty+demo+disk%2C+various+artists%2C+EAC+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rontoolsie","files":16,"time":1442701854,"description":"This is a selection of tracks that will make any good audio system shine. It was initially compiled to herald the arrival of a friends new $26,000 preamp about 12 years or so ago, so every track was carefully selected with that in mind. \n\nSome of the material here you may know....most you probably will not. \n\nBut even the better known tracks (Keb Mo, Sarah McLachlan) have been ripped from the best disks available (MFSL, Classic Records Gold disk). \n\nHere is a brief rundown: \n1. Every Morning-Keb' Mo'. From his first album. Great acoustic blues guitar. \n2. Dilate-Ani DiFranco. From the album dilate. The power and dynamics of her strummed guitar will knock your speakers over backwards. \n3. Night Train-Christina McBride. The meaty woody tone of his stand up double bass with all the rich harmonics are captured in a very convincing way. \n4. Ice-Sarah McLachlan-Beautiful voice, beautiful guitar work with some open tuning, and haunting backings. \n5. Moog Island-Morcheeba. Some Brit Trip Hop electronica. \n6. Potters Wheel-Freyda and Acoustic AttaTude. Classically inspired folk music led by the gorgeous voice and sensitive violin playing of Freyda Epstein. \n7. Rolling-Elysian Fields. From the Bleed Your Cedar album. Everything about this track will draw you in. The extreme smoky seductiveness of her very closely miked voice, the psychedelic tinklings, a plucked bass that will go as low as your speakers will let it and a trance backing. \n8. Sweet Potato-John Renbourne. One of the masters of British acoustic folk guitar wizardry. From the Sir John..... album. \n9. Sleepy Language-Layo and Bushwacka! More spacy trance electronica with a grumbling growling bass line that sets the beat. \n10. Oh Me-Nirvana. From the Unplugged album. These series of Unplugged albums offered some of the finest quality recordings available, and still sound unbeatable. \n11-I Honestly Love You-Olivia Newton John. A re-recording, and a remix of it. The bass plunges so deeeeeeep on this track, I am sure it was lost on 99% of the people who listened to it on very modest gear. \n12-Youth Oriented-Happy Apple. Difficult to describe experimental neo psychedelic jazz. You will either love this or hate it. I loved it. \n13-Breaking Up-The Violent Femmes; a dark recording from a band that rode the alternative wave. Dark, broody and a metronic bass line that propels. \n14. Dawg After Dark-Dave Grisman and Tony Rice. From an album where each musician plays a different vintage mandolin and guitar, which extensive liner notes about every instrument. This of course would be lost unless the recording quality was top notch enough to faithfully portray the beautiful (and different) tones of the different instruments. And it does. \n15. Wandering Star-Portishead. Again some slow paced Brit spacy trip hop, and an electronic bass that goes down to your socks. \n16. She's Already Made Up Her Mind-Lyle Lovett. Beautiful heartbreaking song. But the reason it was included was for its subterranean bass that is better felt than heard. 90% of the systems I heard this on completely lost the bass as it starts off below the frequency most speakers can reproduce. \n\nI did include 800 dpi scans of the front covers of each of the CD's. The artwork shows up on on of the metadata editors I use, but for some reason VLC does not pick up the artwork on all of them. Hopefully your media player will","torrent":{"xt":"urn:btih:3541a20e572d300527bebb630c19b810d8002232","amp;dn":"Audiophile+qualitty+demo+disk%2C+various+artists%2C+EAC+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3541a20e572d300527bebb630c19b810d8002232","infoHashBuffer":{"type":"Buffer","data":[53,65,162,14,87,45,48,5,39,190,187,99,12,25,184,16,216,0,34,50]},"announce":[],"urlList":[]}}