{"title":"AngularJS Testing Cookbook","uid":12049582,"size":1758680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3559a7cd65562c8c695487383acb21482d9d3805&amp;dn=AngularJS+Testing+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ora3nz","files":1,"time":1434972855,"description":"AngularJS Testing Cookbook \nEnglish | 2015 || PDF + EPUB | \n\nEliminate volatile code by taking control and understanding how to test AngularJS applications\nAbout This Book\n* Learn how to build a solid and more reliable AngularJS codebase through test-driven development using clearly defined recipes\n* Understand how to set up and configure your development environment for unit and end-to-end testing of AngularJS applications\n* Over 50 hands-on recipes to help you build a solid foundation in AngularJS\nWho This Book Is For\nThis book is intended for developers who have an understanding of the basic principles behind both AngularJS and test-driven development. You, as a developer, are interested in eliminating the fear related to either introducing tests to an existing codebase or starting out testing on a fresh AngularJS application. If youre a team leader or part of a QA team with the responsibility of ensuring full test coverage of an application, then this book is ideal for you to comprehend the full testing scope required by your developers. Whether youre new to or are well versed with AngularJS, this book will guarantee a complete understanding of your application code and help reduce the cost of bugs.\nIn Detail\nAngularJS stepped up to offer a comprehensive solution to frontend development with minimal dependencies and a clear set of objectives.\nThis book follows the AngularJS philosophy and offers guidance on how to approach testing components that make up the AngularJS framework. At the start of the book, you will explore how to configure your system to run unit and end-to-end tests. Following this, youll become familiar with fundamental principles on testing AngularJS with Jasmine. Then, youll understand how spies can enable you to test your code with greater coverage and simplicity throughout your application. The final result is an AngularJS application that is tested with integrity, helping facilitate a cleaner and more reliable codebase","torrent":{"xt":"urn:btih:3559a7cd65562c8c695487383acb21482d9d3805","amp;dn":"AngularJS+Testing+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3559a7cd65562c8c695487383acb21482d9d3805","infoHashBuffer":{"type":"Buffer","data":[53,89,167,205,101,86,44,140,105,84,135,56,58,203,33,72,45,157,56,5]},"announce":[],"urlList":[]}}