{"title":"The Good Place - s01e04 - Jason Mendoza","uid":15929516,"size":1063232556,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:35b99e3ff0ae02c1080635f41e8a9ccab910c05c&amp;dn=The+Good+Place+-+s01e04+-+Jason+Mendoza&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"weestrom","files":1,"time":1475344346,"description":"The Good Place - s01e04 - Jason Mendoza\r\n\r\nEleanor discovers that the person sending her what she believes are threatening notes is not Tahani as she initially believed, but rather Jianyu. The notes are not meant to be threatening but rather a call for help, as Jianyu is a fraud like her, and should not be in the good place. He is not Jianyu Li, a Taiwanese Buddhist monk as everyone believes, but rather Jason Mendoza, an ethnic Filipino from Jacksonville, Florida, a not very good electronic dance music DJ and drug dealer with a frat boy mentality. The problem for Eleanor and eventually Chidi, who also learns about Jianyu's true identity, is that once Jianyu opens up about his Jason life, he has opened up a floodgate of frat boy emotions which may not be able to be rebottled. As such, he has no real desire to stay in the good place as he just wants to return to his partying ways. And if Jianyu gets caught, it is inevitable that Eleanor will also be exposed at the same time. So Eleanor and Chidi have to try and convince Jianyu to attend Chidi's ethics classes so that he and Eleanor can learn together to stay in the good place. A good test of what may happen with Jianyu is the welcome event Michael has asked Tahani to plan for Chef Patricia's new restaurant in the neighborhood","torrent":{"xt":"urn:btih:35b99e3ff0ae02c1080635f41e8a9ccab910c05c","amp;dn":"The+Good+Place+-+s01e04+-+Jason+Mendoza","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b99e3ff0ae02c1080635f41e8a9ccab910c05c","infoHashBuffer":{"type":"Buffer","data":[53,185,158,63,240,174,2,193,8,6,53,244,30,138,156,202,185,16,192,92]},"announce":[],"urlList":[]}}