{"title":"Ivchenko, Medvedev, Chistyakov - Problems In Mathematical Statis","uid":7966638,"size":37857729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36963a240dd0f514c07c38479df19f7453449ef1&amp;dn=Ivchenko%2C+Medvedev%2C+Chistyakov+-+Problems+In+Mathematical+Statis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"damitr","files":1,"time":1356702986,"description":"Problems in Mathematical Statistics \nby\n\nG. I. Ivchenko, Yu. I. Medvedev and A. V. Chistyakov\n\nThis problem book covers all the traditional topics in modern\nstatistical theory and is designed for students at technical colleges\nand universities who have mathematical statistics as an obligatory\ncourse.  The problems are mostly analytical. The student is asked to\nprove the validity or an assertion or carry out an investigation. This\nwill help him grasp the main aspects of mathematical statistics. Some\nof the problems are more difficult and can be used as individual\nassignments for course papers.\n\nWe have included problems on computer simulation of random variables\nin order to obtain the data for statistical interpretation. Any\n&quot;theoretical&quot; problem which contains a statistical algorithm for data\nanalysis can be used (with the appropriate (practically infinite)\nchoice of the model parameters ) to formulate a &quot;practical&quot;\nproblem. At the first stage the original data should be simulated\nusing either published tables of random numbers or special computer\nprograms. Then, by interpreting these &quot;experimental&quot; results\naccording to the algorithm in question, the student can compare the\ntheoretical hypothesis with the original parameters which are known\nas they were used when the sample was simulated.\n\n All the problems differ in complexity. More difficult problems are\nmarked with an asterisk and may require a significant effort on the\npart of the reader. Problems that cannot be reduced to standard\nalgorithms are answered in detail or hints are given.\n\nEach chapter contains the basic notions, assertions, and formulas\nfrom the respective theo ret ical section. The statistical tables at the end\nof the book will help the reader obtain numerical results. The list of\ndistributions will help him choose problems on different aspects of\nthe same model.\n\n This book was translated from the Russian by Elena Troshneva. The\n  book was published by first Mir Publishers in 1991.\n\nThis makes it one of the last books to see the light of publication\n  under Mir.\n\n  All credits to the original uploader.\n\n  DJVU | 3.8 MB | Pages: 282 | OCR | Cover\n\n======================================\n=++++++++++++++++++++++++++++++++++++=\n=+                                  +=\n=+ Released on TPB by mirtitles.org +=\n=+                                  +=\n=++++++++++++++++++++++++++++++++++++=\n======================================\t\n\nTable of Contents\n\nPreface 6\nTheory and Problems 7\nChapter I \nPrinciples of Statistical Description. Sampling Characteristics and Their Distributions 7\n\nChapter 2 Estimation and Distribution of Parameters 37\n\nChapter 3 Tests of Statistical Hypotheses 79\n\nChapter 4 Linear, Regression and the Least Squares Method 107\n\nChapter 5 Decision Functions 119\n\nChapter 6 Statistics of Stationary Sequences 131\n\nAnswers and Solutions 137\nAppendix 263\nList of Distributions 277\nBibliography 279\n\n","torrent":{"xt":"urn:btih:36963a240dd0f514c07c38479df19f7453449ef1","amp;dn":"Ivchenko%2C+Medvedev%2C+Chistyakov+-+Problems+In+Mathematical+Statis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36963a240dd0f514c07c38479df19f7453449ef1","infoHashBuffer":{"type":"Buffer","data":[54,150,58,36,13,208,245,20,192,124,56,71,157,241,159,116,83,68,158,241]},"announce":[],"urlList":[]}}