{"title":"M.Ogdowski - Z AFGANISTANU.PL [PL]","uid":12685484,"size":282561502,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:36c39b8a5c24b639ea39ae5449de9d786af0851e&amp;dn=M.Ogdowski+-+Z+AFGANISTANU.PL+%5BPL%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":30,"time":1446597457,"description":"Audiobook PL - 28 części /   \r\nrozmiar: 269 MB / czas: 06:30:39\r\nczyta: Krzysztof Banaszyk\r\n\r\nWszystko, co chcielibyście wiedzieć o Afganistanie i wojnie w tym kraju. Audiobook jest adaptacją publikacji dziennikarza i korespondenta wojennego, Marcina Ogdowskiego, który w niezwykle przejmujący sposób opowiedział o życiu i walce w tym targanym konfliktami kraju. Usłyszymy nie tylko o głośnych w mediach akcjach, na jakie wysyłani byli polscy żołnierze wraz z sojuszniczymi wojskami. To przede wszystkim historia codzienności w bazie wojskowej i poza nią.\r\nOgdowski stara się pokazać słuchaczom ten aspekt wojny, który w mediach nie jest obecny: cierpliwe oczekiwanie na rozkazy, żmudne planowanie akcji, trudności z zaopatrzeniem - ale również wszystkie trudne sytuacje, które dotykają w czasie konfliktu zbrojnego ludność cywilną. Jak sobie radzą Afgańczycy, gdy gasną flesze i kamery zagranicznych stacji telewizyjnych? To prawdziwa i pełna szczegółów relacja z pierwszej ręki kogoś, kto wojnę tą widział z bliska - która z pewnością zajmie nie tylko fanów wojskowości i militariów. Jest znakomitym, niemal obowiązkowym uzupełnieniem tego, co nie tak dawno na co dzień oglądaliśmy w przekazach medialnych.\r\nCzy robią jeszcze na Was wrażenie &quot;migawki&quot; z Afganistanu? Być może już nie - ale obok publikacji Ogdowskiego trudno będzie Wam przejść obojętnie...\r\n__________________________________________________________________\r\n\r\n&quot;...Myślę, że byłbym kiepskim żołnierzem. Nienawidzę ścisłej hierarchii i bezwzględnego podporządkowania. Pewnie dlatego zamiast armii wybrałem studia socjologiczne, a później zawód dziennikarza. Ale zainteresowanie wojskiem nie pozostało bez wpływu na to, co robię. To dlatego jako korespondent znalazłem się w Afganistanie, a wcześniej w Iraku.\r\nTym, co w wojnie interesuje mnie najbardziej, nie są techniczne aspekty militarnych operacji. W wojnie – tu trzeba nazwać rzecz po imieniu – pociąga mnie jej codzienność. Żołnierze nie tylko biorą udział w akcjach – częściej na nie czekają, korzystając z wątpliwych uroków bazy. A cywile nie zakopują się pod ziemię z intencją, by wygrzebać się po wszystkim. Próbują jakoś żyć.\r\nI o tym starałem się pisać...&quot;\r\n- Marcin Ogdowski\r\n__________________________________________________________________\r\n\r\nAudiobook został wzbogacony o trzy utwory Zespołu Estradowego &quot;CZASZA&quot; (pliki 3,5,8) - który powstał w 1983 roku, z inicjatywy oficerów odpowiedzialnych za działalność kulturalno-wychowawczą w 6 PDPD.\r\nZespół składa się wyłącznie z muzyków-amatorów, którzy nie tylko bawią grą i piosenką swoich kolegów - ale także szkolą się, by sprostać obowiązkom na zajmowanych stanowiskach służbowych","torrent":{"xt":"urn:btih:36c39b8a5c24b639ea39ae5449de9d786af0851e","amp;dn":"M.Ogdowski+-+Z+AFGANISTANU.PL+%5BPL%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36c39b8a5c24b639ea39ae5449de9d786af0851e","infoHashBuffer":{"type":"Buffer","data":[54,195,155,138,92,36,182,57,234,57,174,84,73,222,157,120,106,240,133,30]},"announce":[],"urlList":[]}}