{"title":"Taking It All (Surrender Trilogy#3) by Maya Banks epub","uid":13140909,"size":409339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36c75e86b5c1eed01aa6fb1ef0dbf2c9a3b58364&amp;dn=Taking+It+All+%28Surrender+Trilogy%233%29+by+Maya+Banks+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DYanna","files":2,"time":1451979064,"description":"Taking It All (Surrender Trilogy #3) by Maya Banks epub\r\n\r\nChessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all\r\n\r\nTate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them.\r\n\r\nBut a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love","torrent":{"xt":"urn:btih:36c75e86b5c1eed01aa6fb1ef0dbf2c9a3b58364","amp;dn":"Taking+It+All+%28Surrender+Trilogy%233%29+by+Maya+Banks+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36c75e86b5c1eed01aa6fb1ef0dbf2c9a3b58364","infoHashBuffer":{"type":"Buffer","data":[54,199,94,134,181,193,238,208,26,166,251,30,240,219,242,201,163,181,131,100]},"announce":[],"urlList":[]}}