{"title":"MakeMKV 1.6.10 [theLEAK]","uid":6495147,"size":4087571,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:37ed5535ea75d31c3e0e5b0c20701e29535cdb50&amp;dn=MakeMKV+1.6.10+%5BtheLEAK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theLEAK","files":3,"time":1309034064,"description":"MakeMKV is your one-click solution to convert video that you own into free and patents-unencumbered format that can be played everywhere. MakeMKV is a format converter, otherwise called &quot;transcoder&quot;. It converts the video clips from proprietary (and usually encrypted) disc into a set of MKV files, preserving most information but not changing it in any way. The MKV format can store multiple video/audio tracks with all meta-information and preserve chapters. There are many players that can play MKV files nearly on all platforms, and there are tools to convert MKV files to many formats, including DVD and Blu-ray discs.\nAdditionally MakeMKV can instantly stream decrypted video without intermediate conversion to wide range of players, so you may watch Blu-ray and DVD discs with your favorite player on your favorite OS or on your favorite device. \n\n- Reads DVD and Blu-ray discs\n- Reads Blu-ray discs protected with latest versions of AACS and BD+\n- Preserves all video and audio tracks, including HD audio\n- Preserves chapters information\n- Preserves all meta-information (track language, audio type)\n- Fast conversion - converts as fast as your drive can read data.\n- No additional software is required for conversion or decryption.\n- Available for Windows, Mac OS X and Linux\n- Functionality to open DVD discs is free and will always stay free.\n\n\n\n\nInstructions:\n1) Click on the application called &quot;Setup_MakeMKV_v1.6.10&quot;\n2) Follow the instructions on screen and install\n3) Once finished installation, DO NOT RUN (Untick &quot;Run MakeMKV v1.6.10&quot;\n4) Go to the &quot;patch&quot; folder&quot; and click on the application called &quot;makemkv.v1.6.10-patch&quot;\n5) Click patch. You'll now see a pop up message saying &quot;Can not find the file. Search the file?&quot; Click YES\n6) Locate the .exe file of MakeMKV\n7) Double click on the .exe file and wait for it to patching it.\n8) Click exit once it's finished patching\n9) Go to ","torrent":{"xt":"urn:btih:37ed5535ea75d31c3e0e5b0c20701e29535cdb50","amp;dn":"MakeMKV+1.6.10+%5BtheLEAK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37ed5535ea75d31c3e0e5b0c20701e29535cdb50","infoHashBuffer":{"type":"Buffer","data":[55,237,85,53,234,117,211,28,62,14,91,12,32,112,30,41,83,92,219,80]},"announce":[],"urlList":[]}}