{"title":"Paquito D'Rivera - Este Camino Largo [FLAC] TQMP","uid":4378540,"size":371238325,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3832b3f706d690ee221b53b26d4a04ef629998ae&amp;dn=Paquito+D%5C%27Rivera+-+Este+Camino+Largo+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1220537157,"description":"Paquito D&amp;#039;Rivera - Este Camino Largo (This Long Road)\n\nOriginal 1978\nRemastered 2002\n\nFeaturing Leo Brower, Chucho Valdes &amp; Irakere.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nThis album&amp;#039;s tracks show a more focused side of D&amp;#039;Rivera&amp;#039;s work during his days in Cuba. Several songs stem from his time with the seminal Cuban fusion band, Irakere; these tracks show his influence upon the band as both a soloist and overall stylist. More pieces from Irakere document their performance with the legendary guitarist Leo Brouwer. Some of these recordings were originally released on the album Great Moments, while others appear here for the first time. These songs demonstrate D&amp;#039;Rivera&amp;#039;s ability to bridge distinct styles, from ragtime to classical and Afro-Cuban rhythms. Two tracks once again place D&amp;#039;Rivera as a soloist with a Finnish jazz combo, providing the complete album that was originally recorded in 1978. These are the only songs that step outside the realm of Irakere, so they offer a distinctly different view of his playing. Overall, it&amp;#039;s a good view of D&amp;#039;Rivera&amp;#039;s work during his later years in Cuba.\n\nThere are several spots on the album that peek into D&amp;#039;Rivera&amp;#039;s brilliance as a young musician. Irakere&amp;#039;s collaboration with Brouwer displays a true bridge between styles on the extended version of Joaquin Rodrigo&amp;#039;s &quot;Concierto de Aranjuez.&quot; After a long dip into classical guitar by Brouwer, Irakere joins with a Flamenco inspired solo accompaniment that sets the stage for a playful soprano sax improvisation from D&amp;#039;Rivera. A gentle rubato piano introduction by Chucho Valdes leads into an inspired duet on &quot;Este Camino Largo.&quot; The understanding support and interplay between the two musicians reveals a strong comaderie and an intimate artistic familiarity. &quot;Chekere-Son&quot; finds all of Irakere performing in their standard blend of traditional jazz, aggressive funk, Afro-Cuban roots, and innovative compositions. D&amp;#039;Rivera joins the melody with his strong bari sax sound and then proceeds to weave a masterful statement from bebop phrases, Cuban rhythmic ideas, and a funky tone. The consummate expression of D&amp;#039;Rivera as a young musician emerges on Irakere&amp;#039;s gospel-tinged version of Mozart&amp;#039;s &quot;Adagio del Concierto en La Mayor.&quot; His training as a classical clarinetist left him intimately familiar with this piece, and D&amp;#039;Rivera brilliantly combines the original composition with bluesy jazz phrases. The album treats the listener to several perspective of D&amp;#039;Rivera within Irakere, where his personality consistently shines.\n\nMost of the album provides a great shot of Irakere during the mid-1970s with spots of brilliance from D&amp;#039;Rivera. Every track contains a fabulous solo or in some cases a feature from the saxophonist, but in most cases, it&amp;#039;s the appeal of the whole group that drives the album. It&amp;#039;s the total package that made Irakere special during the 1970s - Valdes&amp;#039; mind-boggling compositions, the superb virtuosity of the wind players, the combination of electronic instruments and Latin Jazz aesthetics - every piece formed an unstoppable inertia that redefined history. The album certainly makes the case for D&amp;#039;Rivera&amp;#039;s integral role in Irakere - the group undoubtedly survived without him, but it was never quite the same after he left. He provided a musical perspective that spanned stylistic boundaries and a unique voice that stood as a symbol for the band. Este Camino Largo highlights this era nicely and isolates classic pieces of D&amp;#039;Rivera; considering this, in combination with the fact that early Irakere tracks can be difficult to find, this album serves as a wonderful record of this era.\n--- The Latin Jazz Corner &lt;a href=&quot;\nhttp://www.chipboaz.com/blog/2008/06/11/completing-the-picture-early-paquito-drivera-re-issues/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.chipboaz.com/blog/2008/06/11/completing-the-picture-early-paquito-drivera-re-issues/&lt;/a&gt;\n\nTracks\n01- Este Camino Largo\n02- Hasta Siempre\n03- La Cancion De Los Ninos\n04- Ragtime\n05- Adagio Del Concierto En La Mayor\n06- Concierto De Aranjuez\n07- Chekere - Son\n08- Juana 1600\n09- Preludio No 3\n10- Misa Negra\n\nArtwork (300dpi scan), EAC log and CUE sheet included.\n\nFormat: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:3832b3f706d690ee221b53b26d4a04ef629998ae","amp;dn":"Paquito+D%5C%27Rivera+-+Este+Camino+Largo+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3832b3f706d690ee221b53b26d4a04ef629998ae","infoHashBuffer":{"type":"Buffer","data":[56,50,179,247,6,214,144,238,34,27,83,178,109,74,4,239,98,153,152,174]},"announce":[],"urlList":[]}}