{"title":"Captain Midnight 1942 1-67 (23 Issues)","uid":8100011,"size":749663611,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:387f23d062e4ea59ee907186a94dabd3ebfdc0a2&amp;dn=Captain+Midnight+1942+1-67+%2823+Issues%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mothra67","files":-1,"time":1359938826,"description":"CAPTAIN MIDNIGHT (Fawcett) 1942 Series.\nNo. 1, Sep 1942 - no. 67, Sep 1948.\n\n\nThese are all the scanned copies of this golden age comic that I could find.  I also include all the daily and sunday newspaper comic strips that I could find as well.\n\n\nCaptain Midnight (later rebranded on television as Jet Jackson, Flying Commando) is a U.S. adventure franchise first broadcast as a radio serial from 1938 to 1949. Sponsored by the Skelly Oil Company, the radio program was the creation of radio scripters Wilfred G. Moore and Robert M. Burtt, who had previously scored a success for Skelly with their boy pilot adventure serial The Air Adventures of Jimmie Allen.\n\nDeveloped at the Blackett, Sample and Hummert advertising agency in Chicago, Captain Midnight began as a syndicated show in 1938, airing through the spring of 1940 on a few Midwest stations, including Chicago's WGN. In 1940, Ovaltine, a product of The Wander Company, took over sponsorship. With Pierre Andre as announcer, the series was then heard nationally on the Mutual Radio Network where it remained until 1942. It moved to the Merchandise Mart and the NBC Blue Network in September 1942. When the U.S. Government broke up the NBC Red and Blue Networks, Ovaltine moved the series back to Mutual, beginning September 1945, and it remained there until December, 1949.\n\nA newspaper comic strip, based closely on the radio program, made its debut in 1942. The strip, bylined by &quot;Jonwan&quot; (Erwin L. Hess) was drawn in a style similar to that of Milton Caniff. As with the radio show, the major characters were retained, including Joyce Ryan, Chuck Ramsay, Ichabod Mudd and Major Barry Steele. The strip was released by the Chicago Sun Syndicate on June 29, 1942, and ran until the late 1940s. The strip had some differences from the radio show and did not reprise the radio adventures. In the strip, Captain Midnight was referred to as &quot;an unofficial fighter for freedom,&quot; which is at variance from the radio show, where the Secret Squadron was set up by a high governmental official (&quot;Mr. Jones&quot;), which the hero was recruited to head. Even with the variants, it was far closer to the radio show than any of the other spinoffs.\n\nAfter Dell in 1941, Fawcett published Captain Midnight from JUN/42 to SEPT/48. The Fawcett character bore little resemblance to the radio character, and only the character [1] Ichabod Mudd, appeared regularly in the comic, as the sidekickSgt. Twilight.\n\nCaptain Midnight in the comic had a skintight scarlet suit and an array of gizmos like Dr. Mid-Nite which released clouds of blinding darkness, the infra-red &quot;Doom-Beam Torch&quot; which he used to burn his emblem into walls and unlucky villains, and a &quot;Gliderchute&quot; (similar to the flying Wingsuit) attached to the sides of his costume\n\nIn his Captain Albright secret identity he was a genius-level inventor like Edison. He had a secret laboratory in the desert. Otto Binder was one of the writers on the comic book.\n\nIn 2012, Dark Horse reintroduced the character.","torrent":{"xt":"urn:btih:387f23d062e4ea59ee907186a94dabd3ebfdc0a2","amp;dn":"Captain+Midnight+1942+1-67+%2823+Issues%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"387f23d062e4ea59ee907186a94dabd3ebfdc0a2","infoHashBuffer":{"type":"Buffer","data":[56,127,35,208,98,228,234,89,238,144,113,134,169,77,171,211,235,253,192,162]},"announce":[],"urlList":[]}}