{"title":"British Sea Power - The Decline of British Sea Power [2003][EAC,","uid":8866477,"size":404128389,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:38b35e73379fc7d6893b40a97a4c21c83587fa14&amp;dn=British+Sea+Power+-+The+Decline+of+British+Sea+Power+%5B2003%5D%5BEAC%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":19,"time":1377923665,"description":"Artist:British Sea Power\nRelease:The Decline of British Sea Power\nReleased: 2003\nLabel: Rough Trade Records\nCatalog#: 06076-83214-2 / U.S. Bonus Tracks\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: UK\nStyle:rock,indie\n\n01 Men Together Today\n02 Apologies to Insect Life\n03 Favours in the Beetroot Fields\n04 Something Wicked\n05 Remember Me\n06 Fear of Drowning\n07 The Lonely\n08 Carrion\n09 Blackout\n10 Lately\n11 A Wooden Horse\n\nU.S. Bonus Tracks\n\n12 Chilhood Memories\n13 Heavenly Waters\n\nThe Decline of British Sea Power isn't your conventional pop record and it's not particularly a pop-sounding record from an English band. With garage rock ruling overseas and Brit-pop still making the charts in the new millennium, a four-man band from Cumbria arrived with a provocative post-punk sound brazen enough to blast away other indie rock fashionistas like Interpol and the Walkmen. The hypnotic album opener &quot;Apologies to Insect Life&quot; is just as intense as any Joy Division song and Echo &amp; the Bunnymen's early work. However, British Sea Power will not be characterized as a parody. For musicians only in their early twenties, British Sea Power are intellectually complex with their inquisitive lyrical tales about Russian literature, Czech history, and influential figures of time. To call them eccentric would deem them quirky and that's not all. They're musically spontaneous and frontman Yan composes erratically charming songs reflecting nature in its most literal and perplexing senses. From the dreamy wonder of &quot;Carrion&quot; to slagging off the royal regime on the brassy punk-toned &quot;Remember Me,&quot; The Decline of British Sea Power is vehement in color and substance. The 13-minute mind trip &quot;Lately&quot; could very well be the album epic; however, &quot;The Fear of Drowning&quot; is the genius standout. It's rich in space and time with its cascading guitar work, intrinsically dark with its own life lesson of having independent thoughts far away from socio-political ideals. British Sea Power are so convincing, it hurts. The Decline of British Sea Power is a conceptual effort that breathes hard in passion. With an unlikely rock blend of classicism and narrative, British Sea Power has composed a brilliant album that's nearly perfect. It's not exactly pop, but it might as well be.","torrent":{"xt":"urn:btih:38b35e73379fc7d6893b40a97a4c21c83587fa14","amp;dn":"British+Sea+Power+-+The+Decline+of+British+Sea+Power+%5B2003%5D%5BEAC%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b35e73379fc7d6893b40a97a4c21c83587fa14","infoHashBuffer":{"type":"Buffer","data":[56,179,94,115,55,159,199,214,137,59,64,169,122,76,33,200,53,135,250,20]},"announce":[],"urlList":[]}}