{"title":"Aquatic Biofilms - Ecology, Water Quality and Wastewater Treatme","uid":14415532,"size":15364197,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38d00bf03d031ccc85e8e54a22c2862d0b33279b&amp;dn=Aquatic+Biofilms+-+Ecology%2C+Water+Quality+and+Wastewater+Treatme&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461491984,"description":"Aquatic Biofilms - Ecology, Water Quality and Wastewater Treatment - Anna M. Romani et al. (Caister, 2016).pdf\r\n\r\nISBN 978-1-910190-17-3\r\n\r\nBiofilms in aquatic ecosystems colonize various surfaces (sand, rocks, leaves) and play a key role in the environment. Aquatic biofilms supply energy and organic matter to the food chain, they are important in recycling organic matter, and they contribute to water quality. This book is a concise review of the current knowledge on aquatic biofilms, with an emphasis on the characteristics and ecology of biofilms in natural ecosystems, along with a focus on biofilm applications linked to water pollution problems. The book is divided into three sections: &quot;Biofilms Mode of Life,&quot; &quot;Biofilms and Pollution,&quot; and &quot;New Technologies Using Biofilms.&quot; In the first section, the aquatic biofilm mode of life is described and reviewed. Key aspects covered include the three-dimensional structure and cell-to-cell communication of biofilms, their dynamic prokaryotic diversity, and their vital role in biogeochemical cycles. This is followed by a comprehensive look at the use of biofilms in water quality. Additional chapters discuss environmental risk assessment, monitoring, and ecotoxicological approaches. Further topics include biofilm development in sewage pipes and the potential for microbial transformations in these systems. The final section focuses on important examples of novel technologies based on biofilms for water treatment, including the biodegradation of pollutants, the application of bioelectrogenic biofilms, and the biofilm capacity for nitrogen removal","torrent":{"xt":"urn:btih:38d00bf03d031ccc85e8e54a22c2862d0b33279b","amp;dn":"Aquatic+Biofilms+-+Ecology%2C+Water+Quality+and+Wastewater+Treatme","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d00bf03d031ccc85e8e54a22c2862d0b33279b","infoHashBuffer":{"type":"Buffer","data":[56,208,11,240,61,3,28,204,133,232,229,74,34,194,134,45,11,51,39,155]},"announce":[],"urlList":[]}}