{"title":"BROUSKO 137","uid":9896881,"size":1143941066,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:39611ee4acc2f83c388677db442d2538da2c4946&amp;dn=BROUSKO+137&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GioXara","files":-1,"time":1396722243,"description":"BROUSKO EPISODIO 137 DVD RIP\n\nPerilipsi:\n\nTa problhmata gia thn oikogeneia tou Shfh den stamatane pote afou o Shfhs tha eksafanistei kai h Anastasia tha einai anastatwmenh alla kai h Melina apo th meria ths afou fobountai na mhn kanei kamia trela.\nOtan h Xristina tha dei to Nektario kai th Dhmhtra na exoun pio stenh sxesh,apo th zhlia ths tha eksorgistei kai tha kanei mia tromerh anakalypsh sto Nektario oti exei enan agnwsto didymo adelfo  prokalwntas kai alla problhmata alla kai sygkrouseis metaksy tou Nektariou kai twn aderfwn tou.\nAuth th fora sto spiti tou Diamanth tha kataftasei h Eurydikh me stoixeia fwtia kai poia tha einai auta ta stoixeia mia fwtografia pou einai o Nektarios mwro mazi me to didymo adelfo tou alla kai akoma perissotera stoixeia sxetika me thn yiothesia.\nO agnwstos antras apo th meria tou synexizei na kineitai xwris na ton katalabainei kanenas kai prospathei na sylleksei akoma perissotera stoixeia gia  tis kinhseis ths oikogeneias Mat8aiou kai twn Giannakakhdwn.\npleon to mythistorhma exei ginei entonh idea sto myalo ths Dafnhs alla kai h emmonh idea pou ths exei karfwthei sto kefali na symperilabei sto biblio ths tous filous ths th fernei antimetwph me tis antidraseis twn dikwn ths anthrwpwn.\nO Axilleas einai toso trela erwteumenos me th Melina kai den deixnei kanena  endiaferon sto flert ths Aleksias apo thn allh meria omws sta Xania h Melina tha dextei ena poly parakseno thlefwnhma.\nH Melina tha anagkastei na pei allo ena psema ston Axillea kai auto to psema.\n","torrent":{"xt":"urn:btih:39611ee4acc2f83c388677db442d2538da2c4946","amp;dn":"BROUSKO+137","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39611ee4acc2f83c388677db442d2538da2c4946","infoHashBuffer":{"type":"Buffer","data":[57,97,30,228,172,194,248,60,56,134,119,219,68,45,37,56,218,44,73,70]},"announce":[],"urlList":[]}}