{"title":"Johnny Cash - Unearthed - 5 CD set - MP3@320kbps - tagged","uid":4818098,"size":584574045,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39ba52517b31f976af038d0075070d08ccf15cde&amp;dn=Johnny+Cash+-+Unearthed+-+5+CD+set+-+MP3%40320kbps+-+tagged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BillyBingle","files":80,"time":1238633852,"description":"Johnny Cash - Unearthed - 5 CD set - MP3 @ 320kbps - properly tagged\n\n5 CD Set properly tagged etc, 320kbps\n\nOver the course of five mesmerizing CDs, Unearthed shows us just how Johnny Cash's now-legendary handful of recordings for American Records came to be. Four discs feature previously unreleased tracks from the famed Rick Rubin-produced sessions. Through their inconsistencies and quirks (and, more often than not, brilliance), they shed light on how Cash's final records were shaped, edited, and produced. Here we get some creative pairings: Fiona Apple providing guest vocals on Cat Stevens' &quot;Father &amp; Son,&quot; and the late Joe Strummer duetting with Cash on Bob Marley's &quot;Redemption Song.&quot; Neither are the definitive statements that some of Cash's covers from this period are (his glorious takes on Nick Lowe and Danzig, to name just two), but they're still very much worth hearing. Most riveting are the numerous traditional numbers, the songs that were clearly closest to the Man in Black's heart. &quot;Banks of the Ohio,&quot; Billy Joe Shaver's &quot;Old Chunk of Coal,&quot; Stephen Foster's &quot;Hard Times,&quot; and the entire disc of previously unreleased gospel tunes are powerful statements, tunes where you feel privileged to hear Cash--despite declining health and failing voice--sing one more time, the way he wanted. The last disc of this monumental set is a &quot;best-of&quot; compilation of tracks that did make it on the American individual discs, a reminder of just how groundbreaking these sessions were. Perhaps the biggest highlight in this awe-inspiring set is its vast liner notes, a loving collection of essays and recollections that highlight the history and stories behind this eclectic array of songs. --Jason Verlinde \n\nProduct Description\nNot just your average box set of re-packaged music, 'Unearthed' is a 5 CD box containing 79 tracks from the American Recordings era. 'Unearthed' contains 4 entire discs of never-before-heard recordings. 'Unearthed' also contains 'My Mothers Hymn Book' a complete never released solo acoustic spiritual album. Deluxe packaging includes 104 page hard cover book, never before seen photo's and Johnny's personal comments, thoughts and memories about every song on the box. Lost Highway. 2003. \n","torrent":{"xt":"urn:btih:39ba52517b31f976af038d0075070d08ccf15cde","amp;dn":"Johnny+Cash+-+Unearthed+-+5+CD+set+-+MP3%40320kbps+-+tagged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ba52517b31f976af038d0075070d08ccf15cde","infoHashBuffer":{"type":"Buffer","data":[57,186,82,81,123,49,249,118,175,3,141,0,117,7,13,8,204,241,92,222]},"announce":[],"urlList":[]}}