{"title":"Perfect Pussy - Say Yes to Love (2014) [FLAC]","uid":9778866,"size":167832562,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3a4f8786920dcd6ddae005dc0c4b3f39195100b9&amp;dn=Perfect+Pussy+-+Say+Yes+to+Love+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1395075547,"description":"\n  Perfect Pussy - Say Yes to Love (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Noise Rock, Indie, Lo-Fi, Riot Grrrl\n  Source: CD (log + cue) \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 KHz\n\n  01 Driver \n  02 Bells \n  03 Big Stars \n  04 Work \n  05 Interference Fits \n  06 Dig \n  07 Advance Upon the Real \n  08 VII \n  \n  Perfect Pussy's combustive, confrontational sound was so fully formed on their demo I Have Lost All Desire for Feeling that it seemed like their voice could only be diluted on a more widely released effort. However, they sound even more vital on their official debut, Say Yes to Love, offsetting any gains in fidelity with the sheer amount of noise packed into these songs. They use loudness as both a cloak and a dagger even more skillfully than before, alternately hiding behind and brandishing it on &quot;Driver,&quot; where hissing static acts like a lit fuse before the song explodes. Despite being nearly drowned out by the rest of the band, Meredith Graves remains the heart of Perfect Pussy; it says as much about the state of music in the 2010s as it does about the band that there are so few acts with a frontwoman this charismatic and assertive. Graves' blunt yet poetic lyrics reveal the depth of Perfect Pussy's music. She sings about light as much as anger, and wrestles with sex and body positivity in such complicated and honest ways that when she sings &quot;I can only love and move toward everyone&quot; on &quot;Big Stars&quot; or &quot;No bruise is permanent, neither am I&quot; on &quot;Dig,&quot; her conflict is almost palpable. Her ambivalence peaks on &quot;Interference Fits,&quot; where love and marriage -- or abstaining from them -- are equally tough choices, made all the more poignant by the Sonic Youth-like bruised punk surrounding them. That Perfect Pussy choose to shroud the clarity of their words in thick sheets of noise makes for a fascinating, if frustrating contrast; the only way to fully absorb their music is to put in the time with repeated listening and reading the lyrics. Fortunately, that's not a problem with an album as thought-provoking as Say Yes to Love.","torrent":{"xt":"urn:btih:3a4f8786920dcd6ddae005dc0c4b3f39195100b9","amp;dn":"Perfect+Pussy+-+Say+Yes+to+Love+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a4f8786920dcd6ddae005dc0c4b3f39195100b9","infoHashBuffer":{"type":"Buffer","data":[58,79,135,134,146,13,205,109,218,224,5,220,12,75,63,57,25,81,0,185]},"announce":[],"urlList":[]}}