{"title":"The Marshall Tucker Band - Carolina Dreams [FLAC]","uid":9524404,"size":233520270,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3bacb8d293a8e9a0b3a80a4f561526e3cc8b2a54&amp;dn=The+Marshall+Tucker+Band+-+Carolina+Dreams+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1390713952,"description":"The Marshall Tucker Band - Carolina Dreams [FLAC] (Big Papi) Blues Rock\n\nSource: Original Release CD With Fresh Art Scan\n\n\n\nBy B. E Jackson\n\nYou know an album's good when you go into it expecting one song (&quot;Heard It In a Love Song&quot;) to overshadow the rest of the material and yet, when the album finishes, you'd forgotten all about the song you went in expecting to like most!\n\nOh now THIS is awesome. The Marshall Tucker Band lost my attention span in a few spots concerning their previous album (Long Hard Ride) but they MORE than make up for it with this masterpiece. &quot;Heard it in a Love Song&quot; is NOT the only worthwhile song like I ignorantly spent my entire life believing. No way. The album contains one masterpiece after another, and furthermore, I believe this is quite possibly the best musical representation of a cowboy novel ever laid down on tape.\n\n&quot;I Should Have Never Started Lovin' You&quot; isn't like anything I've ever heard the Marshall Tucker Band experiment with before. It's a slow-moving, jazzy, saxophone filled ballad of some kind, and the fact it's over 7 minutes means it *better* feature likeable traits because otherwise it would get boring after a while. The melody has an extremely strong and unavoidably depressing vibe- it's not exactly pure jazz or anything like that. It really is a straight up jazz ballad, and a memorable one at that.\n\nI have to laugh a little at the song title though. I mean, had they called it &quot;I Never Should Have Loved You&quot; it would have made more sense and gotten the point across easier without twisting words around in a confusing manner, but... then the magic of the lyrics wouldn't have worked, and the vocal melody would have been disappointing (or downright awkward) as well. Anyway, the trademark instrumental portion of the Marshall Tucker Band (you know, the instrumental solos that go from sax or violin directly into piano directly into guitar directly into *whatever*) is done particularly well here. Perhaps I just love the vibe, but this song really works for me.\n\nMy favorite is of course (of *course!*) &quot;Heard it in a Love Song&quot;. An upbeat vocal melody that does a perfectly suitable job illustrating the feeling of the southern rock movement that was honestly deteriorating by this point (the late 70's- thanks disco *sarcasm*). It's a well-paced love song, and it's fun singing along to the lyrics and the vocal melody but... yeah, that IS the question, isn't it? Is it really a ballad? I mean, some would argue it is, but the lyrics feel slightly unrelated to what we associate with a love song, and the pace isn't much different from -to use one example- the Allman Brothers Band's &quot;Ramblin' Man&quot; so I don't know. Interpret it anyway you wish.\n\n&quot;Desert Skies&quot; is a perfect ballad for a dreamy, star-gazing cowboy looking for a carefree life of outdoor adventure. The sax/violin/guitar solo in the middle illustrates a cowboy taking a ride on his horse during a full moon without a single care in the world. What a superb song though- everything about it. &quot;Tell It to the Devil&quot; is a wonderfully written country song with tasty instrumental solos including a banjo in the intro and nicely performed piano work later on. I love it, especially the line about picking up the Bible and memorizing every single line. A highly melodic and instantly enjoyable vocal melody too. &quot;Never Trust a Stranger&quot; has more of that western theme continuation with a rhythm that chugs along in an exciting way, and a really interesting guitar solo near the end. Oh, and I can tell you from past experience- NEVER trust a stranger, ever.\n\nI feel really terrible for believing the Marshall Tucker Band continued to gradually get worse, assuming the disco movement and the changing times may have swallowed them whole. However, the songwriting here proves the band had more talent hidden deep within, and here it is, revealed to you on Carolina Dreams.\n\n\n\n---------------------------------------------------------------------\nMarshall Tucker Band, The - Carolina Dreams\n---------------------------------------------------------------------\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 59 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Marshall Tucker Band, The - Fly Like an Eagle [03:04]\n2. Marshall Tucker Band, The - Heard It in a Love Song [04:58]\n3. Marshall Tucker Band, The - I Should Have Never Started Lovin' You[07:12]\n4. Marshall Tucker Band, The - Life in a Song [03:35]\n5. Marshall Tucker Band, The - Desert Skies [06:24]\n6. Marshall Tucker Band, The - Never Trust a Stranger [05:28]\n7. Marshall Tucker Band, The - Tell It to the Devil [06:45]","torrent":{"xt":"urn:btih:3bacb8d293a8e9a0b3a80a4f561526e3cc8b2a54","amp;dn":"The+Marshall+Tucker+Band+-+Carolina+Dreams+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bacb8d293a8e9a0b3a80a4f561526e3cc8b2a54","infoHashBuffer":{"type":"Buffer","data":[59,172,184,210,147,168,233,160,179,168,10,79,86,21,38,227,204,139,42,84]},"announce":[],"urlList":[]}}