{"title":"Neverwinter.Nights.2.Platinum.READ.NFO-BLACKCATS","uid":8159156,"size":15887222802,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3c486eb1da7726e16a9cdbd5c929d4244ec5c911&amp;dn=Neverwinter.Nights.2.Platinum.READ.NFO-BLACKCATS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZINC","files":-1,"time":1361216615,"description":"(c) Atari\n-------------\nNeverwinter Nights 2 (NWN2) is a computer role-playing  game set in the fantasy world of the Forgotten Realms,  one of the popular campaign settings of Dungeons and  Dragons. It takes the player from  the tiniest of  villages into a sweeping tale of danger and war,  chronicling their rise from a peasant to a full-fledged  hero of the Realms, defending it against one of the  greatest threats of the age. \n\n---  EXPANSION#1: Mask of the Betrayer\n\n  Mask of the Betrayer is an expansion pack for Neverwinter  Nights 2 and its core gameplay is identical. The game  uses the 3.5 edition rules of the tabletop role-playing  game Dungeons &amp; Dragons. Players can create a character  from scratch and make use of Mask of the Betrayer's new  races, classes, and feats, or import an existing character from Neverwinter Nights 2. Characters must be at level  18 to begin the game.The level cap has been raised  from 20 to 30, allowing for epic level characters and    accompanying prestige classes and feats. Mask of the  Betrayer features all of the races from Neverwinter Nights 2, as well as introducing two types of elves (the wild    elf and the half-drow), and four types of genasi.        It also contains two new base classes, the &quot;favored soul&quot;  and &quot;spirit shaman&quot;, and five new prestige classes.  Like other Dungeons &amp; Dragons games, the player character in Mask of the Betrayer generally relies on combat to  progress throughout the game. The hero has different      options in combat depending on their choice of class and  abilities, including melee or ranged physical attacks and  magical spells. The player character also has the  opportunity to solve puzzles occasionally, such as  breaking a contract with a devil by searching for  loopholes. Certain actions, such as defeating enemies,  result in the player character being awarded with  experience points which are used to gain levels and become more powerful. Throughout the adventure, the player        character is able to recruit followers and create a party. Each follower has their own agenda, and the hero may  alienate followers with their actions if they disagree  on a course of action.                                                             \n\n--- EXPANSION#2: Storm of Zehir\n\nIn the aftermath of the defeat of the King of Shadows,  the Sword Coast is in the midst of an uneasy economic  recovery. Trade syndicates have sprung up to exploit  the post-war confusion for their own ends. The players  party will wade into this uncertain environment; in order to increase their own fortunes, they can either ally with a syndicate to create a trade empire, or cut their own path through Faer?n by preying upon caravans and selling  the goods on the black market. As they attempt to extend  their influence, players will become aware of a new      faction working behind the scenes: the evil,  shapeshifting, serpentine Yuan-Ti.\n\nINSTALLATiON:\n1 Unpack release\n2 Run installer and install the original game first (when the game will ask for a key use one from SERIAL.txt)\n3 Install one by one expansions (if you want)\n4 Update the game with a native launcher to the latest (!) version (1.23.1765) *\n5 Play!\n----------------\n* NOTE: The latest version removes DRM  \n","torrent":{"xt":"urn:btih:3c486eb1da7726e16a9cdbd5c929d4244ec5c911","amp;dn":"Neverwinter.Nights.2.Platinum.READ.NFO-BLACKCATS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c486eb1da7726e16a9cdbd5c929d4244ec5c911","infoHashBuffer":{"type":"Buffer","data":[60,72,110,177,218,119,38,225,106,156,219,213,201,41,212,36,78,197,201,17]},"announce":[],"urlList":[]}}