{"title":"Daily Life in Traditional China_ The Tang Dynasty by Charles Ben","uid":9867947,"size":3423116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c480f58487ca414965ead70fc050c1a9d69a09b&amp;dn=Daily+Life+in+Traditional+China_+The+Tang+Dynasty+by+Charles+Ben&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"baboo456","files":1,"time":1396382316,"description":"This is smaller version of the .pdf file originally uploaded by flatwheels.\n\n-----------------------------------------------------\n\nDaily Life in Traditional China: The Tang Dynasty by Charles Benn\nISBN-10: 0313309558 | 336 pages\n\n\nThis thorough exploration of the aspects of everyday life in China during the Tang Dynasty (618-907) provides fascinating insight into a culture and time that is often misunderstood, especially by those from western cultures. Here students will find the details of what life was really like for these people. How was their society structured? How did they entertain themselves? What sorts of food did they eat? The answers to these and other questions are provided in full detail to bring this golden age of Chinese culture alive for the modern reader.\n\nBased mainly on classical translations from the Chinese themselves, each chapter addresses a specific aspect of daily living in the voices of those who lived during the time. A myriad of interesting details are provided to help readers discover, among other things, what life was like in the city, what homes and gardens were like, how the role's of men and women differed, and the many rituals in which people participated. Detailed descriptions of the clothes and materials people wore, the games they played and the cooking methods they used for specific foods provide readers with the ability to experiment on their own to recreate the time and place, so they can have a better understanding of this intriguing culture.\n","torrent":{"xt":"urn:btih:3c480f58487ca414965ead70fc050c1a9d69a09b","amp;dn":"Daily+Life+in+Traditional+China_+The+Tang+Dynasty+by+Charles+Ben","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c480f58487ca414965ead70fc050c1a9d69a09b","infoHashBuffer":{"type":"Buffer","data":[60,72,15,88,72,124,164,20,150,94,173,112,252,5,12,26,157,105,160,155]},"announce":[],"urlList":[]}}