{"title":"The English Civil War - Tristram Hunt (2002 - Retail epub)","uid":9368495,"size":6662083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d5f0cda490c698a5a99d482755ce8c2ca76cedc&amp;dn=The+English+Civil+War+-+Tristram+Hunt+%282002+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":5,"time":1387477672,"description":"Books : History : English\n\nThe famous struggles between Roundheads and Cavaliers, Puritans and Anglicans, and English, Scots and Irish get the TV treatment in Tristram Hunt's The English Civil War at First-Hand. Hot on the heels of Simon Schama's epic History of Britain comes another enjoyable account of the nation's past, narrated through the writings, speeches, proclamations, poetry, woodcuts and portraits of those who took part.\n\nHunt tells the story of Charles I's personal rule, the revolt of Parliament and subsequent civil war and the protectorate of Cromwell with economical pace and accuracy and with plenty of helpful datelines along the way. The documents are left to speak for themselves, and they allow the reader to see the struggles from different personal, religious and political perspectives. The visual material is impressive--Hunt and his team have gathered so much from so far--but not much attempt is made to analyse the implicit and explicit meanings of the iconography and portraiture.\n\nAt times the book reads a little too much like a broadcasting script, and those with some knowledge of the period will perhaps be left wanting more interpretive and historiographical pointers. Surely the same readers who can follow the cut and thrust of complex military and constitutional history are also able to understand the gladiatorial battles that have raged between generations of historians? But for an introduction to this brutal and explosive era, the crucible of the modern British state, this is as good a place as any to begin.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3d5f0cda490c698a5a99d482755ce8c2ca76cedc","amp;dn":"The+English+Civil+War+-+Tristram+Hunt+%282002+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d5f0cda490c698a5a99d482755ce8c2ca76cedc","infoHashBuffer":{"type":"Buffer","data":[61,95,12,218,73,12,105,138,90,153,212,130,117,92,232,194,202,118,206,220]},"announce":[],"urlList":[]}}