{"title":"The Abominable [2013][Dan Simmons][mobi/epub][INFERNO]","uid":9094319,"size":1951530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d6d46eaab06dcb8e6f67b3e43b60d101deb1ce5&amp;dn=The+Abominable+%5B2013%5D%5BDan+Simmons%5D%5Bmobi%2Fepub%5D%5BINFERNO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382650029,"description":"\n\nThe Abominable by Dan Simmons\n\n\nFormat: mobi/epub\nLength: 672 pages\nGenre: Horror/Suspense\nDate: 22 October 2013\n\nA thrilling tale of supernatural adventure, set on the snowy peaks of Mount Everest from the bestselling author of The Terror.\n\nIt's 1926, and the desire to summit the world's highest mountain has reached a fever-pitch among adventurers. Three young friends, eager to take their shot at the top, accept funding from a grieving mother whose son fell to his death on Mt. Everest two years earlier. But she refuses to believe he's dead, and wants them to bring him back alive.\n\nAs they set off toward Everest, the men encounter other hikers who are seeking the boy's body for their own mysterious reasons. What valuable item could he have been carrying? What is the truth behind the many disappearances on the mountain? As they journey to the top of the world, the three friends face abominable choices, actions--and possibly creatures. A bone-chilling, pulse-pounding story of supernatural suspense, THE ABOMINABLE is Dan Simmons at his best.\n\nAuthor:\n\nDan Simmons was born in Peoria, Illinois, in 1948, and grew up in various cities and small towns in the Midwest, including Brimfield, Illinois, which was the source of his fictional &quot;Elm Haven&quot; in 1991's SUMMER OF NIGHT and 2002's A WINTER HAUNTING. Dan received a B.A. in English from Wabash College in 1970, winning a national Phi Beta Kappa Award during his senior year for excellence in fiction, journalism and art. ","torrent":{"xt":"urn:btih:3d6d46eaab06dcb8e6f67b3e43b60d101deb1ce5","amp;dn":"The+Abominable+%5B2013%5D%5BDan+Simmons%5D%5Bmobi%2Fepub%5D%5BINFERNO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d6d46eaab06dcb8e6f67b3e43b60d101deb1ce5","infoHashBuffer":{"type":"Buffer","data":[61,109,70,234,171,6,220,184,230,246,123,62,67,182,13,16,29,235,28,229]},"announce":[],"urlList":[]}}