{"title":"Chris Ewan - The Good Thief's Guide to Vegas (Unabridged)","uid":8744369,"size":465485101,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3da95e05c475f08589381251e027053d4309277b&amp;dn=Chris+Ewan+-+The+Good+Thief%27s+Guide+to+Vegas+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alex_ktn","files":-1,"time":1374881171,"description":"The Good Thief's Guide to Vegas\nGood Thief's Guides Book #3\nBy Chris Ewan\n\nCharlie Howard - mystery writer and incorrigible thief - is in for a tough vacation in Las Vegas. Losing heavily at poker is one thing, but to find his literary agent, Victoria, being charmed by the Fifty-Fifty casino resort's star magician, Josh Masters, is another irritation entirely. Still, Charlie's not one to hold a grudge, least of all when he could be holding Masters' wallet. With access to the magician's deluxe suite now tantalizingly at hand, a spot of burglary seems to be in order and Charlie's only too happy to oblige. Problem is, everything's bigger in Sin City - including the fall-out from petty crimes - and it isn't long before Charlie and Victoria find themselves threatened with a one-way trip into the Nevada desert unless they can conjure up a small fortune in twenty-four hours. For Charlie, there's only one viable course of action: break into as many hotel rooms as he can, steal as much as possible, and just hope that Victoria can summon Lady Luck to the gaming table of her choice. Mind you, it would all be a lot easier if Charlie hadn't stumbled upon a dead woman, and if Josh Masters hadn't vanished in the middle of his act...\n\nUnabridged (ca. 8 hours 4 minutes)\nRead by Simon Vance\nMP3/128 bit\n\nEnjoy!","torrent":{"xt":"urn:btih:3da95e05c475f08589381251e027053d4309277b","amp;dn":"Chris+Ewan+-+The+Good+Thief%27s+Guide+to+Vegas+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da95e05c475f08589381251e027053d4309277b","infoHashBuffer":{"type":"Buffer","data":[61,169,94,5,196,117,240,133,137,56,18,81,224,39,5,61,67,9,39,123]},"announce":[],"urlList":[]}}