{"title":"The George Palmer-Jones Mystery Collection - Ann Cleeves","uid":7009199,"size":414460162,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3da95f3b07d246d74570cb5d43255e911261d534&amp;dn=The+George+Palmer-Jones+Mystery+Collection+-+Ann+Cleeves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":58,"time":1328376863,"description":"All from cassette tapes and unabridged.\n32 kbps / 22 kHz Mono CBR Fraunhofer MP3.\n\n\n\nBritish mystery series featuring bird-watcher and crime solver George Palmer-Jones.\n\nSea Fever [1991], 6 hours 21 mins, read by Ric Jerrom\nThe birdwatching weekend in Cornwell becomes memorable when a small band of fanatical birdwatchers aboard the 'Jessie Ellen' - among them amateur detective George Palmer-Jones - sights a seabird that has never been recorded. In the excitement, no-one notices the sudden absence of Greg Franks, the most aggressive birder of them all. Later, Frank's corpse, the head bludgeoned, is found floating in the sea and George unhappily shoulders the burden of finding his killer. Who hated Franks enough to kill him?\n\nAnother Man's Poison [1992], 7 hours 14 mins, read by Alexander John\nWhen she finds her beloved cats and some protected wildfowl dead of illegal poison, elderly Ursula Ottway threatens to expose her landlord, politician Marcus Grenville, as an anti-preservationist. Within hours, Ursula is dead . . . by the same illegal poison. Now, as George and Molly Palmer-Jones reconstruct Ursula's last days, it becomes clear that her sharp eyes and long memory had posed a deadly threat not only to Marcus, but to his chilly wife, his alienated offspring, and others. To bring a killer to justice, Molly and George must uproot a lifetime's worth of secrets and expose a nest of vicious human vultures.\n\nThe Mill on the Shore [1994] , 7 hours 37 mins, read by Stephen Thorne\nWhen Jimmy Morrissey, England's celebrated conservation conscience, kills himself with an overdose of antidepressants, the whole country mourns with his grieving widow. But private investigators Molly and George Palmer-Jones are convinced that what looks like suicide is really murder. After all, Jimmy made a lot of enemies while crusading as an environmental activist. Could one of them have been his wife?\n\nHigh Island Blues [1996], 7 hours 24 mins, read by Ric Jerrom\nAmong the birders from around the world gathered for the dazzling spring avian migration on the Texas coast are three old friends from England--Rob, Mick, and Oliver--celebrating the twentieth anniversary of their first unforgettable trip to High Island. But the party's over when Mick--the introvert who surprisingly got the girl they all wanted years ago--is murdered. The police tag Rob for the crime, but shrewd birder-investigator George Palmer-Jones focuses his attention on some odd ducks among the English contingent. Meanwhile, back home in England, George's wife, Molly, digs up the dirt on a save-the-earth society. And on High Island, a killer finds that one murder is not enough. . .\n\n* Note that although these rare recordings are from cassette tapes, the sound quality is generally hiss free and clear. The narrators are excellent.\n* No CD or Electronic Download versions of any of these titles are available to my knowledge.\n* The author wrote eight titles in this engaging British murder mystery series, but as far as I can tell, only these last four have been released in audio format.","torrent":{"xt":"urn:btih:3da95f3b07d246d74570cb5d43255e911261d534","amp;dn":"The+George+Palmer-Jones+Mystery+Collection+-+Ann+Cleeves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da95f3b07d246d74570cb5d43255e911261d534","infoHashBuffer":{"type":"Buffer","data":[61,169,95,59,7,210,70,215,69,112,203,93,67,37,94,145,18,97,213,52]},"announce":[],"urlList":[]}}