{"title":"Deep Time (2012) [MP3 320]","uid":7454384,"size":85820154,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3dde889cd873369c54ecdcf0bb4fd94c2852d7a1&amp;dn=Deep+Time+%282012%29+%5BMP3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1342624336,"description":"\n  Deep Time (2012) [MP3 320]\n\n  Released: 2012\n  Genre: Pop/Rock\n  Styles: Indie Rock\n  Codec: MP3\n  Bit Rate: 320 CBR\n  Cover: Front\n \n  01 Bermuda Triangle\n  02 Sgt. Sierra\n  03 Coleman\n  04 Clouds\n  05 Homebody\n  06 Gilligan\n  07 Gold Rush\n  08 Marathon\n  09 Horse\n\n  Before changing their name from Deep Time due to legal conflict, Austin, Texas' minimal pop duo Yellow Fever lingered in a nebulous area of obscurity. They toured constantly and captured the attention of a good many folks, but in the tumultuous indie landscape of 2006-2010, acts like the Vivian Girls and Best Coast rose to mass appeal with their punked-out updates on the girl group sound while Yellow Fever were sidelined. Founding member Jennifer Moore was splitting her time with Austin's doo wop/girl group revivalist supergroup the Carrots, so strains of that influence in Yellow Fever were undeniable, but they approached their songs from such a remarkable distance that the subtle melodic crosscurrents could be lost on some listeners, leaving the band coming off as cold or deadpan. On its self-titled debut as Deep Time, the band is a few years older and even deeper into its clinically crafted indie minimalism. The album is densely dynamic, but never relies on loud-then-soft cliches or screaming histrionics to make any of its points. Instead, Moore and Jones sound eternally cool-headed and deceptively even-keeled as they play their songs that are anything but breezy or carefree. The core of anxiety and unrest that lies in the heart of the album is presented so offhandedly, listeners will be happily repeating songs several times before it even starts to register.","torrent":{"xt":"urn:btih:3dde889cd873369c54ecdcf0bb4fd94c2852d7a1","amp;dn":"Deep+Time+%282012%29+%5BMP3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dde889cd873369c54ecdcf0bb4fd94c2852d7a1","infoHashBuffer":{"type":"Buffer","data":[61,222,136,156,216,115,54,156,84,236,220,240,187,79,217,76,40,82,215,161]},"announce":[],"urlList":[]}}