{"title":"HERBIE HANCOCK  -  CANTELOPE ISLAND-VIRUSOFSATEN","uid":4711600,"size":43383505,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ec2f73e3c93eaff1ed95852cf33223b364afdf3&amp;dn=HERBIE+HANCOCK++-++CANTELOPE+ISLAND-VIRUSOFSATEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virusofsaten","files":-1,"time":1234044110,"description":"HERBIE HANCOCK  -  MP4  .\n\n\n\n\n\n\n\n\n\n\n\nBiography\n\n\nHerbie Hancock\n\n\nHerbie Hancock will always be one of the most revered and controversial figures in jazz -- just as his employer/mentor Miles Davis was when he was alive. Unlike Miles, who pressed ahead relentlessly and never looked back until near the very end, Hancock has cut a zigzagging forward path, shuttling between almost every development in electronic and acoustic jazz and R&amp;B over the last third of the 20th century. Though grounded in Bill Evans and able to absorb blues, funk, gospel, and even modern classical influences, Hancock's piano and keyboard voices are entirely his own, with their own urbane harmonic and complex, earthy rhythmic signatures -- and young pianists cop his licks constantly. Having studied engineering and professing to love gadgets and buttons, Hancock was perfectly suited for the electronic age; he was one of the earliest champions of the Rhodes electric piano and Hohner clavinet and would field an ever-growing collection of synthesizers and computers on his electric dates. Yet his love for the grand piano never waned, and despite his peripatetic activities all around the musical map, his piano style continues to evolve into tougher, ever-more-complex forms. He is as much at home trading riffs with a smoking funk band as he is communing with a world-class post-bop rhythm section -- and that drives purists on both sides of the fence up the wall. Having taken up the piano at age seven, Hancock quickly became known as a prodigy, soloing in the first movement of a Mozart piano concerto \nwith the Chicago Symphony at the age of 11. After studies at Grinnell College, Hancock was invited by Donald Byrd in 1961 to join his group in New York City, and before long, Blue Note offered him a solo contract. His debut album, Takin' Off, took off indeed after Mongo Santamaria covered one of the album's songs, &quot;Watermelon Man.&quot; In May 1963, Miles Davis asked him to join his band in time for the Seven Steps to Heaven sessions, and he remained there for five years, greatly influencing Miles' evolving direction, loosening up his own style, and upon Miles' suggestion, converting to the Rhodes electric piano. In that time span, Hancock's solo career also blossomed on Blue Note, pouring forth increasingly sophisticated compositions like &quot;Maiden Voyage,&quot; &quot;Cantaloupe Island,&quot; &quot;Goodbye to Childhood,&quot; and the exquisite &quot;Speak Like a Child.&quot; He also played on many East Coast recording sessions for producer Creed Taylor and provided a groundbreaking score to Michelangelo Antonioni's film Blow Up, which gradually led to further movie assignments. Having left the Davis band in 1968, Hancock recorded an elegant funk album, Fat Albert Rotunda, and in 1969 formed a sextet that evolved into one of the most exciting, forward-looking jazz-rock groups of the era. Now deeply immersed in electronics, Hancock added the synthesizer of Patrick Gleeson to his Echoplexed, fuzz-wah-pedaled electric piano and clavinet, and the recordings became spacier and more complex rhythmically and structurally, creating its own corner of the avant-garde. By 1970, all of the musicians used both English and African names (Herbie's was Mwandishi). Alas, Hancock had to break up the band in 1973 when it ran out of money, and having studied Buddhism, he concluded that his ultimate goal should be to make his audiences happy. The next step, then, was a terrific funk group whose first album, Head Hunters, with its Sly Stone-influenced hit single, &quot;Chameleon,&quot; became the biggest-selling jazz LP up to that time. Now handling all of the synthesizers himself, Hancock's heavily rhythmic comping often became part of the rhythm section, leavened by interludes of the old urbane harmonies. Hancock recorded several electric albums of mostly superior quality in the '70s, followed by a wrong turn into disco around the decade's end. In the meantime, Hancock refused to abandon acoustic jazz. After a one-shot reunion of the 1965 Miles Davis Quintet (Hancock, Ron Carter, Tony Williams, Wayne Shorter, with Freddie Hubbard sitting in for Miles) at New York's 1976 Newport Jazz Festival, they went on tour the following year as V.S.O.P. The near-universal acclaim of the reunions proved: that Hancock was still a whale of a pianist; that Miles' loose mid-'60s post-bop direction was far from spent; and that the time for a neo-traditional revival was near, finally bearing fruit in the '80s with Wynton Marsalis and his ilk. V.S.O.P. continued to hold sporadic reunions through 1992, though the death of the indispensable Williams in 1997 cast much doubt as to whether these gatherings would continue. Hancock continued his chameleonic ways in the '80s: scoring an MTV hit in 1983 with the scratch-driven, proto-industrial single &quot;Rockit&quot; (accompanied by a striking video); launching an exciting partnership with Gambian kora virtuoso Foday Musa Suso that culminated in the swinging 1986 live album Jazz Africa; doing film scores; and playing festivals and tours with the Marsalis brothers, George Benson, Michael Brecker, and many others. After his 1988 techno-pop album, Perfect Machine, Hancock left Columbia (his label since 1973), signed a contract with Qwest that came to virtually nothing (save for A Tribute to Miles in 1992), and finally made a deal with PolyGram in 1994 to record jazz for Verve and release pop albums on Mercury. Well into a youthful middle age, Hancock's curiosity, versatility, and capacity for growth showed no signs of fading, and in 1998 he issued Gershwin's World. His curiosity with the fusion of electronic music and jazz continued with 2001's Future 2 Future, but he also continued to explore the future of straight-ahead contemporary jazz with 2005's Possibilities. An intiguing album of jazz treatments of Joni Mitchell compositions, called River: The Joni Letters, was released in 2007. ~ Richard S. Ginell, All Music Guide\n\n\n\n\n\n\n\n   \n\n\n   \n     * AFTER DOWNLOADING PLEASE SEED SO OTHERS CAN DOWNLOAD THIS TORRENT AS WELL*\n\n\n  {IF EVERY ONE SEEDS TO A 3.0 % RATIO THE NEXT PERSON WILL GET THERE FILE QUICKER}\n\n                {THE MORE SEEDERS THERE ARE THE FASTER THE DOWNLOAD}\n\n\n                         {PLEASE ENJOY FROM THE VIRUSOFSATEN}\n          \n\n                                {LETS SHARE THE FILES}\t\n\n\n                         {SUPPORT THE BAY DOWNLOAD AND SEED}\n\n","torrent":{"xt":"urn:btih:3ec2f73e3c93eaff1ed95852cf33223b364afdf3","amp;dn":"HERBIE+HANCOCK++-++CANTELOPE+ISLAND-VIRUSOFSATEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec2f73e3c93eaff1ed95852cf33223b364afdf3","infoHashBuffer":{"type":"Buffer","data":[62,194,247,62,60,147,234,255,30,217,88,82,207,51,34,59,54,74,253,243]},"announce":[],"urlList":[]}}