{"title":"Encyclopedia of United States National Security-EBOOK-SHAREGO.ra","uid":4503469,"size":20355123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f054b14a8034f1e4507da03b5aaa20413802fb7&amp;dn=Encyclopedia+of+United+States+National+Security-EBOOK-SHAREGO.ra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":1,"time":1226499095,"description":"Encyclopedia of United States National Security-EBOOK-SHAREGO\n\nWith over 750 entries, the Encyclopedia of United States National Security is the first single, concise reference source to provide accurate and informative answers to the many challenging questions of how, why, when, and where national security has evolved. In addition to presenting historical facts and analyses, this two-volume encyclopedia is designed to provide a comprehensive introduction to some of the more complicated and abstract questions concerning world politics and national security. A thoroughly interdisciplinary work, this encyclopedia views national security from historical, economic, political, and technological perspectives.\n\nKey Features\n\n* Examines the full range of contemporary weapons systems including air, sea, and land warfare; ballistic missile defense; space weapons; stealth technology; antisubmarine warfare; and biological weapons\n* Explores much more than the use of force as protection by introducing competing paradigms, such as economic and diplomatic tools in security strategy\n* Includes excerpts from treaties, speeches, and other sources and provides an overview of important events such as scandals and breaches of national security\n* Offers a close look at the leaders and thinkers that shaped U.S. security policy as well as individuals who have had the greatest impact upon U.S. national security\n[img]http://images1.filecloud.com/607500/Appriciation.gif[/img]\n","torrent":{"xt":"urn:btih:3f054b14a8034f1e4507da03b5aaa20413802fb7","amp;dn":"Encyclopedia+of+United+States+National+Security-EBOOK-SHAREGO.ra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f054b14a8034f1e4507da03b5aaa20413802fb7","infoHashBuffer":{"type":"Buffer","data":[63,5,75,20,168,3,79,30,69,7,218,3,181,170,162,4,19,128,47,183]},"announce":[],"urlList":[]}}