{"title":"Bobby Vee &amp; The Shadows - The Early Rockin' Years (1995)","uid":8425901,"size":293697120,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f0f31efab56ea425323879281967b9e738de376&amp;dn=Bobby+Vee+%26amp%3B+The+Shadows+-+The+Early+Rockin%27+Years+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":27,"time":1367345863,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nBobby Vee &amp; The Shadows - The Early Rockin' Years (1995)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41C4Q24SK2L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41C4Q24SK2L._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by John Bush):\n\nHe launched his career as a fill-in for the recently deceased Buddy Holly, Bobby Vee scored several pop hits during the early '60s, that notorious period of popular music sandwiched between the birth of rock &amp; roll and the rise of the British Invasion. Though a few of his singles -- &quot;Rubber Ball,&quot; for one -- were as innocuous as anything else from the era, Vee had a knack for infectious Brill Building pop, thanks to his ebullient voice as well as the cadre of songwriters standing behind him.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/bobby-vee-p5750/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/bobby-vee-p5750/biography&lt;/a&gt;\n\nAll Music Album Review (by Bruce Eder):\n\nBobby Vee was mostly defined for a lot of listeners by the cloying pop/rock of &quot;Take Good Care of My Baby&quot; and related hits of the early '60s, but as his full recorded history reveals, he had a lot more strings to his bow -- not just after that song, but long before, as listeners discover on this collection of mostly early sides recorded with his band the Shadows (no relation to the English group of that name). This side of Vee's output is usually acknowledged in terms of his obvious debt to Buddy Holly, and the lanky Texas legend's influence can be heard throughout. In that regard, it's all derivative rock &amp; roll, but it's also nicely done and pretty solid material by what amounted to a talented second-tier (or third-tier) act of the late '50s who needed a break -- and that break would come, though not on this material. It's still worth hearing in the same way that those innumerable Buffalo Bop compilations of late-'50s rock &amp; roll and rockabilly sides are. The crudest stuff here, including &quot;Lonely Love&quot; (which apparently only exists as an acetate), is the most interesting and exciting, but even the ballad sides like &quot;Love Must Have Passed Me By&quot; -- self-produced by Vee and the band in Minnesota -- are worth a listen or two, not just for their unforced honesty, but also for what they reveal of what Vee brought to the table when he finally crossed paths with producer Snuff Garrett. One realizes that it was Vee who helped point Garrett in the direction that the producer later used to such startlingly good effect with a later artist, Gary Lewis. It's on these sides that the persona of the ur-nebbish -- which Lewis became in a successful ride to the top of the charts -- first really manifests itself within something close to Garrett's orbit. The sound is variable, in keeping with the rough sources for some of the material, but overall the package is a lot of fun and highly informative, and it's difficult to find anything to complain about in the addition of the better part of an hour of Vee's rock &amp; roll rejoining the catalog.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-early-rockin-years-r238898/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-early-rockin-years-r238898/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000000RYK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000000RYK&lt;/a&gt;\n\nTrack List:\n\n01. Flyin' High\n02. Suzie Baby\n03. Lonely Love\n04. Love Must Have Passed Me By\n05. It's Too Late\n06. Laurie\n07. Remember The Day\n08. That'll Be The Day\n09. Susie Q\n10. White Silver Sands\n11. Butterfly\n12. Party Doll\n13. Bye Bye Love\n14. Wishing\n15. Leave Me Alone\n16. What'll I Do\n17. Toy Soldier\n18. Loco\n19. Card Shark\n20. Mindreader\n","torrent":{"xt":"urn:btih:3f0f31efab56ea425323879281967b9e738de376","amp;dn":"Bobby+Vee+%26amp%3B+The+Shadows+-+The+Early+Rockin%27+Years+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0f31efab56ea425323879281967b9e738de376","infoHashBuffer":{"type":"Buffer","data":[63,15,49,239,171,86,234,66,83,35,135,146,129,150,123,158,115,141,227,118]},"announce":[],"urlList":[]}}