{"title":"UFO Chronicles - Aliens And UFOs Exist (Documentary)","uid":10971564,"size":944639154,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3f3922dd544373c17a2871bfcf0e8d63622b41ce&amp;dn=UFO+Chronicles+-+Aliens+And+UFOs+Exist+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mooseleg8","files":-1,"time":1409799056,"description":"Dr. Steven Greer, Founder and Director of the Disclosure Project and Project Orion, speaks frankly about his compilation of over 400 government, military and intelligence witnesses testifying to their direct, firsthand experience with UFOs, ET technology, and the cover-up and/or suppression of evidence of an Alien presence on earth. Commander Graham Bethune, a Navy Pilot who has extensively documented an eight minute encounter with an &quot;Unidentified Flying Object&quot; that was 300 feet in diameter, discusses this mind blowing encounter and many others experienced by pilots and air traffic controllers around the globe. Jim Marrs is a New York Times best-selling author of books and articles on a wide range of alleged cover-ups and conspiracies. Mr. Marrs is a prominent figure in the JFK conspiracy press and his book &quot;Crossfire&quot; was a source for Oliver Stone's film &quot;JFK.&quot; He has written books asserting the existence of government conspiracies regarding aliens, 9/11, telepathy, and secret societies. In this frank interview, Marrs reveals the true nature to the conspiracy of control by the ruling elite.","torrent":{"xt":"urn:btih:3f3922dd544373c17a2871bfcf0e8d63622b41ce","amp;dn":"UFO+Chronicles+-+Aliens+And+UFOs+Exist+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f3922dd544373c17a2871bfcf0e8d63622b41ce","infoHashBuffer":{"type":"Buffer","data":[63,57,34,221,84,67,115,193,122,40,113,191,207,14,141,99,98,43,65,206]},"announce":[],"urlList":[]}}