{"title":"ACTA leaked documents - 2009 [PDF-ENG]","uid":5452210,"size":5472021,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3f6aee3cd08b98d3dc02bc3b74f0e1405794ed95&amp;dn=ACTA+leaked+documents+-+2009+%5BPDF-ENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"exportacc","files":1,"time":1269222392,"description":"[align=center]\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?showforum=395][IMG]http://img21.imageshack.us/img21/8945/freeculture.gif[/IMG][/URL]\n[/align]\n\n\nBozza dell'ACTA (Anti-Counterfeit Trade Agreement - Accordo Commerciale Anti-Contraffazione) \n[per i neofiti: l'ACTA riguarda la censura del p2p]\n\nil PDF e' in Inglese, sono scansioni di bozza, provenienti da una fonte giapponese.\n\nriporto in seguito la descrizione in tedesco, come era presente nel motore di ricerca torrent su I2P:\n[indirizzo del torrent e descrizione: [URL=http://tracker2.postman.i2p/index.php?view=TorrentDetail&amp;id=5727]http://tracker2.postman.i2p/index.php?view=TorrentDetail&amp;id=5727[/URL] il link e' accessibile solo da darknet I2P]\n\n[QUOTE]\n\n\n    * Details for Torrent: ACTA       ( 1 comments for this torrent - Scroll down! )\n\n\nTorrentfile: \tACTA.torrent\nInfohash: \t3F6AEE3CD08B98D3DC02BC3B74F0E1405794ED95\nCategory: \tLeaked Documents\nProperties: \t\nNo extra properties\nDescription: \tKennt ihr schon ACTA?\nAnti-Counterfreit Trade Agreement.\n???\nPersÃƒÂ¶nlichkeitsrecht, Grundrecht auf Information , Datenschutz.\nDas wollen die uns mit diesem Vertrag nehmen.\nSchaut euch den Entwurf an.\nLeider nur in Englisch.\n\n\n\n\n\nDas Anti-Counterfreit Trade Agreement (ACTA) ist wohl eines der geheimsten Verhandlungsthemen, die gegenwÃƒÂ¤rtig auf der Tagesordnung stehen. Nun ist ein Entwurf des Vertrages mit Diskussionsinhalten geleaked.\n\n\nDass der Entwurf aus gutem Grund so heiÃƒÅ¸t, dÃƒÂ¼rfte klar sein. Er stellt nicht die endgÃƒÂ¼ltige Fassung dar, was insbesondere durch die zahlreichen Kommentare unterstrichen wird, welche seitens der Verhandlungspartner eingeworfen werden.\n\nWÃƒÂ¤re der Sachverhalt nicht so ernst, kÃƒÂ¶nnte man ÃƒÂ¼ber einige der EinwÃƒÂ¼rfe fast lachen. Es scheint nÃƒÂ¤mlich so, als seien sich die Teilnehmer der Verhandlungen nicht wirklich so einig, wie man dies gerne prÃƒÂ¤sentiert. Aus dem geleakten Dokument ist ersichtlich, dass in regelmÃƒÂ¤ÃƒÅ¸igen AbstÃƒÂ¤nden &quot;LÃƒÂ¶schaufforderungen&quot; von bestimmten Seiten ergehen, wenn nicht die Kommentare zu einem Paragraphen lÃƒÂ¤nger sind als dieser selbst.\n\nDer geleakte Entwurf bezieht sich bedauerlicherweise primÃƒÂ¤r auf physische Raubkopien und Markenrechtsverletzungen. Der Abschnitt bezÃƒÂ¼glich Rechtsverletzungen im Internet fehlt bislang, jedoch ist dieser fÃƒÂ¼r eine grobe Vorstellung, was die BÃƒÂ¼rger der verhandelnden Nationen erwartet, auch nicht notwendig.\n\nWÃƒÂ¤hrend anfÃƒÂ¤nglich Details ÃƒÂ¼ber das Protokoll besprochen werden, gelangt man relativ rasch an den Kern der Sache. So soll eine engere Zusammenarbeit zwischen staatlichen BehÃƒÂ¶rden und Rechteinhabern umgesetzt werden. Entsprechend den Inhalten des Dokumentes ist dies so vorgesehen, dass sich die staatlichen Organe auf Informationen seitens der Rechteinhaber verlassen und von diesen auch solche anfordern kÃƒÂ¶nnen, falls notwendig. Eine eigenstÃƒÂ¤ndige Ermittlung ist zwar erwÃƒÂ¼nscht, wenn die Rechteinhaber jedoch ausreichendes Material liefern, so wird anhand diesem eingegriffen. Dass die Rechteinhaber ein bewusstes Interesse an der Unterbindung von MarkenfÃƒÂ¤lschungen und Raubkopien haben, sollte kein Geheimnis sein. Scheinbar gewÃƒÂ¤hrt man einer solchen voreingenommen Partei damit jedoch uneingeschrÃƒÂ¤nktes Vertrauen.\n\nEin weiterer wichtiger Punkt, der sich fÃƒÂ¼r die Rechteinhaber ausspricht, wird auf der vierten Seite festgehalten. Dort heiÃƒÅ¸t es, dass die Rechteinhaber nicht fÃƒÂ¼r die administrativen Kosten aufkommen soll, die durch einen Antrag auf Unterbindung entstehen. Dieser Antrag kann seitens der Rechteinhaber eingereicht werden, wenn diese die BehÃƒÂ¶rden gezielt auf die rechtsverletzenden Taten hinweisen wollen. In einem akzeptablen Zeitraum sollen die BehÃƒÂ¶rden die Rechteinhaber darÃƒÂ¼ber informieren, ob der Antrag umgesetzt wird und falls dem so ist, wie lange man dies wahrnehmen wird.\n\nIm Folgenden wird dann darauf hingewiesen, dass alle Vertragspartner MaÃƒÅ¸nahmen zur VerfÃƒÂ¼gung stellen mÃƒÂ¼ssen, die es den Rechteinhabern ermÃƒÂ¶glichen, auf Anfrage die BehÃƒÂ¶rden dazu zu veranlassen, die Verbreitung von illegal reproduzierten GÃƒÂ¼tern zu unterbinden. Im weiteren Verlauf wird verdeutlicht, dass die BehÃƒÂ¶rden auch aus eigener Initiative heraus dies umsetzen sollen. Besonders interessant ist jedoch der Vermerk, dass bereits bei einem Verdacht so vorgegangen werden soll.\n\nUm sicherzustellen, ob es sich schlussendlich wirklich um eine Rechtsverletzung handelt, haben die BehÃƒÂ¶rden alle Materialien sicherzustellen. Bis zu diesem Punkt denkt man womÃƒÂ¶glich noch, alles ist gut. Was darauf folgt, lÃƒÂ¤sst jedoch erneut aufhorchen. So haben die BehÃƒÂ¶rden nach der Sicherstellung der Materialien die Rechteinhaber ÃƒÂ¼ber folgende Details (!) zu informieren: Name und Adresse des Importeurs, Exporteurs, VerkÃƒÂ¤ufers sowie eine Beschreibung der GÃƒÂ¼ter, deren Menge sowie - falls mÃƒÂ¶glich - das Herstellungsland sowie den Namen und die Adresse des Erzeugers.\n\nUm eine bessere Zusammenarbeit zwischen den Nationen zu ermÃƒÂ¶glichen, soll ein Kontrollgremium in jedem Land entstehen, welches sich um die Belange des ACTA-Vertrages kÃƒÂ¼mmert. Dabei soll das Gremium die Umsetzung der ACTA-Richtlinien ÃƒÂ¼berwachen und kontrollieren.\n\nDas zweite Kapitel, Sektion 1, handelt von der zivilrechtlichen DurchfÃƒÂ¼hrung der Vereinbarung. Hier wird darauf hingewiesen, dass das zivilrechtliche Verfahren nicht notwendigerweise kompliziert oder kostenintensiv gestaltet werden soll und keine untragbaren Wartezeiten mit sich bringen darf. Besonders interessant gestaltet sich noch ein finales Element dieses Diskussions-Entwurfes. So soll der entstandene Schaden durch die Rechtsverletzung auch geschÃƒÂ¤tzt werden dÃƒÂ¼rfen, falls keine exakten Werte ermittelt werden dÃƒÂ¼rfen.\n &lt;a href=&quot;\nhttp://www.gulli.com/news/acta-entwurf-geleaked-2009-04-12&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gulli.com/news/acta-entwurf-geleaked-2009-04-12&lt;/a&gt;\n\n\n\nDer Druck auf die politischen Partner wird erhÃƒÂ¶ht. Die USA will schon 2010 eine Einigung erzielen.\n\n\nLaut unterschiedlichen Medienberichten und ausgehend von den BÃƒÂ¼rgerrechtsbewegungen EFF (USA) und La Quadratur du Net (Frankreich) verstÃƒÂ¤rkt die USA den Druck auf die Partner beim so genannten ACTA-Abkommen. ACTA (Anti-Counterfeiting Trade Agreement) soll den &quot;Schutz geistigen Eigentums&quot; gewÃƒÂ¤hrleisten. BekanntermaÃƒÅ¸en wird ausschlieÃƒÅ¸lich hinter verschlossenen TÃƒÂ¼ren verhandelt, deswegen sind Einzelheiten nicht bekannt - es ist aber davon auszugehen, dass das geplante ACTA-Abkommen ganz deutlich gegen BÃƒÂ¼rgerrechte verstoÃƒÅ¸en wird, zum Beispiel indem eine &quot;Three-Strikes&quot;-ÃƒÂ¤hnliche Regel bei UrheberrechtsverstoÃƒÅ¸en verpflichtend werden kÃƒÂ¶nnte. Als demokratisch kann man also den gesamten Verhandlungsprozess nicht einstufen. Angeblich haben die Amerikaner jetzt den Druck auf die Verhandlungspartner deutlich erhÃƒÂ¶ht. Das schlussfolgerte die EFF aufgrund einer Mitteilung des US-Handelsministeriums. Denn in der nÃƒÂ¤chsten Verhandlungsrunde in Mexiko 2010 soll auf der Agenda eine Einigung &quot;so schnell wie mÃƒÂ¶glich&quot; stattfinden.\n\nEs gilt als sicher, dass das ACTA-Abkommen eine Zusammenarbeit zwischen der Content-Industrie und den Internet-Service-Providern vorsehen soll. Der Rechtsprofessor Michael Geist geht davon aus, dass die EU dadurch deutliche Nachteile zu erwarten hÃƒÂ¤tte, da durch das Abkommen die restriktiven GrundsÃƒÂ¤tze des DMCA (Digital Millennium Copyright Act) als Exportartikel in der ganzen Welt etabliert werden sollen.\n\nDie franzÃƒÂ¶sischen BÃƒÂ¼rgerrechtler von La Quadrature du Net warnten davor, dass die EU-Kommission die restriktive Sichtweise der Verhandlungspartner auch fÃƒÂ¼r Europa ÃƒÂ¼bernehmen kÃƒÂ¶nnte. Ein deutlich verschÃƒÂ¤rftes Urheberrecht fÃƒÂ¼r Europa wÃƒÂ¤re die einzig logische und konsequente Folge dieses Prozesses.\n\nAuch in Deutschland werden die Verhandlungen kritisiert. Die Piratenpartei kommentierte in einer Pressemitteilung: &quot;Die Piratenpartei Deutschland kritisiert nicht nur den Inhalt des Abkommens scharf, sondern auch die Art und Weise, wie es geheim ausgearbeitet wird: Die bereits bekannt gewordenen Details mÃƒÂ¼ssen sorgfÃƒÂ¤ltig geprÃƒÂ¼ft werden. Nicht nur Verletzer des Urheberrechts, sondern auch ganz normale Nutzer des Internets werden von den geplanten neuen Regeln betroffen sein. Ein breites Netzwerk aus BÃƒÂ¼rgerrechts-, Entwicklungshilfe- und BibliotheksverbÃƒÂ¤nden sowie BÃƒÂ¼ndnisse aus Schwellen- und EntwicklungslÃƒÂ¤ndern haben jÃƒÂ¼ngst einen breiteren Zugang zu Wissen und Kultur gefordert. Auch haben sich die MehrheitsverhÃƒÂ¤ltnisse in der &quot;World Intellectual Property Organization&quot; (WIPO) geÃƒÂ¤ndert, die fÃƒÂ¼r die geistigen Monopolrechte zustÃƒÂ¤ndig ist. Das ist ein Grund, warum jetzt begonnen wurde, neu zu verhandeln. Die Deutungshoheit soll wieder zugunsten der LobbyverbÃƒÂ¤nde der Rechteindustrie verschoben werden.&quot;\n\n&quot;Durch die strikte Geheimhaltung der Inhalte des ACTA-Papiers soll die ÃƒÂ¶ffentliche Diskussion vermieden werden. WÃƒÂ¤hrend die Interessenvertreter der Rechteinhaber an dem Vertragswerk mitschreiben, werden der Internetwirtschaft und den Nutzergruppen nur Ausschnitte zugÃƒÂ¤nglich gemacht, die an rigide Verschwiegenheitsabkommen gekoppelt sind.&quot;\n\nThorsten Wirth, Vorstandsmitglied der Piratenpartei, kommentierte, dass &quot;ein Abkommen von derartiger Tragweite nicht hinter verschlossenen TÃƒÂ¼ren verhandelt werden dÃƒÂ¼rfte&quot;. Er und seine Partei sehen massive BeeintrÃƒÂ¤chtigungen der PersÃƒÂ¶nlichkeitsrechte eines jeden BundesbÃƒÂ¼rgers, sowie die potenzielle Beschneidung des Grundrechts auf Information. Auch ist davon auszugehen, dass die Fragen des Datenschutzes im Zuge der Verhandlungen, wenn ÃƒÂ¼berhaupt, viel zu wenig berÃƒÂ¼cksichtigt werden.\n &lt;a href=&quot;\nhttp://www.gulli.com/news/acta-geheimes-abkommen-gegen-grundrechte-und-freiheit-2009-11-21&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gulli.com/news/acta-geheimes-abkommen-gegen-grundrechte-und-freiheit-2009-11-21&lt;/a&gt;\n\nRating: \t(4.05) (1 user ratings ) You must login to rate a torrent!\nSize: \t5.22 MB\nHits: \t122\nDownloads: \t33\nAdded: \t2009-11-21 21:47:27\nOwner: \tsmoke\nAnon Comments: \tyes\nBanned: \tno\nVisible: \tyes\nLast active: \t2010-02-10 01:49:47\nFilelist: \t\nFilename \tFilesize\n./acta-drafts-2009.pdf \t5.22 MB\nAttached files: \t\nNo Attachments uploaded. \n\n[/QUOTE]\n\nTipo File: PDF\nPagine: 48\nLingua: Inglese\nTitolo: Anti Counterfeiting Trade Agreement\nAutore: u.s. government, e giappone\nGenere: Leaked Document, contiene varie bozze di varie date, con interventi (proposte dei vari paesi), il documento era previsto che venisse desecretato nel 2018. Le bozze iniziano dal Maggio 2008.\n\nIntestazione di una delle parti: [QUOTE]\n\n\t\t\t\tJapan-US JOINT PROPOSAL\n\t\tThis Document Contains Foreign Government Information to be treated as \n\t\t\tU.S. CONFIDENTIAL MODIFIED HANDLING AUTHORIZED*\n\n\t\t\t\t\t\t\tMydocs/misc/acta_revised_border_measures\n\n\n\t\t\t\tJAPAN-U.S. JOINT PROPOSAL \n\n\t\t\tAnti-Counterfeiting Trade Agreement\n\n[...]\n\n\nDerived From: Classification Guidance\n\t\tdated February 8, 2008\nReason:\t\t\t1.4(b)\nDeclassify on: \tFebruary 8, 2018\n\n* This document must be protected from unauthorized disclosure, but may be mailed or trasmitted over unclassified e-mail or fax, discussed over unsecured phone lines and stored on unclassified computer system. It must be stored in a locked or secured building, room or cabinet.\n\n\n[/QUOTE]\n\n\nvabbe' visto che e' un documento confidenziale, penso che una volta pubblicato in rete e' oramai Free Culture no?\n\nN.B. non ho ancora letto bene tutto il testo, percui per adesso la descrizione e' questa [ho pensato fosse importante, percui ho messo in seed :-)]\n\n\nBanda: 24/24 7/7 fino ad assestamento release\n\nBuona lettura a tutti\nRestate in Seed!!\n\nse vi piace questa release forse vi interesseranno anche le atre mie rel:\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?act=allreleases&amp;st=0&amp;filter=gioacchino2&amp;sb=1&amp;sd=0&amp;cat=0&amp;mid=294618]http://forum.tntvillage.scambioetico.org/t...&amp;mid=294618[/URL]\n\n\n[URL=http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=200947]link[/URL]\n","torrent":{"xt":"urn:btih:3f6aee3cd08b98d3dc02bc3b74f0e1405794ed95","amp;dn":"ACTA+leaked+documents+-+2009+%5BPDF-ENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f6aee3cd08b98d3dc02bc3b74f0e1405794ed95","infoHashBuffer":{"type":"Buffer","data":[63,106,238,60,208,139,152,211,220,2,188,59,116,240,225,64,87,148,237,149]},"announce":[],"urlList":[]}}