{"title":"Pauline Croze - Pauline Croze","uid":4738479,"size":73600799,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ff84885e3fdce016a5d21462e06b3e9be697759&amp;dn=Pauline+Croze+-+Pauline+Croze&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"furryberry","files":-1,"time":1235423486,"description":"Track Listings\n1. Mise ÃƒÂ  Nu - Pauline Croze, Furnon, MickaÃƒÂ«l\n2. Dans La Chaleur des Nuits de Pleine Lune\n3. Men Voulez-Vous? - Pauline Croze, Doriand\n4. Jeunesse AffamÃƒÂ©e\n5. Tes Beau - Pauline Croze, Fambuena, Edith\n6. Quand Je Suis Ivre\n7. Je Suis Floue\n8. Je Ferai Sans\n9. Larmes\n10. Tita - Pauline Croze, Allisio, Henri\n11. Femme Fossile - Pauline Croze, Allisio, Henri\n12. Mal Assis - Pauline Croze, Weber, ElÃƒÂ©onore \n\nIf you like French music, if you like singer-songwriter/guitarists with who play varied music and acoustic/electric indie rock, you might want to check out this cd. I've had this lovely cd for almost a year and still listen to it a lot. I was surprised that no one has reviewed it yet. I really like Pauline Croze's voice and her songs. Mise a nu is probably one of my favourite songs; her French and her voice are especially beautiful in this song, and it's nice rhythmically. It's one that I listen to often.\n\nSince amazon.com doesn't have samples of the tracks for this cd, at least not as of this writing, I would suggest going to amazon.fr to hear them; that is how I found it. I listen to a lot of French music and I like to try out the recommendations and similar artists. Usually, when I hear at least three tracks that I really like, then I buy the cd (not usually from France because of high international shipping rates.) Well, Pauline Croze had more than three that sounded great, and five of them sounded so good that I couldn't wait for the cd to arrive, I kept listening to the samples. Those tracks, Mise a nu, T'es beau, Je ferai sans, Larmes, and Tita are still my favourites, but I also have become pretty attached to Quand je suis ivre (at one point the wonderfully french-sounding background vocals sing &quot;oh-la oh-la oh-lala&quot;) and I like all the other songs, as well.\n\nThere's a range of moods and rhythms in this cd. T'es beau is a pretty waltz-like song; Je ferais sans is repetitive, intense rock, almost explosive, with an eastern sounding electric guitar riff. Larmes has a repetitive background vocal depicting tears and Pauline's vocal seems to express the comfort after a flood of tears. It's difficult to listen to Tita and its bossa-like acoustic bass line without dancing; Femme fossile also seems to have that eastern or North African influence, this time in the rhythm.\n\nThe only thing I don't like about this album is something very, very small -- in Tita, in part of the refrain she sings &quot;oh-oh-oh-oh&quot; both times, while, for impact and expression, it really would sound better sung only the second time. It is of course, something miniscule, but it makes it less spontaneous. Maybe I shouldn't use that to judge, but I think Pauline Croze, who is still in her twenties, probably needs to let loose a bit more. This is her first album, and I hope that she will continue to grow as a singer and songwriter. If she does, I think she will become a very special artist.\n\n-Stephanie &quot;troskaya&quot;","torrent":{"xt":"urn:btih:3ff84885e3fdce016a5d21462e06b3e9be697759","amp;dn":"Pauline+Croze+-+Pauline+Croze","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff84885e3fdce016a5d21462e06b3e9be697759","infoHashBuffer":{"type":"Buffer","data":[63,248,72,133,227,253,206,1,106,93,33,70,46,6,179,233,190,105,119,89]},"announce":[],"urlList":[]}}