{"title":"Meeruthiya Gangsters 2015 Hindi TS AAC-SSM.mp4","uid":12494770,"size":401585248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40105e6c4a9985c904caff846357ce04486eae09&amp;dn=Meeruthiya+Gangsters+2015+Hindi+TS+AAC-SSM.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SSM2015","files":1,"time":1443238865,"description":"SSMovie.co presents:\r\n\r\nMeeruthiya Gangsters 2015 Hindi TS AAC-SSM.mp4\r\n\r\nScreens:\r\n \nhttp://ssmovie.co/meeruthiya-gangsters-full-movie-2015-hindi/\r\n\r\nReview:\r\n\r\nCo-presented by Anurag Kashyap, Meeruthiya Gangsters is a pretentious, frivolous tale of a group of good-for-nothing friends from Meerut, who by happen to become gangsters. It is a staged drama which is often seen in films from Mr Kashyap's stable. \r\n\r\nThe narration starts off intriguingly with the title song as the background score and a profile of a person, in a vehicle leading us into the Meerut college campus. The scene then cuts into the college canteen and into the lives of the six friends. \r\n\r\nThey include the tacit team leader Nikhil (Jaideep Ahlawat), the congenial Amit (Aakash Dahiya), the short-tempered Sunny (Shadab Kamal) aka ‘challengera,’ the blonde-haired Sanjay (Jatin Sarna) aka ‘Foreigner’, the guy-in-love Gagan (Vansh Bhardwaj) and the level-headed Rahul (Chandrachoor Rai). \r\n\r\nWith a convoluted plot that laces around greed, ambition, romance and an easy way of living, the tale unravels how the college buddies get entangled in their own web, leading to their undoing. \r\n\r\nThe characters are paradoxically over-smart simpletons and their idiosyncrasies - spiked with black humour - form a major aspect of their comic trail. \r\n\r\nThe pitfall of this film is writer- director Zeishan Quadri's amateurishly penned script. The plot is formulaic and predictable. The female cast is used as the unconventional conduit to carry the story forward and to make it seemingly quirky. \r\n\r\nThe characters, though interestingly peculiar, are cardboard thin as they are poorly etched in isolation of their roles. Hence, with no reference to their personal or family lives, they are unconvincing as well as unbelievable. \r\n\r\nAs far as performance is concerned, the ensemble cast sincerely tries to keep you entertained with their histrionics. However, their strained efforts seem theatrical and wasted. This is evident throughout the film and especially in the shootout scene between the police and the gangsters during the forcefully stretched climax scene. \r\n\r\nOf the supporting cast, Sanjay Mishra as Sanjay's (Jatin Sarna) scamster uncle, 'Mamaji', and Mukul Dev as the shrewd and eccentric Police Inspector RK Singh, are both stereotypical and wasted. \r\n\r\nThe music and the background score is just a distraction to enforce that this is a light-hearted film, not to be taken seriously. \r\n\r\nWith modest production values, Naren Gedia's camera work captures the essence of the film decently. But it is the initial lengthy single shot, taken on a rotating trolley in the canteen scene, which is an eye-sore. \r\n\r\nOverall, Meeruthiya Gangsters offers nothing exceptional","torrent":{"xt":"urn:btih:40105e6c4a9985c904caff846357ce04486eae09","amp;dn":"Meeruthiya+Gangsters+2015+Hindi+TS+AAC-SSM.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40105e6c4a9985c904caff846357ce04486eae09","infoHashBuffer":{"type":"Buffer","data":[64,16,94,108,74,153,133,201,4,202,255,132,99,87,206,4,72,110,174,9]},"announce":[],"urlList":[]}}