{"title":"Growl 1.4","uid":7340461,"size":3777993,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:41f3df8778198ad3843e4669e93176e563bd1a38&amp;dn=Growl+1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vineshnxs","files":1,"time":1339225199,"description":"Growl is a notification system that allows any application to send it a notification, and then it displays it. You can (for example) be notified that you have new email, or that a download completed.\n\nWHAT'S NEW\nVersion 1.4:\nGeneral:\n\nApplications Tab Redesign! This is a major overhaul, and should be much easier to use.\nMoved Rollup controls to separate tab.\nMajor improvements to networking.\nPreference Pane overhaul:\nNew slider switch for on/off switches\nAdded keyboard support to position picker.\n\nGeneral Tab Relayout.\nNetworking tab\nAdd support for subscription\nHistory Tab, contextual menu for history table to jump to the app/notification settings\nRollup tab is the new home of controls related to the Rollup window.\nAdding a new display should not require a restart of Growl now.\n\nNetworking:\nSupport for Notification-Callback-Target, a URL field in GNTP. Upon click, Growl lets OSX figure out how to open the URL (such as the default browser for an http:// url)\nSubscription support, subscribe to all applications on a remote machine.\nGeneral improvements to networking authentication, removed requirement for, and use of password headers if the password field is blank\nFix networking crash related to address data resolution.\nBind to local socket only if not listening for incoming notifications.\nAddress data caching, and observation of network changes to clear caches\n\nApplescript:\nURL click feedback support, same as Notification-Callback-Target in GNTP\nBug fixes:\nResolved a crash with webkit plugin bridge on creation.\nResolved a crash with forwarding.\nResolved an issue where the Speech display waits for previous message to complete causing a CPU drain\nResolved a crash with CFErrorGetDomain for WebKit Display Styles.\nFixed duplicate listings of display plugins on reinstall.\nNotification-Callback-Target is now respected, and used, even without the method header.\nWorked around problems with corrupt history databases.\nFixed a sorting problem when deleting a single entry in the history list.","torrent":{"xt":"urn:btih:41f3df8778198ad3843e4669e93176e563bd1a38","amp;dn":"Growl+1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f3df8778198ad3843e4669e93176e563bd1a38","infoHashBuffer":{"type":"Buffer","data":[65,243,223,135,120,25,138,211,132,62,70,105,233,49,118,229,99,189,26,56]},"announce":[],"urlList":[]}}