{"title":"DVDFab v9.0.2.0 Portable (registred)","uid":8007854,"size":43868762,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:423ff17365348bd7bb0a6e20641179872462acd6&amp;dn=DVDFab+v9.0.2.0+Portable+%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1357933357,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes,\nNo boring installation of tool-bars in your browser,\nThis makes a portable version a better version.\n\nChangelog\n\nNew: Added support to add external subtitle for Main Movie mode in Blu-ray Copy.\nNew: Added fully featured profile editor.\nNew: Added support to create menu and other features for DVD Creator.\nNew: Added brand new internal preview engine.\nNew: Improved the user experience for Video Effect feature.\nNew: Improved command line support for DVDFab 9.\nNew: Added workaround for CUDA decoder/encoder error. DVDFab can switch to Software mode automatically to complete the task.\nNew: Added support to add external subtitle for DVD Ripper, Blu-ray Ripper and Video Converter.\nNew: Added chapter support for .mp4 file for Blu-ray Ripper.\nNew: Added mp4.passthrough profile for Blu-ray Ripper.\nNew: Added subpicture remux into file support for .mp4 file for Blu-ray Ripper.\nNew: Added new 39 profiles for Blu-ray Ripper and DVD Ripper.\nNew: Added support 10 bit depth decoder for Video Converter and Blu-ray/DVD Creator.\nFix: A problem that wrong information for DVDFab Gold user in Summary.\nFix: A problem that cannot support Split feature for DVDFab Gold user.\nFix: A crash problem when ejecting the physical disc in certain cases.\nFix: A 700 error problem when copying Full Disc in certain cases.\nFix: A problem that the added subtitle is truncated in certain cases.\nFix: A problem that cannot remux the subtitle into .mp4 file in Blu-ray Ripper.\nFix: An A/V sync problem when copying Blu-ray to DVD in certain cases.\nFix: A 504 error when ripping with 2-pass profiles in Blu-ray and DVD Ripper mode.\nFix: A problem that cannot open mp4.h264.aac.mp4 file source in Blu-ray Creator mode.\nFix: An aspect ratio problem in Blu-ray to DVD Converter.\nFix: A display problem for double line subtitles in DVD Creator.\nFix: A problem that cannot add external subtitle for Blu-ray Creator. \n\nOS: Windows 8 / Windows 7 / Vista / XP (32-bit / 64-bit)\n\nLanguages : Multilanguage","torrent":{"xt":"urn:btih:423ff17365348bd7bb0a6e20641179872462acd6","amp;dn":"DVDFab+v9.0.2.0+Portable+%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"423ff17365348bd7bb0a6e20641179872462acd6","infoHashBuffer":{"type":"Buffer","data":[66,63,241,115,101,52,139,215,187,10,110,32,100,17,121,135,36,98,172,214]},"announce":[],"urlList":[]}}