{"title":"CETI - Czarna roza (2004) [FLAC]","uid":9340592,"size":625565157,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42d4b69f8aba80f1146d6cc9ef8b8397feb7483a&amp;dn=CETI+-+Czarna+roza+%282004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":22,"time":1386925854,"description":"CETI - Czarna roza (2004)\n\nGenre: Polish, Hard Rock, Heavy Metal\n\nTracklist:\n\n1.Bieg stracencow\n2.CETI'a\n3.Samotna tancerka\n4.Ogien i lzy\n5.Sztylet\n6.Brama teczy\n7.Prawo piesci\n8.Na progu serca\n9.Sciana placzu\nBonus:\n10. Like An Eagle\n11. Holidays In Agrigento*\n12. Blazen\nBonus (&quot;Maxi Promotion&quot; 1994):\n13. Rasizm*\n14. Epitafium*\n15. Piosenka*\n16. Epitafium II*\n\n&quot;Gielda Live! p.2&quot; - concert recorded 24.06.1994 in studio &quot;Gielda&quot; in Poznan\n17. Lamiastrata*\n18. Sztuczne oddychanie*\n19. Epitafium*\n\nPersonel:\nGrzegorz Kupczyk - vocals, bass guitar (4, 8)\nJacek Jablonski - percussion\nAndrzej Lysow - guitars\nMaciej Przybylski - bass guitar\nMaria Wietrzykowska - keys\n\nMarcin Krystek &quot;Mucek&quot; - drums*\nCzeslaw Niemen - keys (1, 9)\n\n &quot;Czarna Roza&quot; is my favourite Polish album ever. If you enjoy mix of sincere hard rock and heavy metal - this one is surely for you as well.\nYou'll find some heavy metal tracks here. &quot;Bieg Stracencow&quot; with famous Polish bard Czeslaw Niemen playing keyboards as guest is my favourite. Perfect beginning for an album. There's some great, happy rock'n'roll here as well. &quot;C.E.T.I'a&quot; makes me laugh everytime I hear it thanks to it's sound and crazy, funny lyrics (&quot;I'm touching your breasts, I'm burning...&quot;). &quot;Holidays In Agrigento&quot; is quite similar, it's one of two songs sung in English here. There was also a video for this one recorded and is available at the band's website for download. Finally - catchy, killing hard rock ballads is what you'll receive. &quot;Ogien I Lzy&quot; is one of my favourite ballads of all time, &quot;Na Progu Serca&quot; not far behind it. Those remind me quite much of some of the best Deep Purple and Whitesnake ballads that Kupczyk was inspired by (&quot;Soldier of Fortune&quot;, &quot;Is This Love&quot;...).\nActually, I find this album quite similar to the first two Turbo releases, where Grzegorz Kupczyk, the CETI vocalist was singing. There are some differences - guitar lines are quite different, keyboards that were never widely used by Turbo in CETI became important, but overally, it's still the same music; still the same sound and mood and you can hear that the band was having great fun writing and recording it.\nThe album was released for the first time in 1990 on LP, CD and MC and at present it's almost impossible to find this version. CD reedition with different artwork appeared in 2004 and contains several bonus tracks. There are 4 tracks from sold out &quot;Maxi Promotion&quot; EP and 3 live tracks released for the first time, recorded in 1994.\nIf you enjoy bands like Whitesnake or Deep Purple, get this one and it will be a great add to your collection. If you love music from Eastern Europe and find it funny to listen to crazy lyrics in which you can't understand a word - this is simply a must for you. In other cases, I'm pretty sure you won't be disappointed as well, but if you're looking for something that is 100% metal, try rather &quot;Shadow of the Angel&quot; album. But &quot;Czarna Roza&quot; is simply a hard'n'heavy gem.","torrent":{"xt":"urn:btih:42d4b69f8aba80f1146d6cc9ef8b8397feb7483a","amp;dn":"CETI+-+Czarna+roza+%282004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42d4b69f8aba80f1146d6cc9ef8b8397feb7483a","infoHashBuffer":{"type":"Buffer","data":[66,212,182,159,138,186,128,241,20,109,108,201,239,139,131,151,254,183,72,58]},"announce":[],"urlList":[]}}