{"title":"The Chemical Biology of DNA Damage{BBS}","uid":6723243,"size":7176082,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43ecabc51de001ea4bdb1820b611101433536a34&amp;dn=The+Chemical+Biology+of+DNA+Damage%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317859024,"description":"Bringing the power of biochemical analysis to toxicology, this modern reference explains genotoxicity at the molecular level, showing the links between a DNA lesion and the resulting cellular or organismic response. Clearly divided into two main sections, Part 1 focuses on selected examples of important DNA lesions and their biological impact, while the second part covers current advances in assessing and predicting the genotoxic effects of chemicals, taking into account the biological responses mediated by the DNA repair, replication and transcription machineries. A ready reference for biochemists, toxicologists, molecular and cell biologists, and geneticists seeking a better understanding of the impact of chemicals on human health.\nAbout the Author\nNicholas E. Geacintov is Professor of Chemistry and former Chair of the Department of Chemistry at New York University (NYU), USA. He received his PhD degree in physical chemistry and polymer chemistry from the State University of New York College of Forestry at Syracuse University, and spent most of his career at NYU. His current research interests are focused on the mechanisms of chemical carcinogenesis and oxidatively generated DNA damage, especially the relationships between the structural features of DNA lesions and their impact on DNA repair and replication. He has published over 350 papers and is currently serving as a member of the Editorial Board of the Journal of Biological Chemistry. Suse Broyde is Professor of Biology and Affiliate Professor of Chemistry at New York University, USA. Her research interests are focused on computer modeling of DNA lesions, with the goal of elucidating the molecular origins of their mutagenic and tumorigenic properties. She holds a PhD degree in physical chemistry with a minor in physics from the Polytechnic Institute of New York, and has published over 160 papers in peer-reviewed journals. She has been a member of the Editorial Advisory Board of Chemical Research in Toxicology.\n\n\n# Hardcover: 471 pages\n# Publisher: Wiley VCH (23 Jun 2010)\n# Language English\n# ISBN-10: 3527322957\n# ISBN-13: 978-3527322954","torrent":{"xt":"urn:btih:43ecabc51de001ea4bdb1820b611101433536a34","amp;dn":"The+Chemical+Biology+of+DNA+Damage%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ecabc51de001ea4bdb1820b611101433536a34","infoHashBuffer":{"type":"Buffer","data":[67,236,171,197,29,224,1,234,75,219,24,32,182,17,16,20,51,83,106,52]},"announce":[],"urlList":[]}}