{"title":"Need.For.Speed.Most.Wanted.Cider.Port-thebeast09","uid":4134064,"size":2292171431,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:446facf780c7fcde2800f2c6283486139c3c2a9f&amp;dn=Need.For.Speed.Most.Wanted.Cider.Port-thebeast09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thebeast09","files":1,"time":1208185356,"description":"A cider port of the game Need For Speed: Most Wanted! Worked well on a MacBook (1.5gig ram, 2ghz)\n\nI owe a big thanks to the people that coded, and released Cider, for making possible to port this game!!\n\n Enjoy!!!\n\n-TheBeast09\n\n\nNeed for Speed: Most Wanted (NFS:MW) is a multi-platform racing video game, developed by EA Black Box and first released by Electronic Arts for the United States on 15 November 2005. It is part of the Need for Speed series of games. The game reintroduces police chases into a large body of the game&amp;#039;s street racing-oriented game play, with certain (but not all) customization options from the Need for Speed: Underground series. It is possible that this game&amp;#039;s plot is somehow linked to Need For Speed: Underground 2 due to the fact that the word &quot;Bayview&quot; was mentioned in the game, and that Rog mentions the player has come from &quot;the underground&quot; when you race him at the beginning of the game. The game is also succeded by Need for Speed: Carbon, which serves as a sequel to Most Wanted.\n\nMost Wanted has been released for Windows-based personal computers, the PlayStation 2, Nintendo GameCube, Xbox, Xbox 360 (as a launch title), Game Boy Advance, Nintendo DS and mobile phones. Another version of Most Wanted, titled Need for Speed: Most Wanted: 5-1-0 has been released for the PlayStation Portable.\n\n&amp;#039;Black Edition&amp;#039;, a collector&amp;#039;s edition of Most Wanted, was released in celebration of the Need for Speed series&amp;#039; tenth anniversary and in conjunction with the release of Most Wanted. The Black Edition features additional races, bonus cars and other additional content. The Black Edition also comes with a special feature DVD that contains interviews and videos about the game. The Black Edition was released for both the PC, PlayStation 2 and Xbox in the United States and Australia;[1] only the PlayStation 2 version of Black Edition was released additionally for Europe.","torrent":{"xt":"urn:btih:446facf780c7fcde2800f2c6283486139c3c2a9f","amp;dn":"Need.For.Speed.Most.Wanted.Cider.Port-thebeast09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446facf780c7fcde2800f2c6283486139c3c2a9f","infoHashBuffer":{"type":"Buffer","data":[68,111,172,247,128,199,252,222,40,0,242,198,40,52,134,19,156,60,42,159]},"announce":[],"urlList":[]}}