{"title":"Autisme een leven lang - DVD 4  Deel 6  TBS","uid":6642099,"size":4161338978,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:44a75cc6dcd7e9b53e0412d61dae2ec5044c60be&amp;dn=Autisme+een+leven+lang+-+DVD+4++Deel+6++TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Saggin","files":-1,"time":1314790018,"description":"[b]Autisme een leven lang - DVD 4  Deel 6  [/b]\n\n[img]http://www.wessels-ib-support.nl/imagedump/autisme.jpg[/img]\n\na. Buitenbeentjes - Autisme\nb. Buitenbeentjes - ADHD\nc. Als Autisme Niet Opvalt\n\n\n[b]a. Buitenbeentjes - Autisme[/b] \nAan kinderen met een autistische stoornis is zo op het eerste gezicht niets bijzonders \nte zien. Maar in de omgang blijkt al snel dat zij anders zijn. Kinderen met een \nautistische stoornis maken slecht persoonlijk contact. Zij kunnen overstuur raken van \nveranderingen of onverwachte voorvallen. Zij kunnen moeite hebben om de wereld om zich \nheen goed te interpreteren. Wat gaat er mis? Autisme is niet te genezen. Maar wat \nhebben deze kinderen en hun ouders nodig om zo goed mogelijk te kunnen leren \nfunctioneren?\n\nMieke Roijmans en Peter Roest hebben vijf kinderen: Auke, Frie, Hugin en de tweeling \nSjef en Hilde van 9 jaar. Zij wonen op een boerderij in een rustig deel van \nNoord-Brabant. Sjef heeft PDD-NOS, een aan autisme verwante contactstoornis. Zo op het \neerste gezicht is aan hem niets bijzonders te zien, maar in de omgang blijkt Sjef al \nsnel anders. Hij maakt moeilijk contact met anderen, blijft hardnekkig vasthouden aan \nbepaalde routines en het is voor hem moeilijk de gevoelens van anderen in te schatten. \nWat betekent dit voor zijn ouders en het gezinsleven en kan de school daarop inspelen?\n\n[b]b. Buitenbeentjes - ADHD[/b] \nIn elke klas zitten wel een paar kinderen met ADHD. Het lijkt wel een modeverschijnsel. \nMaar is dat ook zo? Komt ADHD meer voor dan vroeger? ADHD (Attention Deficit and \nHyperactivity Disorder), in de volksmond ook wel \\'Alle Dagen Heel Druk\\' genoemd, is een \nernstige stoornis waarvan de diagnose het best door de kinder- en jeugdpsychiater - of \nsoms door de kinderarts - kan worden gesteld. Wanneer moet je je als ouder echt zorgen \ngaan maken?\n\nLiesbeth en Douwe Pol hebben vier kinderen: Else, Corinne, Gert en Suzanne. Else van 11 \nen Gert van 7 hebben beiden ADHD. Else bleek na onderzoek ook PDD-NOS te hebben, een \nmilde vorm van autisme. Gert was vanaf 4 maanden heel levendig, kroop al snel door de \nkamer en toen hij 10 maanden was, liep hij. Hij bewoog veel, de hele dag door en ook in \nzijn slaap. Toen hij 4 jaar was, werd de diagnose ADHD gesteld. Sindsdien gebruikt hij \nmedicijnen en gaat het op school en thuis redelijk goed met Gert.\n\n[b]c. Als Autisme Niet Opvalt[/b] \nDeze video besteedt aandacht aan de groep kinderen,jongeren en volwassenen, die niet \ndirect in het oog springt. Autisme komt voor op alle niveaus van intelligentie, slechts \neen kwart van mensen met een autistische stoornis beschikt over een (boven-)normale \nintelligentie. Bij sommigen van hen valt autisme niet direct op. Pas als je hen goed \nkent valt dit gedrag op We maken kennis met een aantal mensen met een moeilijk \nherkenbare vorm van autisme, hun ouders, leraren en hulpverleners.\n\n\na. Misfits - Autism\nb. Misfits - ADHD\nc. If unnoticed Autism\n\n\n[b] a. Misfits - Autism [/ b]\nChildren with autistic disorder at first glance nothing special to see. But in dealing \nquickly shows that they are different. Children with autism are not making personal \ncontact. They may be upset by changes or unexpected events. They may have difficulty \nmaking the world around them well to interpret. What goes wrong? Autism is not curable. \nBut what have these children and their parents need to best learn to operate?\nMieke and Peter Rust Roijmans have five children: Auke, Freddy, Hugin and the twins and \nSjef Hilde 9 years. They live on a farm in a quiet part of North Brabant. Sjef PDD-NOS, \nan autism spectrum disorder contact. At first glance, nothing special to see him, but \nthe deal quickly turns Sjef different. He makes hard contact with others, continues to \nstubbornly cling to certain routines and it is difficult for him the feelings of others \nto assess. What does this mean for parents and family life and the school can meet \nthem?\n\n[B] b. Misfits - ADHD [/ b]\nIn each class there are a couple of kids with ADHD. It seems like a fad. But is that \ntrue? ADHD is more common than previously? ADHD (Attention Deficit and Hyperactivity \nDisorder), popularly known as \\&quot;All Day All Press\\', is a severe disorder whose diagnosis \nis best by the child and adolescent psychiatrist - or sometimes by the pediatrician - \ncan be made. When you have as a parent really start worrying?\nDouwe Pol Liesbeth and have four children: Elsie, Corinne, Gert and Suzanne. Else, 11 \nand 7 Gert both have ADHD. Else, after being well to have PDD-NOS, a mild form of \nautism. Gert was very lively from 4 months, crawled quickly across the room and when he \nwas 10 months, he walked. He moved a lot, all day and even in his sleep. When he was 4 \nyears old, was diagnosed with ADHD made. Since then he uses drugs and does reasonably \nwell at school and at home with Gert.\n\n[B] c. If Autism is not conspicuous [/ b]\nThis video focuses on the group of children, adolescents and adults who are not \ndirectly in the eye. Autism occurs at all levels of intelligence, only one quarter of \npeople with autistic disorder has an (upper) normal intelligence. By some autism does \nnot directly. Only when you know them well is this behavior on We meet a few people \nwith a difficult recognizable form of autism, their parents, teachers and social \nworkers.\n\nSpotinformatie\n\nBron:[/b]  VHS\n[b]Menu:[/b]  Ja\n[b]Audio Taal:[/b]  Nederlands\n[b]Subs:[/b]  Geen\n\n[b]Beeld:[/b]  PAL\n[b]Beeld verhouding:[/b]  4:3\n[b]Video:[/b]  ReEncoded\n[b]Bewerking:[/b]  Autiboer\n[b]Regio:[/b]  Vrij\n[b]Hoesje:[/b] Nee\n\n\n\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n","torrent":{"xt":"urn:btih:44a75cc6dcd7e9b53e0412d61dae2ec5044c60be","amp;dn":"Autisme+een+leven+lang+-+DVD+4++Deel+6++TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a75cc6dcd7e9b53e0412d61dae2ec5044c60be","infoHashBuffer":{"type":"Buffer","data":[68,167,92,198,220,215,233,181,62,4,18,214,29,174,46,197,4,76,96,190]},"announce":[],"urlList":[]}}