{"title":"Dilogy Vietcong (2003-2005) PC","uid":7335339,"size":4507483406,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4549defa765e320199d2a4b8fb482c9426fecdd0&amp;dn=Dilogy+Vietcong+%282003-2005%29+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SeregA_Lus","files":14,"time":1339058570,"description":"DESCRIPTION:\nVietcong / Vietcong\nPlay in the &quot;Vietcong&quot; and feel the danger, fear and unpredictability of the deadly battle in the jungle. The effect of this first-person shooter set during the infamous conflict in Southeast Asia. Log into the ranks of fighters highly specialized units of the U.S. Army. Under your command - the best group of soldiers from all that existed in history. It's time to show the world what you're made!\n\nVietcong: Fist Alpha / Vietcong: Fist Alpha\nthe official expansion for the game Vietcong. New actors, new weapons and aircraft. New missions for both single and multiplayer games.\n'Fist Alpha' - this is your group. A squad of U.S. Special Forces, as opposed to mortal enemy - Viet Cong.\nThe five members of the group &quot;Fist Alpha&quot; from the original game adds two new Vietcong soldier - Sergeant First Class Warren Douglas and Nguyen Nam.\nIn the course of seven new missions group &quot;Fist Alpha&quot; will fight the Viet Cong units and DIA in the central plateau of Vietnam.\nGo through the minefields, protect your base, locate and destroy Viet Cong weapons factories, dispose of enemy artillery positions, locate and rescue downed U.S. Air Force pilot.\nFighting in the eight new maps with eight new types of weapons, not including machetes and bayonets.\nGo back to the battlefield as an American or a Viet Cong soldier in the exciting multiplayer game for 64 players over LAN or the Internet.\n\nVietcong 2 / Vietcong 2\nThey called it the battle for freedom. They said they do fraternal obligation to the citizens of Vietnam.\nTheir freedom came - enclosing all the rebellious arms of napalm in the hot, leisurely riding on tank tracks, under the sharp clatter of the M-16 and well-built chorus of propaganda. Freedom has resulted in a units of the children of America who are confident in a quick and easy victory, convinced that the happiness of the people you can bring someone else on the uninvited steel bayonets.\nWell, let them. In humid tropical jungle dark room for many thousands of graves ...\n\n\nIMPORTANT:\nAt the time of installation Vietcong 2 disable Anti-Virus.\n\n\nFeatures repack:\n--- Language: Russian\n--- For the basis the License 1C\n--- Version irgy:\n--- Vietcong Fist Alpha + v.1.60\n--- Vietcong 2 v.1.10\n--- Do not cut / no recoded.\n--- Installation of additional software (DirectX, Visual C + +)\n--- Release from R.G. Element Arts | Author repack SeregA_Lus","torrent":{"xt":"urn:btih:4549defa765e320199d2a4b8fb482c9426fecdd0","amp;dn":"Dilogy+Vietcong+%282003-2005%29+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4549defa765e320199d2a4b8fb482c9426fecdd0","infoHashBuffer":{"type":"Buffer","data":[69,73,222,250,118,94,50,1,153,210,164,184,251,72,44,148,38,254,205,208]},"announce":[],"urlList":[]}}