{"title":"Water and Life: The Unique Properties of H20","uid":8260273,"size":30499812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a5d30a1de60a5eb418efaeedd47ae96db9e8a93&amp;dn=Water+and+Life%3A+The+Unique+Properties+of+H20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1363368166,"description":"Ruth M. Lynden-Bell, Simon Conway Morris, John D. Barrow, John L. Finney, Charles Harper, &quot;Water and Life: The Unique Properties of H20&quot;\n2010 | ISBN: 1439803560 | 396 pages | PDF | 29 MB\n\nReflecting a rich technical and interdisciplinary exchange of ideas, Water and Life: The Unique Properties of H20 focuses on the properties of water and its interaction with life. The book develops a variety of approaches that help to illuminate ways in which to address deeper questions with respect to the nature of the universe and our place within it.\n\nGrouped in five broad parts, this collection examines the arguments of Lawrence J. Henderson and other scholars on the &quot;fitness&quot; of water for life as part of the physical and chemical properties of nature considered as a foundational environment within which life has emerged and evolved. Leading authorities delve into a range of themes and questions that span key areas of ongoing debate and uncertainty. They draw from the fields of chemistry, biology, biochemistry, planetary and earth sciences, physics, astronomy, and their subspecialties. Several chapters also deal with humanistic disciplines, such as the history of science and theology, to provide additional perspectives.\n\nBringing together highly esteemed researchers from multidisciplinary fields, this volume addresses fundamental questions relating to the possible role of water in the origin of life in the cosmos. It supports readers in their own explorations of the origin and meaning of life and the role of water in maintaining life.","torrent":{"xt":"urn:btih:4a5d30a1de60a5eb418efaeedd47ae96db9e8a93","amp;dn":"Water+and+Life%3A+The+Unique+Properties+of+H20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a5d30a1de60a5eb418efaeedd47ae96db9e8a93","infoHashBuffer":{"type":"Buffer","data":[74,93,48,161,222,96,165,235,65,142,250,238,221,71,174,150,219,158,138,147]},"announce":[],"urlList":[]}}