{"title":"Sexually Broken--Hardcore throatboarding sybian slut in stocks,","uid":12507566,"size":573907855,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4a9f23609d77140220171ee2a31d9880ec33bb96&amp;dn=Sexually+Broken--Hardcore+throatboarding+sybian+slut+in+stocks%2C+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":1,"time":1443474129,"description":"Hardcore throatboarding sybian slut in stocks, London River drooling and destroyed by dick! | London River | Maestro | Jack Hammer\r\n\r\nSeptember 28, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nThin tan fucktoy strapped to sybian and throatboarded without mercy \r\n\r\nPart two of London River’s live BaRS show continues as we take our already toasted toy and build a custom made wooden bondage piece around her toned flesh. That perfectly shaved snatch is placed on a sybian and a post goes up her back before trapping her face in place. Part wood, part skin, all skin. She can not shift her head away, only take every inch of dick we chose to dish out. This is throatboarding at its finest.\r\n\r\nLondon has a weakness. Her pussy is on a hair trigger and orgasms make her lose her mind completely. The strict tight bondage we have to keep her in is because her superhuman orgasm power makes her destroy things as she cums. The sybian that we have her hair trigger pussy on is the world’s most powerful vibrator, and deepthroating dick while on it is no easy feat. We don’t care.\r\n\r\nThe one two three combination of bondage, deepthroat and orgasms cause London to lose it completely. It is a good thing she is as secured as she is, or her hulked out orgasm super power would be destroying everything around her. As it is, all she can do is cum and suck, suck and cum. Like the well trained pet she is, London drools all over the dick. She knows her place.\r\n\r\nThere are still more positions to go, the only question is if London can last the length of the show. Her vacant blue eyes stare off into the distance as she twitches in her restraints. This is what sexually broken looks like. Stay tuned and see if this fuckpuppet can go the distance... \r\n \r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=09_28lriver4&amp;u=SexuallyBroken-London-River-Maestro-Jack-Hammer-Hardcore-throatboarding-sybian-slut-in-stocks-London-River-drooling-and-destroyed-by-dick\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:4a9f23609d77140220171ee2a31d9880ec33bb96","amp;dn":"Sexually+Broken--Hardcore+throatboarding+sybian+slut+in+stocks%2C+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a9f23609d77140220171ee2a31d9880ec33bb96","infoHashBuffer":{"type":"Buffer","data":[74,159,35,96,157,119,20,2,32,23,30,226,163,29,152,128,236,51,187,150]},"announce":[],"urlList":[]}}