{"title":"Bronder - Bevor Hitler kam (Jews behind Hitler)(1975)","uid":4731821,"size":2020661,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cb45b36f7b1ed98a0e7c7d555b129db81bb2186&amp;dn=Bronder+-+Bevor+Hitler+kam+%28Jews+behind+Hitler%29%281975%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235071092,"description":"For english-only speaking:\nThis book is in german language. English title would be: Before Hitler came - A historical study (1975). Dietrich Bronder's monumental book exposes the occult roots and shadowy organizations behind the rise of Adolf Hitler. From philosophers that helped to shape the political doctrine of national socialism to secret societies (such as Thule) that later implemented it as the 3rd Reich slowly gained its final form as envisioned by the secret founders. But all this was not the real reason why the book was (and still is) banned from print. It is truly an irony that Bronder, a Jewish professor of history, would discover the forbidden history of dominant Jewish involvement in building the 3rd Reich. He shows in incredible detail which Jews financed Adolf Hitler and thus helped him to power. As it later turned out many high-level Nazi dignitaries had Jewish ancestry and were actively working to terrorize the European Jews to get them into Palestine. Later the Zionists have done everything in their power to suppress information of their co-operation with the Nazis in the years before the Second World War. It turned out that it was the Jewish masonic lodge B'nai B'rith, in co-operation with the Zionist organization, LICA (Ligue International contre l'Antisemitisme) in Paris that was behind the so called Kristallnacht on 9 November 1938. The aim of the LICA provocation was to encourage the emigration of German Jews to Palestine. B'nai B'rith had previously infiltrated the Nazi movement's vital parts: the SS, the SA and the party. The Nazi leadership took no legal action against B'nai B'rith, which was allowed to continue its subversive activities. It had 12 000 members in 80 lodges in Germany, three of them in Berlin. B'nai B'rith was the only Jewish organization allowed by Hitler to remain active and open during the Nazi regime after 1933. The Zionist collaboration with Hitler went so far that some of them were declared Aryans, among them the banker Oppenheimer and the aircraft manufacturer Ernst Heinrich Heinckel. This explains why a large number of Jews were given Aryan documents. Thus the Nazi leadership also included Jews with &quot;the right documents&quot;, among them the head of the SS Heinrich Himmler, Wilhelm Canaris, Alfred Rosenberg and Joseph Goebbels. The deputy Chancellor of the Reich, Rudolf Hess, was born in Egypt by a Jewish mother. Thousands of men of Jewish descent, and hundreds of those designated as Jews by the Nazis, served in the military with Hitler's knowledge. In some twenty cases, soldiers of Jewish descent were decorated with the Ritterkreuz, one of the highest awards of merit in the German army. But it seems the &quot;other&quot; side was also full of them as 430 000 Soviet Jews fought German Jews in the Second World War. The Red Army high command also included many Jews, among them the generals Solomon Raikin, Isaak Revzis, Simon Reizin, Josef Rubin, Mikhail Belkin, Zelik Yoffe, and Grigori Preizman. Fully documented, Before Hitler came lays bare the biggest secret behind antisemitic movements, namely that it was started by Jews themselves. As Austrian writer Rudolf Kommoss warned the world: &quot;Should there arise a party led by anti-Semite Jews or half-Jews, we will have to watch out!&quot; 450 pages.\n\nFur Deutschsprachige:\nDas monumentale Buch von Dietrich Bronder legt offen die okkulte Wurzeln und dunkle Organizationen hinter dem Aufstieg von Adolf Hitler. Von Philosophern die politische Doktrine von Nazionalsocialism erschafft haben bis Geheimgesellschaften (wie Thule) die sie spater implementierte. Aber das alles war nicht der echte Grund warum dieses Buch verboten war (und noch ist). Es muss eine Ironie sein dass gerade Bronder, ein judische Professor von Geschichte, die verbotene Geschichte von dominante judische Einstrickung in das Bau von dem Drittem Reich entdeckte. Er zeigt in unglaublicher Detail welche Juden Adolf Hitler financiert haben und ihn Macht zu erreichen hilfen. Als sich spatter zeigte, hatten viele hochrangige Nazis judische Vorfahrer und haben aktiv daran gearbeitet europaische Juden zu terrorizieren um sie nach Palestina zu bringen. Spater haben die Zionisten alles getan um diese Information von ihren Mitarbeit mit die Nazis zu vertuschen. Diese Kollaboration hatte solche Aufmass das einige Juden zum Ariern erklart wurden und arische Dokumenten gegeben haben. Unter diese waren auch hochrangige Nazis wie Heinrich Himmler, Wilhelm Canaris, Alfred Rosenberg und Joseph Goebbels. Auch Rudolf Hess war in Egypt eine judische Mutter geboren. Tausende judische Manner dienten im Wehrmacht mit vollem Hitlers Wissens. Aber auch auf die &quot;andere&quot; Seite war es nicht anders, als 430 000 sovietische Juden deutsche Juden bekampft haben. Die rote Armee Kommando hatte auch viele Juden wie die Generale Solomon Raikin, Isaak Revzis, Simon Reizin, Josef Rubin, Mikhail Belkin, Zelik Yoffe und Grigori Preizman. Vollstandig dokumentiert, Bevor Hitler kam offenbart das grosste Gegeimnis hinter antisemitische Bewegunge, namlich das sie von Juden selber gestartet waren. Der Osterreiche Schreiber Rudolf Kommoss versuchte es das Welt verwarnen: &quot;Ob eine Partei aufsteigen wird die von antisemitische Juden oder Halbjuden geleitet ist, dann mussen wir aufpassen!&quot; 450 Seiten.\n","torrent":{"xt":"urn:btih:4cb45b36f7b1ed98a0e7c7d555b129db81bb2186","amp;dn":"Bronder+-+Bevor+Hitler+kam+%28Jews+behind+Hitler%29%281975%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb45b36f7b1ed98a0e7c7d555b129db81bb2186","infoHashBuffer":{"type":"Buffer","data":[76,180,91,54,247,177,237,152,160,231,199,213,85,177,41,219,129,187,33,134]},"announce":[],"urlList":[]}}