{"title":"TSSeduction--TS-35976 Courtney Taylor, Vaniity and Will Havoc","uid":11013549,"size":2827947803,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4cd23491bbae9169e7bde673b2a595ed50ad3c09&amp;dn=TSSeduction--TS-35976+Courtney+Taylor%2C+Vaniity+and+Will+Havoc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1410423944,"description":"\nTHE LEAGUE OF EXTRAORDINARY TRANSSEXUALS: PART 1 SUPER HERO FEATURE\n\nSep 10, 2014 - Performers: Courtney Taylor ,  Vaniity  and  Will Havoc \n\n\nMed, Hi and HD MP4 + Pics.\n\n\nTsSeduction.com is proud to present the incredible feature presentation, The League of Extraordinary Transsexuals: To Catch a Panty Thief. Starring Vaniity as Wonderella, Courtney Taylor as Super Squirter, and Will Havoc as, The Pany Thief. This two part feature ends with a cliffhanger (golden lasso, oh no!), which will air next week on TsPussyHunters.com and includes, Hungaliscious played by no other than Honey Foxx! And now on to the episode: \n\nIn an abandon warehouse deep in the docks of Metropolis, Wonderella dangles helpless in the strength sucking powers of Panty Thief's bondage. She cleverly distracts the villain to activate her distress beacon hidden in her super bra. \n\nSuper Squirter dashes off in the invisible plane to save Wonderella and punish Panty Thief. Who better to dish out punishment than these two fine heroines of justice! \n\nPanty Thief pays for his crimes with his face, ass and cock as the super sisters wring him dry and soak him wet with their own juices. Wonderella's super cock does some super fucking which would make most mortals snap in half but she wields her powers perfectly and together her and Super Squirter, milk two loads out of Panty Theif's cock after making him fuck like a stallion AND take a pounding. The chemistry is electric and the sex is so intense there are times you may have to turn away from your screen to save yourself from pure sexual overload! \n\nThe incredible threesome ends badly for our heroines though as Panty Thief uses their distracted cum bliss after glow to tie both girls up with Wonderella's golden lasso of power! The girls need help - their only hope is Hungaliscious is watching the distress screen back at head quarters. Will Hungaliscious save Wonderella and Super Squirter before Panty Theif steals the golden panties? Tune in next week on TsPussyHunters.com to find out!\n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=35976&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=35976&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n","torrent":{"xt":"urn:btih:4cd23491bbae9169e7bde673b2a595ed50ad3c09","amp;dn":"TSSeduction--TS-35976+Courtney+Taylor%2C+Vaniity+and+Will+Havoc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cd23491bbae9169e7bde673b2a595ed50ad3c09","infoHashBuffer":{"type":"Buffer","data":[76,210,52,145,187,174,145,105,231,189,230,115,178,165,149,237,80,173,60,9]},"announce":[],"urlList":[]}}