{"title":"Julia Kent - Character [2013][EAC.Log,Cue.FLAC]","uid":9327025,"size":195561515,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4dee8457e46f07bcf9a7bb214a7b12bdd33dc4d2&amp;dn=Julia+Kent+-+Character+%5B2013%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1386661422,"description":"Artist: Julia Kent\nRelease: Character \nReleased: 2013\nLabel: Leaf Label\nCatalog#:BAY 80\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: neoclassical\n\nEbb [02:44]\nTransportation [04:31]\nFlicker [03:32]\nTourbillon [03:09]\nFall [04:22]\nKingdom [04:46]\nOnly Child [04:17]\nIntent [04:14]\nSalute [04:21]\nNina and Oscar [03:37]\nTransportation (Delivered By Roll The Dice) [08:14]\n\nCharacter is cellist and composer Julia Kent's third solo album. Like its predecessors, 2007's Delay and 2011's Green and Grey, she places her cello in concert with an array of digital loops and field recordings. But aside from her unmistakable tone and playing style, Character has little in common with its siblings. For starters, for the first time she recorded alone in her home studio. The music on those earlier recordings reflected the outer world in various ways: the field recordings on Delay were those of airports; on Green and Grey the sounds of the natural world. Here, incorporated sounds reflect the solitary nature of the creative process: a single match lighting, the scratch of a pen writing on paper, a detuned autoharp; even the sound of wineglasses seems more like accidental movement in a cupboard than a celebratory clink. The theme on this album muses on the cycles of life and how little control the individual possesses. (Her use of loops offers concrete examples: if a &quot;mistake&quot; is made, new, previously unconsidered possibilities emerge.) Opener &quot;Ebb&quot; is an invitation to step back from motion, toward stillness. It is seemingly mournful, but that's misleading. The acceptance and willingness of slowing create a foundation for the album to go deeper. It's true that the intro to &quot;Transportation,&quot; with its frenetic plucked strings, and the seemingly forceful pulse of the cello in &quot;Tourbillon&quot; offer seeming outward motion, but they are actually reflections of the tensions that occur as the reality of an individual's inner world meets her perceived ones. In the brooding &quot;Kingdom,&quot; tape manipulation, an echoing backdrop, and dark, even paranoid ambient sounds create dark sonorities that meet one another simultaneously from the interior of the instrument. The sheer loneliness of &quot;Intent,&quot; with its juxtaposition of the autoharp, drum loops, and deep droning cello, is a haunting poetic on the many timbral voices that self-reflection speaks with. &quot;Only Child&quot; and closer &quot;Nina and Oscar&quot; feel deliberately unfinished, as if their resonance would reveal more in time. Character may not carry the blissed-out expressions Kent's earlier records did. But it is here that she speaks most poignantly of loneliness, fear, desire, life's richness, and more -- by creating a listening experience of nearly cavernous depth and poetic beauty","torrent":{"xt":"urn:btih:4dee8457e46f07bcf9a7bb214a7b12bdd33dc4d2","amp;dn":"Julia+Kent+-+Character+%5B2013%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dee8457e46f07bcf9a7bb214a7b12bdd33dc4d2","infoHashBuffer":{"type":"Buffer","data":[77,238,132,87,228,111,7,188,249,167,187,33,74,123,18,189,211,61,196,210]},"announce":[],"urlList":[]}}