{"title":"Edge of the Universe: A Voyage to the Cosmic Horizon and Beyond","uid":7854003,"size":316896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e1ed1c50fece81ad446c2503891579f4deb0099&amp;dn=Edge+of+the+Universe%3A+A+Voyage+to+the+Cosmic+Horizon+and+Beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353689026,"description":"Edge of the Universe: A Voyage to the Cosmic Horizon and Beyond by Paul Halpern\nWiley | 2012 | ISBN: 0470636246 | English | 240 pages | EPUB + MOBI | 0.30 MB + 0.50 MB\n\nAn accessible look at the mysteries that lurk at the edge of the known universe and beyond. The observable universe, the part we can see with telescopes, is incredibly vast. Yet recent theories suggest that there is far more to the universe than what our instruments record--in fact, it could be infinite. Colossal flows of galaxies, large empty regions called voids, and other unexplained phenomena offer clues that our own &quot;bubble universe&quot; could be part of a greater realm called the multiverse. How big is the observable universe? What it is made of? What lies beyond it? Was there a time before the Big Bang? Could space have unseen dimensions? In this book, physicist and science writer Paul Halpern explains what we know--and what we hope to soon find out--about our extraordinary cosmos.\n\n* Explains what we know about the Big Bang, the accelerating universe, dark energy, dark flow, and dark matter to examine some of the theories about the content of the universe and why its edge is getting farther away from us faster\n* Explores the idea that the observable universe could be a hologram and that everything that happens within it might be written on its edge\n* Written by physicist and popular science writer Paul Halpern, whose other books include Collider: The Search for the World's Smallest Particles, and What's Science Ever Done For Us: What the Simpsons Can Teach Us About Physics, Robots, Life, and the Universe\n","torrent":{"xt":"urn:btih:4e1ed1c50fece81ad446c2503891579f4deb0099","amp;dn":"Edge+of+the+Universe%3A+A+Voyage+to+the+Cosmic+Horizon+and+Beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e1ed1c50fece81ad446c2503891579f4deb0099","infoHashBuffer":{"type":"Buffer","data":[78,30,209,197,15,236,232,26,212,70,194,80,56,145,87,159,77,235,0,153]},"announce":[],"urlList":[]}}