{"title":"Sick from Freedom (2012) by Jim Downs","uid":10306479,"size":1902414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ebd8d4ae340593965404cc1f7126ddf4dafb044&amp;dn=Sick+from+Freedom+%282012%29+by+Jim+Downs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1402137483,"description":"Sick from Freedom - African-American Illness and Suffering during the Civil War and Reconstruction (2012) by Jim Downs.pdf\n\nBondspeople who fled from slavery during and after the Civil War did not expect that their flight toward freedom would lead to sickness, disease, suffering, and death. But the war produced the largest biological crisis of the nineteenth century, and as historian Jim Downs reveals in this groundbreaking volume, it had deadly consequences for hundreds of thousands of freed people.\n\nIn Sick from Freedom, Downs recovers the untold story of one of the bitterest ironies in American history--that the emancipation of the slaves, seen as one of the great turning points in U.S. history, had devastating consequences for innumerable freedpeople. Drawing on massive new research into the records of the Medical Division of the Freedmen's Bureau-a nascent national health system that cared for more than one million freed slaves-he shows how the collapse of the plantation economy released a plague of lethal diseases. With emancipation, African Americans seized the chance to move, migrating as never before. But in their journey to freedom, they also encountered yellow fever, smallpox, cholera, dysentery, malnutrition, and exposure. To address this crisis, the Medical Division hired more than 120 physicians, establishing some forty underfinanced and understaffed hospitals scattered throughout the South, largely in response to medical emergencies. Downs shows that the goal of the Medical Division was to promote a healthy workforce, an aim which often excluded a wide range of freedpeople, including women, the elderly, the physically disabled, and children. Downs concludes by tracing how the Reconstruction policy was then implemented in the American West, where it was disastrously applied to Native Americans.\n\nThe widespread medical calamity sparked by emancipation is an overlooked episode of the Civil War and its aftermath, poignantly revealed in Sick from Freedom.\n\n280 pages\nPublisher: Oxford University Press; 1St Edition edition (May 14, 2012)\nLanguage: English\nISBN-10: 0199758727\nISBN-13: 978-0199758722","torrent":{"xt":"urn:btih:4ebd8d4ae340593965404cc1f7126ddf4dafb044","amp;dn":"Sick+from+Freedom+%282012%29+by+Jim+Downs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ebd8d4ae340593965404cc1f7126ddf4dafb044","infoHashBuffer":{"type":"Buffer","data":[78,189,141,74,227,64,89,57,101,64,76,193,247,18,109,223,77,175,176,68]},"announce":[],"urlList":[]}}