{"title":"Absolute Covers Vol.3","uid":8651184,"size":721206743,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f1413f2d254f574c601a012cc5e946fbcf54b83&amp;dn=Absolute+Covers+Vol.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"babinoas","files":79,"time":1373109442,"description":"1\tThe Tone\tRelax, Take It Easy (Mika Cover)\n2\tAustra\t        Woodstock (Joni Mitchell Cover)\n3\tModestep\tParadise (Coldplay Cover)\n4\tKasabian\tVideo Games (Lana Del Rey Cover)\n5\tHellsongs\tStand Up And Shout (Dio Cover)\n6\tJeff Tweedy\tCrack A Smile (Jandek Cover)\n7\tJohnny Cash\tHurt (Nine Inch Nails Cover)\n8\tMayer Hawthorne\tDon't Turn The Lights On (Chromeo Cover)\n9\tRadiohead\tNobody Does It Better (Carly Simon Cover)\n10\tThe White Stripes\tJolene (Dolly Parton Cover)\n11\tZucchero\tEverybody's Got To Learn Sometime (The Korgis Cover)\n12\tMy Morning Jacket\tTyrone (Erykah Badu Cover)\n13\tThe Black Keys\tDearest (Buddy Holly Cover)\n14\tJohnny Depp\tWicked Game (Chris Isaak Cover)\n15\tCowboy Junkies\tSweet Jane (Lou Reed Cover)\n16\tRevolver\tMonk (Mini Mansions Cover)\n17\tKylie Minogue\tWonderful Life (Hurts Cover)\n18\tLimp Bizkit\tWish You Were Here (Pink Floyd Cover)\n19\tCat Power\tNew York (Frank Sinatra Cover)\n20\tMewithoutyou\tIn Bloom (Nirvana Cover)\n21\tThe Divine Comedy\tThere Is A Light That Never Goes Out (The Smiths Cover)\n22\tSimply Red\tIf You Don't Know Me By Now ( Harold Melvin &amp; The Blue Notes Cover)\n23\tBerlin\tLive To Tell (Madonna Cover)\n24\tThe Mission Uk\tAfter All (David Bowie Cover)\n25\t10,000 Maniacs\tEveryday Is Sunday (Morissey Cover)\n26\tTennis         \tTell Her No (The Zombies Cover)\n27\tThe Postal Service\tWe Will Become Silhouettes (The Shins Cover)\n28\tPatti Smith\tLosing My Religion (R.E.M. Cover)\n29\tMatthew Sweet\tEvery Night (Paul Mccartney Cover)\n30\tBoyce Avenue\tRolling In The Deep (Adele Cover)\n31\tWalk Off The Earth\tSomebody That I Used To Know (Gotye Cover)\n32\tThe Cardigans\tIron Man (Black Sabbath Cover)\n33\tZiggy Marley\tDrive (The Cars Cover)\n34\tBad Brains\tDay Tripper - She's A Rainbow (Beatles &amp; Rolling Stones Cover)\n35\tDr Israel\tBrain Damage (Pink Floyd Cover)\n36\tGrace Jones\tShe's Lost Control (Joy Division Cover)\n37\tMatisyahu\tMessage In A Bottle (The Police Cover)\n38\tEarth, Wind &amp; Fire\tGot To Get You Into My Life (The Beatles Cover)\n39\tRobbie Williams\tFreedom (George Michael Cover)\n40\tJc Brooks &amp; The Uptown Sound\tI Am Trying To Break Your Heart (Wilco Cover)\n41\tRobert Palmer\tMercy Mercy Me (Marvin Gaye Cover)\n42\tCharles Bradley &amp; Menahan Street Band\tHeart Of Gold (Neil Young Cover)\n43\tGrand Funk Railroad\tThe Locomotion (Carole King Cover)\n44\tCalexico\tAlone Again Or (Love Cover)\n45\tTimbuk 3\tBorn To Be Wild (Steppenwolf Cover)\n46\tSum 41 &amp; Blink 182\tI Love Rock N Roll (Joan Jett &amp; The Blackhearts Cover)\n47\tWithin Temptation\tSkyfall (Adele Cover)\n48\tMy Darkest Days\tCome Undone [Duran Duran Cover]\n49\tPlacebo \tFuck U (Archive Cover)\n50\tBeck    \tVenus In Furs (Velvet Underground Cover)\n51\tXiu Xiu\t        Only Girl (In The World) [Rihanna Cover]\n52\tShiny Toy Guns\tNothing Compares 2 U ( The Family Cover)\n53\tThe Vines\tMs. Jackson (Outcast Cover)\n54\tJoan Jett &amp; The Blackhearts\tCrimson And Clover (Tommy James And The Shondells Cover)\n55\tThe Who \tSummertime Blues (Eddie Cochran Cover)\n56\tMeat Puppets\tWhat To Do (The Rolling Stones Cover)\n57\tKatie Melua\tOn The Road Again (Canned Heat Cover)\n58\tBonnie Tyler\tHave You Ever See The Rain (Creedence Clearwater Revival Cover)\n59\tU2\t        Night And Day (Cole Porter Cover)\n60\tThe Horrors\tBest Thing I Never Had (Beyonce Cover)\n61\tWilco   \tI Love My Label (Nick Lowe Cover)\n62\tAztec Camera\tJump (Van Halen Cover)\n63\tLcd Soundsystem\tLive Alone (Franz Ferdinand Cover)\n64\tGary Numan\tU Got The Look (Prince Cover)\n65\tNo Doubt\tI Want You To Want Me (Cheap Trick Cover)\n66\tDinosaur Jr.\tJust Like Heaven\n67\tThe Raveonettes\tMy Boyfriend's Back (The Angels Cover)\n68\tDum Dum Girls\tThere Is A Light That Never Goes Out (The Smiths Cover)\n69\tThe Cranberries\tGo Your Own Way (Fleetwood Mac Cover)\n70\tBryan Ferry\tTake Me To The River (Al Green Cover)\n71\tIan Mcculloch\tHey, That's No Way To Say Goodbye (Leonard Cohen Cover)\n72\tPavement\tWhat Goes On ( The Velvet Underground Cover)\n73\tPixies  \tI Can't Forget (Leonard Cohen Cover)\n74\tDale Earnhardt Jr. Jr.\tWe Almost Lost Detroit (Gil Scott-Heron Cover)\n75\tVampire Weekend\tI'm Going Down (Bruce Springsteen Cover)\n76\tFlowers Of Romance\tChildren Of The Revolution (T.Rex Cover)\n77\tFlaming Lips\tBohemian Rhapsody (Queen Cover)\n78\tNickelback\tWe Will Rock You (Queen Cover)\n","torrent":{"xt":"urn:btih:4f1413f2d254f574c601a012cc5e946fbcf54b83","amp;dn":"Absolute+Covers+Vol.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f1413f2d254f574c601a012cc5e946fbcf54b83","infoHashBuffer":{"type":"Buffer","data":[79,20,19,242,210,84,245,116,198,1,160,18,204,94,148,111,188,245,75,131]},"announce":[],"urlList":[]}}