{"title":"Nerina Pallot...Year of the Wolf(2011)[FLAC]","uid":6811313,"size":262016325,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4f59baf4232ab4a16df5106eaee3d85a3386de5f&amp;dn=Nerina+Pallot...Year+of+the+Wolf%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":17,"time":1321045058,"description":"[img]http://image.allmusic.com/00/amg/cov200/drq100/q133/q13325aoeoq.jpg[/img]\n[color=Red]Year of the Wolf(2011) Polydor UK 2764024 [/color] \n\n1  Put Your Hands Up  3:27 \n  2  Turn Me on Again  3:41 \n  3  All Bets Are Off  4:12 \n  4  If I Lost You Now  2:53 \n  5  Butterfly  3:27 \n  6  This Will Be Our Year  4:26 \n  7  I Think  3:43 \n  8  Will You Still Love Me  2:50 \n  9  I Do Not Want What I Do Not Have  3:22 \n  10  Grace  4:21 \n  11  History Boys  3:35 \n\nUnceremoniously booted from Duffy's disastrous sophomore album, Rockferry producer and former Suede guitarist Bernard Butler possibly had dozens of female singer/songwriters waiting to capitalize on the Welsh songstress' career-suicidal decision. It's unlikely that resolutely independent Jersey-born Nerina Pallot was one of them, having wrote, produced, and self-released her last album, The Graduate. But after bonding over a mutual love of Arsenal FC, the unlikely pair has teamed up on a record that cleverly manages to showcase Butler's trademark sweeping melodrama without ever compromising Pallot's sweetly sung intimate tones, gentle folky melodies, and subtle poetic lyrics. Named after the child she was pregnant with during its recording, Year of the Wolf has Butler's stamp all over it, from the Motown basslines, seductive girl group choruses, and winding guitar solos of the slightly risquÃƒÂ© &quot;Turn Me on Again,&quot; to the sweeping strings and Wall of Sound-esque vibes of lead single &quot;Put Your Hands Up&quot; (originally intended for Kylie Minogue's Aphrodite), to the foot-stomping beats and '60s garage rock riffs of &quot;Butterfly.&quot; But building on her recent songwriter-for-hire skills and life-changing experiences, Pallot never allows its cinematic nature to overshadow her own talents, revealing her unique sense of self-awareness on the military rhythms, jaunty piano chords, and chugging glam rock hooks of &quot;I Think,&quot; her gorgeously fragile vocals on the orchestral waltz-tinged &quot;All Bets Are Off,&quot; and her heartbreaking way with words on the hushed piano balladry of &quot;History Boys,&quot; the closing track inspired by the images of grieving mothers during the Chilcot Inquiry. It's a credit to the pair that apart from the low-key brass-tinged R&amp;B of &quot;This Will Be Our Year&quot; and the Bacharach-esque lounge-pop of &quot;Will You Still Love Me,&quot; its 11 tracks never turn into the Rockferry, Pt. 2 affair that most people expected, with the haunting folk-soul of &quot;Grace,&quot; the Norah Jones-esque torch song &quot;If I Lost You Now,&quot; and the ghostly avant-garde pop of &quot;I Do Not Want What I Do Not Have&quot; (co-written with Linda Perry) a world away from Duffy's '60s pastiche. While her forays into writing for other artists suggest she could become the next Cathy Dennis, Year of the Wolf shows that Pallot belongs in front of the microphone rather than behind a studio desk, and ten years into her career, it might just provide the big breakthrough she so deserves. \n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/about/[/url]","torrent":{"xt":"urn:btih:4f59baf4232ab4a16df5106eaee3d85a3386de5f","amp;dn":"Nerina+Pallot...Year+of+the+Wolf%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f59baf4232ab4a16df5106eaee3d85a3386de5f","infoHashBuffer":{"type":"Buffer","data":[79,89,186,244,35,42,180,161,109,245,16,110,174,227,216,90,51,134,222,95]},"announce":[],"urlList":[]}}