{"title":"Digital Anarchy Phtoshop Plugin's w s/n","uid":4898989,"size":127424434,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5017f092aaf20e76dd1602e3e333d8c470966370&amp;dn=Digital+Anarchy+Phtoshop+Plugin%5C%27s+w+s%2Fn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":4,"time":1242506347,"description":"4 nice PS Plugins from Digital Anarchy with s/n + 1 Aperture Plugin\n\nWeb Site : http://www.digitalanarchy.com/\n\nPrimatte:\n\nBe careful when you instal the serial number.  You may have to quit the app and write the numbers down and enter them in the boxes IN REVERSE ORDER.. Works with both CS3 and CS4.\n\nPrimatte Chromakey 3.0 software is a powerful blue / green screen photography tool that removes a single color background, giving you a transparent area around your subject where you can insert new images.\n\nKnoll Light Factory: For both PS CS3 and CS4,\nLooking for Adobe Photoshop plugins or Adobe Photoshop Elements filters to enhance your work? Knoll Light Factory 3.0 creates Photoshop lighting effects like lens flares, natural glows, street lights or headlights.\n\nToon it. make cartoons out of you images: both CS3, CS4 and Aperture.\nJust released! Two new plugins for Apple's Aperture! ToonIt! Aperture creates cartoons from photographs, while Knoll Aperture generates natural lighting effects.\n\nBackdrop Designer: for both PS CS3 and CS4\nCreate digital backgrounds for photography and other design mediums with Backdrop Designer. Pick from hundreds of premade digital backdrops, or customize your own presets. This Adobe Photoshop plugin creates beautiful resolution-independent backdrops, very similar to those expensive muslin drapes you may currently have in your photography studio.","torrent":{"xt":"urn:btih:5017f092aaf20e76dd1602e3e333d8c470966370","amp;dn":"Digital+Anarchy+Phtoshop+Plugin%5C%27s+w+s%2Fn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5017f092aaf20e76dd1602e3e333d8c470966370","infoHashBuffer":{"type":"Buffer","data":[80,23,240,146,170,242,14,118,221,22,2,227,227,51,216,196,112,150,99,112]},"announce":[],"urlList":[]}}