{"title":"[Som]Focaccia blues[DvdRip-Xvid-Ita-Mp3]","uid":5320112,"size":719035812,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:505966ca3a1143eb1260742910f2ea75ea89133f&amp;dn=%5BSom%5DFocaccia+blues%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"misafor","files":1,"time":1264842649,"description":"\n\nFocaccia Blues, la vera storia della focaccia che mangiÃƒÂ² l'hamburger, trae spunto da una vicenda accaduta realmente qualche anno fa ad Altamura, un Comune della Puglia dove venne inaugurato, tra la curiositÃƒÂ  della gente del luogo, un grande McDonald's di 550 metri quadri. Dopo qualche mese, Luca DigesÃƒÂ¹ avendo un locale proprio accanto al &quot;gigante&quot; americano decise di aprire una piccola panetteria in cui produceva la sua piccola specialitÃƒÂ : la fo-caccia. Lentamente, da quel momento, giorno dopo giorno, la concorrenza &quot;leale&quot; del panettiere altamurano mise sempre piÃƒÂ¹ in crisi il grande Fast Food, che da lÃƒÂ¬ a pochi mesi fu costretto a chiudere. Nel film la storia ÃƒÂ¨ raccontata direttamente attraverso l'esperienza dei simpatici abitanti del paese, da un giornalista francese (Eric Jozsef) e dall'avventura di Onofrio (Onofrio Pepe), giunto negli USA armato di decine di focacce con uno scopo preciso: far conoscere agli americani la bontÃƒÂ  della focaccia. Alla vicenda realmente accaduta si unisce poi la favola d'amore tra Dante (Dante Marmone), un fruttivendolo amante della qualitÃƒÂ , e Rosa (Tiziana Schiavarelli), sua cliente abituale, affascinata dall'arrivo in cittÃƒÂ  di uno strano personaggio, Manuel (Luca Cirasola) un anti-eroe western moderno, deciso a colonializzare tutto ciÃƒÂ² che gli passa davanti. Da citare anche le continue incursioni nella vicenda di due personaggi televisivi (im-personificati da Lino Banfi e Renzo Arbore) protagonisti di uno sketch di &quot;telecucina&quot;, in cui esasperano il concetto di identitÃƒÂ  litigando per i piÃƒÂ¹ disparati e futili motivi (&quot;ÃƒÂ¨ piÃƒÂ¹ buono il fungo Cardoncello o il Lampascione?&quot;); un nostalgico proiezionista cinematografico ((Michele Placido) e un combattivo esercente di una piccola monosala d'essai (Nichi Vendola).\n","torrent":{"xt":"urn:btih:505966ca3a1143eb1260742910f2ea75ea89133f","amp;dn":"%5BSom%5DFocaccia+blues%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"505966ca3a1143eb1260742910f2ea75ea89133f","infoHashBuffer":{"type":"Buffer","data":[80,89,102,202,58,17,67,235,18,96,116,41,16,242,234,117,234,137,19,63]},"announce":[],"urlList":[]}}