{"title":"Antenna v3.5.498 web site design Incl.Serials-(Murlok)","uid":5984941,"size":7508530,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5098dd1dfa520fc0f23d38ebf37ef5835e037f28&amp;dn=Antenna+v3.5.498+web+site+design+Incl.Serials-%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1290706203,"description":"Antenna enables you to design and develop great looking professional web sites rapidly - without any coding or HTML knowledge. Using transparent layers, master pages and pixel accurate positioning, Antenna makes web site building a visual experience - more like using an art or desktop publishing package, instead of programming. Now you can concentrate on aesthetics and design - instead of spending hours just trying to make your HTML code work - have fun and make your site look stunning!\n\nKey Features:\n\nVisual editor for Rapid Site Development\nDrag and drop WYSIWYG - Pixel Accurate. Position items exactly where you want them to be. Customisable 'snap-to-grid' facility for easy object alignment.\n\nPowerful Graphics Capabilities built in\nMake professional web galleries of your digital photos with the Photo Gallery creator. Create high-quality button graphics and gradients with Antenna's integrated Button and Gradient Lab utilities - all built in, no extra software required.\n\nFull Layers System with Layer Transparency\nYou can build your web pages in layers, place related items on the same layer, add new layers, overlap items and change layer opacity for translucent effects.\n\nInclude Pages\nInclude any page as a layer on any other page. A real time saver when you need the same items to appear on many pages - and any changes are reflected instantly across all other pages!\n\nDesign with Style - CSS Styles Editor built in\nPerfect your look, and make sweeping visual changes across the whole site quickly and simply.\n\nRollover Buttons and Special FX\nShadows, motion blur, neon, water - all done visually, no HTML coding required.\n\nAdd Audio and Video to your web pages\nSupports AVI, MPEG, QuickTime and Flash.\n\nObject Properties Palette\nNo need for complex modal dialog boxes - modify items using a floating palette and see the results instantly. Very quick - once you know how to customise one type of object, you know how to customise them all.\n\nSingle File Project\nA website is saved as a single file on disk - very easy to manage. Organise your web and move files around at any time without having to worry about broken links - Antenna keeps links updated automatically.\n\nIntegrated FTP Publisher\nNo need for additional publishing software. Antenna's built in publisher includes a 'Publish Changes Only' option for rapid site updates.\n\nMultiple Languages - Site Localisation\nAll text and image objects support the facility to change their content based on language - so you can easily create and maintain multilingual sites from a single design.\n\nCustom HTML\nAdvanced users can add custom HTML code and Javascript, and even create completely new object types using Antenna's HTML plugin system.\n\n\n\nOne of the best!\n\n\nTested And Working \n\n  (old reg working also like key? Ask Me At Forum :)\n\n\nEnjoy","torrent":{"xt":"urn:btih:5098dd1dfa520fc0f23d38ebf37ef5835e037f28","amp;dn":"Antenna+v3.5.498+web+site+design+Incl.Serials-%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5098dd1dfa520fc0f23d38ebf37ef5835e037f28","infoHashBuffer":{"type":"Buffer","data":[80,152,221,29,250,82,15,192,242,61,56,235,243,126,245,131,94,3,127,40]},"announce":[],"urlList":[]}}