{"title":"Cartoon rating guide for smart adults v1.2.txt","uid":3851186,"size":12683,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:509ee22450998f7babe5c885bca5b82b3b1143c8&amp;dn=Cartoon+rating+guide+for+smart+adults+v1.2.txt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uncommon.muse","files":1,"time":1192938241,"description":"Cartoon rating guide for the smart adult: v1.2, 1/2007\n\n\n\nNote: This is a rating guide, not a review book -- hit up Google &amp; Wikipedia, then Amazon and IMDB forums for extended analyses. It&amp;#039;s purpose is to quickly alert you to animation you may never have heard of. It is also skewed from the perspective of an adult animation fan -- a lowly-rated show may be immensely enjoyable for small children and even competently-made, but was of little interest to me; a highly-rated show will be competently-made, and may or may not be enjoyable for or even marketed to small children. Lastly, if a show has English-language versions, those are the versions I have likely watched (and I appreciate good dubbing and loathe bad dubbing).\n\n\n\nThis list covers mainly animated television series, although several films are included. I have not seen every episode of some shows rated 7 and lower and many episodes of shows rated 5 or lower; indicated ratings may change if I see new episodes of better or worse qualify than those previous, or if many better or worse episodes of other shows alter the landscape.","torrent":{"xt":"urn:btih:509ee22450998f7babe5c885bca5b82b3b1143c8","amp;dn":"Cartoon+rating+guide+for+smart+adults+v1.2.txt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"509ee22450998f7babe5c885bca5b82b3b1143c8","infoHashBuffer":{"type":"Buffer","data":[80,158,226,36,80,153,143,123,171,229,200,133,188,165,184,43,59,17,67,200]},"announce":[],"urlList":[]}}