{"title":"Heart Throbs","uid":3954864,"size":793102548,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5119c27b36506b9c3292e66f72e4bce6afc27bfc&amp;dn=Heart+Throbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"citaltras","files":36,"time":1199095679,"description":"\t\n\tH e a r t    T h r o b s\nQuality comics\n\nDC comics\n\nThis is the second torrent in my series of romance comics.\n\n\n\n\nA Very Brief History of Romance Comics (from jennymiller.com)\n\nRomance comics were one of five major genres of adult comics which boomed after World War II. The so-called golden-age of comics began in 1935 and ended at about the time of the self-imposed Comics Code of 1954. The main period of interest to this archive is the third phase of the golden era, from 1948 to 1954. During this period comic readership was at its height, and adults, both men and women, were a major piece of the market. These years saw comic sales approach 60 million issues per month, and a 1950 government-sponsored study of an Ohio town revealed that 54 percent of all comic readers were over 20-years old, and that the average reader bought about 11 comics per month.\n\nFor the first and last time, adult women were major consumers of comics. And although the genre is largely dismissed by comics aficionados today, it was created by two of the most revered artists and writers of the time: Jack Kirby and Joe Simon, who kicked off Young Romance in 1947. Kirby and Simon had created Captain America in the early &amp;#039;40s, and Kirby is responsible for many famous superheroes, including Mighty Thor, the Incredible Hulk, the Fantastic Four, and the X-Men. Success followed the pair into romance comics, and by 1949 there were 120 romantic titles on the market, most of which were intended for an adult audience. (In fact, comics with more explicit themes, which were very common before the code, often carried bright orange labels which read For the more ADULT Reader of Comics.) By 1950, there were 148 different titles, and by the mid-fifties pretty much every comics publisher was churning out romance comics.\n\n(from jennymiller.com)\n\nEnjoy and seed\n","torrent":{"xt":"urn:btih:5119c27b36506b9c3292e66f72e4bce6afc27bfc","amp;dn":"Heart+Throbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5119c27b36506b9c3292e66f72e4bce6afc27bfc","infoHashBuffer":{"type":"Buffer","data":[81,25,194,123,54,80,107,156,50,146,230,111,114,228,188,230,175,194,123,252]},"announce":[],"urlList":[]}}