{"title":"Freemake Video Converter 3.0.2.14 (2012)","uid":7387051,"size":18306416,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:51f64f1bfbb974bd479398f55359e8378884fb53&amp;dn=Freemake+Video+Converter+3.0.2.14+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1340662904,"description":"Freemake Video Converter 3.0.2.14 (2012) \n\n\nYear: 2012\nVersion: 3.0.2.14\nPlatform: Windows XP/2003/Vista/7\nLanguage: Multilanguage\nTablet: Not required\nSize: 17.46 MB\n\nDescription:\n\nFreemake Video Converter - a universal application that offers tools for users' attention quickly convert videos in popular formats, editing and writing to optical media. With enthusiasts Freemake Video Converter also be able to perform some other action, for example, to prepare materials for display on specific mobile devices, create high quality slide shows and to extract the soundtrack from a favorite movie .\n\nAppendix Freemake Video Converter can be used to convert video taken with a digital camera (avi, mpg, tod, mov, dv, rm) or phone (3GP, 3G2, 3GP2), downloaded from the web (flv, swf, mp4 ) or saved on the hard drive of your PC (wmv, avi, qt, ts, m). With built-in &quot;installation of scissors,&quot; the author can cut cut and remove unwanted parts and reorganize. The editing tools allow proposals also rotate the image, and perform other actions. The program allows automatic conversion of video formats supported by popular consumer devices such as iPod, iPhone, iPhone, PSP, Xbox, BlackBerry.\n\nThe package includes tools easy to use and functional for the rapid conversion of disparate digital photos in high quality, multimedia slide shows. Users can also enjoy the means proposed to &quot;Rip&quot; DVD-ROM and be able to easily extract audio tracks from video clips and movies. And audio in various formats can be converted into a universal MP3 format.\n\nSlide presentations and audio files can be quickly uploaded to YouTube directly from the application interface. If necessary, the program file itself cuts the media much of 10 minutes parts that are compatible with the popular video portals.\n","torrent":{"xt":"urn:btih:51f64f1bfbb974bd479398f55359e8378884fb53","amp;dn":"Freemake+Video+Converter+3.0.2.14+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51f64f1bfbb974bd479398f55359e8378884fb53","infoHashBuffer":{"type":"Buffer","data":[81,246,79,27,251,185,116,189,71,147,152,245,83,89,232,55,136,132,251,83]},"announce":[],"urlList":[]}}