{"title":"Birds and Animals of Australia's Top End (2015).pdf Gooner","uid":12302511,"size":343983973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5203d7748e2a785c5c2844ac2638e48e5e1132d3&amp;dn=Birds+and+Animals+of+Australia%27s+Top+End+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1440724157,"description":"Publisher: Princeton University Press (July 14, 2015)\nLanguage: English\nISBN-10: 0691161461\nISBN-13: 978-0691161464\n\nOne of the most amazing and accessible wildlife-watching destinations on earth, the &quot;Top End&quot; of Australia's Northern Territory is home to incredible birds and animals--from gaudy Red-collared Lorikeets to sinister Estuarine Crocodiles and raucous Black Flying-foxes. With this lavishly illustrated photographic field guide, you will be able to identify the most common creatures and learn about their fascinating biology--from how Agile Wallaby mothers can pause their pregnancies to why Giant Frogs spend half the year buried underground in waterproof cocoons.\n\nThe Top End stretches from the tropical city of Darwin in the north, to the savannas of Mataranka in the south, and southwest across the vast Victoria River escarpments to the Western Australian border. The region includes some of Australia's most popular and impressive tourist destinations, such as Kakadu, Litchfield, Nitmiluk, and Gregory national parks, and is visited by more than two hundred thousand tourists every year.\n\nAn essential field guide for anyone visiting the Top End, this book will vastly enhance your appreciation of the region's remarkable wildlife.\n\nFeatures hundreds of stunning color photographs\nIncludes concise information on identification and preferred habitat for each species\nProvides a summary of each species' life history, including interesting habits, and suggestions on where to see it\nOffers valuable tips on searching for wildlife in the Top End\nAn essential guide for visitors to the Top End, from Darwin south to Katherine and Kununurra, including Kakadu, Litchfield, Nitmiluk and Gregory national parks","torrent":{"xt":"urn:btih:5203d7748e2a785c5c2844ac2638e48e5e1132d3","amp;dn":"Birds+and+Animals+of+Australia%27s+Top+End+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5203d7748e2a785c5c2844ac2638e48e5e1132d3","infoHashBuffer":{"type":"Buffer","data":[82,3,215,116,142,42,120,92,92,40,68,172,38,56,228,142,94,17,50,211]},"announce":[],"urlList":[]}}