{"title":"The Vonbluvens Show Collection pt2 (The NSM Years)","uid":8182699,"size":525182091,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5357869a5b520cef6753c3e78ed96152220b6746&amp;dn=The+Vonbluvens+Show+Collection+pt2+%28The+NSM+Years%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Halturnerfan","files":1,"time":1361658081,"description":"The Vonbluvens Show was a White Nationalist podcast from a neo-Nazi point of view that ran on and off from 2002 to 2008.  It remains an interesting timecapsule type snapshot of the world of the NS movement as it existed at the time.  Sadly, copies of the original podcasts can be a bit hard to find these days in no small part due to the orginal host having disavowed the show and working to &quot;scrub&quot; the internat of all references to it.  It's unfortunate to see anything go down the memory hole like that, so I am providing a fairly complete archive of the shws for download in three seperate torrents.\n\nThis is the second part of the collection.  it features shows that were produced when the original host was acting as the National Socialist Movement's &quot;Minister of Radio&quot;.  This era in the show's history is one of the most prolific and certainly is the most consistant in that shows apeared at failry regular intervals\n\nSadly, this archive is not complete as some of the earlier shows are missing, including some important shows such as the interview with Glenn Miller and those that featured Profesor Pluss.  If anyone has those earlir shows, by all means upload them!\n\nAs always this torrent is being provided for historical research and amusement value alone.  It does not nesisarly represent the views of the seeder.","torrent":{"xt":"urn:btih:5357869a5b520cef6753c3e78ed96152220b6746","amp;dn":"The+Vonbluvens+Show+Collection+pt2+%28The+NSM+Years%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5357869a5b520cef6753c3e78ed96152220b6746","infoHashBuffer":{"type":"Buffer","data":[83,87,134,154,91,82,12,239,103,83,195,231,142,217,97,82,34,11,103,70]},"announce":[],"urlList":[]}}