{"title":"Kate Bush - The Dreaming (1982) [EAC-LAME 320kbps]","uid":4641709,"size":105558178,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:54333cda4853fde9cce47b291b36fd10230ae89d&amp;dn=Kate+Bush+-+The+Dreaming+%281982%29+%5BEAC-LAME+320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"h_benotto","files":10,"time":1231738252,"description":"Four albums into her burgeoning career, Kate Bush's The Dreaming is a theatrical and abstract piece of work, as well as Bush's first effort in the production seat. She throws herself in head first, incorporating various vocal loops, sometimes campy, but always romantic and inquisitive of emotion. She's angry and pensive throughout the entire album, typically poetic while pushing around the notions of a male-dominated world. However, Kate Bush is a daydreamer. Unfortunately, The Dreaming, with all it's intricate mystical beauty, isn't fully embraced compared to her later work. Album opener &quot;Sat in Your Lap&quot; is a frightening slight on individual intellect, with a booming chorus echoing over throbbing percussion and a butchered brass section. &quot;Leave It Open&quot; is goth-like with Bush's dark brooding, which is a suspending scale of vocalic laments, but it's the vivacious and moody &quot;Get Out of My House&quot; that truly brings Bush's many talents for art and music to the forefront. It prances with dripping piano drops and gritty guitar, and the violent rage felt as she screams &quot;Slamming,&quot; sparking a fury similar to what Tori Amos ignited during her inception throughout the 1990s. Not one to be in fear of fear, The Dreaming is one of Kate Bush's underrated achievements in depicting her own visions of love, relationships, and role play, not to mention a brilliant predecessor to the charming beauty of 1985's Hounds of Love. ","torrent":{"xt":"urn:btih:54333cda4853fde9cce47b291b36fd10230ae89d","amp;dn":"Kate+Bush+-+The+Dreaming+%281982%29+%5BEAC-LAME+320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54333cda4853fde9cce47b291b36fd10230ae89d","infoHashBuffer":{"type":"Buffer","data":[84,51,60,218,72,83,253,233,204,228,123,41,27,54,253,16,35,10,232,157]},"announce":[],"urlList":[]}}