{"title":"Marshall and Shea - Silenced (mobi, epub)","uid":6955186,"size":1870141,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:549754a5735feceae1a4d1533f981d612e73be08&amp;dn=Marshall+and+Shea+-+Silenced+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":2,"time":1326553911,"description":"Silenced: How Apostasy and Blasphemy Codes are Choking Freedom Worldwide\n\nThe fatwa against Salman Rushdie awakened many westerners to the danger of being accused of blasphemy in the Muslim world. As this eye-opening volume reveals, accusations of &quot;blasphemy,&quot; &quot;apostasy,&quot; or &quot;insulting Islam&quot; are increasingly used by authoritarian governments and extremist forces in the Muslim world to acquire and consolidate power. These charges, which traditionally carry a punishment of death, have proved effective in intimidating not only converts and heterodox groups, but also political and religious reformers. In his foreword, the late Indonesian President Wahid observes that coercively applied blasphemy laws &quot;narrow the bounds of acceptable discourse...not only about religion, but about vast spheres of life, literature, science and culture in general.&quot;\n\nSilenced provides the first survey of such accusations in the contemporary Muslim world, in international organizations, and in the West. The authors describe hundreds of victims, including political dissidents, religious reformers, journalists, writers, artists, movie makers, and religious minorities throughout the Muslim world. They also document the political effects in Muslim societies of blasphemy and apostasy laws, as well as non-governmental fatwas and vigilante violence. Finally, they address the move toward new blasphemy laws in the West and the increasing threat of violence to stifle commentary on Islam in the West even in the absence of law.\n\nAuthor: Paul Marshall and Nina Shea\nPublisher: Oxford University Press, USA\nPublication Date: October 3, 2011\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:549754a5735feceae1a4d1533f981d612e73be08","amp;dn":"Marshall+and+Shea+-+Silenced+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"549754a5735feceae1a4d1533f981d612e73be08","infoHashBuffer":{"type":"Buffer","data":[84,151,84,165,115,95,236,234,225,164,209,83,63,152,29,97,46,115,190,8]},"announce":[],"urlList":[]}}