{"title":"Forbidden Holywood Collection Vol. 3-Disk 1-DVD9- Other Men's Wo","uid":9265328,"size":7379523584,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:54fb599f59f02cf51241f844418a8b88c97a881e&amp;dn=Forbidden+Holywood+Collection+Vol.+3-Disk+1-DVD9-+Other+Men%27s+Wo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1385694062,"description":"Forbidden Holywood Collection Vol. 3-Disk 1-DVD9- Other Men's Women (1931) - The Purchase Price (1932) [DDR]\n\n----------------------------------------------------------------------------------\n\nForbidden Holywood Collection Vol. 3 -  Other Men's Women (1931) \n\nOther Men's Women is a 1931 all-talking pre-code American film directed by William A. Wellman and written by Maude Fulton. \nIt was produced and distributed by Warner Brothers. The film stars Grant Withers, Regis Toomey and Mary Astor. \nThe film was first previewed and released in a limited number of locations under the title The Steel Highway in 1930. \nBy the time of the film's general release the title had been changed to Other Men's Women. \nDue to the public's apathy and aversion to anything musical in films in late 1930 and early 1931, the film's music is kept to an absolute minimum. \nThe credits at the beginning and ending of the film are presented without music and there is virtually no background musical score throughout the film.\n\nCAST:-\nGrant Withers as Bill White\nMary Astor as Lily Kulper\nRegis Toomey as Jack Kulper\nJames Cagney as Ed 'Eddie' Bailey\nJoan Blondell as Marie\nFred Kohler as Haley\nJ. Farrell MacDonald as Peg-Leg\nLillian Worth as Waitress\nWalter Long as Mike 'Bix' / 'Roundhouse' Bixby\n\nDirected by William A. Wellman\nWritten by Maude Fulton, William K. Wells\nMusic by Erno Rapee, Louis Silvers\n\nSYNOPSIS:- Other Men's Women (1931)\nThe film is about Bill (Grant Withers), a railroad engineer, who falls in love with Lily (Mary Astor), the wife of his co-worker Jack (Regis Toomey). When the two men fight over Lily, Jack is blinded. He dies in a violent storm saving Bill's life. Joan Blondell plays a diner waitress and James Cagney makes his third film appearance in a small role as an engineer.\n\nRailroad fireman Bill White is a carefree ladies' man with an irresponsible streak. His buddy Jack Kulper, an engineer, is more solid and reliable. Bill comes to stay a while with Jack and his wife Lily. Bill and Lily fall in love, but not wishing to hurt Jack, Bill leaves without explanation. When Jack confronts Bill about his suspicions, the two fight and Jack is seriously injured. Bill is consumed with guilt and tries to make good, but Jack has his own ideas about that. \n\n=====================================================================================\n\nForbidden Holywood Collection Vol. 3 -  The Purchase Price (1932) \n\nThe Purchase Price is a 1932 Pre-Code American film, which was directed by William Wellman and starring Barbara Stanwyck, George Brent, and Lyle Talbot. Adapted from the \n\nnovel by Arthur Stringer, with a screenplay by Robert Lord, the film is about an attractive nightclub singer who leaves her criminal boyfriend and travels to Canada and becomes the mail-order bride of a humble farmer.\n\nDuring the fight scene between Talbot and Brent, Wellman approached each actor privately with the instruction: &quot;let him have it.&quot; The actors worked the fight out between themselves beforehand. However, when Talbot flew back against a wall (as planned), his head struck a nail. &quot;It just bled like mad. They had to take me over to the infirmary and sew me up.\n\nStanwyck's rendition of &quot;Take Me Away&quot; marked the first time she sang onscreen.\n\nCAST:-\nBarbara Stanwyck as Joan Gordon\nGeorge Brent as Jim Gilson\nLyle Talbot as Eddie Fields\nHardie Albright as Don Leslie\nDavid Landau as Bull McDowell\nMurray Kinnell as Spike Forgan\nAnne Shirley as Sarah Tipton\n\nDirected by William Wellman\nScreenplay by Robert Lord\nStory by Arthur Stringer\nMusic by Leo F. Forbstein\n\nMOVIE REVIEW:- The Purchase Price (1932)\nJoan Gordon (Barbara Stanwyck) is a torch singer, performing on Broadway since age 15, who runs away from her high profile gangster boyfriend Eddie Fields (Lyle Talbot), in order to marry Don Leslie (Hardie Albright), an upstanding citizen who can provide Joan with a secure future. However, Don's father has checked-up on Joan's past, and finds out about her relationship with Eddie. When Don dumps her, she decides to run away from town, rather than returning to Eddie. In Montreal, she changes her name and resumes performing. Later, one of Eddie's men recognizes her, and informs his boss. Aware she cannot stay in Montreal forever, Joan trades places with her hotel's maid (Leila Bennett), who had used her picture when corresponding with a struggling North Dakota farmer in the height of the Great Depression. Offering the bride a large sum of money in exchange for the farmer's address, Joan becomes a mail-order bride to the farmer, Jim Gilson (George Brent).\n\nTheir relationship has a rocky start, when at the first night, a put off Joan rejects Jim's attempts to make love with her and suggests that they sleep apart. The next morning, she tries to apologize for her behavior, but Jim is not interested. Joan, who over the while falls in love with him, tries to win his affections, although Jim remains unmoved. Meanwhile, he is informed that he will lose his land if he does not make profit anytime soon. Even though he is certain that he has developed great wheat seed that can save him from a downfall, he has to convince fellow farmer Bull McDowell (David Landau), who has offered to buy his land in exchange for Joan's company. Despite never having showed affection for Joan, he is unhappy with another man thriving her attention, and starts a fight with him.\n\nSometime later, Joan drives out to an old woman who is giving birth. By this time, Joan has already broken with her city-girl image and slowly progressed into a farmer's wife. She helps the old woman and her adolescent daughter Sarah (Anne Shirley), and then races through a snow storm to return to her husband. There, she is informed by Jim that he has taken in a man who was injured during the storm. She finds out that the man is no other than Eddie. She initially pretends not to know him, but Eddie quickly tries to take her with him. \n\nRealizing his wife's past is a big lie, Jim concludes that she is worthless and suggests she go with Eddie. Joan refuses to leave him and even asks Eddie for a loan to save Jim's land.\n\nThrough the loan, Jim is allowed to pay of his debts until after the harvest. Joan continues to stand at his side, but Jim is unable to forgive her. Meanwhile, Bull has set the farm on fire, and Joan and Jim finally reconcile after Joan sustains injuries due to the fire. Together, they put out the fire, after which Jim admits he does love her.\n\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 137 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 137 mins","torrent":{"xt":"urn:btih:54fb599f59f02cf51241f844418a8b88c97a881e","amp;dn":"Forbidden+Holywood+Collection+Vol.+3-Disk+1-DVD9-+Other+Men%27s+Wo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54fb599f59f02cf51241f844418a8b88c97a881e","infoHashBuffer":{"type":"Buffer","data":[84,251,89,159,89,240,44,245,18,65,248,68,65,138,139,136,201,122,136,30]},"announce":[],"urlList":[]}}