{"title":"SSDlife.Ultrabook.v2.5.80-TE","uid":10822834,"size":8513815,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:551c408684f1a12467be7b0a6d6b35cc657599eb&amp;dn=SSDlife.Ultrabook.v2.5.80-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TeX","files":5,"time":1408553058,"description":"TE 2014 PRESENTS\n\nANOTHER FINE RELEASE\n\nRelease: SSDlife Ultrabook v2.5.80 (c) 2014 BinarySense\nDate: 08/20/2014\n\nCracked By: Twisted EndZ\nRelease Type: Other: Armadillo, Precracked\nRELEASE NOTES\n\nSSD Life for Ultrabooks\n\nDo you own a modern and powerful ultrabook? Just for you we ve\ndeveloped the new SSDLife edition - SSDLife for Ultrabook. It\nfeatures full support for your ultrabook and uses minimal\nresources at the same time\n\nFull support for ultrabooks\n\nSSDLife for Ultrabook is specifically designed for ultraportable\ncomputers. Ultrabooks, which are powerful and lightweight\nlaptops, have been our top-priority platform since the very\nstart. Ultrabooks allocated in a separate segment\n\nMinimum system load\n\nBeing originally designed for laptops, SSDLife for Ultrabook puts\nminimum load on your ultraportable device. It uses a very small\namount of RAM and includes battery-saving modes to deliver the\nbest experience\n\nSingle SSD drive support\n\nMost ultrabooks and ultraportable laptops are designed to fit\nonly one disk. That s why we ve optimized SSDLife for Ultrabook\nto deal with a single SSD only. This also helped us to reduce the\nresources used by the program\n\nAll other features of SSDLife Pro\n\nSSDLife for Ultrabook supports all other features of the pro\nversion, including some unique ones such as checking for firmware\nupdate and calculation of an SSD s lifetime\n\nPRO FEATURES:\n\nSSD reliability analysis\nIt s a shame when a drive failure results in all your personal\ndata being lost. SSDLife allows you to control how worn your\nSSDs are in an easy and convenient way, which means you can\ncontrol how safely and securely your data is stored on them\n\nSSD lifetime calculation\nSSD Life analyzes how actively you use your solid-state drive\nand uses a special algorithm to calculate its estimated\nlifetime. Of course, the date of the lifetime expiration is\ncorrected depending on how intensively you keep using your\ndrive\n\nFull drive information\nThe entire information about your SSD from general\n(manufacturer, model) to technical (whether your drive/system\nsupports TRIM) is displayed in the main window of SSD Life\nSometimes you may need it to find out how many hours the drive\nhas already been in operation, for example, when you buy a used\nSSD\n\nCompatibility with SSDs\nSSDLife supports practically all SSDs that are in use from\nthe latest Intel models to the time-proven first Vertex models\nSSDLife has been tested with solid-state drives from most SSD\nmanufacturers such as Kingston, OCZ. And even with Apple\nMacBook Air!*\n\n* in case the Windows operating system is installed on it\n\nWhats New In v2.5.80 - August 6, 2014:\nFixed support for Crucial M550 mSATA (detection, added image)\n\nv2.5.78 - July 14, 2014\nFull support for Crucial M500, M550, MX100 added\n* some bugs fixed\n\nv2.5.76 - May 28, 2014\n\n* some bugs fixed\n\nIMPORTANT NOTICE:\n\nAs of 09/14/2013 ALL TE RAR archives will now be using the RAR5\nstandard. Please make sure to update to the latest version of\nWinrar (at least Winrar v5.0) so you can extract the contents of\nthe *.001, *.002 etc... archives within the zip files. The\nupdate is free, there is no reason not to update\n\nTE Release Filename: tsdn257x.zip\n\nINSTALLATION NOTES\n\nInstall SSDlife UB 2.5.80.msi for normal installation. Copy\nprecracked exe from the Crack folder to the installed folder of\nSSDlife UB, making sure you overwrite the existing file\n\nFor a portable installation. Copy ssdlife.exe from the Crack\nfolder onto your USB Flash Drive or Disc Media. Now you can\nLaunch SSDlife UB from your prefered device\n\nThats it! Enjoy\n\nT E 2 0 1 4\n\nascii\nby mx\n\nDon't Hate The Hacker, Hate The Code","torrent":{"xt":"urn:btih:551c408684f1a12467be7b0a6d6b35cc657599eb","amp;dn":"SSDlife.Ultrabook.v2.5.80-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"551c408684f1a12467be7b0a6d6b35cc657599eb","infoHashBuffer":{"type":"Buffer","data":[85,28,64,134,132,241,161,36,103,190,123,10,109,107,53,204,101,117,153,235]},"announce":[],"urlList":[]}}