{"title":"[Patrick_Sanchez]Girlfriends(azw, epub, lrf, mobi, pdf){Zzzzz}","uid":11112372,"size":6723949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55f70984b6df41449fe344d82abc4f2249f5d107&amp;dn=%5BPatrick_Sanchez%5DGirlfriends%28azw%2C+epub%2C+lrf%2C+mobi%2C+pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":6,"time":1411816955,"description":"Book Description\nPublication Date: August 5, 2014\nThis wickedly witty, urbane novel tackles the ups and downs of female friendship, and the ultimate question for every young woman searching for the perfect job, apartment, and man--or woman--in the big city: What's a nice girl like you doing with a life like this?\n\nGina knows there are worse things than being dateless for her ten-year high school reunion--for example, being dateless at yet another wedding. But after witnessing one lavish nuptial too many, she wonders if it's time to give up on Mr. Right, and settle for Mr. Maybe.... A chic, African-American woman, Cheryl loves the diversity of city life. But despite her open mind and free spirit, she still longs for a husband. And she's willing to break every rule of online dating to find him. . .. When Linda meets Rosa, she's sure the beautiful Latina is her future--even though she's soon reminded that everyone has a past. . .\n\nBetween personal misadventures and professional mishaps, all three women will find that when the going gets tough what you need most is your sense of humor--and your girlfriends. . .\n\n&quot;Clearly taking his cue from Candace Bushnell (Sex and the City) and Helen Fielding (of Bridget Jones fame), Sanchez's style is light and entertaining.&quot; --Publishers Weekly\n\nKensington | English | August 5, 2014 | ISBN: 1575669242 | 384 pages | azw, epub, lrf, mobi, pdf | 6,4 mb\n\nEditorial Reviews\nFrom Publishers Weekly\nThe recent craze of hapless singletons tackling seemingly infinite battles in career and romance has inspired yet another jungle of comical mishaps in debut novelist Patrick Sanchez's Girlfriends. From one-night stands to embarrassing high school reunions, Sanchez places his 20-somethings, a trio of chic, ambitious, unlucky-in-love (and often unoriginal) characters, in the most unbelievable though occasionally amusing circumstances. Clearly taking his cue from Candace Bushnell (Sex and the City) and Helen Fielding (of Bridget Jones fame), Sanchez's style is light and entertaining; the episodic nature of the novel may leave readers wondering whether a TV series is in the works.\n\nCopyright 2001 Cahners Business Information, Inc.\nReview\n&quot;If Armistead Maupin and Terry McMillan collaborated on a novel, GIRLFRIENDS would be the result... a wildly entertaining first novel.&quot; -- Todd D. Brown, author\n\n&quot;Imagine FRIENDS without the Prozac... Wickedly funny and blisteringly vengeful...&quot; -- Stephen Stark, author\n\n&quot;VALLEY OF THE DOLLS meets BRIDGET JONES via THREE COINS IN THE FOUNTAIN!&quot; -- Michael Musto, VILLAGE VOICE\n\n","torrent":{"xt":"urn:btih:55f70984b6df41449fe344d82abc4f2249f5d107","amp;dn":"%5BPatrick_Sanchez%5DGirlfriends%28azw%2C+epub%2C+lrf%2C+mobi%2C+pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55f70984b6df41449fe344d82abc4f2249f5d107","infoHashBuffer":{"type":"Buffer","data":[85,247,9,132,182,223,65,68,159,227,68,216,42,188,79,34,73,245,209,7]},"announce":[],"urlList":[]}}