{"title":"Angry Birds Star Wars 1.3.0 (2013PC-ENG)@Anirban","uid":8889523,"size":74889180,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:581a9d567999122a52144aaf904067208e9e7cb0&amp;dn=Angry+Birds+Star+Wars+1.3.0+%282013PC-ENG%29%40Anirban&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NokiaAnir","files":4,"time":1378548868,"description":"Once upon a time in a far, far away galaxy ... Rebel team desperate birds face off with galactic threat: the evil empire pigs!\n\nThe rebel attack birds made with a hidden base and scored his first victory against the evil Imperial pigs. During the battle, Rebel spies managed to steal a plan Stars pigs and now they are racing to provide this plan rebellious bird. They need your help!\n\nJoin the epic adventure with the Angry Birds in the legendary Star Wars universe! Use the power and possess your lightsaber and bring problems to pigs in his intergalactic journey from the deserts of Tatooine to the depths Stars pigs, where you face off against the terrifying Darth Vader, Dark Lord of pigs! You can become a Jedi Master and restore freedom to the galaxy? It's time to take your lightsaber and join the adventure! Yes birds will arrive to you!\n\nFeatures Angry Birds Star Wars:\nHours and hours of engaging gameplay. Explore more than 80 levels in different locations, such as Tatooine as the Star of Pigs. You will be able to destroy the Imperial pigs, laser towers, pigs Tusken Riders and the dark side of the Force to get all three stars?\nNew gameplay mechanics. Use a light saber, fuses and power of the Jedi to damage the Imperial Pigs!\nImprove their birds. Keep playing and enhance your birds to improve their skills!\nSecrets and hidden goodies. You can open R2-D2 and bonus levels C-3PO?\nFree updates. This is only the beginning of the epic saga!\nThe powerful falcon. Stuck on the difficult level? Earn stars and call the Mighty Falcon to inflict maximum damage. New goals, achievements and gameplay!\nThe Jedi Path. Training ground for the Jedi, this purchase in the application opens the 40 levels of the call Dagobah with Jedi Master Yoda! Do well by the Jedi to open the legendary sword of the Jedi!\n\nSystem requirements:\nOperating system: Windows Â® XP / Vista / Windows Â® 7\nProcessor: 2GHz\nRAM: 512 MB\nVideo: 3D-graphics card compatible with DirectX, 128 MB\nSound Card: Sound device compatible with DirectX Â® 9.0\nFree hard disk space: 48.3 MB","torrent":{"xt":"urn:btih:581a9d567999122a52144aaf904067208e9e7cb0","amp;dn":"Angry+Birds+Star+Wars+1.3.0+%282013PC-ENG%29%40Anirban","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"581a9d567999122a52144aaf904067208e9e7cb0","infoHashBuffer":{"type":"Buffer","data":[88,26,157,86,121,153,18,42,82,20,74,175,144,64,103,32,142,158,124,176]},"announce":[],"urlList":[]}}