{"title":"Ultimate Spider-Man Vol 1-2 Complete","uid":11021741,"size":9310588129,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:594d8e3e7756767729419f7851257ed54f4ff001&amp;dn=Ultimate+Spider-Man+Vol+1-2+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"UnreadHy","files":-1,"time":1410598803,"description":"Why this upload.... again? \n\nFirst - This is what I'm currently re-reading. I've read this series before and by god if you haven't.. you should. I HIGHLY SUGGEST buying the comics via Amazon or some other store(buy locally and support you local retailers. \n\nSecondly - As much as I do not want to step on toes - There are a few uploads (MANY BY PEOPLE WHO OWE OUR UNDYING GRATITUDE) - which claim to contain 'Complete Vol 1' and 'Vol 2' of Ultimate Spider-Man. Going to point out that it does not appear that any of them contain Spider-Man Requiem (Which is actually a bit of a pain to find). \n\nSpider-Man Requiem comes at the end of Vol 1. The mini-series, Ultimatum: Spider-Man Requiem #1-2 written by Bendis and art by Bagley and Immonen, would explore the lives of supporting cast of the Ultimate Spider-Man after the crisis of Ultimatum as how are they are living their lives without the webslinger, such as J. Jonah Jameson's eulogy to the apparent fallen hero and Peter Parker's loved ones' grief over his disappearance. In Manhattan, the military and the surviving Ultimates searches for survivors of Magneto's attack, and Captain America finds the unconscious Peter Parker within the ruins of the city, revealed to be still alive. The story serves as a bridge between Ultimate Spider-Man and Ultimate Spider-Man vol. 2.\n\nIn keeping with my other upload - I put things in reading order. I'm a little OCD like that. I also combined Requiem into a singular book as it makes the numbering work. Assuming Vol 1 ends at 133, Requiem as 134 - Vol 2 starts at 135 and runs smoothly till completion of Vol 2 with the death of Spider-Man. I've included Ultimate Fallout as it does pertain to what happens after Spider-Man's death thus truly being a complete Vol 1 and 2. Vol 3 can be found elsewhere. ","torrent":{"xt":"urn:btih:594d8e3e7756767729419f7851257ed54f4ff001","amp;dn":"Ultimate+Spider-Man+Vol+1-2+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594d8e3e7756767729419f7851257ed54f4ff001","infoHashBuffer":{"type":"Buffer","data":[89,77,142,62,119,86,118,119,41,65,159,120,81,37,126,213,79,79,240,1]},"announce":[],"urlList":[]}}