{"title":"FIFA 12 MULTI 9 Portable - [Espera]","uid":6815920,"size":8548842246,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5992b3f4f54ac1b7a752ee3409bf2fba7142b366&amp;dn=FIFA+12+MULTI+9+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1321205806,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Go inside the &quot;Game&quot; folder and Run &quot;FIFA 12 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us may or may not \nwork with x64 versions of Windows.\n\nFIFA 12 (titled FIFA Soccer 12 in North America) is the nineteenth game in Electronic Arts' FIFA series of association football video games. It was developed by EA Canada, and published by Electronic Arts worldwide under the EA Sports label. David Rutter, the line producer for FIFA 12, promised &quot;a revolutionary year for FIFA ... especially in the gameplay department.&quot;[6]\n\nAn &quot;Ultimate Edition&quot; of the game will be available through Game and Gamestation stores. It includes four monthly Ultimate Team gold packs, with each pack containing 12 items including players, contracts, stadiums, managers, staff, fitness, healing, footballs, kits and badges. Each pack contains one rare item, such as enhanced player attributes, longer contracts and the most coveted players. On 22 June 2011, EA Sports announced that the Microsoft Windows version of FIFA 12 will have the same engine, features, and competitions as the PlayStation 3 and Xbox 360 versions.\n\nAlong with several other new EA Sports titles, FIFA 12 was available three days early to purchasers of the EA Sports Season Ticket.\n\nThe release date of the FIFA 12 demo was announced at the Gamescom event in Germany on 16 August; the demo was available from Xbox Live Marketplace and EA's Origin Store[9] for Microsoft Windows on 13 September 2011,[10] though the Playstation 3 demo was not available in Europe until the following day.\n\nRecommended system requirements: CPU with dual-core processor (Intel Core 2 Duo or faster). Intel Core2Duo @ 2,4 Ghz Windows XP / Windows Vista / Windows 7. 2 GB of RAM. DirectX Ã‚Â® 9.0c compatible 256 MB video card with 3D acceleration or equivalent (support for Shader Model 3.0 or higher). ATI RADEON HD 2900. NVIDIA GEFORCE 8800 GT.","torrent":{"xt":"urn:btih:5992b3f4f54ac1b7a752ee3409bf2fba7142b366","amp;dn":"FIFA+12+MULTI+9+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5992b3f4f54ac1b7a752ee3409bf2fba7142b366","infoHashBuffer":{"type":"Buffer","data":[89,146,179,244,245,74,193,183,167,82,238,52,9,191,47,186,113,66,179,102]},"announce":[],"urlList":[]}}