{"title":"Chiang Kai Shek - Jonathan Fenby","uid":8576434,"size":36274277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a0c76b3bf0b57bb4f22f706cd83462cabf8672b&amp;dn=Chiang+Kai+Shek+-+Jonathan+Fenby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"loonleeks","files":-1,"time":1371288879,"description":"Chiang Kai Shek: China's Generalissimo and the Nation He Lost\n\n\nBook Description\nDec 10 2004\n\nWith a narrative as briskly paced and vividly detailed as an international thriller, this definitive biography of Chiang Kai-shek masterfully maps the tumultuous political career of Nationalist China's generalissimo as it reevaluates his brave but unfulfilled life. Chiang Kai-shek was one of the most influential world figures of the twentieth century. The leader of the Kuomintang, the Nationalist movement in China, by 1928 he had established himself as head of the government in Nanking. Butwhile he managed to survive the political storms of the 1930s, Chiang's power was continually being undermined by the Japanese on one side and the Chinese Communists on the other. Drawing extensively on original Chinese sources and accounts by contemporaneous journalists, acclaimed author Jonathan Fenby explores little-known international connections in Chiang's story as he unfolds a story as fascinating in its conspiratorial intrigues as it is remarkable for its psychological insights. This isthe definitive biography of the man who, despite his best intentions, helped create modern-day China.\n","torrent":{"xt":"urn:btih:5a0c76b3bf0b57bb4f22f706cd83462cabf8672b","amp;dn":"Chiang+Kai+Shek+-+Jonathan+Fenby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0c76b3bf0b57bb4f22f706cd83462cabf8672b","infoHashBuffer":{"type":"Buffer","data":[90,12,118,179,191,11,87,187,79,34,247,6,205,131,70,44,171,248,103,43]},"announce":[],"urlList":[]}}