{"title":"San Suk Si Gin (DD 5.1)(2009)(Nl subs) RETAIL TBS","uid":6509487,"size":4633109276,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5b1536d0c02d9ab32bd7c7a2caed3441f6e06c04&amp;dn=San+Suk+Si+Gin+%28DD+5.1%29%282009%29%28Nl+subs%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vlinder.","files":-1,"time":1309562886,"description":"San Suk Si Gin (DD 5.1)(2009)(Nl subs) RETAIL TBS\n\nAlternatieve titels: The Shinjuku Incident, Xin Su Shi Jian\n\nHongkong\nActie / Drama\n120 minuten\n\ngeregisseerd door Tung-Shing Yee\nmet Jackie Chan, Naoto Takenaka en Jinglei Xu\n\nNet als heel veel van zijn landgenoten ontvlucht boer Steelhead (Jackie Chan) het arme bestaan in China voor een betere toekomst in Japan. \nSteelhead heeft nog een tweede reden om naar Tokyo te gaan, want zijn jeugdliefde is daar jaren geleden naar toe gegaan \nen na een tijdje is het contact helemaal verbroken. In Tokyo aangekomen ontdekt hij hoe zwaar het leven van een immigrant kan zijn. \nChinezen doen het vuile werk van de zich superieur voelende Japanners en de yakuza hebben het leven in een ijzeren greep. \nSteelhead ontdekt dat de enige manier om een goed leven op te bouwen, is door zelf ook voor de misdaad te kiezen. \nHij begint met het verkopen van illegale telefoonkaarten, \nmaar al snel geeft hij leiding aan een groep Chinezen die op allerlei illegale manieren geld probeert te verdienen. \nTijdens zijn weg naar boven op de criminele ladder raakt hij bevriend met Eguchi, onderbaas van ÃƒÂ©ÃƒÂ©n van de yakuza-clans. \nVia hem weet Steelhead zijn positie te versterken, maar hoe groter en machtiger hij groeit, \ndes te meer aandacht hij trekt van de gevestigde orde die onder geen beding de vorming van een sterke Chinese bende toe wil staan.\n\nThe Shinjuku Incident is een heel ander soort Jackie Chan film dan we de laatste jaren van hem gewend zijn. \nDe humor en vechtkunsten van Chan hebben plaats gemaakt voor een veel hardere en rauwere inhoud die de fans van actie en misdaadfilms zeker aan zal spreken..\n\nStoryline\n\nIn China, the poor worker Tietou repairs tractors and misses his sweetheart Xiu Xiu, back in Japan, \nshe having never sent any news to her family or him. While illegally emigrating to Japan, \nTietou loses his Chinese documents and so cannot return to his country. \nHe is welcomed by his countrymen who lodge and work in Shinjuku where they also help him to find illegal work. \nWhile running from a police raid through the sewage system where Chinese are illegally working, \nTietou saves Inspector Kitano from drowning in the dirty water. Later, after an incident with his cousin, Joe, \nand a Taiwan gang, Tietou saves the powerful Yakuza boss Toshinari Eguchi. He is the husband of Xiu Xiu, \nwho is now called Yuko and are parents of a little daughter. The mobster offers a dirty job to Tietou; in retribution, \nhe promises to deliver the quarter dominated by the Taiwan gang to him. \nTietou becomes the boss of the Chinese illegal immigrants...\n\nThe Shinjuku Incident is a very different kind of film than Jackie Chan in the last years he used to. \nThe humor and martial arts from Chan have made for a much harsher and harsher content that fans of action and crime films will certainly speak ..\n\ninfo\n  \nCategory..........: Video \nFormat............: DVD5 \nSource............: Retail  \nSubtitle..........: Dutch subs selectable  \nAudio.............: Chinees Gesproken \nGeluid............: DD5.1 \nAudio.............: Chinese language\nNederlandse.......: (originele) ondertiteling.\nMenu..............: Yes\nExtras............: No\nCover.............: Yes \n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/52552&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/52552&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1075419&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1075419&lt;/a&gt;","torrent":{"xt":"urn:btih:5b1536d0c02d9ab32bd7c7a2caed3441f6e06c04","amp;dn":"San+Suk+Si+Gin+%28DD+5.1%29%282009%29%28Nl+subs%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b1536d0c02d9ab32bd7c7a2caed3441f6e06c04","infoHashBuffer":{"type":"Buffer","data":[91,21,54,208,192,45,154,179,43,215,199,162,202,237,52,65,246,224,108,4]},"announce":[],"urlList":[]}}