{"title":"The Planets - Dava Sobel  (Unabridged)","uid":6511536,"size":324745034,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5bb792d78894a0535f5f26f366d1663b2765cc07&amp;dn=The+Planets+-+Dava+Sobel++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":7,"time":1309642100,"description":"The Planets\nby Dava Sobel; read by Lorna Raver\nÃ‚Â©2005 Random House Audio\nUnabridged (Length: 5 hrs., 31 mins.)\nOrig. Media: Audio CD\n---------------------------------------------------------------------------\n\n\n&quot;Playful...lyrical ... a guided tour so imaginative that we forget we're being educated while we're being entertained.&quot; -Newsweek\n\n\n\nTABLE OF CONTENTS . . .\n\n* INTRODUCTION (01:00) - [PHOTO: Diane Ackerman &amp; Carl Sagan]\n* CHAPTER 01 - Model Planets (14:23) - [PHOTO: The Solar System]\n* CHAPTER 02 - Genesis (The Sun) (22:06) - [PHOTO: The Sun]\n* CHAPTER 03 - Mythology (Mercury) (28:04) - [PHOTO: Mercury]\n* CHAPTER 04 - Beauty (Venus) (27:49) - [PHOTO: Venus]\n* CHAPTER 05 - Geography (Earth) (42:09) - [PHOTO: Earth]\n* CHAPTER 06 - Lunacy (The Moon) (27:25) - [PHOTO: The Moon]\n* CHAPTER 07 - Sci-Fi (Mars) (28:22) - [PHOTO: Mars]\n* CHAPTER 08 - Astrology (Jupiter) (31:08) - [PHOTO: Jupiter]\n* CHAPTER 09 - Music of the Spheres (Saturn) (23:00) - [PHOTO: Saturn]\n* CHAPTER 10 - Night Air (Uranus &amp; Neptune) (42:03) - [PHOTO: Uranus &amp; Neptune]\n* CHAPTER 11 - U.F.O. (Pluto &amp; KBOs) (24:24) - [PHOTO: Pluto &amp; Charon]\n* CHAPTER 12 - Planeteers (09:18) - [PHOTO: Cassini &amp; Huygens probes]\n* GLOSSARY (10:24) - [PHOTO: Back Cover]\n\n\n\nSUMMARY . . .\n\n\nTHE PLANETS is Dava Sobel's sweeping look at our heavenly galaxy. In the spirit of Longitude and Galileo's Daughter, Sobel once again brings science and history deftly to life as she explores the origins of the planets and reveals the exotic environments that exist in each of these fascinating alien worlds. \n\nAfter the huge national and international success of Longitude and Galileo's Daughter, Dava Sobel tells the human story of the nine planets of our solar system. THE PLANETS tells the story of each member of our solar family, from their discovery, both mythic and historic, to the latest data from the modern era's robotic space probes and images from the Hubble Space Telescope. Whether revealing what hides behind Venus' cocoon of acid clouds, describing Jupiter's 'Technicolor lightning bolts and shimmering sheets of auroras,' or capturing first-hand the excitement at the Jet Propulsion Laboratory when the first pictures from Voyager were beamed to earth, Dava Sobel's unique tour of the solar family is filled with fascination and poetry. \n\nIn lyrical prose THE PLANETS gives a breathtaking, close-up perspective on those heavenly bodies that have captured the imagination of humanity since that first glimpse at the glittering night skies. This is an extraordinary book of science, history, biography and storytelling. Timely and timeless, THE PLANETS will engage and delight as it unravels the mysteries of the cosmos.\n\n\n\n\nABOUT THE AUTHOR . . .\n\nDava Sobel (born 1947) is a writer of popular expositions of scientific topics. She graduated from the Bronx High School of Science and Binghamton University. Her works include:\n\n* Longitude: The True Story of a Lone Genius Who Solved the Greatest \nScientific Problem of His Time (1995) - the genius in question was \nJohn Harrison, who spent decades trying to convince the British \nAdmiralty of the accuracy of his naval timepieces and their use in \ndetermining longitude when at sea in order to win the longitude \nprize. - The book itself won the 1997 British Book of the Year award.\n* Galileo's Daughter: A Historical Memoir of Science, Faith, and Love \n(2000)\n* The Best American Science Writing 2004 (editor)\n* The Planets: A discourse on the discovery, science, history and \nmythology, of the planets in our solar system, with one chapter \ndevoted to each of the celestial spheres. (2005)\n\nLongitude was dramatised for television by Charles Sturridge and Granada Film in 1999, and was shown in the US by A&amp;E. Michael Gambon played John Harrison, and Jeremy Irons played Rupert Gould, who restored Harrison's timepieces for posterity in the mid 20th century.\n\nSobel made her first foray into teaching at the University of Chicago as the Vare Writer-in-Residence during Winter 2006. She taught a one-quarter seminar on &quot;Writing About Science.&quot;\n\n\n\n\nABOUT THE READER . . .\n\nLorna Raver (born October 9, 1943) is a American actress who has appeared in numerous films and television series. She is also an esteemed narrator of audio books. She is sometimes credited as Lorna Raver Johnson.\n\nOn September 19, 2006, she began appearing as Rebecca Kaplan (previously played by Millie Perkins) on CBS's The Young and the Restless. She won wide critical acclaim as Mrs. Ganush in Sam Raimi's Drag Me to Hell. In addition to numerous other stage and television appearances, she is a notable audio book narrator for Tantor, Books on Tape and Blackstone Audio, frequently working with her domestic partner Yuri Rasovsky.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5bb792d78894a0535f5f26f366d1663b2765cc07","amp;dn":"The+Planets+-+Dava+Sobel++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb792d78894a0535f5f26f366d1663b2765cc07","infoHashBuffer":{"type":"Buffer","data":[91,183,146,215,136,148,160,83,95,95,38,243,102,209,102,59,39,101,204,7]},"announce":[],"urlList":[]}}