{"title":"Grateful Dead Summer Solstice 89 pt.2 VHScap","uid":8699313,"size":1410289340,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5cf849bad862e4e74cd1ec5b9f2d05ee8dab1788&amp;dn=Grateful+Dead+Summer+Solstice+89+pt.2+VHScap&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"erebus009","files":1,"time":1374022670,"description":"Grateful Dead Summer Solstice 89 pt2 VHScap\n\nSet out to digitize my VHS collection, so I picked up a capture device, dragged out the old VCR, and the first tape out the box is the Grateful Dead Summer Solstice concert, broadcast live on June 21, 1989 from the Shoreline Theater in Mountain View, CA, and pirated from the Showtime pay-per-view satellite feed with a black box.\nI've had this tape for 24 years and can attest that this is the first time it has been played in it's entirety, so there is no stretching or mangling from cheap VCRs. Because of this I decided to rip it once on the first pass without trying to rework the sound separately. I split it to make it more manageable than the captured mpg format of 7.72 gigs, but if there's interest for it I can post it as well.\nA lot of fun was had during this taping (so I'm told), but I must have been conscious because I paused it for most of the 30 minute intermission, not knowing if I had enough room left on the tape for whole show. As it turned out, the network cut it off before the encore was finished.\nPurists may grumble, but my intent was to digitize what I had and I'm more than happy  with the results.\nEnjoy!","torrent":{"xt":"urn:btih:5cf849bad862e4e74cd1ec5b9f2d05ee8dab1788","amp;dn":"Grateful+Dead+Summer+Solstice+89+pt.2+VHScap","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf849bad862e4e74cd1ec5b9f2d05ee8dab1788","infoHashBuffer":{"type":"Buffer","data":[92,248,73,186,216,98,228,231,76,209,236,91,159,45,5,238,141,171,23,136]},"announce":[],"urlList":[]}}