{"title":"Jimmy Page &amp; Robert Plant - No Quarter (1994) WMA320","uid":6043828,"size":326683378,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5d89eda9ad67fa7c574190cefdbc494869efaa1f&amp;dn=Jimmy+Page+%26+Robert+Plant+-+No+Quarter+%281994%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292469185,"description":"The 1994 release of Jimmy Page and Robert Plant's &quot;No Quarter&quot; or &quot;Unledded&quot; was part of the MTV unplugged series. It is not a Led Zeppelin reunion, but there are plenty of guest musicians who shine, including Najma Akhtar on vocals and the Egyptian Ensemble, Musicians in Marrakech and the London Metropolitan Orchestra.\nRather than trot out the hits, Page and Plant chose lesser known and acoustic-based tunes, especially from LZIII, and did some significant reworking of songs like &quot;Nodbody's Fault But Mine&quot; and &quot;Kashmir.&quot; The result is multi-textured and organic, with an outside feeling.\n&quot;Nobody's Fault But Mine&quot; has a country flair, and although Plant's voice sounds strained, he makes up for it with effort.\n&quot;Thank You&quot; is a love pledge ballad, and Plant's vocal in a lower register sounds better here.\n&quot;No Quarter&quot; is really missing John Paul Jones. Page's guitar playing gets a bit creaky, but overall this song is effectively haunting.\n&quot;Friends&quot; brings in some of the traditional North African instrumentation, along with acoustic guitar, and with this number the musicians start to sound more comfortable and relaxed.\n&quot;Yallah&quot; is one of three new songs here, with soaring vocals by Plant, strong percussion and an exotic feel sounds like one staring into the desert at sunset.\n&quot;City Don't Cry&quot; features more North African instrumentation, a one chord rhythm with strong percussion, and strong vocals from Plant and the backing singers.\n&quot;Since I've Been Loving You&quot; seems kind of out of place as the only blues number on the disk, but Page's soloing is crisp and Plant shows some howl. Strings on the blues?\n&quot;The Battle of Evermore&quot; is one of the standout tracks, with the instrumental backing, mandolins and outstanding female duet with Plant.\n&quot;Wonderful One&quot; is ballad where Plant and Page weave their magic of vocals and guitars.\n&quot;That's the Way&quot; is one of my all time favorite songs, and this version does not disappoint. Guitars and banjos and some of the most heartfelt lyrics Page and Plant ever wrote.\n&quot;Gallows Pole&quot; is a great acoustic number from LZIII that gets a nice treatment here, especially when it picks up tempo and the other instruments join in.\n&quot;Four Sticks&quot; also stands out in this set. It's one of the more obscure tunes from LZIV, but the rapidly strummed guitars, strings and especially the percussion make this an outstanding performance.\n&quot;Kashmir&quot; fits the organic, exotic theme of this set perfectly, and while Bonham's physical presence is missed, he's there in spirit. The orchestra playing is excellent, and there are some nice surprises. \n\nby Jack Fitzgerald &quot;JFD&quot;\n\nTRACKLIST:\n\n01 - Nobody's Fault But Mine.wma                                                \n02 - Thank You.wma                                                              \n03 - No Quarter.wma                                                             \n04 - Friends.wma                                                                \n05 - Yallah.wma                                                                 \n06 - City Don't Cry.wma                                                         \n07 - Since I've Been Loving You.wma                                             \n08 - The Battle Of Evermore.wma                                                 \n09 - Wonderful One.wma                                                          \n10 - Wah Wah.wma                                                                \n11 - That's The Way.wma                                                         \n12 - Gallows Pole.wma                                                           \n13 - Four Sticks.wma                                                            \n14 - Kashmir.wma       \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:5d89eda9ad67fa7c574190cefdbc494869efaa1f","amp;dn":"Jimmy+Page+%26+Robert+Plant+-+No+Quarter+%281994%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d89eda9ad67fa7c574190cefdbc494869efaa1f","infoHashBuffer":{"type":"Buffer","data":[93,137,237,169,173,103,250,124,87,65,144,206,253,188,73,72,105,239,170,31]},"announce":[],"urlList":[]}}