{"title":"LiveCode Mobile Development - Second Edition - Colin Holgate","uid":11982769,"size":5318748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6000493d3fcb663685808e62e81863b1fad69672&amp;dn=LiveCode+Mobile+Development+-+Second+Edition+-+Colin+Holgate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433265287,"description":"Create interactive mobile apps for Android and iOS with LiveCode\n\nAbout This Book\n\nCreate fun, interactive apps with the rich media features of LiveCode\nDive headfirst into mobile application development through explanations enriched with ample screenshots\nLearn to create apps and interfaces using the step-by-step instructions\nWho This Book Is For\n\nThe ideal reader for this book would be someone who already knows LiveCode, is interested in creating mobile apps, and wants to save the many hours it took for me to track down all of the information on how to get started! Chapter 1, LiveCode Fundamentals, will help those of you who know programming but are not familiar with LiveCode. The knowledge you've acquired should be enough for you to benefit from the remainder of the book.\n\nIn Detail\n\nLiveCode is a tool for developing mobile apps designed for users who don't want to use Objective-C, C++, or Java. LiveCode Mobile Development Beginner's Guide, Second Edition will explain how to create apps and upload them to the app stores with minimal effort.\n\nYou will begin with a simple calculator application and quickly enhance it using LiveCode Mobile. You will also learn about the interface controls for videos and images of LiveCode's environment. You'll go on digging into configuring devices and making rich media applications, and then finish by uploading your mobile applications to app stores. You will learn how to build apps for iPhone and Android devices with LiveCode Mobile through sample applications of increasing complexity","torrent":{"xt":"urn:btih:6000493d3fcb663685808e62e81863b1fad69672","amp;dn":"LiveCode+Mobile+Development+-+Second+Edition+-+Colin+Holgate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6000493d3fcb663685808e62e81863b1fad69672","infoHashBuffer":{"type":"Buffer","data":[96,0,73,61,63,203,102,54,133,128,142,98,232,24,99,177,250,214,150,114]},"announce":[],"urlList":[]}}