{"title":"State-Sponsored Terrorism, Crimes, Lies-Collection 30 (Russia 6)","uid":12885424,"size":191762731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6006d40ee52569e55de494df2e2c68ede51cef1e&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+Lies-Collection+30+%28Russia+6%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":28,"time":1449058155,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 30 (Russia 6):\r\n\r\nWe have 28 titles here.  One title that deserves a special mention is: &quot;Winter Is Coming; Why Vladimir Putin and the Enemies of the Free World Must Be Stopped (2015)&quot;, written by Gary Kasparov, the previous chess world champion. It is a must-read.\r\nIncluded also is the WADA report that exposed the wide-use of performance enhancing drugs among Russian athletes.\r\n\r\n-  Applebaum - Iron Curtain; the Crushing of Eastern Europe, 1945-1956 (2012)\r\n\r\n-  Balmaceda (Ed.) - On the Edge; Ukrainian-Central European-Russian Security Triangle (2000)\r\n\r\n-  Cordovez &amp; Harrison - Out of Afghanistan; the Inside Story of the Soviet Withdrawal (1995)\r\n\r\n-  Edwards - The Winter War; Russia's Invasion of Finland, 1939-40 (2008)\r\n\r\n-  Eliacson et al (Eds.) - After the Soviet Empire; Legacies and Pathways (2016)\r\n\r\n-  Fortescue (Ed.) - Russian Politics from Lenin to Putin (2010)\r\n\r\n-  Friedman - Red Mafiya; How the Russian Mob Has Invaded America (2000)\r\n\r\n-  Hemment - Youth Politics in Putin's Russia; Producing Patriots and Entrepreneurs (2015)\r\n\r\n-  Jack - Inside Putin's Russia (2004)\r\n\r\n-  Kasparov - Winter Is Coming; Why Vladimir Putin and the Enemies of the Free World Must Be Stopped (2015)\r\n\r\n-  Katz - Ukraine and the Future of NATO, AlJazeera Centre for Studies (Sept 2015)\r\n\r\n-  Kufenko - Economic Growth and Inequality; Empirical Analysis for the Russian Regions (2015)\r\n\r\n-  Leitenberg &amp; Zilinskas - The Soviet Biological Weapons Program; a History (2012)\r\n\r\n-  Lieven - Chechnya; Tombstone of Russian Power (1998)\r\n\r\n-  Lovell - Destination in Doubt; Russia since 1989 (2006)\r\n\r\n-  Lynch - Russian Peacekeeping Strategies in the CIS; the Cases of Moldova, Georgia and Tajikistan (2000)\r\n\r\n-  Mole - I Was a Potato Oligarch; Travels &amp; Travails in the New Russia (2008)\r\n\r\n-  Myers - The New Tsar; the Rise and Reign of Vladimir Putin (2015)\r\n\r\n-  Ostrovsky - The Invention of Russia; the Journey from Gorbachev's Freedom to Putin's War (2015)\r\n\r\n-  Pipes - Russia Under the Old Regime (1974)\r\n\r\n-  Popova - Politicized Justice in Emerging Democracies; a Study of Courts in Russia and Ukraine (2012)\r\n\r\n-  Pound et al - The Independent Commission, Final Report; WADA Investigations (Nov. 2015)\r\n\r\n-  Rawlinson - From Fear to Fraternity; a Russian Tale of Crime, Economy and Modernity (2010)\r\n\r\n-  Saikal &amp; Maley (Eds.) - The Soviet Withdrawal from Afghanistan (1989)\r\n\r\n-  Schaefer - The Insurgency in Chechnya and the North Caucasus; From Gazavat to Jihad (2010)\r\n\r\n-  Shabaneh - Putin's Moment in the Middle East, AlJazeerah Centre for Studies (Oct 2015)\r\n\r\n-  Soldatov &amp; Borogan - The New Nobility; the Restoration of Russia's Security State and the Enduring Legacy of the KGB (2010)\r\n\r\n-  Tobien - Dancing Under the Red Star; the Extraordinary Story of Margaret Werner, the Only American Woman to Survive Stalin's Gulag (2006)","torrent":{"xt":"urn:btih:6006d40ee52569e55de494df2e2c68ede51cef1e","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+Lies-Collection+30+%28Russia+6%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6006d40ee52569e55de494df2e2c68ede51cef1e","infoHashBuffer":{"type":"Buffer","data":[96,6,212,14,229,37,105,229,93,228,148,223,46,44,104,237,229,28,239,30]},"announce":[],"urlList":[]}}