{"title":"DiskView Professional v2007 + serial (working good)","uid":3824045,"size":3176328,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:60b18f2e583af2e76e9dd4b81561f397c6f16a55&amp;dn=DiskView+Professional+v2007+%2B+serial+%28working+good%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mikemoo","files":1,"time":1191099142,"description":"DiskView is an innovative disk space manager that shows how your disk space is being utilized, and gives a visual report of your hard disk&amp;#039;s health - all within Windows Explorer!\n\nDiskView uses a combination of color, shape, size, texture and transparency to represent various attributes of the file-system - hidden files and folders are transparent, newer are bright, system files have distinctive patterns, fragmented files are shown with a fragmented pattern and file-system attributes are depicted with icons. With one glance, you can see which files and folders are taking up the most disk-space, and gain an intimate understanding of how disk space is distributed on your computer.\n\nWith DiskView, you can manage your disk space wisely, and organize your files and folders without stepping out of Windows Explorer. DiskView helps you find big files at a glance, and visually shows how disk space is organized - not only on your computer, but also on network shares and mapped network drives. Using the hard disk&amp;#039;s Self Monitoring Reporting and Analysis Technology(S.M.A.R.T) capabilities, DiskView gives a visual indication of disk health, it&amp;#039;s current operating temperature and even predict disk failure in time for you to create backups.\n\n-----------------------------------------------------------------------------------\n\n\nscreenshot:\n\nThis thing works pretty well, i like it a bit better then spacemonger\n\ndont forget guys, sharing is caring - seed the fuck out of it ","torrent":{"xt":"urn:btih:60b18f2e583af2e76e9dd4b81561f397c6f16a55","amp;dn":"DiskView+Professional+v2007+%2B+serial+%28working+good%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b18f2e583af2e76e9dd4b81561f397c6f16a55","infoHashBuffer":{"type":"Buffer","data":[96,177,143,46,88,58,242,231,110,157,212,184,21,97,243,151,198,241,106,85]},"announce":[],"urlList":[]}}