{"title":"Death Traps","uid":4758189,"size":6186046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62a87274dc820cf2b5834d7aa7583db89f72bb74&amp;dn=Death+Traps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"philmccrevice","files":1,"time":1236564891,"description":"Without a doubt, this is one of the finest WWII memoirs ever written by an American junior officer. Lieutenant Cooper served with the 3rd Armored Division's Maintenance Battalion and saw action from Normandy to Germany in 1944-1945. One of the army's two heavy armored divisions, the 3rd lost 648 M4 Shermans and had another 700 tanks damaged, repaired and put back in service by the time the shooting ended in May 1945. Cooper, as one of the division's three ordnance liaison officers, was in the midst of the division's tank recovery operations. He writes about the tenacity of the maintenance mechanics and their ability to improvise and devise their own policies. Cooper is unsparing in his criticism of George S. Patton and other generals whose belief in mobility over heavy armor kept the Sherman medium tank as the standard. American tank crews quickly learned that these &quot;death traps&quot; were no match for heavier German tanks such as the Panther and King Tiger. Cooper describes the difficult maneuvering in the hedgerow country, the confusion of the Battle of the Bulge, the liberation of Nordhausen concentration camp and the destruction of an entire column of tanks and other vehicles. Cooper demonstrates convincingly that it was the unheralded work of the maintenance section that allowed the 3rd Armored Division to maintain its combat effectiveness. This detailed story will become a classic of WWII history and required reading for anyone interested in armored warfare. Photos not seen by PW. \nCopyright 1998 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. \n\nFrom School Library Journal\nYA-In a down-to-earth style, Death Traps tells the compelling story of one man's assignment to the famous 3rd Armored Division that spearheaded the American advance from Normandy into Germany. Cooper served as an ordinance officer with the forward elements and was responsible for coordinating the recovery and repair of damaged American tanks. This was a dangerous job that often required him to travel alone through enemy territory, and the author modestly recalls his service with pride, downplaying his role in the vast effort that kept the American forces well equipped and supplied. Readers will not gain any great insights on the causes of the war or the reasons why a campaign went the way it did; however, they will be left with an indelible impression of the importance of the support troops and how dependent combat forces were on them.\n","torrent":{"xt":"urn:btih:62a87274dc820cf2b5834d7aa7583db89f72bb74","amp;dn":"Death+Traps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a87274dc820cf2b5834d7aa7583db89f72bb74","infoHashBuffer":{"type":"Buffer","data":[98,168,114,116,220,130,12,242,181,131,77,122,167,88,61,184,159,114,187,116]},"announce":[],"urlList":[]}}