{"title":"Grigg-America's Engineered Decline(FTTA as globalist trap)(20","uid":4615855,"size":2459635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62f7e2f924a4ce911f48c3cd03c87a9b0d4ed19e&amp;dn=Grigg-America%5C%27s+Engineered+Decline%28FTTA+as+globalist+trap%29%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"red_gonzo","files":1,"time":1230835461,"description":"This is William Norman Grigg's shocking book America's Engineered Decline (2004) which exposes the globalist agenda of Free Trade Area of the Americas (FTAA) that promises prosperity through free trade but is instead bringing disaster to Americans as millions are loosing their jobs and forced to live in misery. Is America's middle class doomed? For centuries, America's thriving middle class was the foundation of our liberties and the envy of the world. But now an increasing number of debt-ridden Americans find themselves joining the &quot;race to the bottom&quot;. Across the nation, communities are reeling as manufacturing and hi-tech jobs are &quot;outsourced&quot; abroad. And even as the nation exports jobs that once opened the door to the middle class, America is importing waves of unskilled immigrants, including millions of illegals. No longer America's protector, its political elite schemes to merge the country into a continent-spanning socialist mega-state modeled after the European Union. America's Engineered Decline reveals the common threads binding these developments together into a revolutionary agenda that may bring doom to America. But, as the author points out, that subversive agenda can be defeated - if enough Americans will join in organized and principled action. Find out how FTAA lowers the living standards of all Americans to meet that of the least fortunate in the hemisphere and as everyone knows - once you are as low as them, there is no return whatsoever. 170 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:62f7e2f924a4ce911f48c3cd03c87a9b0d4ed19e","amp;dn":"Grigg-America%5C%27s+Engineered+Decline%28FTTA+as+globalist+trap%29%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f7e2f924a4ce911f48c3cd03c87a9b0d4ed19e","infoHashBuffer":{"type":"Buffer","data":[98,247,226,249,36,164,206,145,31,72,195,205,3,200,122,155,13,78,209,158]},"announce":[],"urlList":[]}}