{"title":"[1985] Back to Basics Reform - Or... OBE Skinnerian Internationa","uid":9434799,"size":191541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63c440cdc790e517dac7925b72ec7274db7b4871&amp;dn=%5B1985%5D+Back+to+Basics+Reform+-+Or...+OBE+Skinnerian+Internationa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seering","files":1,"time":1388881731,"description":"Back to Basics Reform Or...OBE *Skinnerian International Curriculum? (paperback, 48 pages) by renowned author and education expert Charlotte Iserbyt enables the reader to understand the long-planned controversial restructuring of education from traditional academics to socialist workforce training. This transition was necessary for the planned global economy and for the United States participation in a one-world government; a plan that was finalized between 1980 and the present time. Back to Basics Reform Or... lets the reader peek into the U.S. Department of Education during the early eighties, when and where the author worked as a Senior Policy Adviser, with access to confidential planning. The author was fired for leaking a very important document to the press. However, since she knew she would get fired for doing so, she managed to remove all the incriminating documents from her office prior to leaking the one most important document. Much of the information gleaned from these purloined documents is found in Back to Basics Reform Or...OBE *Skinnerian International Curriculum?. The book contained such important information it was originally banned by the establishment. Nationwide distribution of this little booklet could have resulted in the abolition of the unconstitutional U.S. Department of Education, something President Reagan had promised the American people during his campaign. This would, of course, have stopped the controversial education restructuring we see today. However, that was not to be since the major conservative organizations in our country, now referred to as neoconservatives, successfully boycotted the booklet, and, it is unlikely that more than a few elected officials ever had the opportunity to read it and act upon its recommendations.","torrent":{"xt":"urn:btih:63c440cdc790e517dac7925b72ec7274db7b4871","amp;dn":"%5B1985%5D+Back+to+Basics+Reform+-+Or...+OBE+Skinnerian+Internationa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c440cdc790e517dac7925b72ec7274db7b4871","infoHashBuffer":{"type":"Buffer","data":[99,196,64,205,199,144,229,23,218,199,146,91,114,236,114,116,219,123,72,113]},"announce":[],"urlList":[]}}