{"title":"WinRAR x64 (64 bit) v3.92 Final + KeyReg [ChattChitto RG]","uid":5366192,"size":5267854,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63d2a91d81a3f2418f7e726da1161052a91f2b45&amp;dn=WinRAR+x64+%2864+bit%29+v3.92+Final+%2B+KeyReg+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1266270375,"description":"WinRAR x64 (64 bit) v3.92 Final + KeyReg [Requested]\n\n.exe File Format (Setup File - KeyReg - Instructions)\n\n***********************************************************************************\n\nWinRAR x64 (64 bit) v3.92 Final\n\nHomepage: http://www.rarlab.com/rar_archiver.htm\n\n\nWinRAR benefits:\n==================\n-Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n-WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n-WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n-When you purchase WinRAR license you are buying a license to the complete technology, no need to purchase add-ons to create self-extracting files, it's all included. One price, one payment, once.\n-You also receive the benefit of a life-time use of the WinRAR archiver. No upgrade fee to pay. When a new release is made, simply download and install, your license is valid for life.\n-WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n-WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n-WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n-WinRAR offers the ability to create selfextracting and multivolume archives.\n-Recovery record and recovery volumes allow to reconstruct even physically damaged archives.\n-WinRAR features are constantly being developed to keep WinRAR ahead of the pack.\n\n\nWinRAR - What's new in the latest version:\n===========================================\n\n\nVersion 3.92:\n--------------\n\n1. If you start WinRAR command from Explorer context menu in multiple\n   monitor configuration, the command dialog will be displayed\n   on the same monitor as context menu. In previous versions it was\n   always displayed on primary monitor.\n\n2. WinRAR &quot;Compress and email...&quot; context menu command adds the archive\n   name to email subject. Previous versions left the subject blank.\n\n3. In RAR 3.91 -x switch could also exclude folders from archiving\n   even if mask contained wilcard characters and did not contain a path.\n   For example, -x*. excluded all those folders, which do not have\n   the extension in the name. Now -x switch uses RAR 3.80 approach\n   for masks without path, excluding folders only if mask does not\n   contain wildcards and matches the folder name exactly.\n\n4. Bugs fixed:\n\n   a) WinRAR 3.91 reported the incorrect &quot;Unexpected end of archive&quot;\n      error, when opening an empty ZIP archive created with\n      &quot;New WinRAR ZIP archive&quot; context menu command;\n\n   b) if &quot;Delete archive&quot; option was enabled when unpacking several\n      ZIP archives and if one of archives was damaged, WinRAR did not\n      delete archives after the damaged one, even if they were unpacked\n      successfully;\n\n   c) if file matched two different masks in RarFiles.lst, WinRAR\n      could select the last match. Normally, if neither of masks\n      is a subset of another, the first match must be chosen.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n\n[Please Leave A Comment Confirming This Pack]\n\n-----------------------------------------------------------------------------------\n\nFor Torrent Request:\n[Put The Request Name In The SUBJECT Box &amp; Also Provide It's Webpage, Or Your Request Will Be Ignored Automatically]","torrent":{"xt":"urn:btih:63d2a91d81a3f2418f7e726da1161052a91f2b45","amp;dn":"WinRAR+x64+%2864+bit%29+v3.92+Final+%2B+KeyReg+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d2a91d81a3f2418f7e726da1161052a91f2b45","infoHashBuffer":{"type":"Buffer","data":[99,210,169,29,129,163,242,65,143,126,114,109,161,22,16,82,169,31,43,69]},"announce":[],"urlList":[]}}