{"title":"The Anthony Cumia Show 2014-11-06 MP4 MP3 combo","uid":11398828,"size":321774664,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:640e618728ef6fe13a91a0f67367723c1858ee32&amp;dn=The+Anthony+Cumia+Show+2014-11-06+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":-1,"time":1415399563,"description":"Episode 055: Ant starts the show by discussing the latest crew addition Stinky and his humble beginnings. We get an update on the Artie Lange fake outrage situation, and here Tom Brokaw discuss own his slave fantasies. Ant checks out a &quot;Shy Bladder&quot; website and tries to decide whether or not it's real. Next he talks technology acceleration including watching some &quot;drone porn&quot; footage. We take a call from comedian Jo Koy and he talks about the hard work it took to work his way up the comedy ladder. Ant (unfortunately) take some phone calls, then discusses his upcoming event at Mohegan Sun in Connecticut. We hear a story about a 4CHAN user who posted a picture of his girlfriend's body after he strangled her then surrendered to police. Ramping up the dirtiness we run through the many acceptable positions for ass sex; watch some insertion videos, and a McDonald's brawl / ninja footage that must be seen to believe. Finishing up we watch a clip from Australia of someone stealing a car; a clip fron Jersey of a sobriety checkpoint, and news footage with GTA-like action going on.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:640e618728ef6fe13a91a0f67367723c1858ee32","amp;dn":"The+Anthony+Cumia+Show+2014-11-06+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"640e618728ef6fe13a91a0f67367723c1858ee32","infoHashBuffer":{"type":"Buffer","data":[100,14,97,135,40,239,111,225,58,145,160,246,115,103,114,60,24,88,238,50]},"announce":[],"urlList":[]}}