{"title":"DeskSoft FastFolders 5.3.0 + crack","uid":12198321,"size":1615903,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64992e29a15361410ae8075db40cfdeafe68604a&amp;dn=DeskSoft+FastFolders+5.3.0+%2B+crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"movieZ.freak","files":4,"time":1438784583,"description":"This system extension increases your productivity dramatically by giving you quick and easy access to folder contents and files. Without opening each and every folder, you can browse the directory structure starting at any point by clicking the right mouse button on a file, folder or drive. The program adds a menu item to the context menus of shell objects, which displays the directory structure on demand. If you drag and drop an object on a folder or drive using the right mouse button, you can copy or move the object(s) to any folder of your computer by selecting it from the FastFolders menu. FastFolders can also show the total size of folders including their subfolders and files. This is extremely useful for getting an overview of the distribution of your files and the disk space they occupy.\n\nKey Features:\n--------------------\n\n- Modifies the context menu of folders and files, adding a menu item which displays the directory structure on demand\n- All shell objects can be browsed (including My Computer, Control Panel, Network Neighborhood, etc.)\n- Right-button Drag &amp; Drop: If you drag and drop an object on a folder or drive using the right mouse button, you can copy or move the object(s) to any folder of your computer by selecting it from the FastFolders menu\n- Large directories can be split up into multiple columns for easy access\n- In addition to folders, any file types can be included in the directory structure, to give you fast access to these files\n- Adjustable menu speed and many other options to customize the product\n- Adds a column to the &quot;Details&quot; view of Explorer windows, which shows the total size of folders (Windows ME, 2000, XP or higher)\n- Pressing &quot;S&quot; or the middle mouse button display the item sizes (including subitems), &quot;U&quot; switches display units\n- Pressing &quot;C&quot; on an item will copy a list of contents of this item to the clipboard (like a directory listing). &quot;SHIFT+C&quot; includes the complete path information\n- Pressing &quot;CTRL&quot; when clicking a FastFolders item keeps the FastFolders menu open\n- Pressing &quot;SHIFT&quot; when clicking a FastFolders item will open it in an explorer instead of a normal window\n- Now with Windows 10 support!\n-----------------------------------------------------------------------------------\n\nSystem requirements: Supported operating systems (32 and 64 bit):\n\nWindows XP\nWindows Vista\nWindows 7\nWindows 8\nWindows 10\nWindows Home Server\nWindows Server 2003\nWindows Server 2008\nWindows Server 2012\n\n--------------------------------------------------------------\n\n- Install Fast Folders.\n- After installation (do not reboot)\n- Copy precracked exe and license file from crack folder into Fast Folders installed folder making sure to overwrite the existing file.\n- Reboot your pc if you want to activate extension.\n- After reboot scroll through 'start menu' or whatever 'software menu' you have.\n- Enjoy.\n &lt;a href=&quot;\nhttp://someimage.com/t66X639&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://someimage.com/t66X639&lt;/a&gt;","torrent":{"xt":"urn:btih:64992e29a15361410ae8075db40cfdeafe68604a","amp;dn":"DeskSoft+FastFolders+5.3.0+%2B+crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64992e29a15361410ae8075db40cfdeafe68604a","infoHashBuffer":{"type":"Buffer","data":[100,153,46,41,161,83,97,65,10,232,7,93,180,12,253,234,254,104,96,74]},"announce":[],"urlList":[]}}