{"title":"iPod USB Driver for Windows 98","uid":3812015,"size":126593,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64d8f83032b402aa91c9510025ef64218b042c46&amp;dn=iPod+USB+Driver+for+Windows+98&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ethan420","files":2,"time":1190217290,"description":"Apple iPod is the greatest MP3 player. It offers quality sound, ease of use, and doubles as a mobile hard disk drive - USB and FireWire.\n\nEverything is easy for Windows 2000 and Windows XP - iPod comes with proper drivers which makes it fully functional, but without them you can still use iPod as a removable disk drive.\n\nProblem starts with Windows 98 and Windows 98 SE - iPod can be used only as FireWire device. No USB support.\n\nThe developer modified the Microsoft driver for USB Mass Storage Drive, added some keys into .inf file and that was it! iPod download for windows 98 is ready.\n\nThe driver has been tested with following devices:\n\n* 2G iPod Shuffle (&quot;the clip&quot;) NEW!\n* 2G iPod Nano (the one with a metal case)\n* 5G iPod (&quot;with video&quot;)\n* iPod Nano\n* iPod Shuffle\n* 4G iPod (&quot;with ClickWheel&quot;)\n* iPod Mini\n* 3G iPod\n\nSetup\n1. Open win98-iPod-PSP-v25-847836.exe\n2. Unpack it. win98-iPod-PSP directory will be created\n3. Connect iPod to your computer. If nothing happens check your cabling or reboot\n4. When prompted, select &quot;Search for updated driver (recommended)&quot;\n5. Check &quot;Specific location&quot; and uncheck remaining checkboxes\n6. Select location you have unpacked driver\n7. Wait for a while. Now you should have additional drive visible on your system.\n8. Before unplugging iPod you should always eject it. To do that, double-click My Computer icon, right-click iPod disk drive and select Eject on pulldown menu.\n\nUploading Music\n\nUnfortunately, you cannot use Windows 98 with Apple iTunes software, but there are alternatives:\n\n* YamiPod - simple and multiplatform.\n* Winamp with iPod Plugin - supports Shuffle! (Remark: Winamp 5.22 has iPod support built-in, but it seems to be incompatible with Windows 98 - do not enable it during installation!\n* RealPlayer v. 10.5 and newer. Free version is OK.\n* SharePod - a great program for downloading mp3 back from iPod to other computer\n* EphPod - doesn&amp;#039;t work with 5th generation iPods (those with video)!\n* vPod (old versions)\n\nImportant Remarks\n\nRegarding iPod Shuffle\n\nIf you need to initialize your iPod Shuffle and you cannot use iTunes - now you can use iPod shuffle Database Builder: http://shuffle-db.sourceforge.net/.\n\nRegarding all iPods\n\nIf your iPod was never used before you can get &quot;Drive not formatted&quot; message. Don&amp;#039;t try formatting iPod with Windows tools! To format iPod correctly you have to use Apple iPod Updater software. This software works only under Windows 2000 or Windows XP.\nSo you&amp;#039;ll have to find some Windows 2000/XP machine, install software from CD you got with your iPod (or download it from here:and Update (or Restore) your iPod.\nAfter that you can uninstall software and enjoy iPod under Windows 98.\n\nAbove information suits Windows 98 and Windows 98 SE. If you have Windows ME, there&amp;#039;s a page devoted to using iPod: Guide to iPod and Windows ME\n\nIf you are happy with this driver, feel free to donate: http://www.98-drivers.com/ipod.html ","torrent":{"xt":"urn:btih:64d8f83032b402aa91c9510025ef64218b042c46","amp;dn":"iPod+USB+Driver+for+Windows+98","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64d8f83032b402aa91c9510025ef64218b042c46","infoHashBuffer":{"type":"Buffer","data":[100,216,248,48,50,180,2,170,145,201,81,0,37,239,100,33,139,4,44,70]},"announce":[],"urlList":[]}}