{"title":"BangBus - Noel XXX 480p 05.12.2001","uid":11264174,"size":726640321,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:64f3bedc12e2f8fe081b2905830c8812a126deb3&amp;dn=BangBus+-+Noel+XXX+480p+05.12.2001+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"christian2353","files":1,"time":1414002941,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/DacnKaAgD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DacnKaAgD&lt;/a&gt;\n\n\n\n\nWell we hooked up with an old buddy of mine named Cat Collins he's into photography and movies music all that *censored*so he called ugly and I and we were happy to take him out to do a round with us. As we drove around ugly spotted this really wholesome white girl out of the cornner of his eye and so the game began, But when we pulled up I was about to say something and she yelled at us &quot;get the fuck away from me&quot; and to be honest it kinda scared me..... Yea right anyway I tried again and again to have a conversation with her while Cat in the back is saying &quot;lets get out of here leave her alone lets get out of here&quot; Now all that did was push me farther to commit to getting this girl to go with us. Because aparently she had just had a huge fight with her boyfriend and she was kicked out of the house with just the cloths on her back. And I really dont think that she could have done something so horrible that Noel deserved that shit..You hear me jason you pussy ass dumb fuck .Anyway with a little money the promise of a ride to her aunts house and a lot of tenderness shown to Noel she got in and really had a big fucken chip on her schoulder... Well my attiude is you can be angry to the world but dont smack a bull in the face if he's being nice to you or he'll just straight run you fuckin down and thats exactly what she did again and again with the DIRTY one and I dont take that bullshit not from anyone so we explaned to Noel that this was just the begining of her therapy to get over that scum bag Jason You know who you are jerk ass.. And at first she didn't want that but after veiwing the menu of options she got the point and we got a fat load blow on her tricky face","torrent":{"xt":"urn:btih:64f3bedc12e2f8fe081b2905830c8812a126deb3","amp;dn":"BangBus+-+Noel+XXX+480p+05.12.2001+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f3bedc12e2f8fe081b2905830c8812a126deb3","infoHashBuffer":{"type":"Buffer","data":[100,243,190,220,18,226,248,254,8,27,41,5,131,12,136,18,161,38,222,179]},"announce":[],"urlList":[]}}