{"title":"Crime School (1938) Xvid 1cd - Dead End Kids, Humphery Bogart [D","uid":11201459,"size":765555318,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:655ea06eb440595de216f6d91d99dec2c6a29868&amp;dn=Crime+School+%281938%29+Xvid+1cd+-+Dead+End+Kids%2C+Humphery+Bogart+%5BD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1413172628,"description":"Crime School (1938) Xvid 1cd - Dead End Kids, Humphery Bogart [DDR]\n\nCrime School is a 1938 Warner Bros. film directed by Lewis Seiler and starring the Dead End Kids and Humphrey Bogart.\n\n    CAST:- The Dead End Kids\n    Billy Halop as Frankie Warren\n    Bobby Jordan as Lester &quot;Squirt&quot; Smith\n    Huntz Hall as Richard &quot;Goofy&quot; Slade\n    Leo Gorcey as Charles &quot;Spike&quot; Hawkins\n    Bernard Punsly as George &quot;Fats&quot; Papadopolos\n    Gabriel Dell as Timothy &quot;Bugs&quot; Burke\n    Humphrey Bogart as Mark Braden\n    Gale Page as Sue Warren\n    George Offerman, Jr. as Red\n    Weldon Heyburn as Cooper\n    Cy Kendall as Morgan\n    Charles Throwbridge as Judge Clinton\n\nDirected by Lewis Seiler\nProduced by Bryan Foy\nWritten by Crane Wilbur\nMusic by Max Steiner\nRunning time 86 min.\n \nMOVIE PLOT:- Crime School (1938)\nA junkman (Frank Otto) does business with the Dead End Kids: Frankie (Billy Halop), Squirt (Bobby Jordan), Spike (Leo Gorcey), Goofy (Huntz Hall), Fats (Bernard Punsly), and Bugs (Gabriel Dell). When the boys ask for a $20 payoff, &quot;Junkie&quot; says &quot;Five is all you'll get. Now take it and get out of here.&quot; In a rage, Spike strikes the man in the back of the head with a hard object, and the junkman falls to the floor and doesn't move. When Judge Clinton (Charles Trowbridge) cannot convince the boys to divulge which one struck the damaging blow, they are all sent to reform school.\n\nThe superintendent of the state reformatories, Mark Braden (Humphrey Bogart), visits the school and finds that it is being mismanaged. As a way of starting over, he fires Morgan (Cy Kendall), the cruel warden, and four ex-convict guards, while retaining the head guard, Cooper (Weldon Heyburn). Braden runs the school himself and attempts to parole the kids, while romancing Frankie's sister, Sue Warren (Gale Page).\n\nMeanwhile, Cooper is afraid that Braden will learn of Morgan's illegal use of the food budget, which would implicate him as well. He learns that Spike is the one who dealt the blow to the junkman and blackmails him. He gets him to tell Frankie that Braden is forcing Sue to pay for the special treatment the boys have received. Although untrue, it causes the kids to escape from the school.\n\nOn the outside, they confront Braden and learn the truth. Cooper &quot;discovers&quot; that the kids have escaped and Morgan calls the press to discredit Braden and get him fired. Once the kids are back at the school and the police arrive, Braden delivers evidence about Morgan's fraud, and Morgan is arrested.\nBackground\n\n    As this was a Warner Bros. film and not a United Artists' film like Dead End, they advertised the kids as 'The Crime School Kids' in this film, and their next, Angels with Dirty Faces. However, the name did not catch on and they remained 'The Dead End Kids'.\n    Before the film was released, Halop, Dell, Hall, and Punsly were released from their contracts by Warner Brothers and they went on to make a film at Universal, Little Tough Guy. The success of this film caused Warner to reconsider and they were rehired at a substantial raise.\n    The Dead End Kids received top billing over Humphrey Bogart for Crime School, with their typeface also larger than Bogart's in posters and advertising.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 952 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 86 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:655ea06eb440595de216f6d91d99dec2c6a29868","amp;dn":"Crime+School+%281938%29+Xvid+1cd+-+Dead+End+Kids%2C+Humphery+Bogart+%5BD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"655ea06eb440595de216f6d91d99dec2c6a29868","infoHashBuffer":{"type":"Buffer","data":[101,94,160,110,180,64,89,93,226,22,246,217,29,153,222,194,198,162,152,104]},"announce":[],"urlList":[]}}