{"title":"Going to War-Creating Computer War Games[bigbluesea]","uid":6604977,"size":8625275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:666e6bb265c64a0e3dd2a23c4c8f93b4cec15592&amp;dn=Going+to+War-Creating+Computer+War+Games%5Bbigbluesea%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1313362083,"description":"Do you want to learn how to create computer war games, but don't know how to get started or don't have any experience with game programming? &quot;Going to War: Creating Computer War Games&quot; shows you how to use the drag-and-drop game engine, Multimedia Fusion 2, to make your very own computer war games to play and share. After an introduction to the Multimedia Fusion 2 interface and the basics of how to use it, you'll get started on the game that you'll create throughout the course of the book. You'll begin by making your game map, using a system of hexagon tiles to create the terrain and the different units you want to include in your game such as soldiers and tanks. Then you'll learn how to set rules for player movement, different types of terrain, and combat. You'll even find more advanced techniques such as how to implement officers, fortifications, and even a simple monetary system in your games. The book even discusses how to track and find bugs in your games and how to create an editor that allows you to easily apply data you've already created to new games. Everything you need to build your own war games is included with the book, and by the time you've worked your way through it you'll have designed your very own working and playable war game. \n\n\n\n\n\n                               *****Please Seed*****\n\n                                *****Thank You*****","torrent":{"xt":"urn:btih:666e6bb265c64a0e3dd2a23c4c8f93b4cec15592","amp;dn":"Going+to+War-Creating+Computer+War+Games%5Bbigbluesea%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"666e6bb265c64a0e3dd2a23c4c8f93b4cec15592","infoHashBuffer":{"type":"Buffer","data":[102,110,107,178,101,198,74,14,61,210,162,60,76,143,147,180,206,193,85,146]},"announce":[],"urlList":[]}}