{"title":"Lone Survivor 2013 BRRip DVDr [ nordic+bonus]","uid":10166708,"size":6565771264,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:667137ed445c8df76510243cb94afcde5831d519&amp;dn=Lone+Survivor+2013+BRRip+DVDr+%5B+nordic%2Bbonus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"headcedon7","files":-1,"time":1400349011,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1091191/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1091191/&lt;/a&gt;\n\n\n\nMOVIE:\naudio ]  DD5.1ï¼š   English  \n\n[sub ] ï¼š NORSK , SVENSKA , SUOMI , ENGLISH , chinese\n\n\n\nBonus (71mins):\n\n     Blu-ray Exclusive Bonus Content\n\n        -Will of the Warrior: An in-depth look at Marcus Luttrell, the real-life Navy SEAL who received the Navy Cross and Purple Heart for his actions in Operation Red Wings.\n\n        -Recreating the Firefight: Reveals how Lone Survivor's action-packed stunts were choreographed and shot. This featurette includes interviews with Director Peter Berg, Actors Mark Wahlberg, Taylor Kitsch, Ben Foster and Emile Hirsch and stunt coordinator and 2nd unit director Kevin Scott.\n\n        -Learning the Basics: Watch as Mark Wahlberg, Emile Hirsch, Taylor Kitsch and Ben Foster go through rigorous SEAL training in weapons handling, communication/patrolling and simulated attack drills. Along with Marcus Luttrell, Peter Berg enlisted the help of active Navy SEALS to help the actors accurately portray the fallen soldiers of Operation Red Wings.\n\n        -The Pashtun Code of Life: Learn why Marcus Luttrell's rescuer, Mohammad Gulab, risked his life and the lives of everyone in his village in order to save Marcus.\n\n        -Bringing the Story to Light: Marcus Luttrell's story of survival under extremely dire circumstances is an inspiration to anyone who hears it. Director, producer and writer Peter Berg, Producer Sarah Aubrey, and the four lead actors (Mark Wahlberg, Emile Hirsch, Taylor Kitsch and Ben Foster) reveal their passion for the project and why it was so important to them to tell this story.\n\n        -The Fallen Heroes of Operation Red Wings: Mark Wahlberg, Taylor Kitsch, Ben Foster and Emile Hirsch profile the real-life heroes who inspired their characters: Marcus Luttrell, Michael Murphy, Daniel Dietz and Matthew Axelson. Family members provide intimate accounts of what these brave men were like in their private lives, as well as perspective on their decisions to join the military and make the ultimate sacrifice for their country. Also included is a tribute to the team of Operation Red Wings, using personal photos. \n\naudio : english\nSUB : NONE","torrent":{"xt":"urn:btih:667137ed445c8df76510243cb94afcde5831d519","amp;dn":"Lone+Survivor+2013+BRRip+DVDr+%5B+nordic%2Bbonus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"667137ed445c8df76510243cb94afcde5831d519","infoHashBuffer":{"type":"Buffer","data":[102,113,55,237,68,92,141,247,101,16,36,60,185,74,252,222,88,49,213,25]},"announce":[],"urlList":[]}}