{"title":"Yo Soy El Amor DVD-Screener Spanish 2009","uid":5633201,"size":1359169536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:68cabfcb43c4329344f9bebcf961006659251a35&amp;dn=Yo+Soy+El+Amor+DVD-Screener+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1276774770,"description":"La casa de la rica familia Recchi, en MilÃƒÂ¡n, estÃƒÂ¡ llena de espejos, flores, dinero y frialdad. La saga estÃƒÂ¡ compuesta por Eduardo Tancredi y su mujer Emma (Tilda Swinton), inmigrante rusa plenamente integrada en la cultura milanesa, sus hijos Elisabetta, Edoardo y Gianluca, los compaÃƒÂ±eros y prometidos de estos, los abuelos, el linaje y las futuras generaciones celebran entre habitaciones y pasillos, jardines cubiertos de nieve y las espaciosas cocinas de Villa Recchi la sucesiÃƒÂ³n y entrega del negocio familiar y la consolidaciÃƒÂ³n, una consolidaciÃƒÂ³n progresiva de los papeles que cada vez es mÃƒÂ¡s temida pues son conscientes de la clase a la que pertenecen la gran burguesÃƒÂ­a industrial de LombardÃƒÂ­a. El joven cocinero Antonio, completamente ajeno a este mundo y no muy inclinado al compromiso, condensa emociones en platos que no deberÃƒÂ­an estar en la tradiciÃƒÂ³n culinaria de la familia. Tanto Emma como Antonio son personajes que no encajan en el universo al que pertenecen y la pasiÃƒÂ³n desemboca en una colisiÃƒÂ³n que harÃƒÂ¡ que ambos rompan con todas las ataduras y entren en contacto directo con la naturaleza. Gracias a esto Antonio encuentra la inspiraciÃƒÂ³n para sus creaciones; gracias a esto Emma consigue distanciarse y crear una nueva identidad. El precio a pagar es desorbitante y solo hay un remedio: el amor.  ","torrent":{"xt":"urn:btih:68cabfcb43c4329344f9bebcf961006659251a35","amp;dn":"Yo+Soy+El+Amor+DVD-Screener+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cabfcb43c4329344f9bebcf961006659251a35","infoHashBuffer":{"type":"Buffer","data":[104,202,191,203,67,196,50,147,68,249,190,188,249,97,0,102,89,37,26,53]},"announce":[],"urlList":[]}}