{"title":"Bello-Vatican Empire(Vatican&amp;big bussines)(1968)","uid":4739249,"size":995459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:690b7154a774f02ddf5d73f12635700fd99c5186&amp;dn=Bello-Vatican+Empire%28Vatican%26big+bussines%29%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1235469032,"description":"This is Nino Lo Bello's monumental book The Vatican Empire - The Authoritative Report that Reveals the Vatican as a Nerve Center of High Finance and Penetrates the Secret of Papal Wealth (1968) which clearly exposes the Vatican as one of the world's largest shareholders, with a stock portfolio that can be conservatively estimated in the billions of dollars. The extent of papal wealth has traditionally been cloaked in secrecy. Even within the Vatican's own walls there is no individual who has an overall view of its infinitely ramified financial operations. In The Vatican Empire, Nino Lo Bello, a former Rome correspondent for Business Week, presents the first comprehensive and authoritative report on the Vatican as a nerve center of high finance. The picture that emerges is one of awesome fiscal power. Bello describes in fascinating detail Vatican investments in real estate - one third of Rome is owned by the Holy See - electronics, plastics, airlines, and chemical and engineering firms. He also gives evidence that the Vatican is heavily involved in Italian banking and that it has huge deposits in foreign banks. Many of these are in Swwitzerland, since the Vatican financiers prefer numbered Swiss accounts where annonymity is maintained and where they can gain control of foreign corporations far from the public eye. Although written in the objective, non-sensational style of the newsman, this is a book that finally demonstrates the depth of the Vatican's commitment to the world of big business. 180 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:690b7154a774f02ddf5d73f12635700fd99c5186","amp;dn":"Bello-Vatican+Empire%28Vatican%26big+bussines%29%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"690b7154a774f02ddf5d73f12635700fd99c5186","infoHashBuffer":{"type":"Buffer","data":[105,11,113,84,167,116,240,45,223,93,115,241,38,53,112,15,217,156,81,134]},"announce":[],"urlList":[]}}