{"title":"Java 6 Kompendium","uid":4729779,"size":13098947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69d847f4b1df0c1025355760174d54f97c8c2003&amp;dn=Java+6+Kompendium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234957470,"description":"Kurzbeschreibung \nJava 6 ist da! Das erfolgreiche Autorenteam Louis/Muller vom Kompendium Ã‚Â»Java 5Ã‚Â« hat ein brandaktuelles Java-Handbuch zu den Neuerungen, die Java 6 mit sich bringt, fur Sie den Markt gebracht.Aber nicht nur die Neuerungen finden Sie hier. Das Kompendium nimmt Sie als Java-Programmierer mit Grundkenntnissen an die Hand und schlie?t die Lucke zwischen Einsteiger- und Profiliteratur.Grundlagen, OOP, Oberflachendesign, fortgeschrittene Textbearbeitung, Drucken, Java2D, JDBC, RMI, Thread-Programmierung, Ressourcen und Lokalisierung, Netzwerkprogrammierung, Java Generics, Applets, JNI, Sicherheit und Eclipse sind einige der Themen, die in bewahrter Weise aufgenommen und praxisnah erlautert werden. \n\nUber den Autor \nDirk Louis studierte Informatik und Biologie und war mehrere Jahre am Max-Planck-Institut fur Informatik in Saarbrucken tatig. Sein Arbeitsfeld umfa?te die grafische Darstellung von Molekulen sowie die Entwicklung und den Einsatz genetischer Algorithmen und neuronaler Netze. Heute ist er selbstandiger Programmierer und Autor. Seine reiche Programmiererfahrung und das Wissen um die Schwierigkeiten mit den verschiedenen Programmiersprachen sind in dieses Buch eingeflossen und haben sein didaktisches Konzept gepragt. ","torrent":{"xt":"urn:btih:69d847f4b1df0c1025355760174d54f97c8c2003","amp;dn":"Java+6+Kompendium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69d847f4b1df0c1025355760174d54f97c8c2003","infoHashBuffer":{"type":"Buffer","data":[105,216,71,244,177,223,12,16,37,53,87,96,23,77,84,249,124,140,32,3]},"announce":[],"urlList":[]}}