{"title":"Automatic Modulation Classification: Principles, Algorithms and ","uid":12019124,"size":1980058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a507972b8c3a5a8b498be3c93da737a64a40e22&amp;dn=Automatic+Modulation+Classification%3A+Principles%2C+Algorithms+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":3,"time":1434382509,"description":"Title: Automatic Modulation Classification: Principles, Algorithms and Applications \nAuthor: Zhechen Zhu, Asoke K. Nandi \nFormat: PDF \nHardcover: 184 pages \nPublisher: Wiley; 1 edition (February 16, 2015) \nLanguage: English \nISBN: 9781118906491 \n\n\nAutomatic Modulation Classification (AMC) has been a key technology in many military, security, and civilian telecommunication applications for decades. In military and security applications, modulation often serves as another level of encryption; in modern civilian applications, multiple modulation types can be employed by a signal transmitter to control the data rate and link reliability.\n\nThis book offers comprehensive documentation of AMC models, algorithms and implementations for successful modulation recognition. It provides an invaluable theoretical and numerical comparison of AMC algorithms, as well as guidance on state-of-the-art classification designs with specific military and civilian applications in mind.\n\nKey Features:\n\n- Provides an important collection of AMC algorithms in five major categories, from likelihood-based classifiers and distribution-test-based classifiers to feature-based classifiers, machine learning assisted classifiers and blind modulation classifiers\n- Lists detailed implementation for each algorithm based on a unified theoretical background and a comprehensive theoretical and numerical performance comparison\n- Gives clear guidance for the design of specific automatic modulation classifiers for different practical applications in both civilian and military communication systems\n- Includes a MATLAB toolbox on a companion website offering the implementation of a selection of methods discussed in the book","torrent":{"xt":"urn:btih:6a507972b8c3a5a8b498be3c93da737a64a40e22","amp;dn":"Automatic+Modulation+Classification%3A+Principles%2C+Algorithms+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a507972b8c3a5a8b498be3c93da737a64a40e22","infoHashBuffer":{"type":"Buffer","data":[106,80,121,114,184,195,165,168,180,152,190,60,147,218,115,122,100,164,14,34]},"announce":[],"urlList":[]}}