{"title":"El Comite de la Muerte - Noah Gordon [Ebook][Spanish]","uid":6717360,"size":886879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6aeffbadea5a3e9d3d9d643e21543eb23aee1b68&amp;dn=El+Comite+de+la+Muerte+-+Noah+Gordon+%5BEbook%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1317638864,"description":"TÃƒÂ­tulo del libro: Comite De La Muerte\nAutor: Gordon Noah (Ver su biografÃƒÂ­a)\nIdioma: EspaÃƒÂ±ol\nAcerca de Comite De La Muerte\nComitÃƒÂ© de la Muerte trata de la conferencia de la mortalidad, como algo tan simple como una reuniÃƒÂ³n de los mÃƒÂ©dicos de un hospital para averiguar si las muertes ocurridas durante esos dÃƒÂ­as se hubieran podido evitar, un mÃƒÂ©dico expone un caso y los otros lo valoran y estudian y dan su veredicto.\n\nEste comitÃƒÂ© no tiene el afÃƒÂ¡n de buscar un culpable, si no el que todos aprendan de los errores.\n\nEstamos hablando del aÃƒÂ±o 1968, de las primeras operaciones de transplante, especialmente las de riÃƒÂ±ÃƒÂ³n y la investigaciÃƒÂ³n sobre fÃƒÂ¡rmacos anti-rechazo y que ahora son cosa muy habitual en los hospitales. TambiÃƒÂ©n es el aÃƒÂ±o de los hippies, de la muerte de Luther King y de los enfrentamientos raciales.\n\nEn el libro se nos muestra la vida durante un aÃƒÂ±o acadÃƒÂ©mico de sus personajes, casi todos mÃƒÂ©dicos que trabajan en el hospital general del condado de Suffolk:\n*Adam Silverstone: nuevo mÃƒÂ©dico adjunto, de origen muy humilde, con un padre alcohÃƒÂ³lico, ve en la medicina el poder hacerse de dinero, aunque luego las cosas cambian...\n\n*Rafe Meomartino: de origen cubano, de una familia con dinero que tuvo que emigrar a los EEUU con la llegada del comunismo, jefe del servicio de cirugÃƒÂ­a, casado con la sobrina del Dr. Longwood.\n\n*Spurgeon Robinson: nuevo mÃƒÂ©dico interno, es el que hace el trabajo sucio, guardias de 72 horas en la ambulancia... Es de color, y muchos de sus pacientes, en un mundo dominado por los blancos, no confÃƒÂ­an en ÃƒÂ©l.\n\n*Harlang Longwood: director mÃƒÂ©dico del servicio de cirugÃƒÂ­a del hospital, con mucha experiencia, ya mayor, hace el papel de mÃƒÂ©dico-enfermo,\n\nLo peor con que un mÃƒÂ©dico se puede encontrar en el hospital, es el enfermo que peor se deja cuidar. Sus riÃƒÂ±ones no le funcionan bien, estÃƒÂ¡ con hemodiÃƒÂ¡lisis y en espera de un donante de riÃƒÂ±ÃƒÂ³n y de que el transplante vaya bien... A veces su moral decÃƒÂ¡e, quiere dejar el tratamiento, entonces ÃƒÂ©l mismo se plantea su caso en el comitÃƒÂ© de la muerte...\n\nComo todos los libros de Noah Gordon, una excelente lectura y se nota que el escritor conoce bien el mundillo de los hospitales y de los mÃƒÂ©dicos.\n\nTiene una manera de describir la vida de los personajes y de relacionarlos que hace que no se deje de leer. Tiene su moraleja, y tambiÃƒÂ©n describe cÃƒÂ³mo la vida puede cambiar tanto en tan sÃƒÂ³lo un aÃƒÂ±o.","torrent":{"xt":"urn:btih:6aeffbadea5a3e9d3d9d643e21543eb23aee1b68","amp;dn":"El+Comite+de+la+Muerte+-+Noah+Gordon+%5BEbook%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aeffbadea5a3e9d3d9d643e21543eb23aee1b68","infoHashBuffer":{"type":"Buffer","data":[106,239,251,173,234,90,62,157,61,157,100,62,33,84,62,178,58,238,27,104]},"announce":[],"urlList":[]}}