{"title":"[InterracialPickups] Brooklyn Chase (25.09.2012)","uid":7673007,"size":287471883,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6af8162d52c2677c49030ece2e988985f9072315&amp;dn=%5BInterracialPickups%5D+Brooklyn+Chase+%2825.09.2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1348624713,"description":"[InterracialPickups] Brooklyn Chase (25.09.2012)\n\nBrooklyn Chase has never, ever fucked a black guy. In fact, Brooklyn Chase and her boyfriend fuck while watching interracial porn,\ndespite the fact that she?s never accepted black cock into her life. That was then this is now! This busty brunette welcomes her boyfriend's tiny\ndick while secretly dreaming about a huge black cock, and Mandingo's the one to give it to her. Brooklyn is in the middle of running around and\nshe's about to encounter Mandingo- someone she's fucked her boyfriend while watching his interracial porn. Mandingo and Brooklyn shoot the\nbreeze when Brooklyn Chase drops a bomb: It's always been her, and her boyfriend's fantasy for her to make a homemade interracial porn that\nwould be for their eyes only. Mandingo is willing to deposit his third leg into Brooklyn in order to keep the boyfriend happy- yes, it's twisted but\ndifferent strokes for different folks. We find ourselves inside and Brooklyn Chase experience's her first black cock and her eyes nearly pop from\ntheir sockets. Brooklyn's stash of interracial porn couldn't get her completely ready for the monstrosity before her. Mandingo assures her that\nthis interracial porn will be for Brooklyn and her boyfriend's consumption only. Brooklyn Chase. After getting reassured, Brooklyn gets a face full\nof Mandingo's huge black cock while nearly 9 inches of it is coming out of her mouth. The camera (train) keeps rolling as Brooklyn's first taste of\nblack cock nearly damages her wind pipe. Mandingo's gigantic black cock slithers its way from Brooklyn's mouth and into that tight, white pussy.\nThere's no sleep until Brooklyn Chase rides that 13 inch black cock until her pussy nearly bursts at the seams. Mandingo fucks this white slut and\nyou can nearly hear her boyfriend jerking his tiny dick from the house they share together. The legendary black cock claims another newbie to\ninterracial porn and Brooklyn Chase gets her first facial of black jizz. Mandingo had this scene edited while Brooklyn showered off the black nut\nsauce he left all over her. It would be a crime towards humanity not for him to share this first interracial encounter with the rest of the world.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=kfqk8h3wxwxqgen6maxc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=kfqk8h3wxwxqgen6maxc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=wc6phwy0do0i88z96tz6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=wc6phwy0do0i88z96tz6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6af8162d52c2677c49030ece2e988985f9072315","amp;dn":"%5BInterracialPickups%5D+Brooklyn+Chase+%2825.09.2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af8162d52c2677c49030ece2e988985f9072315","infoHashBuffer":{"type":"Buffer","data":[106,248,22,45,82,194,103,124,73,3,14,206,46,152,137,133,249,7,35,21]},"announce":[],"urlList":[]}}