{"title":"Blade Runner Extended Edition By ADigitalMan","uid":4102827,"size":8261067968,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6afa867c94bb2d58ac0a4c2e4c85cddc4744bb84&amp;dn=Blade+Runner+Extended+Edition+By+ADigitalMan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dark jedi","files":22,"time":1206657112,"description":"Blade Runner 2008 Extended Edition\n\nBy ADigitalMan\n\nList of changes:\n\n1) Opens with &quot;Reedited by ADigitalMan&quot; logo, Blade Runner style \n2) After the company logos, a snippet of deleted &quot;happy ending&quot; audio over a black screen where Rachel says, &quot;You know what I think? That we were made for each other.&quot; \n3) &quot;Tears in the Rain&quot; opening credits. \n4) Original &quot;Eye on the City&quot; opening sequence. The &quot;reactive eye&quot; of the Final Cut was too damn distracting ... you spend your time looking at the iris and not the reflections. \n5) Holden&amp;#039;s shooting cuts to black. Fade in on the advertising blimp heading downtown. \n6) Extended intro to Deckard with more voiceovers, including the bit about Holden and the bit about his ex-wife. \n7) Final Cut video of the whole Spinner ride to headquarters. \n8 ) Removed the &quot;Skin-Job/N-word&quot; voiceover ... Deckard refers to them as skin jobs himself later, which makes this awkward line even more misplaced. \n9) Extended description of Leon&amp;#039;s abilities. \n10) Holden in the Hospital. Brief bit the next morning as Deckard flips through the files and some of the voiceover about Tyrell growing slaves. \n11) Alternate version of Leon&amp;#039;s hotel room. \n12) Audio of Deckard trying to find four phony ones in a city of 160 million over his ride to the apartment. Deckard runs in the rain. \n13) Deckard thinks about his wife while thumbing through photos. Note that he and his wife are on the same porch as Rachel and her mom. Hmmmmm. \n14) No Friggin Unicorns (TM). I understand the shot&amp;#039;s significance, but is inserted ham-fistedly and fits with nothing else in the film. It&amp;#039;s the midichlorians of Blade Runner. There are enough other hints and the unicorn origami has a beautiful significance all its own without needing this to distort its meaning. \n15) Alternate Esper analysis. I edited this down some. I especially like how this scene actually freezes on the same shot as Deckard&amp;#039;s printout. Why it was changed to something that doesn&amp;#039;t fit escapes me. \n16) Deckard studies the fish scale at the sushi bar. \n17) &quot;Final Cut&quot; video for the snake scale analysis and conversation with the snake maker. \n18 ) Extended bit outside of Taffey Lewis&amp;#039; bar. More hockey-masked go go dancers. \n19) Bartender tells Deckard to talk to &quot;the artists&quot; about the snakes. \n20) Deckard wonders why a replicant would be doing snake dances while he waits to corner Zhora. \n21) Final Cut video for Zhora busting through the glass through Rachel shooting Leon. \n22) Voiceover about &quot;it&amp;#039;s not real blood&quot; added. \n23) Rachel and Deckard walk through the streets before heading back to his place. \n24) Extended sequence where Rachel watches Deckard get clean. \n25) Rachel watches Deckard sleep. \n26) Extended love scene. \n27) Return to visit Holden in the Hospital/Bryant and Gaff eavesdrop. \n28 ) Security check as Sebastian and Roy ascend in the elevator. \n29) &quot;Father&quot; remixed better than the Final Cut. Extended gore. \n30) Roy descends in the elevator, hears the computer and calls her &quot;Mom.&quot; \n31) Deckard is a smartass to the cop/&quot;Good luck Blade Runner.&quot; \n32) Removed final voiceover at Roy&amp;#039;s death. &quot;Final Cut&quot; dove sequence. Final Cut video from rooftop to the end. \n33) Gaff says &quot;Are you sure you are a man? It&amp;#039;s hard to tell who&amp;#039;s who around here.&quot; \n34) No happy ending. \n\n\nDetails:\n\nStatic Main,Scenes,About,Credit Menu&amp;#039;s with sound.\n16:9 Anamorphic Widescreen at 2.35:1\nDolby Digital 5.1\n4 Different Sound Options:\n1) The original audio mix I did (no skin job n-word/father/no final voiceover at Batty&amp;#039;s death. \n2) No voiceovers \n3) skin job/father/theatrical Batty-death v.o. \n4) skin job/father/workprint batty-death v.o.\nDVD Artwork in the DVD_ROM folder,along with a 5th sound option and how to include it.\n\nENJOY!\n","torrent":{"xt":"urn:btih:6afa867c94bb2d58ac0a4c2e4c85cddc4744bb84","amp;dn":"Blade+Runner+Extended+Edition+By+ADigitalMan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6afa867c94bb2d58ac0a4c2e4c85cddc4744bb84","infoHashBuffer":{"type":"Buffer","data":[106,250,134,124,148,187,45,88,172,10,76,46,76,133,205,220,71,68,187,132]},"announce":[],"urlList":[]}}