{"title":"A Man of Good Hope - Jonny Steinberg","uid":12831151,"size":4072181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6afe8bdf35cdcfc4beeae3913a5f3b4ebe80ccac&amp;dn=A+Man+of+Good+Hope+-+Jonny+Steinberg&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1448397901,"description":"In January 1991, when civil war came to Mogadishu, the capital of Somalia, two-thirds of the city’s population fled. Among them was eight-year-old Asad Abdullahi. His mother murdered by a militia, his father somewhere in hiding, he was swept alone into the great wartime migration that scattered the Somali people throughout sub-Saharan Africa and the world.\r\n\r\nThis extraordinary book tells Asad’s story. Serially betrayed by the people who promised to care for him, Asad lived his childhood at a skeptical remove from the adult world, his relation to others wary and tactical. He lived in a bewildering number of places, from the cosmopolitan streets of inner-city Nairobi to the desert towns deep in the Ethiopian hinterland.\r\n\r\nBy the time he reached the cusp of adulthood, Asad had honed an array of wily talents. At the age of seventeen, in the Ethiopian capital, Addis Ababa, he made good as a street hustler, brokering relationships between hard-nosed businessmen and bewildered Somali refugees. He also courted the famously beautiful Foosiya, and, to the astonishment of his peers, seduced and married her.\r\n\r\nBuoyed by success in work and in love, Asad put twelve hundred dollars in his pocket and made his way down the length of the African continent to Johannesburg, South Africa, whose streets he believed to be lined with gold. And so began a shocking adventure in a country richer and more violent than he could possibly have imagined.\r\n\r\nA Man of Good Hope is the story of a person shorn of the things we have come to believe make us human—personal possessions, parents, siblings. And yet Asad’s is an intensely human life, one suffused with dreams and desires and a need to leave something permanent on this earth","torrent":{"xt":"urn:btih:6afe8bdf35cdcfc4beeae3913a5f3b4ebe80ccac","amp;dn":"A+Man+of+Good+Hope+-+Jonny+Steinberg","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6afe8bdf35cdcfc4beeae3913a5f3b4ebe80ccac","infoHashBuffer":{"type":"Buffer","data":[106,254,139,223,53,205,207,196,190,234,227,145,58,95,59,78,190,128,204,172]},"announce":[],"urlList":[]}}