{"title":"FastStone Image Viewer 3.7","uid":4665523,"size":4235606,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6b40f49aef17dd135dfc167ef5b392d71224b838&amp;dn=FastStone+Image+Viewer+3.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":1,"time":1232552002,"description":"Copied from FastStone Homepage:\n\n\nFastStone Image Viewer is a fast, stable, user-friendly image browser, converter and editor. It has a nice array of features that include image viewing, management, comparison, red-eye removal, emailing, resizing, cropping and color adjustments. Its innovative but intuitive full-screen mode provides quick access to EXIF information, thumbnail browser and major functionalities via hidden toolbars that pop up when your mouse touches the four edges of the screen. \nOther features include a high quality magnifier and a musical slideshow with 150+ transitional effects, as well as lossless JPEG transitions, drop shadow effects, image annotation, scanner support, histogram and much more. \n\nIt supports all major graphic formats:\n\nBMP\nJPEG\nJPEG 2000\nanimated GIF\nPNG\nPCX\nTIFF\nWMF\nICO\nTGA\n\nThe program can also open CUR and PSD images.\n\nIt also supports popular digital camera RAW formats:\n\nCRW\nCR2\nNEF\nPEF\nRAF\nMRW\nORF\nSRF\nDNG\n\n\nFeatures\n  \n\nImage browser and viewer with a familiar Windows Explorer-like user interface\n\nTrue Full Screen viewer with image zoom support and unique fly-out menu panels\n\nCrystal-clear and customizable one-click image magnifier\n\nSuperior Red-Eye effect removal/reduction with completely natural looking end result\n\nImage modification tools: Resize/resample, rotate/flip, crop, sharpen/blur, brightness/contrast, etc. \n\nEleven (yes, 11) resampling algorithms to choose from when resizing images\n\nImage color effects: gray scale, sepia, negative, Red/Green/Blue adjustment\n\nImage special effects: watermark, annotation, drop shadow, framing, bump map, lens, morph, waves\n\nMulti-level Undo/Redo capability\n\nOne-touch best fit/actual size image display support\n\nImage management, including tagging capability, with drag-and-drop and Copy To/Move To Folder support\n\nHistogram display with color counter feature\n\nCompare images side-by-side (up to 4 at a time) to easily cull those forgettable \nshots\n\nImage EXIF metadata support (plus comment editing for JPEGs)\n\nConfigurable batch processing to convert/rename large or small collections of images\n\nSlideshow creation with 150+ transition effects and music support (MP3, WMA, \nWAV...)\n\nCreate efficient image attachment(s) for emailing to family and friends\n\nPrint images with full page-layout control\n\nCreate fully configurable Contact Sheets - just like the pros (and save $$$ on ink)\n\nCreate memorable artistic image montages from your family photos for personalized desktop wallpapers (Wallpaper Anywhere)\n\nAcquire images from a scanner\n\nVersatile screen capture capability\n\nPowerful Save As interface to compare image quality and control generated file size\n\nRun favorite programs with one keystroke from within Image Viewer\n\nCreate a no-install fully portable version of the program which can be run from a removable storage device\n\nConfigurable mouse wheel support\n\nSupports multiple program skins\n\nSupports dual-monitor configurations\n\nAnd much more... \n\n\nNo Adware No Spyware\nFree for Home Users \n\nChangelog: \n\n\nAdded Preview to the &quot;Batch Convert&quot; tool. Now it is possible to preview the conversion by clicking the &quot;Conversion Preview&quot; button\n\nAdded a checkbox to allow converted files to be saved in their original folders in the &quot;Batch Convert&quot; tool\n\nEnhanced the &quot;Cover&quot; style of Set as Wallpaper. Now it is possible to zoom and drag an image to set any particular part of it as wallpaper\n\nNow it is possible to adjust EXIF Timestamp by both hours and minutes using the &quot;Change Timestamp&quot; tool under &quot;Tools&quot; menu\n\nAdded an option to the Settings to determine which (move or copy) action to take when files are dragged to the folder tree\n\nEnhanced the Magnifier to view large images faster\n\nUpdated the RAW format library. Panasonic RW2 files are supported\n\nFixed some bugs\n\n\nComments from the uploader (olofolleola4):\nThis is my favorite image viewer.\nIt has all the common editing features that I regulary use.\nTry it!","torrent":{"xt":"urn:btih:6b40f49aef17dd135dfc167ef5b392d71224b838","amp;dn":"FastStone+Image+Viewer+3.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b40f49aef17dd135dfc167ef5b392d71224b838","infoHashBuffer":{"type":"Buffer","data":[107,64,244,154,239,23,221,19,93,252,22,126,245,179,146,215,18,36,184,56]},"announce":[],"urlList":[]}}