{"title":"Little Charlie and Organ Grinder Swing - Skronky Tonk","uid":15329194,"size":161088295,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6b4e73b1d7ad30800abd58952abf4f293c0043d3&amp;dn=Little+Charlie+and+Organ+Grinder+Swing+-+Skronky+Tonk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":18,"time":1468711839,"description":"Little Charlie &amp; Organ Grinder Swing - Skronky Tonk\r\n\r\nA traditional jazz organ trio setting with an assorted palette of songs. You'll hear Charlie Christian licks, Jimmy Smith influence, Reinhardt ornaments, Groove Holmes double-time, MJQ arr, etc. All very well performed!\r\n\r\n\r\nTrack listing:\r\n01. Shronky Tonk (5:04)\r\n02. How High Is The Moon (4:08)\r\n03. Receita De Samba (2:57)\r\n04. Nuages (5:27)\r\n05. Pennies From Heaven (6:30)\r\n06. Gerontology (3:35)\r\n07. Django (5:49)\r\n08. Swing To Bop (4:14)\r\n09. Broadway (4:06)\r\n10. Um A Zero (2:37)\r\n11. Cobalt Blues (4:02)\r\n12. Misty (6:30)\r\n13. Flyin' Home (4:28)\r\n\r\nTotal Time: 59:34\r\n\r\nPersonnel: \r\n- Little Charlie Baty, guitar \r\n- Lorenzo Farrell, Hammond organ, bass on &quot;Cobalt Blues&quot; \r\n- J. Hansen, drums, percussion. \r\n\r\nLabel: Eller Soul Records \r\nReleased: 2016\r\n\r\nMP3 format. 320 kbit/s. All songs are tagged by the book.\r\n\r\n----------\r\n\r\nReview by James Nadal\r\nLittle Charlie Baty is best known as leader of The Nightcats, a solid blues band with an extended discography on Alligator records dating back to 1987. He recently recorded and toured with the Golden State Lone Star Blues Revue, to high acclaim. This organ trio venture is a lifelong personal ambition, which he finally realized. Farrell and Hansen are his former Nightcats bandmates, and so the personal and musical chemistry is present. What might appear as a radical departure for these three, upon further analysis, is just a deeper exploration to the core of American music.\r\n\r\nThe title track determines the direction of the record, and is an indicator that Baty and company have done their homework in the soul/jazz idiom. This is one of three originals, the swinging &quot;Gerontology,&quot; and &quot;Cobalt Blues,&quot; being the others. Some of the repertoire is composed of standards as &quot;How High The Moon,&quot; &quot;Pennies From Heaven,&quot; and &quot;Misty,&quot; all given a gentle nudge into a jazzier atmosphere.\r\n\r\nThe jazz manouche of Django Reinhardt is evident on his &quot;Nuages,&quot; and &quot;Django,&quot; penned by John Lewis of Modern Jazz Quartet fame. Charlie Christian is credited as the first jazz guitarist, and his &quot;Swing To Bop,&quot; is rejuvenated with ambitious vigor. The Brazilian tinge is covered on &quot;Receita de Samba,&quot; and &quot;Um a Zero,&quot; whereas &quot;Broadway,&quot; drifts into the Caribbean; displaying versatility and ability to syncopate. They wrap it up with the Benny Goodman classic &quot;Flyin' Home,&quot; a good natured jaunt into big band territory, reinvented within the organ trio format. Throughout the record, Baty as guitarist, and Farrell in his role of organist, do a magnificent job playing off of each other with disciplined anticipation. Keeping the arrangements lean, with no rushing or clutter, makes for ease of enjoyment.\r\n\r\nSince these musicians are based out of California, Greaseland Studios in San Jose was chosen for recording the sessions; the sound being exemplary, as the clarity of the instruments shines through. Little Charlie elected to play this music as a matter of choice and taste; serving as an homage to those musicians who inspired and challenged his trajectory, his bandmates rising to the occasion. The organ trio is a tough turf to travel, and these guys do it in style. \r\n\r\n----------\r\nL Hammond, The Pirate Bay, where you'll find more jazz organ","torrent":{"xt":"urn:btih:6b4e73b1d7ad30800abd58952abf4f293c0043d3","amp;dn":"Little+Charlie+and+Organ+Grinder+Swing+-+Skronky+Tonk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b4e73b1d7ad30800abd58952abf4f293c0043d3","infoHashBuffer":{"type":"Buffer","data":[107,78,115,177,215,173,48,128,10,189,88,149,42,191,79,41,60,0,67,211]},"announce":[],"urlList":[]}}