{"title":"BoundGods--BG-39385 Dirk Caber and Jessie Colter Hi HD","uid":13176751,"size":3578120508,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6babbb0d256081b6e1bed7164df665da464a83ad&amp;dn=BoundGods--BG-39385+Dirk+Caber+and+Jessie+Colter+Hi+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":2,"time":1452297306,"description":"Dirk Caber and Jessie Colter Share a Night of Pain and Pleasure\r\n\r\nJan 7, 2016 - Performers: Dirk Caber  and  Jessie Colter \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nBoth strapped in tight leather jocks and harnesses, Jessie Colter and Dirk Caber pay a visit to the dungeon for a play session. After a rough makeout and rimming on a dingy bed, Dirk commands the situation and fastens Jessie to a pillar to worship his pits. He puts Jessie's balls to the test with a cruel cluster of weights and canes the eager pain slut. Jessie moans in short relief when Dirk frees his balls, but Dirk punctures the break with sharp electric stings from the zapper. Now it's Jessie's turn to dominate. Dirk finds himself stretched out between two columns while Jessie gropes his muscles and cock with rough hands. Jessie edges Dirk before whipping out a cattle prod in reply to Dirk's earlier zapper. He teases the hunk with its prongs before finally delivering an excruciating jolt. Dirk has his hard body flogged raw before both men return to the bed. Still in control, Jessie lays Dirk spread-eagle and covers his legs and nipples in clothespins before plunging deep into his hole. After tearing off the pins, Jessie flips the roles and rides Dirk's throbbing cock to blow a thick load. Now it's Dirk's turn to cum. He orders Jessie to milk the hot jizz from his balls and offers his own load to share with Jessie. The men lap up their mess in a horny daze as the night grows late.\r\n\r\nScreens \nhttp://www.boundgods.com/site/shoot.jsp?shootId=39385\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:6babbb0d256081b6e1bed7164df665da464a83ad","amp;dn":"BoundGods--BG-39385+Dirk+Caber+and+Jessie+Colter+Hi+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6babbb0d256081b6e1bed7164df665da464a83ad","infoHashBuffer":{"type":"Buffer","data":[107,171,187,13,37,96,129,182,225,190,215,22,77,246,101,218,70,74,131,173]},"announce":[],"urlList":[]}}