{"title":"[Mature] Mures et Dociles / shut up and submissive (Zeus, Maeva)","uid":7128751,"size":733968384,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6bcd9f40554a91949e3cbb6dcbdc41aba1b50478&amp;dn=%5BMature%5D+Mures+et+Dociles+%2F+shut+up+and+submissive+%28Zeus%2C+Maeva%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1332623248,"description":"Year: 2007\nCountry: France\nGenre: Mature, Anal, Oral, Hardcore, Spanking\nTime: 00:59:30\nDirected by: Zeus\nStudio: Maeva Video\nCast: Marie Delvaux\nAlizee\nWilliam\nDescription: Voici two femmes mures qui tombent entre les mains d'un type qui va abuser de leur naivete, il leur fera subir ses fantasmes inavouables. Baisant tout d'abord la plus docile, puis sa copine va les surprendre, celle-ci participera a leurs ebats. Elles se feront prendre ainsi toutes les deux puis se gouineront entre elle pour le plus grand plaisir du male.\nVideo francaise exclusive, introuvable ailleurs! La majeure partie de cette video nous montre une belle brune tres cochonne qui prend enormement de plaisir a sucer une grosse bite! Cette chienne en chaleur a chauffe son voisin juste avant puis elle s'est mise a quatre pattes ... La coquine a commence par ouvrir grand sa bouche et a lecher cette enorme queue! La bonne salope se touche en meme temps pour bien mouiller et ca marche! Ce pervers est tres excite maintenant, il a envie de la penetrer ... Aussitot dit, aussitot fait, ce vicieux enfonce sa bite dans le cul de cette mature!\nPromt:\nHere are two women who fall into the hands of a type that is going to abuse their innocence, he would expose them to their shameful fictions. First kissing the most obedient, and then her friend is going to surprise them, that will take part in their pranks. They force themselves to take so both then gouineront between her big fun for most of the male.\nVideo French exception, which is absent in the other place! Much of this video shows us the beautiful brunette is trite that gets a lot of fun to suck up the document, bite! This bitch in heat heated his neighbor's front and then it fit on four legs ... Began to cheat is widely opened her mouth and licks to this huge place! Good, salope, touching at the same time to anchor well and it goes! This weirdo is now very excited, he wants to get through it ... No sooner said than done, this is an erroneous deepens its bite in the ass of this mature!\nQuality: DVDRip\nVideo format: AVI\nVideo Codec: XviD\nFormat: MP3\nVideo: 448x336 (1.33:1), 25 fps, XviD MPEG-4 ~ 1494 kbps avg, 0.40 bit / pixel\nAudio: 48 kHz, MPEG Layer 3, 2 ch, ~ 136.20 kbps avg\nSize 700 MB\nscreens\n\n &lt;a href=&quot;\nhttp://50.97.164.34/IR7VD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://50.97.164.34/IR7VD&lt;/a&gt;","torrent":{"xt":"urn:btih:6bcd9f40554a91949e3cbb6dcbdc41aba1b50478","amp;dn":"%5BMature%5D+Mures+et+Dociles+%2F+shut+up+and+submissive+%28Zeus%2C+Maeva%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bcd9f40554a91949e3cbb6dcbdc41aba1b50478","infoHashBuffer":{"type":"Buffer","data":[107,205,159,64,85,74,145,148,158,60,187,109,203,220,65,171,161,181,4,120]},"announce":[],"urlList":[]}}