{"title":"The Health Wyze Report - Episode 17","uid":6982571,"size":38831454,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6cae046b5213544f5f0da9cf18a707b76f8f2d01&amp;dn=The+Health+Wyze+Report+-+Episode+17&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1327449712,"description":"In this show, we outline why we don't always play well with others, expose the problems with the so-called leaders of our community, explain why we do not associate ourselves with many other groups, and warn people about some of the deceptive games played by the health &quot;gurus&quot;. We caution people about raw foodists who recommend raw meats and eggs.\n\nThis is bound to become known as the &quot;They've stopped sugar-coating&quot; episode.\n\nWe discuss even more problems with products coming from China, their upcoming involvement in vaccine manufacture, the modern use of cadmium, along with the hidden danger in painted plates. We elaborate on the health dangers of factory farmed fish and how such breeding methods lead to a lack of biodiversity. We explain the problems with high definition televisions, explain how to avoid most of the issues, and also expose the dangers of wireless internet in large institutions, such as schools and colleges. We mention the mental issues caused by flickers in fluorescent lights and televisions, and the associated seizure risks.\n\nWe warn people about detergents, dryer sheets and dishwasher drying agents, offer an alternative for vegetarians who must otherwise rely on soy, give advice specifically to adult men who are getting too much iron, and the discoveries of Linus Pauling about how to remove excess iron from the body. We explain that people who have problems with fungi and dandruff should supplement with zinc. We also advise pet owners about using nutrition to treat severe pet injuries.\n\nFor more information, visit our home site at http://healthwyze.org/","torrent":{"xt":"urn:btih:6cae046b5213544f5f0da9cf18a707b76f8f2d01","amp;dn":"The+Health+Wyze+Report+-+Episode+17","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cae046b5213544f5f0da9cf18a707b76f8f2d01","infoHashBuffer":{"type":"Buffer","data":[108,174,4,107,82,19,84,79,95,13,169,207,24,167,7,183,111,143,45,1]},"announce":[],"urlList":[]}}