{"title":"The Isles, by Norman Davies","uid":7108273,"size":9295448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6de6df37e631886e3ff6c8b73b8502027457ee84&amp;dn=The+Isles%2C+by+Norman+Davies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rngtrk","files":1,"time":1331941164,"description":"When did British history begin, and where will it all end? These controversial issues are tackled head-on in Norman Davies' polemical and persuasive survey of the four countries that in modern times have become known as the British Isles. Covering 10 millennia in just over a thousand pages, from &quot;Cheddar Man&quot; to New Labour, Davies shows how relatively recent was the formation of the English state--no earlier than Tudor times--and shows too how a sense of Britishness only emerged with the coming of empire in the 18th and 19th centuries. A historian of Poland and the author of an acclaimed history of Europe, Davies is especially sensitive to the complex mixing and merging of tribes and races, languages and traditions, conquerors and colonised which has gone on throughout British history and which in many ways makes &quot;our island story&quot; much more like that of the rest of Europe than we usually think. Many myths of the English are dispelled in this book and many historians are taken to task for their blinkered Anglo-centrism. But the book ends on an upbeat note, with Davies welcoming Britain's return to the heart of Europe at the dawn of the new millennium. --Miles Taylor --This text refers to an out of print or unavailable edition of this title.\n\n\n\nISBN-10: 0333692837\n\nISBN-13: 978-0333692837\n","torrent":{"xt":"urn:btih:6de6df37e631886e3ff6c8b73b8502027457ee84","amp;dn":"The+Isles%2C+by+Norman+Davies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de6df37e631886e3ff6c8b73b8502027457ee84","infoHashBuffer":{"type":"Buffer","data":[109,230,223,55,230,49,136,110,63,246,200,183,59,133,2,2,116,87,238,132]},"announce":[],"urlList":[]}}