{"title":"Various Artists - Plug It In! Turn It Up! Electric Blues - The D","uid":9572785,"size":407531032,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e80a82c744b5c39e91b21b3edf62fee1c236895&amp;dn=Various+Artists+-+Plug+It+In%21+Turn+It+Up%21+Electric+Blues+-+The+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1391653676,"description":"mp3 v0\n\nVarious Artists - Plug It In! Turn It Up! Electric Blues - The Definitive Collection, Pt. 3: 1960-1969 [2012]\n\nOriginal Release / Bear Family / BCD 16923 CP / CD\n\n(3 CD-digipac with 172-page booklet) Blues historian and musicologist Bill Dahl from Chicago has produced the most comprehensive history of electric blues ever! With nearly 300 tracks, BEAR FAMILY RECORDS is telling the story from the beginning into the new millennium. Every significant artist... every significant recording from the 1930s to the present day, including T-Bone Walker, Muddy Waters, Howlin' Wolf, George Thorogood, and Freddie, B.B. and Albert King, Jeff Beck, Fleetwood Mac, Charlie Musselwhite, Eric Clapton, and Stevie Ray Vaughan, and literally hundreds more! Cross-licensed from every record company to be truly comprehensive!\n\nIn the 1930s, the invention of Gibson's ES-150 - the first electric guitar - changed popular music forever. The first generation of blues pioneers played acoustic instruments, but with the invention of amplification, guitar and harmonica players could be heard over the piano, drums and horns. Music was revolutionized!\n\nThis is one of four 3-CD sets in elegant deluxe digipacs. All four sets combined add up to 12 generously full CDs plus more than 650 pages in four lavishly illustrated booklets, in which Bill Dahl writes authoritatively about the history of electric blues, and how it influenced rock music during the 1960s and beyond. Here's the complete story from jazz-inspired jump numbers in the late 1930s to hard-driving blues/rock from the States and Great Britain in the 1960s, '70s, and beyond. The journey closes with today's contemporary blues. This is it! Truly definitive! Done as only BEAR FAMILY can do it!\n\nAllmusic.com\nThis is the third three-disc volume in Bear Family Records' ambitious four-volume history of the electric blues, all compiled and annotated by blues historian and musicologist Bill Dahl. The Gibson guitar company introduced the first electric guitar in the 1930s, and the advent of amplification meant the blues could preach louder and longer, which allowed a country acoustic music to transform itself into its own kind of powerfully rhythmic pop music. Taken as a whole, this ambitious Bear Family series traces and surveys that transformation, beginning with jazz-inspired jump blues tracks and following through to the juncture of blues and rock, blues and funk, and beyond, on into the 21st century. This particular volume covers 1960 to 1969, a time when blues and rock &amp; roll really started to join hands, and it features classic tracks like Buddy Guy's &quot;First Time I Met the Blues,&quot; Jimmy Reed's &quot;Big Boss Man,&quot; Albert King's &quot;Crosscut Saw,&quot; and B.B. King's &quot;Rock Me Baby,&quot; but it also collects lesser-known gems like Frank Frost's &quot;Jelly Roll King&quot; and Junior Parker's &quot;Driving Wheel,&quot; then slides into blues and rock hybrids like the Animals' &quot;House of the Rising Sun,&quot; Canned Heat's Henry Thomas-inspired &quot;On the Road Again,&quot; and Janis Joplin's &quot;Ball and Chain,&quot; before closing things out with Stevie Wonder's blues-based &quot;I Ain't Superstitious&quot; done by the Jeff Beck Group. Bear Family Records is known for its quality releases, and this volume is no exception. When the full 12 discs are taken together, with nearly 300 tracks, it makes for a fascinating survey of the blues in all of its electric configurations.\n\nTracks\n\nDisc 1\n\n\n01 - Rush, Otis - So Many Roads, So Many Trains\n02 - Guy, Buddy - First Time I Met the Blues\n03 - Reed, Jimmy - Big Boss Man\n04 - King, Freddy - Hide Away\n05 - King, Freddy - Have You Ever Loved a Woman\n06 - Wells, Junior - Messin' with the Kid\n07 - Bland, Bobby - I Pity the Fool\n08 - Earl King - Come On (Parts 1 &amp; 2)\n09 - Thomas, Kid - Rockin This Joint To-nite\n10 - James, Elmore - Shake Your Moneymaker\n11 - James, Betty - I'm a Little Mixed Up\n12 - Parker, Junior - Driving Wheel\n13 - Perryman, Willie - Doctor Feel-Good\n14 - Hooker, John Lee - Boom Boom\n15 - Parker, Bobby - Watch Your Step\n16 - Cobbs, Willie - You Dont't Love Me\n17 - Allen, Ricky - Cut You A-Loose\n18 - Frost, Frank - Jelly Roll King\n19 - Diddley, Bo - You Can't Judge a Book by Looking at the Cover\n20 - Kittrell, Christine - I'm a Woman\n21 - Williamson, Sonny Boy - Help Me\n22 - Fortune, Jesse - Too Many Cooks\n23 - Taylor, Little Johnny - Part Time Love\n24 - Howlin' Wolf - Hidden Charms\n25 - Davis, James - Blue Monday\n\nDisc 2\n\n01 - Tucker, Tommy - Hi-Heel Sneakers\n02 - Lee, Lillte Frankie &amp; The Saxtons - Full Time Lover\n03 - King, B. B. - Rock Me Baby\n04 - Shaw, Timmy - Gonny Send You Back to Georgia\n05 - DeSanto, Sugar Pie - Use What You Got\n06 - Howlin' Wolf - Killing Floor\n07 - Thomas, Rufus - All Night Worker\n08 - Wells, Junior - Snatch It Back and Hold It\n09 - Harpo, Slim - Baby Scratch My Back\n10 - Taylor, Koko - Wang Dang Doodle\n11 - Lilttle Milton - Feel So Bad\n12 - Taylor, Johnnie - Little Bluebird\n13 - Picket, Wilson - Mustang Sally\n14 - King, Albert - Crosscut Saw\n15 - John, Mable - You're Taking up Another Man's Place\n16 - Fulsom, Lowell - Tramp\n17 - Franklin, Aretha - Dr. Feelgood (Love Is a Serious Business)\n18 - King, Albert - Born Under a Bad Sign\n19 - James, Etta - I'd Rather Go Blind\n20 - Guy, Buddy - Mary Had a Little Lamb\n21 - Carter, Clarence - Slip Away\n22 - Rhodes, Sonny - One of These Days\n23 - Davis, Tyrone - A Woman Needs to Be Loved\n24 - Magic Sam - What Have I Done Wrong\n25 - Leavy, Calvin - Cummins Prison (Farm)\n\nDisc 3\n\n01 - Hawkins, Ronnie - Who Do You Love\n02 - Mack, Lonnie - Baby What's Wrong\n03 - Winter, Johnny - Gangster of Love\n04 - Animals, The - The House of the Rising Sun\n05 - Manfred Mann - Bring It to Jerome\n06 - Bloomfield, Michael - Going Down Slow\n07 - Pretty Things, The - Judgement Day\n08 - Yardbirds, The - I Ain't Got You\n09 - Paul Butterfield Blues Band - Born in Chicago\n10 - John Mayall's Blues Brakers - Have You Heard\n11 - Hammond, John - I Can Tell You\n12 - Charley Musselwhite's South Side Band - Baby Will You Please Help Me\n13 - Spencer Davies Group, The - Stevie's Blues\n14 - Ten Years After - I Want to Know\n15 - Savoy Brown - Shake 'Em on Down\n16 - Mahal, Taj - She Caught the Cat\n17 - Canned Heat - On the Road Again\n18 - Big Brother &amp; The Holding Company - Ball and Chain\n19 - Fleetwood Mac - Black Magic Woman\n20 - Jeff Beck Group, The - I Ain't Superstitious","torrent":{"xt":"urn:btih:6e80a82c744b5c39e91b21b3edf62fee1c236895","amp;dn":"Various+Artists+-+Plug+It+In%21+Turn+It+Up%21+Electric+Blues+-+The+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e80a82c744b5c39e91b21b3edf62fee1c236895","infoHashBuffer":{"type":"Buffer","data":[110,128,168,44,116,75,92,57,233,27,33,179,237,246,47,238,28,35,104,149]},"announce":[],"urlList":[]}}