{"title":"Stay Awake","uid":5304495,"size":97249005,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6efd97718c43741d554dfad52127b2ea8799568c&amp;dn=Stay+Awake&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jackrabbit_lx","files":-1,"time":1264345376,"description":"Review\tby Mark Deming\n\nWhether you regard him as one of the greatest storytellers in American history or a cold-hearted marketing genius who forced a set of prepackaged consumerist myths on several generations of unsuspecting youth, there's little argument that the films of Walt Disney have become an indelible part of our collective subconsciousness. Then again, for every child who delighted in the antics of Mickey Mouse and Donald Duck, there's another who had the bejesus scared out of him by the Wicked Queen or went into hysterics after Bambi's mother was shot; there's a mingled joy and tragedy in Disney's best work that's helped to give his films a cultural resonance Bugs Bunny or Tom &amp; Jerry have never achieved. Consequently, different people have wildly different perspectives on Disney's work, and producer Hal Wilner, a man who joyously revels in diverse perspectives, made the most of that on Stay Awake, in which 21 songs from classic Disney films are reinterpreted -- sometimes faithfully, sometimes radically -- by a startling array of artists brought together by Wilner. Some of these tunes are barely recognizable from their sources (most notably\n\nTom Waits' predictably clanky version of &quot;Heigh Ho [The Dwarfs Marching Song]&quot;), while others are faithful yet idiosyncratic (Syd Straw's jaunty &quot;Blue Shadows on the Trail,&quot; and Los Lobos's rollicking &quot;I Wan'na Be Like You [The Monkey Song]&quot;), but just about everyone seems to find a different angle from which they approach these tunes. Bonnie Raitt gets soulful on &quot;Baby Mine,&quot; Buster Poindexter's take on &quot;Castle in Spain&quot; is high camp at it's most eyebrow wagging, Sun Ra and His Arkestra take &quot;Pink Elephants on Parade&quot; to the spaceways, the Replacements pull &quot;Cruella De Ville&quot; from a puddle of stale beer, and Sinead O'Connor invests &quot;Someday My Prince Will Come&quot; with a desperate longing that's just a bit disturbing. For every nightmare there's a moment of genuine beauty, and when Ringo Starr wraps it up with &quot;When You Wish Upon a Star&quot; the cynics and the incurable optimists join hands and all get along just fine for a moment, just the way Uncle Walt would have wanted it. A fascinating look at a massively influential and little explored treasure trove of music","torrent":{"xt":"urn:btih:6efd97718c43741d554dfad52127b2ea8799568c","amp;dn":"Stay+Awake","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6efd97718c43741d554dfad52127b2ea8799568c","infoHashBuffer":{"type":"Buffer","data":[110,253,151,113,140,67,116,29,85,77,250,213,33,39,178,234,135,153,86,140]},"announce":[],"urlList":[]}}