{"title":"&quot;Hitler's Table Talk&quot;","uid":9668529,"size":7371744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f6385d9ee64df32c84f52875921337be91bba49&amp;dn=%26quot%3BHitler%27s+Table+Talk%26quot%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1393424127,"description":"\nAdolf Hitler, Norman Cameron, R. H. Stevens, Hugh Redwald Trevor-Roper &quot;Hitler's Table Talk&quot;\n Enigma Books | 2000 | ISBN: 1929631057 | 790 pages | PDF | 7.2 MB\n\n\n Hitler's Table Talk 1941-1944 records the private, off the record, informal conversations of a man who, more than anyone else, came close to destroying the western world. On Martin Bormann's instructions, the secret conversations at Hitler's headquarters from July 1941 to November 1944 were all recorded. This is the real companion volume to Hitler's Mein Kampf, whereby what had been a project suddenly was reality, almost to the disbelief of its author. \n Here is a startling account of Hitler freely talking about his enemies, his friends, his ambitions, his failures, his secret dreams voicing his thoughts to his intimate associates as the sun set at the end of each day of the war. We see here a conversational Hitler letting down his guard to his trusted henchmen. Miraculously, Martin Bormann persuaded Hitler to let these talks be taken down by a team of specially picked shorthand writers. Hitler had intended, after his famous tyranny, to use these notes as source material for the books he planned to write about the glory of the Thousand-Year Reich. \n Now they have come to us, indisputably authentic, a raw, fascinating, unretouched look at the inner recesses of the mind of Adolf Hitler. Der Fuhrer's mind was crude and narrow; he had little education and, as we see here, no humanity; but we can also see that he was (as he himself knew) a political genius, a terrible simplifier, a man who, with no equipment except his own will power, personality and ideas, attempted to bring mankind into a terrible darkness. \n As Trevor-Roper says in his brilliant introduction if we are to discover the mind of Hitler, we must penetrate behind the thick curtains of superficial evidence which conceal it the repellant character which formed its expression, and for which no power of thought can compensate, and the unreliable intermediaries who have commented upon it. We must go directly to Hitler's personal utterances: not indeed to his letters and speeches these, so valuable, are too public, too formalized for such purposes to his secret conversations, his table talk. \n","torrent":{"xt":"urn:btih:6f6385d9ee64df32c84f52875921337be91bba49","amp;dn":"%26quot%3BHitler%27s+Table+Talk%26quot%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6385d9ee64df32c84f52875921337be91bba49","infoHashBuffer":{"type":"Buffer","data":[111,99,133,217,238,100,223,50,200,79,82,135,89,33,51,123,233,27,186,73]},"announce":[],"urlList":[]}}