{"title":"EnigmaT Set Rips { Cuts } - April 25th, 2013","uid":8409778,"size":1916789424,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6fa804cad3a1cc249ebe3dac1eae92ed2c1548a8&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+25th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":199,"time":1366850589,"description":"Andrew Bayer - Echo (ABGT 024 Rip)-enTc.mp3\nAndrew Bayer - Need Your Love (ABGT 024 Rip)-enTc.mp3\nAndrew Bayer - Soul Cry (ABGT 024 Rip)-enTc.mp3\nAndrew Bayer Feat. Ane Brun - Lose Sight (Ghosting Season Remix) (Cut From Blake Set)-enTc.mp3\nAndrew Bayer feat. Deb Talan - You Are (ABGT 024 Rip)-enTc.mp3\nAndrew Bayer- As The Circle Closes (ABGT 024 Rip)-enTc.mp3\nAndy Blueman - Away from the Sun (InnerSync Remix) (Cut From Romel Set)-enTc.mp3\nAndy Duguid &amp; Julie Thompson - Skin &amp; Bones (ABGT 024 Rip)-enTc.mp3\nAndy Elliass vs Laucco - Flying With Angels (Icone Remix) (Cut From Space Garden Set)-enTc.mp3\nAndy Mcgirr - The Conscious (Original Club Mix) (Cut From Kirkwood Set)-enTc.mp3\nAndy Raeside - Who Do You Think I Am (Cut From Kirkwood Set)-enTc.mp3\nAndy Tau &amp; Pulstate - Alliance (Cut From Jules Set)-enTc.mp3\nAngelique - Hold On (Cut From RAM Set)-enTc.mp3\nAnivia &amp; De Astro - Memory Lane (Witness45 Remix) (Cut From Datt Set)-enTc.mp3\nAqua &amp; Arctic - Celts (Original Mix) (Cut From Tempo Set)-enTc.mp3\nArman Dinarvand - Deist (Dreamy Remix) (Cut From Summerville Set)-enTc.mp3\nAscania - Worlds Apart (Original Mix) (Cut From Romel Set)-enTc.mp3\nAshai - The Untold Story (Mobil Remix) (Cut From Del Mar Set)-enTc.mp3\nAstral - The End (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nBarry - Behind The Scene (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nBassfinder &amp; Shipops - Ride it! (Original Mix) (Cut From Ozcan Set)-enTc.mp3\nBen Hennessy Feat. Darren Barley - Fire (Electric V Remix) (Cut From Jules Set)-enTc.mp3\nBernie Allen - Late Reflections (Cut From Datt Set)-enTc.mp3\nBinary Finary &amp; Alpha Duo - Tornado (Original Mix) (Cut From Vale Set)-enTc.mp3\nBlack Mesa vs Industrial Division - Lost Weekend (Cut From Dymond Set)-enTc.mp3\nBlack Noise - In The Dark (Martian Arts Remix) (Cut From Patterson Set)-enTc.mp3\nBlood Groove &amp; Kikis - Mirage (Jaytech Remix) (Cut From Jaytech Set)-enTc.mp3\nBlood Groove &amp; Kikis - Vesta (Cut From Jaytech Set)-enTc.mp3\nBlue Silence - Jenova (Illitheas Remix) (Cut From Blue Silence Set)-enTc.mp3\nBluefeld - One Little Wish (Cut From Shah Set)-enTc.mp3\nBluEye - Night Lights (E.T Project Remix) (Cut From Blue Silence Set)-enTc.mp3\nBT - Vervoeren (Original Mix) (Cut From BT Set)-enTc.mp3\nCarl Crellin &amp; Mark S - Aspire (John Doppping Implication) (Cut From Trainer Set)-enTc.mp3\nChris Hampshire - 94 (Manuel Le Saux Remix) (Cut From Stowers Set)-enTc.mp3\nChristopher Vassilakis - Turquoise (Cut From Basil Set)-enTc.mp3\nChuckie vs Dzeko &amp; Torres - Down To This (Cut From W&amp;W Set)-enTc.mp3\nCraig Wilson - Creations (Cut From Kirkwood Set)-enTc.mp3\nCryostate - If Only (Extended Mix) (Cut From Del Mar Set)-enTc.mp3\nDaga - Riviera (Cut From Ruben Set)-enTc.mp3\nDarren Porter &amp; Gareth Weston - First Contact (Original Mix) (Cut From Saux Set)-enTc.mp3\nDavid Sonido - Thought Is Everything (Color Ray Remix) (Cut From Probity Set)-enTc.mp3\nDavide Catania - Forbidden Love (A. Galchenko Remix) (Cut From Datt Set)-enTc.mp3\nDean Zone - In the Absence (ZedFX Remix) (Cut From Ekman Set)-enTc.mp3\nDeathmind &amp; Choval - The Core (Estigma Remix) (Cut From Estigma Set)-enTc.mp3\nDeathmind &amp; Choval - The Core (Estigma Remix) (Cut From Vale Set)-enTc.mp3\nDerek Ryan &amp; Melissa Lin feat. Charmy - Gravity (Mike Saint-Jules Remix) (Cut From Lange Set)-enTc.mp3\nDerek Ryan &amp; Melissa Lin feat. Charmy - Gravity (Original Mix) (Cut From Tempo Set)-enTc.mp3\nDezza - Sistiana (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nDJ Feel Feat. Aelyn - UNTITLED (Cut From Feel Set)-enTc.mp3\nDJ Madwave - Vooteta (Original Mix) (Set Rip)-enTc.mp3\nDJ T.H. - Dancing In Chinatown (MilamDo pres. Harmonic Rush Remix) (Cut From A&amp;F Set)-enTc.mp3\nDJ Th - Dancing In Chinatown (Milamdo Pres Harmonic Rush Remix) (Cut From Del Mar Set)-enTc.mp3\nDragon &amp; Jontron with Lea Luna - Loud &amp; Proud (Original Mix) (Cut From MORPH Set)-enTc.mp3\nDreamy - Aiman (Amitacek Remix) (Cut From Amitacek Set)-enTc.mp3\nDreamy - Aiman (Ikerya Project Remix) (Cut From Above Clouds Set)-enTc.mp3\nDreamy feat. Magdalen Silvestra - As It Was Meant To Be (Darren Porter Remix) (Cut From Nadz Set)-enTc.mp3\nE.T Project - Northern Lights (Original Mix) (Cut From Shadows Set)-enTc.mp3\nEdu - On The Edge (Original Mix) (Cut From Shah Set)-enTc.mp3\nEDU feat. Natalie Gioia - You And Me (Arcalis Dark Mix) (Cut From Hiddenagenda Set)-enTc.mp3\nEleven.Five - Pinnacle (Intro Mix) (Cut From Shiver Set)-enTc.mp3","torrent":{"xt":"urn:btih:6fa804cad3a1cc249ebe3dac1eae92ed2c1548a8","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+25th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fa804cad3a1cc249ebe3dac1eae92ed2c1548a8","infoHashBuffer":{"type":"Buffer","data":[111,168,4,202,211,161,204,36,158,190,61,172,30,174,146,237,44,21,72,168]},"announce":[],"urlList":[]}}