{"title":"Coast To Coast AM 10-29-2014 - Horror Films - Hauntings &amp; Sp","uid":11330989,"size":54718275,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6fdf4981aefc9427057d2d355b348e999d98ef1d&amp;dn=Coast+To+Coast+AM+10-29-2014+-+Horror+Films+-+Hauntings+%26amp%3B+Sp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Isaac09","files":-1,"time":1414678982,"description":"Horror Films/ Hauntings &amp; Spirit Communications\n\n\nDate:\t10-29-14\nHost:\tGeorge Noory\nGuests:\tMr. Lobo, Rosemary Ellen Guiley\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 32mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 52.2 MiB (100%)\n\n\nIn the first half, Mr. Lobo, the host of Cinema Insomnia, the nationally syndicated show seen in over 30 television markets, discussed some of the best films in the horror genre, trends in the industry, why we're fascinated with different types of monsters, and the wacky world of horror hosting. The 1930s were the golden age of horror films, he said, and a couple of his favorites from that era are Son of Frankenstein and The Invisible Man. From the 1950s, he likes the films of Jack Arnold, who directed such movies as &quot;The Creature from the Black Lagoon,&quot; and The Incredible Shrinking Man, &quot;which I think is a wonderful metaphor for anyone who feels like they're losing their identity,&quot; he commented. A trend we're seeing nowadays are horror films aimed at a young female audience with money-making properties like the Twilight series, he added.\n\nThe popularity of zombies is also noteworthy-- they are an enemy we can universally destroy and not have feelings about it, and also represent how people have become mindless and controlled by their gadgets, he shared. For someone looking to break into the ranks of horror hosts, such as Mr. Lobo, Dr. Morgus, and Elvira, there are many public domain films that can be shown without royalties, he pointed out. Mr. Lobo also runs the online Horror Host Magazine, and creates a variety of videos like &quot;In Spite of Reality&quot; (view promo).\n\n-------------------------------------\nIn the latter half, author and leading expert on the paranormal, Rosemary Ellen Guiley, detailed the physical manifestations of hauntings, her research into entities like Shadow People, and stories of spirit communications involving objects such as Ouija boards. &quot;One of the surprising causes of hauntings are the living themselves,&quot; she revealed. Certain people seem to have a connection to the spirit world-- &quot;it's like they're a beacon,&quot; and if they go to a place that has the right energy, history, or residue-- &quot;they can actually light things up and have hauntings,&quot; she continued. Interestingly, objects, and dolls in particular, can become haunted; they can acquire spirit energy that's invested into them by their previous owner if they were highly attached to them, she explained.\n\nShe investigated a case of teenage girls who were interested in vampires and contacted entities via the Ouija board, who identified themselves as &quot;Devon and the Vampire Choir.&quot; The initial contacts were entertaining and the girls became obsessed with the board. Later the spirits became more manipulative and eventually attached themselves to the girls, even when they weren't using the board, Guiley recounted. She also spoke about the Black-Eyed Children phenomenon, which she related to earlier entity contacts with dark figures such as the Djinn or demons. &quot;These are trickster entities who seem to come up with new forms,&quot; she added.\n\nNews segment guests: Dr. John McDougall, Robert Zimmerman","torrent":{"xt":"urn:btih:6fdf4981aefc9427057d2d355b348e999d98ef1d","amp;dn":"Coast+To+Coast+AM+10-29-2014+-+Horror+Films+-+Hauntings+%26amp%3B+Sp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fdf4981aefc9427057d2d355b348e999d98ef1d","infoHashBuffer":{"type":"Buffer","data":[111,223,73,129,174,252,148,39,5,125,45,53,91,52,142,153,157,152,239,29]},"announce":[],"urlList":[]}}