{"title":"[PS2]Giren no Yabou Axis no Kyoui V (iso)","uid":11578546,"size":1205261095,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7069bf88c123b3ff3946ca3089b8630e64b6527c&amp;dn=%5BPS2%5DGiren+no+Yabou+Axis+no+Kyoui+V+%28iso%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jdhthegr8","files":-1,"time":1417104341,"description":"Kidou Senshi Gundam: Giren no Yabou - Axis no Kyoui V is a Strategy game, developed by Bec and published by Bandai Namco Games, which was released in Japan in 2009.\n\nFrom Wikipedia-\n\n&quot;The game's graphics are rendered in 2.5D. Also, unlike its predecessor 'War Of Independence', the game features conflicts from the One Year War (including the events of MS IGLOO) to Mobile Suit Zeta Gundam (with some events that occurred during the spinoff manga Advance of Z: Flag of Titans), Mobile Suit Gundam ZZ, and the events that take place during Mobile Suit Gundam: Char's Counterattack and Mobile Suit Gundam: Hathaway's Flash. Factions featured in &quot;Blood of Zeon&quot; also make an appearance (Federation, Zeon, AEUG, Titans, Axis forces), both the first and second Neo Zeon movements. Garma's &quot;Zeon Reborn&quot; and Kycillia's &quot;Legitimate Zeon&quot; (previously unique to Blood of Zeon) are also available. a noteworthy trait of the game is it featuring nearly every Gundam protagonist and antagonist that piloted a mobile suit or was on board a battleship. Features include 2 new difficulties, &quot;Very Easy&quot; and &quot;Special&quot;. This game was re-released as an expansion entitled Gihren's Ambition: The Menace of Axis V, featuring new characters, Mobile Suits, and a bonus faction, the Tem Ray Army. It was made available on the PlayStation 2 as well as the PlayStation Portable.\n\nAccording to an interview with Norihiko Ushimura, Game Producer of the series, mobile suits from MS IGLOO, Harmony Of Gundam and Mobile Suit Variation are featured; there are said to be roughly 400 MS/MA featured in this version of the video game. Event scenes, however, do not have animation: instead there are more than 400 still scenes created in collaboration with Sunrise to represent important events as portrayed in previous titles.&quot;\n\nnote from jdhthegr8- Hey guys, another upload here! This is the PS2 port of Gihren's Greed Threat of Axis V, a game which originally was released for PSP. I'd had this one for a while but for the past several years it had only been available as a single torrent spread across multiple sites under a sketchy name. After finally obtaining and testing it to see that it worked, I'm reupping it here. Use any unzipper or archive manager to open it and retrieve the iso\n\nHere's a translated version of the trailer for the PSP version","torrent":{"xt":"urn:btih:7069bf88c123b3ff3946ca3089b8630e64b6527c","amp;dn":"%5BPS2%5DGiren+no+Yabou+Axis+no+Kyoui+V+%28iso%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7069bf88c123b3ff3946ca3089b8630e64b6527c","infoHashBuffer":{"type":"Buffer","data":[112,105,191,136,193,35,179,255,57,70,202,48,137,184,99,14,100,182,82,124]},"announce":[],"urlList":[]}}