{"title":"Talking Heads - Stay Up Late [promo].VOB","uid":8742068,"size":270592000,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:70a4f1ece259c1cc6f8d8fa48f99447897e187e7&amp;dn=Talking+Heads+-+Stay+Up+Late+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1374815096,"description":"Talking Heads - Stay Up Late [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Stay Up Late&quot; is a song from  Little Creatures, the sixth album by Talking Heads, released in 1985. The album examined themes of Americana and incorporated elements of country music, with many songs featuring the steel guitar. It was voted as the best album of the year in The Village Voice Pazz &amp; Jop critics poll and is the band's biggest-selling studio album, with over two million copies sold in the US.\n\nThe cover art was created by outsider artist Howard Finster, and was selected as album cover of the year by Rolling Stone magazine.\n\nIn 2005, it was re-released and remastered by Warner Music Group on their Warner Bros./Sire Records/Rhino Records labels in DualDisc format, with three bonus tracks on the CD side (early versions of &quot;Road To Nowhere&quot; and &quot;And She Was&quot; and an extended mix of &quot;Television Man&quot;). The DVD-Audio side includes both stereo and 5.1 surround high resolution (96 kHz/24bit) mixes, as well as a Dolby Digital version and the videos of &quot;And She Was&quot; and &quot;Road to Nowhere.&quot; In Europe, it was released as a CD+DVDA two disc set rather than a single DualDisc. The reissue was produced by Andy Zax with Talking Heads.\n\nTalking Heads were an American new wave and avant-garde band formed in 1975 in New York City and active until 1991. The band comprised David Byrne (lead vocals and guitar), Chris Frantz (drums and backing vocals), Tina Weymouth (bass and backing vocals) and Jerry Harrison (keyboards, guitar, and backing vocals). Auxiliary musicians also regularly made appearances in concert and on the group's albums. The new wave style of Talking Heads combined elements of punk rock, art rock, avant-garde, pop, funk, world music, and Americana. Frontman and songwriter David Byrne contributed whimsical, esoteric lyrics to the band's songs, and emphasized their showmanship through various multimedia projects and performances.\n\nCritic Stephen Thomas Erlewine describes Talking Heads as being &quot;one of the most critically acclaimed bands of the '80s, while managing to earn several pop hits.&quot; In 2002, the band was inducted into the Rock and Roll Hall of Fame. Four of the band's albums appeared on Rolling Stone magazine's 2003 list of the 500 Greatest Albums of All Time, and the Channel 4 100 Greatest Albums poll listed one album (Fear of Music) at number 76. On a 2011 update of Rolling Stone's &quot;100 Greatest Artists of All Time&quot;, the band was ranked at No. 100.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Little_Creatures_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Little_Creatures_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/jaNCmAaEP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jaNCmAaEP&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:44\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:70a4f1ece259c1cc6f8d8fa48f99447897e187e7","amp;dn":"Talking+Heads+-+Stay+Up+Late+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a4f1ece259c1cc6f8d8fa48f99447897e187e7","infoHashBuffer":{"type":"Buffer","data":[112,164,241,236,226,89,193,204,111,141,143,164,143,153,68,120,151,225,135,231]},"announce":[],"urlList":[]}}