{"title":"Hack.Slash.Loot.v8-RAiN","uid":8733613,"size":6724072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:720139c313a83dd2e2151f4c4ae4f83dd6c968d0&amp;dn=Hack.Slash.Loot.v8-RAiN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IAmsoICan","files":4,"time":1374645735,"description":"There are dark places in the world inhabited by evil denizens. Places filled with danger and foreboding where no ordinary man would dare to journey. However, there are a few who are willing to risk death in the name of good, in the name of justice, in the name of.. valuable loot!\n\nHack, Slash, Loot(HSL) is a single-player turn-based dungeon crawler for Windows, MacOS, and Linux. Take control of a lone hero and explore sprawling dungeons, fight dangerous monsters, and most importantly, plunder valuable treasures.\n\nHSL features thousands of items, monsters, and dungeon features, and with a new dungeon created every game you can be sure that no two plays will ever be the same. Boasting easy to master controls you'll be adventuring in no time, but there is still enough depth to challenge the most hardened of adventurers.\n\nThe full game features 32 playable characters, six quests, and the ability to add more characters and quests when they are released. One purchase will get you the Windows, MacOS, and Linux versions of the game downloadable right away. HSL is 100% DRM free, and 100% region free.\n &lt;a href=&quot;\nhttp://hackslashloot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hackslashloot.com/&lt;/a&gt;\n\nEnglish language, no installastion needed, just extract and start the game.\n\nThere are no system requirements on the website, but i guess every pc that is arround 10 years old or younger will work.\n\nFor those wondering about the weird compression that its used this is the original scene rls, it was listed in o day, there its normal that it is zipped and in the zip files there are again rar files.\n\nthe official scene rules say, that 0day stuff has to be zipped and not to be rared, so most of the stuff is zipped but in the zipped also rared.\n\nI know its retarded but as i said before i prefer to upload scene releases untouched.\n","torrent":{"xt":"urn:btih:720139c313a83dd2e2151f4c4ae4f83dd6c968d0","amp;dn":"Hack.Slash.Loot.v8-RAiN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"720139c313a83dd2e2151f4c4ae4f83dd6c968d0","infoHashBuffer":{"type":"Buffer","data":[114,1,57,195,19,168,61,210,226,21,31,76,74,228,248,61,214,201,104,208]},"announce":[],"urlList":[]}}