{"title":"Le serpent cosmique, l'ADN et les origines du savoir","uid":6666154,"size":12598304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:723b7af2d02bacadde908e3bb9baa7911d726ca2&amp;dn=Le+serpent+cosmique%2C+l%5C%27ADN+et+les+origines+du+savoir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":2,"time":1315689534,"description":"Depuis le XIXe siÃƒÂ¨cle et le grand dÃƒÂ©veloppement de la science occidentale, la pensÃƒÂ©e des peuples indigÃƒÂ¨nes semble sans rapport avec les connaissances apportÃƒÂ©es par les sciences modernes en biologie, chimie et mÃƒÂ©decine. cependant, de grands auteurs, et parmi eux Mircea Eliade, nous ont fait entrevoir que les cultures autres que celles de la pensÃƒÂ©e rationnelle ÃƒÂ©taient arrivÃƒÂ©es ÃƒÂ  un niveau de connaissance - exprimÃƒÂ©e le plus souvent dans le langage du symbolisme mythologique - par des moyens ÃƒÂ  nos yeux mystÃƒÂ©rieux, sans relation avec leur niveau de technologie.\n\n&quot;La premiÃƒÂ¨re fois qu'un homme ashaninca m'a dit que les propriÃƒÂ©tÃƒÂ©s mÃƒÂ©dicinales des plantes s'apprenaient en absorbant une mixture hallucinogÃƒÂ¨ne, j'ai cru qu'il s'agissait d'une plaisanterie.&quot;. Un anthropologue ÃƒÂ©tudiant l'ÃƒÂ©cologie d'un peuple indigÃƒÂ¨ne de l'Amazonie pÃƒÂ©ruvienne se trouve confrontÃƒÂ© ÃƒÂ  une ÃƒÂ©nigme : les Indiens, dont les connaissances botaniques sont admirÃƒÂ©es par les scientifiques, lui expliquent invariablement que leur savoir provient des hallucinations induites par certaines plantes. Dans une enquÃƒÂªte qui s'ÃƒÂ©tale sur dix ans, de la forÃƒÂªt amazonienne aux bibliothÃƒÂ¨ques d'Europe, il rÃƒÂ©unit suffisamment d'indices pour ÃƒÂªtre convaincu que la rÃƒÂ©ponse ÃƒÂ  l'ÃƒÂ©nigme se trouve dans l'ADN, la molÃƒÂ©cule de vie prÃƒÂ©sente dans chaque cellule de chaque ÃƒÂªtre vivant. Son hypothÃƒÂ¨se ouvre de nouvelles perspectives sur la biologie, le savoir des peuples indigÃƒÂ¨nes, l'anthropologie et les limites du rationalisme.\n\nCe livre, dÃƒÂ©jÃƒÂ  traduit en onze langues, n'a cessÃƒÂ© depuis sa parution d'intriguer le monde scientifique. Et si l'hypothÃƒÂ¨se de Jeremy Narby venait ÃƒÂ  se vÃƒÂ©rifier ? Elle bouleverserait tout simplement notre vision du monde !\n\nJeremy Narby est docteur en anthropologie de l'UniversitÃƒÂ© de Stanford. Il travaille pour l'organisation d'entraide &quot;Nouvelle planÃƒÂ¨te&quot; en temps que coordinateur de projet amazonien. Il vit actuellement en Suisse et donne de nombreuses confÃƒÂ©rences ÃƒÂ  travers le monde pour dÃƒÂ©fendre la cause amazonienne et une vision de l'anthropologie du XXIe siÃƒÂ¨cle.","torrent":{"xt":"urn:btih:723b7af2d02bacadde908e3bb9baa7911d726ca2","amp;dn":"Le+serpent+cosmique%2C+l%5C%27ADN+et+les+origines+du+savoir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723b7af2d02bacadde908e3bb9baa7911d726ca2","infoHashBuffer":{"type":"Buffer","data":[114,59,122,242,208,43,172,173,222,144,142,59,185,186,167,145,29,114,108,162]},"announce":[],"urlList":[]}}