{"title":"T-Model Ford - The Ladies Man (blues)(flac)[rogercc]","uid":6883244,"size":286636668,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:729b3726bd7717b23708cd08dde27f6af7204731&amp;dn=T-Model+Ford+-+The+Ladies+Man+%28blues%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":14,"time":1323722611,"description":"T MODEL FORD THE LADIES MAN\nLabel: Alive Sounds\nReleased: 2010\nFormat:Flac\n\nOn January 12, 2010 Alive Naturalsound Records released The Ladies Man, the 7th album from Delta bluesman T-Model Ford. Recorded live during one afternoon session at the Planet Paul Recording Studio in Wichita, Kansas the album features Ford and his acoustic guitar bangin' away on song after song as a group of younger backing musicians attempt to keep up. For the blues purists among our readers, the raw energy of The Ladies Man was created with no overdubs, minimal mixing, and a little Jack Daniels from the flask that 'T' is known to carry with him everywhere!\nBorn James Lewis Carter Ford sometime during the 1920s in Greenville, Mississippi - 'T' claims that he's 88 years old while his driver's license says that he's 84 years old - the singer and guitarist began his blues career when he was in his 70s, recording his debut album Pee-Wee Get My Gun for Fat Possum Records in 1997.\nInspired by bluesmen like Muddy Waters and John Lee Hooker, Ford's unique take on the music is an inspired mix of rough-n-tumble, Delta-born juke-joint jams and stripped-down Chicago style blues. On many of his previous recordings, Ford and his electric guitar was backed only by drummer Spam (Tommy Lee Miles), the duo spinning a mesmerizing and rhythmic sound that packed a visceral emotional punch.\nDuring his lengthy life, Ford has lived the blues as well as sung about them...he's worked in sawmills and logging camps, driven a truck and experienced more than his share of run-ins with &quot;Johnny Law.&quot; Ford would be the first to tell you that he's a bad mother...and he brings a sense of menace to his music that few bluesman can muster.\n\nTracklist:\n\n01. Chicken Head Man\n02. Two Trains\n03. I'm Coming To Kick Yer Asses\n04. I Love You Baby\n05. 44 Blues\n06. Sallie Mae\n07. My Babe\n08. I Was Born In A Swamp\n09. That's Alright\n10. Love Me All Night Long\n11. Hip Shaking Woman\n","torrent":{"xt":"urn:btih:729b3726bd7717b23708cd08dde27f6af7204731","amp;dn":"T-Model+Ford+-+The+Ladies+Man+%28blues%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729b3726bd7717b23708cd08dde27f6af7204731","infoHashBuffer":{"type":"Buffer","data":[114,155,55,38,189,119,23,178,55,8,205,8,221,226,127,106,247,32,71,49]},"announce":[],"urlList":[]}}