{"title":"Brown-Stellar Theology&amp;Masonic Astronomy(1882)","uid":4535220,"size":2710049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72cd2960f05808e5c4c03cea3d62a3b84d614f4e&amp;dn=Brown-Stellar+Theology%26Masonic+Astronomy%281882%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227713998,"description":"This is Robert Hewitt Brown&amp;#039;s rare and mindblowing book Stellar Theology and Masonic Astronomy (1882) which blatantly reveals the hidden meanings behind occult signs and symbols from ancient times which were carried over into our modern world forming what should be termed stellar theology or astrotheology. Although published over 100 years ago it is still of the most concise and on point books about astrology, numerology, esoteric sciences and the like. Profusely illustrated so much so the illiterate and semi literate can still benefit from it&amp;#039;s lights and rights. The author was himself a mason and in this amazing book he reveals how Freemasonry is connected to Judaism, Christianity and the Bible. Brown explores the world&amp;#039;s legends, emblems and symbols and how they were all connected to ancient astronomical systems. Lastly, he shows what the ancients knew about astronomy and how it became incorporated into the various religions of the world. Today we see those symbols not only on religious buildings but also on corporate logos as corporatism has become the ultimate religion of today with many of its managers as members of modern secret societies. Stellar Theology and Mansonic Astronomy is certainly an important work for understanding archaeoastronomy in masonry or religion and provides the reader with an excellent resource for studying the ancient mysteries which eventually developed into major religions of this world - with all the bloodshed and suffering which eventually followed to this very day with no end in sight. This 1997 reprint contains an excellent introduction by world-famous scholar of the occult Jordan Maxwell. 255 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:72cd2960f05808e5c4c03cea3d62a3b84d614f4e","amp;dn":"Brown-Stellar+Theology%26Masonic+Astronomy%281882%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72cd2960f05808e5c4c03cea3d62a3b84d614f4e","infoHashBuffer":{"type":"Buffer","data":[114,205,41,96,240,88,8,229,196,192,60,234,61,98,163,184,77,97,79,78]},"announce":[],"urlList":[]}}