{"title":"Steve Coleman - The Tao of Mad Phat [FLAC] TQMP","uid":6335154,"size":499654023,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:72ce7642886d9bdc9b34c1051d73b9ede1f55264&amp;dn=Steve+Coleman+-+The+Tao+of+Mad+Phat+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ousabd","files":17,"time":1303431666,"description":"Steve Coleman &amp; Five Elements - The Tao of Mad Phat\n1993\n\n\n\nREVIEW (by Don Snowden on allmusic.com)\n &lt;a href=&quot; http://www.allmusic.com/album/the-tao-of-mad-phat-fringe-zones-r190725/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-tao-of-mad-phat-fringe-zones-r190725/review&lt;/a&gt;\n\nSteve Coleman's achievement in creating a musical environment for serious improvising that sets aside acoustic, swing-based rhythms for electric, funk-influenced ones that don't fall prey to repetitive fusion formulas is one of the great creative accomplishments in jazz over the last 20 years. The Tao of Mad Phat, recorded live in the studio before a small invited audience in an attempt to capture the looseness and ambience of the Five Elements' live performances, may be the ideal entry point to sampling that criminally underrated feat. Coleman's studio recordings with the Five Elements are impressive but sometimes suffer from a daunting density that disappears here, largely thanks to drummer Gene Lake. His licks provide the springy, more-bounce-to-the-ounce launching pad that is essential for a group that improvises off rhythmic impulses more than chord cues. At times (&quot;Incantation&quot;), the groove sounds something like the Meters' drums-bass tandem of Ziggy Modeliste and George Porter stretching out jazz-wise while guitarist David Gilmore and keyboard player Andy Milne adroitly tackle the tough task of fitting in their lines without cluttering things up. The Tao of Mad Phat isn't 100 percent live, since the tracks fade in and out and were recorded at three different sessions. The title track works off a downward chord progression and stark, spare improvising from the rhythm, and &quot;Alt-Shift-Return&quot; very effectively works the same slippery terrain. The &quot;Collective Meditations I&quot; suite is really one 13-minute piece with different sections that's the closest thing to straight post-bop jazz blowing here. &quot;Laid Back Schematics&quot; may be the most striking track since Coleman teaches the bandmembers the rhythm for their parts as they play -- it shows the method behind the music as the guitar and electric bass incrementally change their lines to nail down the groove. &quot;Polymad Nomads&quot; expands the group to a ten-piece, including trumpeter Roy Hargrove and trombonist Josh Roseman, and it's simply outstanding -- ten and a half minutes of musical bobbing and weaving, floating and stinging that's grounded and soaring all at once and fades out long before you're ready for it to end. &quot;Little Girl on Fire&quot; starts off almost mainstream melodic with Coleman's alto soloing with Milne and then gradually, organically, shifts over to the Five Elements' funky, thumb-pop bass norm. And the very organic quality of the music on The Tao of Mad Phat is the true measure of how successfully Coleman and his collaborators have extended the tradition in innovative new directions grounded in modern rhythms.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nTRACK LIST\n\n01. The Tao Of Mad Phat (15:29) \n02. Alt-Shift-Return (07:10)\nCollective Meditations I: \n\t03. Changing Of The Guard (03:56) \n\t04. Guards On The Train (03:04) \n\t05. Relax Your Guard (00:39) \n\t06. All The Guards There Are (02:10) \n\t07. Enter The Rhythm (People) (04:04)\n08. Incantation (03:56) \n09. Laid Back Schematics (08:15) \n10. Polymad Nomads (10:36)\n11. Little Girl On Fire (16:31)\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nPERSONNEL\nSteve Coleman (alto sax, vocals)\nAndy Milne (keyboards)\nDavid Gilmore (guitar)\nReggie Washington (bass guitar)\nGene Lake (drums)\n\nSpecial guests:\nRoy Hargrove (trumpet)\nJosh Roseman (trombone)\nMatthew Garrison (bass guitar)\nKenny Davis (acoustic bass)\nJunior Wedderburn (percussion)\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nOFFICIAL WEBSITE (album page on Steve Coleman's website)\n &lt;a href=&quot; http://www.m-base.com/taobio.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.m-base.com/taobio.html&lt;/a&gt;\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nArtwork included.\n","torrent":{"xt":"urn:btih:72ce7642886d9bdc9b34c1051d73b9ede1f55264","amp;dn":"Steve+Coleman+-+The+Tao+of+Mad+Phat+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ce7642886d9bdc9b34c1051d73b9ede1f55264","infoHashBuffer":{"type":"Buffer","data":[114,206,118,66,136,109,155,220,155,52,193,5,29,115,185,237,225,245,82,100]},"announce":[],"urlList":[]}}