{"title":"Princess of the Sun - Norsk Tale","uid":8349363,"size":777282398,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:746bded12cac3bd8892081500fa0ac14902a6156&amp;dn=Princess+of+the+Sun+-+Norsk+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"indium_x","files":-1,"time":1365286275,"description":"------------------\n\nXviD - AC3\n\n-------------------\n\nThis riveting cartoon animated work-of-art made in France and set in the fascinating ancient Egyptian era is clearly destined to entertain all those who take the time to settle down and watch it. Its high-quality animation that almost stands in for real actors mixed with a powerful impact on a cinema screen the portrayed magnificent aeon will seem far more wondrous than just the mindless chatter of a dull history teacher.\n\nThe story sets off on a rather unexciting note when a playful princess and an irritable prince are suddenly ordered by their royal old-fashioned parents to be wed. From the moment they meet they can both see that this union was not meant to be, but neither the prince's mother nor the princess' father the Pharaoh will see reason. That night the ever-determined princess flees her kingdom and embarks on an epic journey to the city of Thebes in the hope of finding her mother the Queen who was driven away by the Pharaoh's infuriating obsession with the god of the sun Aten. The palace guards mistake her flight for a kidnapping engineered by the prince and so he has no choice but to join her.","torrent":{"xt":"urn:btih:746bded12cac3bd8892081500fa0ac14902a6156","amp;dn":"Princess+of+the+Sun+-+Norsk+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746bded12cac3bd8892081500fa0ac14902a6156","infoHashBuffer":{"type":"Buffer","data":[116,107,222,209,44,172,59,216,137,32,129,80,15,160,172,20,144,42,97,86]},"announce":[],"urlList":[]}}