{"title":"EnigmaT Set Rips { Cuts } - April 30th, 2014","uid":10095022,"size":805884475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:748b3bd52b381847f3cc039ccc80e4165b651576&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+30th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":101,"time":1399267766,"description":"Above &amp; Beyond &amp; Andy Moor - Air For Life (Rob Corbo Remix) (Cut From A&amp;F Set)-enTc\nAbstract Vision &amp; Main Gain - Freedom (Cut From A&amp;F Set)-enTc\nAdukuf - Dolphin (Hiroki Nagamine Uplifting Mix) (Cut From Space Garden Set)-enTc\nAirborn - Virage (Amos &amp; Riot Night Remix) (Cut From Suzy Set)-enTc\nAlex Shore - Frisson (Original Mix) (Cut From Del Mar Set)-enTc\nAlexander Epifanov - Light Forces (Cut From M.PRAVDA Set)-enTc\nAlexandre Bergheau - Symptom (Cut From W&amp;W Set)-enTc\nAlvaro - Shades (twoloud Private Edit) (Cut From Tiesto Set)-enTc\nAndres Sanchez - Sunset at Kanye (Cut From A&amp;F Set)-enTc\nBassjackers &amp; MAKJ - Derp (Original Mix) (Cut From Halliwell Set)-enTc\nBastian Salbart - Krush (Cut From KvA Set)-enTc\nBen Gold - Depature (Cut From W&amp;W Set)-enTc\nBen Nicky feat. Chloe Stamp - Brave Heart (Johan Malmgren Remix) (Cut From Del Mar Set)-enTc\nBlumenkraft feat. Ramona Arena - Piya (Dashka Remix) (Cut From KvA Set)-enTc\nBT &amp; JES &amp; Fractal - Letting Go (Shant &amp; Clint Maximus Remix) (Cut From Del Mar Set)-enTc\nCesar Lugo - Your World (Original Mix) (Cut From Lugo Set)-enTc\nCharlie Darker - Watch Me Demonstrate (Cut From Page Set)-enTc\nColdplay - Magic (Sebastien Edit) (Cut From KvA Set)-enTc\nD-Wayne - X Ray Vision (Cut From Bolier Set)-enTc\nDan Royal - Spring (Cut From Wanrooy Set)-enTc\nDansson &amp; Marlon Hoffstadt - Shake That (Tom Staar Remix) (Cut From Tiesto Set)-enTc\nDarin Epsilon feat. Ghost Wars - All That Could Have Been (Matt Lange Remix) (Cut From KvA Set)-enTc\nDarkboy - Atkinsane (Liam Wilson Remix) (Cut From Wilson Set)-enTc\nDave Spoon - At Night (Phillip Estevez Remix) (Cut From Tasso Set)-enTc\nDimension - Vicus (Cut From Ferry Set)-enTc\nDoubleV - Lost Highway (Original Mix) (Cut From Del Mar Set)-enTc\nDustin Lenji &amp; Adinde - Zipper (Cut From W&amp;W Set)-enTc\nElectric Universe - Quasar (Cut From LEON Set)-enTc\nEllie Goulding - Goodness Gracious (Josh Butler Remix) (Cut From Meramek Set)-enTc\nELV - Mystery Love (Original Mix) (Cut From Fady&amp;Mina Set)-enTc\nFederation - These Six Words (Will Destroy You) (Cut From Fonarev Set)-enTc\nFher Vizzuet - Supernatural God (Marko LB Remix) (Cut From Lugo Set)-enTc\nFlatflex - Exoplanet (Cut From Pearl Set)-enTc\nGalantis - You (Still Young Remix) (Cut From W&amp;W Set)-enTc\nGalantis - You (Tiesto Remix) (Cut From Tritonal Set)-enTc\nHarmonic Rush - Head Rush (Original Mix) (Cut From Riel Set)-enTc\nHekmat - Arcamonia (Outer Space Remix) (Cut From A&amp;F Set)-enTc\nIce Upon Fire - Vesperales (Original Mix) (Cut From Tero A Set)-enTc\nIio - Rapture (Leon Bolier Remix) (Cut From Bolier Set)-enTc\nInnerlight feat. Adrian Martadinata - When We Fly (Original Mix) (Cut From Nugroho Set)-enTc\nJohn Mash - Matemorphosl (Dirkie Coetzee Remix) (Cut From Dinaire Set)-enTc\nJustin Oh - Pryizzapoppa (Cut From Ferry Set)-enTc\nLam.I - Ego Noise (Cut From Ashcome Set)-enTc\nLiam Shachar feat. Assy Sky - Want You Here (Cut From KvA Set)-enTc\nLiam Wilson - Escarpins (Original Mix) (Cut From Wilson Set)-enTc\nLost Witness feat. Tiff Lacey - Love Again (Another World Vocal Mix) (Cut From Suzy Set)-enTc\nLouis Tan - Never Ending Highway (ASOT 658 Rip)-enTc\nLuke Terry - Ice Cap (Original Mix) (Cut From Wilson Set)-enTc\nM83 feat. Susanne Sundfor - Oblivion (Cut From Ercole Set)-enTc\nMaria Healy - Atlantis Calling (Original Mix) (Cut From Riel Set)-enTc\nMariah Carey - You're Mine (Our Love Would Never End) (Veselin Tasev Remix) (Set Rip)-enTc\nMartin Garrix - Proxy (Bumer Ax-Synth Intro Edit) (Cut From Xabi Set)-enTc\nMiguel Verdolva - O Superman (Daddy's Groove &amp; Cryogenix Remix) (Cut From Tiesto Set)-enTc\nMike Nichol - Can't Deny It (Cut From Brandt Set)-enTc\nMoguai - Aciiid (Cut From Tiesto Set)-enTc\nMonoverse - Forsaken (Original Mix) (Cut From Riel Set)-enTc\nMoonsouls - If I Still Believe (Cut From A&amp;F Set)-enTc\nNick Callan - Velocity (Cut From KvA Set)-enTc\nNiko Pavlidis feat. Zoya - Lost &amp; Found (Original Mix) (Cut From Del Mar Set)-enTc\nNitro Fun - Cheat Codes (Cut From Page Set)-enTc\nOne Republic - If I lose Myself (Digital Junkiez &amp; Jason Ross Bootleg) (Cut From Steve Brain Set)-enTc\nPaul Di White &amp; Alex Blest - Northern Light (Original Mix) (Cut From Indayo Set)-enTc\nPaul Webster - Corruption (ID Remix) (Cut From Wilson Set)-enTc\nQBass featuring Tawar - Kiss My Soul (Shipops Remix) (Cut From McKnight Set)-enTc\nRaddle B - Like You (Dedicated to Diana Pascal) (Cut From Sty Set)-enTc\nRave CHannel &amp; Serdar Grey - Crimea (Original Mix) (Cut From Steve Brian Set)-enTc\nRene Ablaze &amp; AxelPolo - Contact (Mike van Fabio &amp; Araya Remix) (Cut From Saux Set)-enTc\nReOrder &amp; Darren Porter - ID (Original Mix) (Cut From ReOrder Set)-enTc\nRepow - Bamboo Rush (Cut From Xabi Set)-enTc\nSean Mathews - Morocco (Original Mix) (Cut From Saux Set)-enTc\nSergio Mauri - Camelot (Cut From W&amp;W Set)-enTc\nSi Whelan - Offset (Oiginal Mix) (Cut From Saux Set)-enTc\nSick Individuals - Rock &amp; Rave (Cut From W&amp;W Set)-enTc\nSick Individuals - Rock and Rave (Cut From Page Set)-enTc\nSimon De Jano &amp; Bottai - Delorean (Cut From Xabi Set)-enTc\nSimon Patterson - Bulldozer (Sektor V Reconstruction) (Cut From Dinaire Set)-enTc\nSkipper &amp; Ruback - Jack Sparrow (Cut From Cogito Set)-enTc\nSoulero - Seconds Away (Cut From Smith Set)-enTc\nSoulu - Cirera (Stellar Crew Remix) (Cut From KvA Set)-enTc\nSouth Pole - Closer (Beatsole Remix) (Cut From Tero A Set)-enTc\nStarchaser &amp; Visserline feat. Lokka - Your Love Again (Star Night Remix) (Cut From Del Mar Set)-enTc\nSteve Brian pres. Mr Sander - Neno Itome (Cut From Brandt Set)-enTc\nSub Question - Aurora (Plutian Remix) (Cut From Haig Set)-enTc\nSunny Lax - Digital Generation (Cut From KvA Set)-enTc\nSuper8 &amp; Tab - Elektra (Dub Tek Remix) (Cut From Wilson Set)-enTc\nSwilow &amp; Diamans feat. Daniel Rise - L'avenir (Original Mix) (Cut From Suzy Set)-enTc\nTangle - Halycon (Cut From Tasso Set)-enTc\nTasso &amp; Daniel Skyver - Do You Copy (Original Mix) (Cut From OzzyXPM Set)-enTc\nTasso - L.R.H (Cut From Tasso Set)-enTc\nThe Disco Fries &amp; Loopers - Exposure (Cut From Page Set)-enTc\nThe Script - Break Even (Sied van Riel &amp; David Forbes Bootleg) (Cut From Riel Set)-enTc\nTiesto featuring Kirsty Hawkshaw - Just Be (Kris O'Neil Remix) (Cut From Wanrooy Set)-enTc\nTJR &amp; VINAI - Bounce Generation (Cut From Bolier Set)-enTc\nTom Moroca - Renaissance (Original Mix) (Cut From Halliwell Set)-enTc\nVato Gonzalez - B52 Riddim (Cut From W&amp;W Set)-enTc\nVINAI &amp; TJR - Bounce Generation (Cut From Xabi Set)-enTc\nVlind - Let it Out (Aizen Remix) (Cut From Lugo Set)-enTc\nWhyel - Ray Ban (Cut From Tiesto Set)-enTc\nWitness45 - Angel (Cut From A&amp;F Set)-enTc\nWolfpack &amp; BobbyPuma - Jump (Cut From W&amp;W Set)-enTc\nYppsilon - Tornado (Cut From Xabi Set)-enTc\n","torrent":{"xt":"urn:btih:748b3bd52b381847f3cc039ccc80e4165b651576","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+30th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"748b3bd52b381847f3cc039ccc80e4165b651576","infoHashBuffer":{"type":"Buffer","data":[116,139,59,213,43,56,24,71,243,204,3,156,204,128,228,22,91,101,21,118]},"announce":[],"urlList":[]}}