{"title":"A Crown Imperilled - Raymond E Feist","uid":7008946,"size":417970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74f682bb2ddeef509907cade47b408d7799ca367&amp;dn=A+Crown+Imperilled+-+Raymond+E+Feist+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fatboypj73","files":2,"time":1328368104,"description":"Books : Fantasy : English\n\nThe penultimate volume of the mighty Riftwar Cycle\n\nWar rages in Midkemia but behind the chaos there is disquieting evidence of dark forces at work.\n\nJim Dasher's usually infallible intelligence network has been cleverly dismantled; nowhere is safe. He feels that the world is coming apart at the seams and is helpless to protect his nation.\n\nQuiet palace coups are underway in Roldem and Rillanon; and King Gregory of the Isles has yet to produce an heir. In each kingdom a single petty noble has risen from obscurity to threaten the throne.\n\nLord Hal of Crydee and his great friend Ty Hawkins, champion swordsman of the Masters' Court, are entrusted with the task of smuggling Princess StephanÃƒÂ© and her lady-in-waiting, the lovely but mysterious Lady Gabriella, out of Roldem to a place of greater safety. But is there any safe haven to be found?\n\nMeanwhile, Hal's younger brothers Martin and Brendan are attempting to hold the strategic city of Ylith against an onslaught of Keshian Dog Soldiers, and a mysterious force from beneath the sea. The Kingdom might lose Crydee and recover; but if Ylith falls, all is lost.\n\nAn unknown player appears to be orchestrating these conflicts. Can Pug and the Conclave of Shadows track down this source before Midkemia is destroyed?","torrent":{"xt":"urn:btih:74f682bb2ddeef509907cade47b408d7799ca367","amp;dn":"A+Crown+Imperilled+-+Raymond+E+Feist+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74f682bb2ddeef509907cade47b408d7799ca367","infoHashBuffer":{"type":"Buffer","data":[116,246,130,187,45,222,239,80,153,7,202,222,71,180,8,215,121,156,163,103]},"announce":[],"urlList":[]}}