{"title":"Adobe_INDESIGN 4.0 CS2_Tryout_to_Full_Activation","uid":3652528,"size":156566850,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:75f6b388093d5f7e4c66fa7801b3101403113830&amp;dn=Adobe_INDESIGN+4.0+CS2_Tryout_to_Full_Activation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kostas34","files":1,"time":1175454987,"description":"Launched as a direct competitor to QuarkXPress, it initially had difficulty in converting users. In 2002 it was first to release a Mac OS X-native version. Also, InDesign CS and CS2 were bundled with Photoshop, Illustrator, and Acrobat in the Creative Suite. InDesign can export documents in Adobe&amp;#039;s Portable Document Format (PDF) and offers multilingual support that Quark users can get only by purchasing a much more expensive &quot;Passport&quot; version. InDesign was the first major DTP application to support Unicode for text processing, advanced typography of OpenType fonts, advanced transparency features, layout styles, and optical margin alignment. The cross-platform scriptability using JavaScript still sets it apart. Finally, it features tight integration and user interface.\n\nInDesign was positioned as a higher-end alternative and successor to Adobe&amp;#039;s own PageMaker. InDesign&amp;#039;s primary adopters are designers of periodical publications, posters, and other print media. Longer documents are often still designed with FrameMaker (manuals and technical documents) or QuarkXPress (books, catalogs). The combination of a relational database, InDesign and Adobe InCopy word processor, which uses the same formatting engine as InDesign, is the heart of dozens of publishing systems designed for newspapers, magazines, and other publishing environments.\n\nNew versions of the software introduced new file formats. To support the vast array of new features (particularly typographic features) introduced in InDesign CS, both the program and its document format were not backwards-compatible, initially upsetting some users. Fortunately, InDesign CS2 introduced the backwards-compatible InDesign Interchange (.inx) format, an XML-based representation of the document. Versions of InDesign CS updated with the 3.01 April 2005 update (available free from Adobe&amp;#039;s Web site) can read files saved from InDesign CS2 exported to this format. The InDesign Interchange format does not support versions earlier than InDesign CS.\n\nAdobe has developed InDesign CS3 (and the rest of Creative Suite 3) as a Universal binary for native Intel and PowerPC Mac compatibility and is expecting to ship InDesign CS3 by the end of April 2007. Because the Mac version of CS2 has code tightly integrated with the PPC architecture (not natively compatible with the Intel processors featured in Apple&amp;#039;s new machines), porting these products is a huge endeavor. Adobe decided to devote all its resources to developing CS3 (including integrating Macromedia products acquired in 2005) rather than recompiling CS2 and developing CS3 simultaneously. This decision has upset many Intel Mac early-adopters, especially since Adobe CEO Bruce Chizen initially announced &quot;Adobe will be first with a complete line of Universal applications.\n\nSource : Wikipedia","torrent":{"xt":"urn:btih:75f6b388093d5f7e4c66fa7801b3101403113830","amp;dn":"Adobe_INDESIGN+4.0+CS2_Tryout_to_Full_Activation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75f6b388093d5f7e4c66fa7801b3101403113830","infoHashBuffer":{"type":"Buffer","data":[117,246,179,136,9,61,95,126,76,102,250,120,1,179,16,20,3,17,56,48]},"announce":[],"urlList":[]}}