{"title":"Vikas Swarup - Slumdog Millionaire","uid":8779439,"size":464972688,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:763dce613bfcd911fc0fc48dca3224d26e65d61b&amp;dn=Vikas+Swarup+-+Slumdog+Millionaire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1375642663,"description":"Swarup's inventive debut traces the fortunes of Ram Mohammad Thomas from &quot;Asia's biggest slum&quot; to his sudden acquisition of enormous wealth as the biggest winner on the popular quiz show, Who Will Win a Billion? A poor, uneducated waiter, Ram is arrested after the final episode in the belief that he must have cheated. In jail he shares his hardscrabble life with his lawyer: his abandonment at birth in a used clothing bin, the church orphanage where he was dubbed an &quot;idiot orphan boy,&quot; the foster home where children were purposely crippled and forced to beg, the estate of an Australian diplomat who was really a spy, the home of an aging Bollywood actress, and his meager waiter job. Each chapter in Ram's life provided him with a correct answer on the show, as a la Forrest Gump, he has been in the right place at the right time. Ram's funny and poignant odyssey explores the causes of good and evil and illustrates how, with a little luck, the best man sometimes wins.\n\n'Slumdog Millionaire' is based on Vikas Swarup's bestseller 'Q and A', which only took Swarup two months to write! Read by Kerry Shale, this beautiful award winning audio communicates Vikas' words and narrative to life, allowing the listener to envisage the colour and vibrance of Mumbai and the hard hitting truth of poverty and struggle through the eyes of two young boys and the friends they make along the way. One of the boys comes through it all, knowledgable and determined by answering twelve questions correctly on a gameshow. Stunning an audience of millions, he draws on a store of street wisdom and trivia to provide him with the essential keys, not only to the quiz show, but to life itself.","torrent":{"xt":"urn:btih:763dce613bfcd911fc0fc48dca3224d26e65d61b","amp;dn":"Vikas+Swarup+-+Slumdog+Millionaire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"763dce613bfcd911fc0fc48dca3224d26e65d61b","infoHashBuffer":{"type":"Buffer","data":[118,61,206,97,59,252,217,17,252,15,196,141,202,50,36,210,110,101,214,27]},"announce":[],"urlList":[]}}