{"title":"Beyond Bio Technology","uid":8946100,"size":918948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76bc354953b6c4e04ef5d2cd538324ed460c78da&amp;dn=Beyond+Bio+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379781404,"description":"In 2001 the Human Genome Project announced that it had successfully mapped the entire genetic content of human DNA. Scientists, politicians, theologians, and pundits speculated about what would follow, conjuring everything from nightmare scenarios of state-controlled eugenics to the hope of engineering disease-resistant newborns. As with debates surrounding stem-cell research, the seemingly endless possibilities of genetic engineering will continue to influence public opinion and policy into the foreseeable future. Beyond Biotechnology: The Barren Promise of Genetic Engineering distinguishes between the hype and reality of this technology and explains the nuanced and delicate relationship between science and nature. Authors Craig Holdrege and Steve Talbott evaluate the current state of genetic science and examine its potential applications, particularly in agriculture and medicine, as well as the possible dangers. The authors show how the popular view of genetics does not include an understanding of the ways in which genes actually work together in organisms.","torrent":{"xt":"urn:btih:76bc354953b6c4e04ef5d2cd538324ed460c78da","amp;dn":"Beyond+Bio+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76bc354953b6c4e04ef5d2cd538324ed460c78da","infoHashBuffer":{"type":"Buffer","data":[118,188,53,73,83,182,196,224,78,245,210,205,83,131,36,237,70,12,120,218]},"announce":[],"urlList":[]}}