{"title":"Boxing Fitness - Clinton McKenzie 2013 [Epub] Ehhhh","uid":8733102,"size":6378794,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:774782ea5088b9924e89dbcb8ea5483102f0f9c3&amp;dn=Boxing+Fitness+-+Clinton+McKenzie+2013+%5BEpub%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374637005,"description":"\nOverview\nBoxing is well-known for its training regime, which produces some of the strongest, fittest athletes in the world. 'Boxing fitness', a recent development in personal fitness, has adapted elements of this training into a safe, enjoyable and effective workout. A non-contact discipline, it's fun and suitable for everyone.\n\nIn essence, it's a great cardiovascular workout that also helps develop strength, speed, co-ordination, balance and flexibility. In this book, two experts describe the techniques involved - a circuit that includes shadow boxing, skipping, punch bag and focus-pad work - and explain how a regime can be tailored to address each individual's fitness goals, whether it be weight loss, general toning, increased stamina or improved strength.\n\nThe unique structure of a boxing fitness session evokes the traditional\nboxing experience, adding an authentic touch to a modern exercise regime that's suitable for men and women, young and old. Whether you're a cross-training athlete or simply want to enjoy a great workout, this clear and well-illustrated guide will help you reach the top of your game.\n\n\n\nProduct Details\n\n    ISBN-13: 9781408196199\n    Publisher: Bloomsbury USA\n    Publication date: 6/30/2013\n    Sold by: Barnes &amp; Noble\n    Format: eBook\n    Edition number: 1\n\n\nMeet the Author\nClinton McKenzie represented the UK in the Light Welterweight division and fought 'Sugar Ray' Leonard at the 1976 Olympic Games in Montreal before turning professional. He works with schools, councils and prison - as well as with members of the public - to bring boxing fitness and its benefits into the mainstream.\n\nHilary Lissenden is a qualified fitness instructor who works with Clinton McKenzie on developing boxing fitness training programmes for a variety of fitness levels and age groups.\n","torrent":{"xt":"urn:btih:774782ea5088b9924e89dbcb8ea5483102f0f9c3","amp;dn":"Boxing+Fitness+-+Clinton+McKenzie+2013+%5BEpub%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"774782ea5088b9924e89dbcb8ea5483102f0f9c3","infoHashBuffer":{"type":"Buffer","data":[119,71,130,234,80,136,185,146,78,137,219,203,142,165,72,49,2,240,249,195]},"announce":[],"urlList":[]}}