{"title":"Savants maudits, chercheurs exclus - Volume 1","uid":13566642,"size":889493,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:775c68874e1155941880ee30140c26fedae3bd73&amp;dn=Savants+maudits%2C+chercheurs+exclus+-+Volume+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":2,"time":1455628588,"description":"Pierre Lance, &quot;Savants maudits, chercheurs exclus&quot;- Vol. 1\r\nPublisher : Guy trédaniel | 2005 | ISBN : 2844455727 | French | EPUB | 351 pages | 0.9 Mb\r\n\r\nPaul Kammerer - Biologiste autrichien, prouva l'hérédité des caractères acquis, encore niée aujourd'hui par les généticiens : &quot;suicidé&quot; par les nazis en 1926\r\n\r\nAntoine Béchamp - Professeur de chimie médicale, démontra contre Pasteur que bactéries et virus peuvent provenir de nos cellules et que l'asepsie des êtres vivants est inexistante\r\n\r\nJules Tissot - Professeur de physiologie, confirma les thèses de Béchamp par des photographies de cellules d'une étonnante précision\r\n\r\nRené Quinton - Découvrit l'identité chimique de notre sang et de l'eau de mer. Il fut mondialement célèbre en 1906 pour avoir sauvé du choléra des milliers d'enfants\r\n\r\nMarcel Ferru - Professeur de clinique médicale infantile, démontra l'inefficacité et la nocivité du vaccin BCG que la France est le seul pays européen à avoir rendu obligatoire\r\n\r\nEdgard Nazare - Ingénieur en aéronautique, inventa la &quot; centrale aérothermique &quot;, productrice d'électricité solaire, qu'il ne put faire accepter. Marcel Macaire - Docteur ès sciences, expliqua la distribution ordonnée de tous les corps célestes et nia les dogmes de l'expansion de l'univers\r\n\r\nRené Jacquier - Ingénieur chimiste, inventa un procédé d'oxygénation efficace contre de graves maladies, notamment cardiovasculaires. Invention méconnue\r\n\r\nAntoine Priore - Ingénieur électronicien, inventa une &quot;machine à guérir le cancer&quot; par un rayonnement de champs magnétiques. Invention méconnue\r\n\r\nJean Solomidès - Médecin, inventa des substances capables de détruire les cellules cancéreuses. Découverte ignorée malgré les preuves de son efficacité\r\n\r\nMirko Beljanski - Docteur ès sciences, créa des médicaments efficace contre le cancer mais ne put les faire agréer. Persécuté jusqu'à en mourir, pour avoir guéri &quot;illégalement&quot;\r\n\r\nLoïc Le Ribault - Docteur ès sciences, rénovateur de la police scientifique française, prouva l'efficacité thérapeutique du silicium organique, agréé à l'étranger, mais non en France. Poursuivi pour &quot;exercice illégal de la médecine&quot;","torrent":{"xt":"urn:btih:775c68874e1155941880ee30140c26fedae3bd73","amp;dn":"Savants+maudits%2C+chercheurs+exclus+-+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775c68874e1155941880ee30140c26fedae3bd73","infoHashBuffer":{"type":"Buffer","data":[119,92,104,135,78,17,85,148,24,128,238,48,20,12,38,254,218,227,189,115]},"announce":[],"urlList":[]}}