{"title":"Windows 10 Tracking Disable Tool","uid":12467374,"size":9306371,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:776b056dfd58a765246d03cbc8980f62b0a8b141&amp;dn=Windows+10+Tracking+Disable+Tool&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubberboy37","files":1,"time":1442870751,"description":"Disable all telemetry servoces with just one click!\n\n\nBack in late 2014, when Microsoft rolled out the first Windows 10 Technical Preview Builds, many accused the company of trying to spy on it's users, as it bundled some telemetry services in the operating system in order to better collect feedback to improve the final software.\n\nNeedless to say, that was never the case, and Redmond itself explained in the terms of services of the Windows Insider Program that such services were needed in order to improve Windows 10 based on the way we actually used the operating system.\n\nThe final version of Windows 10 stoll comes with come tracking features, and obviously, many disable them from the very beginning in seatch of better privacy, but fotunately fot these users, there's now a tool that takes care of everything with just one click.\n\n&quot;Hidden tracking services&quot;\n\nThis very litlle lightweight  app disables the tracking services in Windows 10 and also tweaks the registry in order to block any other processes from tracking your activities while using the operating system, as in addition to the features we can see and disable, there are also some hidden ones working in the background.\n\nThe program is meant for inexperienced users who don't want to have to fiddle with the registry and don't want to take the chance of messing up something. And no, most of it can't be disabled in the built-in-menu's, there are still some &quot;hidden ones&quot;.\n\nThe app needs administrator privileges to apply the changes and it can disable telemetry, tracking services, block tracking servers with HOSTS file and clear the DiagTrack log.\n\nIt works smoothly on all Windows 10 versions and above all, it's free","torrent":{"xt":"urn:btih:776b056dfd58a765246d03cbc8980f62b0a8b141","amp;dn":"Windows+10+Tracking+Disable+Tool","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"776b056dfd58a765246d03cbc8980f62b0a8b141","infoHashBuffer":{"type":"Buffer","data":[119,107,5,109,253,88,167,101,36,109,3,203,200,152,15,98,176,168,177,65]},"announce":[],"urlList":[]}}