{"title":"Dagmar Herzog - Brutality and Desire [2009][A]","uid":10004402,"size":2261883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77aa98f1b63c9c4bb09dc948f75659bfde546b8f&amp;dn=Dagmar+Herzog+-+Brutality+and+Desire+%5B2009%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1398034830,"description":"Description\nProduct Details\nBook Title: Brutality and Desire: War and Sexuality in Europe's Twentieth Century (Genders and Sexuality in History)\t\nBook Author: Dagmar Herzog (Editor)\nSeries: Genders and Sexuality in History\nHardcover: 256 pages\nPublisher: Palgrave Macmillan (January 6, 2009)\nLanguage: English\nISBN-10: 0230542530\nISBN-13: 978-0230542532\n-----------------------\nBook Description\nTracing sexual violence in Europes twentieth century from the Armenian genocide to Auschwitz and Algeria to Bosnia, this pathbreaking volume expands military history to include the realm of sexuality. Examining both stories of consensual romance and of intimate brutality, it also contributes significant new insights to the history of sexuality.\n-----------------------\nReviews\n'This wonderful book makes a powerful contribution to the history of Europe in the 20th century. With their complex and comparative treatment of wars -- from the Armenian genocide, to the Holocaust, colonization and decolonization, and the recent conflict in the Balkans -- these collected essays carefully historicize the meanings and modalities of sexualized violence and sexual desire. Together they brilliantly demonstrate the intimate and integral ties between the history of sexuality and the history of European war.' - Judith Surkis, Centre for European Studies, Harvard University, USA\n\n'Scholars and instructors from a broad range of disciplines (European history, military history, gender studies, imperialism, racism) will be grateful for this path-breaking collection of essays that analyze the complex intersections of sexuality and war from the Armenian genocide to the Balkan Wars of the 1990s. By focusing not only on sexual violence but also on desire and the consensual sexuality made possible by the dislocation and anonymity of war, the authors of this fine book also provide an important history of both female and male sexuality during Europe's bloody century.' - Maria Hohn, Vassar College, USA\n\n'Astonishing and unforgettable, this book is one of a kind. Its explorations into the taboo territory of sex and war span the 20th century, from Anatolia to Ethiopia, Auschwitz, Algeria, Bosnia-Herzegovina, and points between and beyond. These chapters are as remarkable for the deep particularity they exhibit in each case as for the powerful and urgently universal nature of the viciousness, pain, exhilaration, and desire they reveal. Dagmar Herzog has assembled a compelling, indeed, indisputable case for the inseparability of war and sex, in all their manifestations.' - Doris L. Bergen, University of Toronto, Canada\n\n'This history of sexuality risks a great deal. It confronts the issue of sexual violence -- against women, against men, and against children. It also takes on desire and love or, in any case, consensual relationships in times of war. The book succeeds and may serve as a model for further explorations because it is based on remarkably thorough research and on prudence as well as good judgment in making sense of sexuality in times of war.' - Michael Geyer, University of Chicago, USA\n-------------------------\nAbout the Author\nDAGMAR HERZOG is Professor of History and Daniel Rose Faculty Scholar at the Graduate Center, City University of New York. She is the author of Sex in Crisis: The New Sexual Revolution and the Future of American Politics (2008) and Sex after Fascism: Memory and Morality in Twentieth-Century Germany (2005).\n","torrent":{"xt":"urn:btih:77aa98f1b63c9c4bb09dc948f75659bfde546b8f","amp;dn":"Dagmar+Herzog+-+Brutality+and+Desire+%5B2009%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77aa98f1b63c9c4bb09dc948f75659bfde546b8f","infoHashBuffer":{"type":"Buffer","data":[119,170,152,241,182,60,156,75,176,157,201,72,247,86,89,191,222,84,107,143]},"announce":[],"urlList":[]}}