{"title":"Sexually Broken--Helpless Cougar Sexually Destroyed Simone Sonay","uid":7941293,"size":1870108990,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:77da954037087202eabbaa90d48cb93f55e7b2f5&amp;dn=Sexually+Broken--Helpless+Cougar+Sexually+Destroyed+Simone+Sonay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"merzedes","files":-1,"time":1355991377,"description":"\nHelpless Cougar is Sexually Destroyed. Brutal throat, pussy fucking, squirting screaming orgasms! | Simone Sonay | Matt Williams\n\nDecember 19, 2012 \n\n \nMP4 only.\n  \n \nThe hottest Cougar in all of porn is back on Sexually Broken. Simone Sonay puts all those younger porn stars to shame. There is nothing sexier then a mature, smoking hot, long legged, blond, beautiful woman, all helpless and submissive.\n\nBound on her knees, arms spread out, with a blindfold and pigtails, Simone finds her tongue held out of her mouth by an evil wooden trap. Drool runs down her tan hard body. A hard cock pushes it way into Simone's mouth. She can't even use her tongue as a &quot;block&quot;, the cock slides deeper and deeper, fucking deep down her helpless throat. Simone can do nothing as the cock brutally fucks her skull. Her throat becomes a pussy for the cock, a throatpussy fucked without mercy. Simone goes into survival mode, stealing breaths of air when the cock isn't all the way down her throat. She is struggling, the cock is winning.\n\nShe is quickly moved to the bed, re-bound into a beautiful helpless &quot;fuck me&quot; position. Her legs back and spread, soles of her feet pointing to the ceiling. The cock pushes into her shaved wet pussy, balls deep first thrust. Within seconds Simone is cumming from hard cock. The cock fucks her hard and deep, she vainly struggles in her bondage, as she cums again. The cock pulls out and fingers blast her to a screaming squirting orgasm! Now she is lying in her own cum and getting fucked again. A special vibrator is used on her clit. This sends Simone into a panic struggle as the vibration is just too much for her to handle, in the end she cums again. \n\nSobbing, drooling, squirt and snot. Liquid pours out of every hole of this helpless slut. The orgasms leave her deep in subspace unable to form rational thought. All she knows is orgasm after brutal orgasm. We impale her with a huge dildo. A powerful vibrator is attached and locked in her wanting pussy. There is nothing she can do now but cum and cum, we leave her to her mindless devastating orgasms..... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_19simone2/SexuallyBroken-Simone-Sonay-Matt-Williams-Helpless-Cougar-is-Sexually-Destroyed-Brutal-throat-pussy-fucking-squirting-screaming-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_19simone2/SexuallyBroken-Simone-Sonay-Matt-Williams-Helpless-Cougar-is-Sexually-Destroyed-Brutal-throat-pussy-fucking-squirting-screaming-orgasms.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about \n\nleaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:77da954037087202eabbaa90d48cb93f55e7b2f5","amp;dn":"Sexually+Broken--Helpless+Cougar+Sexually+Destroyed+Simone+Sonay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77da954037087202eabbaa90d48cb93f55e7b2f5","infoHashBuffer":{"type":"Buffer","data":[119,218,149,64,55,8,114,2,234,187,170,144,212,140,185,63,85,231,178,245]},"announce":[],"urlList":[]}}