{"title":"Secrets of Grindea v0.603a","uid":12699315,"size":256373398,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7892e2db3f7880894f4a058a4bf51be904e7ebcd&amp;dn=Secrets+of+Grindea+v0.603a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1446753699,"description":"\nAbout This Game\r\nHey there! Glad you found our store page! Be sure to read the Early Access information above so you know what you're buying!\r\n\r\nSecrets of Grindea is an old-school Action RPG with co-op support for up to 4 players. It is a tribute to and sometimes a parody of the old SNES games so many of us grew up with and loved! Journey through fantastical lands and battle tons of different enemies and bosses in your quest for truth, friendship and, above all, finding the world's rarest treasures!\r\n\r\nIntrigued but not sold? Try out the demo!\r\n\r\nWant to get some insight into development? Visit our DevBlog!\r\nKey Features\r\n\r\n    Character customization. There are no class restrictions, which gives you precise control over how your character develops! A flaming ice mage smashing faces with axes? Sure thing! On top of this, there’s a wide variety of haircuts, hats and head gears that will make your character look unique as well.\r\n    Co-op support for up to four players! Bring your friends on the adventure by inviting them directly via Steam!\r\n    A story filled with mystery, laughs and suspense will take you through dungeons and fields of all shapes in the rich and varied world of Grindea. A ton of side quests and hidden content will keep you busy for hours after finishing the game!\r\n    Arcade Mode features a unique experience of procedurally generated Action RPG madness, truly putting your skills to the test. Help build the town of Arcadia by rising to the challenge of this extremely tough and replayable mode!\r\n    A pet system that makes sure you never have to be alone, even when playing by yourself. Catch any of the cute tameable animals and have them accompany you on your adventures while also boosting your skills!","torrent":{"xt":"urn:btih:7892e2db3f7880894f4a058a4bf51be904e7ebcd","amp;dn":"Secrets+of+Grindea+v0.603a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7892e2db3f7880894f4a058a4bf51be904e7ebcd","infoHashBuffer":{"type":"Buffer","data":[120,146,226,219,63,120,128,137,79,74,5,138,75,245,27,233,4,231,235,205]},"announce":[],"urlList":[]}}