{"title":"Jesse James 1939 BrRip Mp4 Lee1001","uid":9827507,"size":841624675,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:798de5e2a6abacac5ba1622454a5915e8035aac8&amp;dn=Jesse+James+1939+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"xultfoad","files":2,"time":1395800746,"description":"Jesse James 1939 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0031507/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0031507/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Jesse_James_(1939_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Jesse_James_(1939_film)&lt;/a&gt;\nJesse James, notorious train and bank bandit of the late 19th century, and an important figure in the history of the midwest frontier, gets a drastic bleaching. script by Nunnally Johnson is an excellent chore, nicely mixing human interest, dramatic suspense, romance and fine characterizations for swell entertainment.\n \nJesse James was one of two legendary westerns released in 1939 which brought legitimacy to a genre which had largely become discredited in the 1930s, thanks to a slew of cheap and hackneyed productions from Hollywood's poverty row studios. John Ford's Stagecoach made John Wayne an overnight star and established the style of what would become the classic Hollywood western. Jesse James would have a similar, if not greater, impact and introduced audiences to another stalwart of the genre, Henry Fonda. Shot in the recently invented Technicolor, this latter film has a striking modernity and remains one of the most beautifully photographed and poetic of all westerns.\n\nThis was not the first or indeed last telling of the exploits of America's most famous outlaw, but it is unquestionably the finest, its slick production values surpassed only by the remarkable performances from its lead actors. Prior to this, Tyrone Power had been seen as a lightweight matinee idol. His convincing portrayal of Jesse James, which combined old west machismo with genuine human frailty, was to alter audiences' perception of him and helped to elevate him to the level of a screen icon. Whilst Power is the star of the film, Henry Fonda gives the better performance, which is all the more remarkable for its quiet restraint and subtlety. Strong supporting contributions from Randolph Scott, Nancy Kelly and Brian Donlevy help to make this one of the most compelling and realistic of Hollywood westerns.\n\nWhen they embarked on this project, director Henry King and screenwriter Nunnally Johnson were keen to deliver the definitive account of the life and death of Jesse James, but both were more easily seduced by the myth than the reality. When she viewed the film, Jesse James's granddaughter remarked that she saw only one tenuous connection with the life of the famous outlaw - that it was about a man named Jesse who rode a horse. The grim details of the James brothers' notorious exploits is glossed over in the film and their criminality is justified as retribution against the capitalist demon that was driving hardworking American farm-workers to ruin. This is the version of history that American audiences wanted to see, one in which their Robin Hood took on the moneygrubbing bankers and businessmen in defense of the values of the old west. The film's popularity encouraged Twentieth Century Fox to make a sequel, The Return of Frank James (1940), directed by Fritz Lang, with Henry Fonda reprising the role of Frank James. \n\nThere is some splendid Technicolor photography, and Power's and Fonda's performances as Jesse and Frank, and Scott as the sheriff, are superb.\n\nVIDEO\nSize.... 802mb\nDuration.... 01:41:53\nCodec.... h264\nFrame Width.... 720\nFrame Height.... 528\nData Rate.... 937kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 160kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:798de5e2a6abacac5ba1622454a5915e8035aac8","amp;dn":"Jesse+James+1939+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"798de5e2a6abacac5ba1622454a5915e8035aac8","infoHashBuffer":{"type":"Buffer","data":[121,141,229,226,166,171,172,172,91,161,98,36,84,165,145,94,128,53,170,200]},"announce":[],"urlList":[]}}