{"title":"Generation X - Perfect Hits 1971-1981 [FLAC]","uid":7028146,"size":348065904,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7a2712feba5ea351acc8caf92702aec5f9ffb189&amp;dn=Generation+X+-+Perfect+Hits+1971-1981+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stormium","files":-1,"time":1329138992,"description":"-Generation X - Perfect Hits 1971-1981 - [FLAC]\n-Includes FLAC, Log, Cover\n\n   1. Dancing with Myself\n   2. Your Generation\n   3. Ready, Steady, Go\n   4. Untouchables\n   5. Day By Day\n   6. Wild Youth\n   7. Wild Dub\n   8. One Hundred Punks\n   9. King Rocker\n  10. Kiss Me Deadly\n  11. Gimme Some Truth\n  12. New Order\n  13. English Dream\n  14. Triumph\n  15. Youth Youth Youth\n\nallmusic.com says:\n\nAlthough not as well as known as some of their peers (the Clash, the Sex Pistols, the Damned, etc.), first wave U.K. punk rockers Generation X burst onto the scene at the same time as the others. And while they enjoyed some moderate success in their homeland, Generation X would become better-known as the launching pad for their singer, Billy Idol, who would go on to achieve great commercial success come the '80s. Originally formed in 1976, Generation X (which was named after a book that focused on battles between the Mods and the Rockers during the '60s) was comprised of guitarist Bob Andrews, bassist Tony James, drummer Mark Laff, and fronted by Idol. The group was eventually signed up by Chrysalis Records, resulting in a self-titled debut album in 1978 (the U.S. and U.K. versions contained different track listings), as Generation X became one of the first punk bands to appear on the popular British TV music program Top of the Pops.\n\nUnlike other punk bands, Generation X wasn't afraid to turn a blind eye to the supposed &quot;accepted&quot; ideals by punk rockers as they covered a John Lennon song on their debut (&quot;Gimme Some Truth&quot;) and even hooked up with veteran rocker Ian Hunter to handle the production chores for their sophomore effort, 1979's Valley of the Dolls. Perhaps as a result, however, the group's musical direction became cloudy (some wanting the group to remain true to their punk roots, while others feeling that they should pursue a heavier rock sound) and bandmembers began to leave one by one, until Idol and James were the only remaining original members. Generation X managed to squeeze out one final album, 1981's Kiss Me Deadly (which contained the original version of a song that Idol would later cover as a solo artist and score a massive hit with, &quot;Dancing With Myself&quot;), before splitting up.\n\nAfter the group's breakup, James later turned up as a member of '80s glam-punkers Sigue Sigue Sputnik, while Idol relocated to New York and embarked on his aforementioned solo career. As Idol's solo success created interest in his first band, numerous Generation X best-of and rarity collections began to crop up, including 1985's Perfect Hits: 1975-1981, 1998's Sweet Revenge, and 2000's Original Debut, the latter of which was a reissue of the U.K. version of Generation X's self-titled debut. \n\nEnjoy.","torrent":{"xt":"urn:btih:7a2712feba5ea351acc8caf92702aec5f9ffb189","amp;dn":"Generation+X+-+Perfect+Hits+1971-1981+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a2712feba5ea351acc8caf92702aec5f9ffb189","infoHashBuffer":{"type":"Buffer","data":[122,39,18,254,186,94,163,81,172,200,202,249,39,2,174,197,249,255,177,137]},"announce":[],"urlList":[]}}