{"title":"The Boy Who Could Fly  (1986)  DVD-R  NTSC","uid":4926640,"size":4680845312,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7b1fa90e3ac0d6ff115c44e888b7b6e1739bb71d&amp;dn=The+Boy+Who+Could+Fly++%281986%29++DVD-R++NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1243873156,"description":"The Boy Who Could Fly (1986)\n\n\n\nDirected by Nick Castle \nProduced by Gary Adelson \nWritten by Nick Castle \nStarring Lucy Deakins\nJay Underwood\nBonnie Bedelia\nFred Savage\nMindy Cohn \nMusic by Bruce Broughton \nCinematography Adam Holender\nSteven Poster \nEditing by Patrick Kennedy \nDistributed by 20th Century Fox (theatrical release)\nWarner Bros. (DVD/VHS) \nRelease date(s) August 14, 1986 \nRunning time 114 minutes \nCountry  United States \nLanguage English \n\n\n\nThe Boy Who Could Fly is a 1986 film written and directed by Nick Castle. The film was produced by Lorimar Productions for 20th Century Fox, and originally released to movie theatres in August 14, 1986.\n\n14-year-old Milly (Deakins) and her family have just moved into a new suburban home. Milly meets her new neighbor Geneva, and the two become friends. Milly and her 8 year old brother Louis (Fred Savage) have hard times adjusting to their new schools, while their mother Charlene (Bonnie Bedelia) copes with a demotion at work and her inability to learn how to use a computer. Meanwhile Louis is plagued by bullies down the street.\n\nMilly and Geneva observe their other neighbor Eric Gibb, (Underwood) an autistic boy living with his alcoholic uncle Hugo. Eric exhibits bizarre behavior related to flying, such as balancing on the roof of his house with his arms spread out like an airplane. Amelia hears that Eric's parents died in a plane crash, and that somehow in the instant of their death, he knew; and that he did the only thing he could think of to try and save them, which was to become an airplane. Milly reveals to Geneva that she finds Eric attractive.\n\nAlthough Eric cannot communicate with anyone, he begins to react to Milly, first by mimicking her movements and facial expressions. Her teacher, Mrs. Sherman, observes this interaction, and asks Milly to keep an eye on Eric. Mrs. Sherman explains that because of uncle Hugo's drinking, Eric is in constant danger of being taken by authorities and placed in a hospital; but that every time Eric had been taken away before, he had become so anguished that he almost died. Sherman tells Milly she can consider it her science project.\n\nMilly works with Eric over the course of the school year and takes notes on his progress, which is slow at first. Milly notes excitedly the first time Eric smiles on his own rather than merely copying her own smile. Eric cannot catch, until one day he spontaneously reaches out and catches a stray baseball flying toward Milly's face. She tries to repeat this in school as proof of Eric's ability to catch a ball, but ends up with a black eye. However, strange occurrences, like Eric's apparent ability to appear in his own window one instant, and in Milly's the next, begin to make Milly question reality. In her notes, Milly wonders whether Eric is becoming more like her, or the other way around.\n\nOn a school field trip, Milly reaches out over a bridge to pick a rose that is growing high over a precipice. She slips and hits her head on a bridge railing, and Eric is the only person to witness it. She is knocked out and dreams that she and Eric are flying. She wakes up with no other injuries other than the one on her head, and is convinced that Eric can fly and that he caught her as she fell.\n\nThe authorities come to Eric's house and discover his uncle is drunk again, and they plan on removing Eric from his custody. Milly sneaks Eric out and the two are chased across town by the police. They end up on the roof of the school during a carnival crowded with people, and are driven to the edge by police officers. Eric turns to Milly and speaks her name, the first word he has spoken thus far. Milly asks Eric if he really can fly, and he smiles and nods his head. He holds her hand and the two fall off the building.\n\nJust before hitting the ground, Milly and Eric take off into the air, flying in plain view of the stunned and amazed crowd, which forms a parade that follows Milly and Eric down the streets of their town. Eric brings Milly to her own window, tells her he loves her and kisses her, and then says goodbye and flies away. Milly is heartbroken, but quickly realizes why Eric had to leave; over the following weeks, spectators, policemen and scientists mob the town, looking for an explanation and taking all of Eric's belongings away to be analyzed. Milly speculates that Eric too would have been taken by scientists had he remained.\n\nIt is revealed that Amelia and Louis' father had known he had cancer, but kept it a secret from his family because he did not want them to worry. Rather than seek treatment, he said goodbye and committed suicide. His refusal to fight for life had left the Michaelsons feeling helpless and hopeless, but Eric's ability to fly shows them that anything is possible if you believe. Unlike Milly's father, Eric's uncle and the remaining Michaelsons refuse to give up. Eric's uncle beats his drinking problem and gets an excellent job; Louis dominates the bullies down the street; Charlene masters the computer at work; and Milly regains interest in her life and relationships with those around her.\n\n\n\nLanguages: English, French, Spanish, Portugues  2.0\nSubs:      English, French, Spanish, Portugues\nAspect Ratio: 1.85:1\nWidescreen 16:9\nNTSC\n\n\n\nUntouched","torrent":{"xt":"urn:btih:7b1fa90e3ac0d6ff115c44e888b7b6e1739bb71d","amp;dn":"The+Boy+Who+Could+Fly++%281986%29++DVD-R++NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1fa90e3ac0d6ff115c44e888b7b6e1739bb71d","infoHashBuffer":{"type":"Buffer","data":[123,31,169,14,58,192,214,255,17,92,68,232,136,183,182,225,115,155,183,29]},"announce":[],"urlList":[]}}