{"title":"Microsoft Plus! Digital Media Edition","uid":3500723,"size":216432773,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c4a2f8ca845ac14e0ae72e7d1278845553b0aec&amp;dn=Microsoft+Plus%21+Digital+Media+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skurtsy","files":2,"time":1152022322,"description":"Microsoft Plus! Digital Media Edition\n\n\nPhotos\nShare your photos in a whole new way Plus! Photo Story 2! Turn your photos into exciting photo stories by narrating the pictures, adding background music, and creating special panning and zooming effects. With the new Plus! Photo Story 2, you can also:\n\nEasily choose photos from your PC or MSN Groups\nCreate Video CDs that play on most home DVD players\nEdit and Save projects to update your stories over time\nThen play your photo stories on your desktop computer or WindowsÂ® Mobile 2003 powered Pocket PC, send them to family and friends, or publish them on the Web.\n\nMusic\nPlus! Party Mode for Windows MediaÂ® Player turns your PC into a party jukebox. Use  Plus! Analog Recorder to convert your old LPs and tapes into clear, vibrant digital music files. With  Plus! CD Label Maker , you can create colorful custom labels, booklets, and inserts for your CD collection. Use Plus! Dancers to turn your desktop into a dance floor for lifelike 3-D characters.\n\nLearn more about how these and other features in Plus! Digital Media Edition take Music to the max!\n\nHome Movies\nNow you can easily add amazing special effects to your home movies by using Plus! Effects &amp; Transitions for Windows Movie Maker 2. Make your movies even more impressive with 50 new video effects and transitions that are sure to please any audience. Then share your creations via email and the Web thanks to amazing compression, or use programs such as Sonic MyDVD to burn high quality home movies you can play in most home DVD players.\n\nPortable Devices\nTake your favorite music and video with you on your WindowsÂ® Mobile 2003 powered Pocket PC. With Plus! Sync &amp; Go for Pocket PC, you can choose audio and video content from your Windows Media Player Media Library and have it synchronized automatically to your device.\n\nGet the Plus! Portable Audio Devices Power Toy! This tool lets you instantly access and manage the content on a Windows Media Player 9 Series compatible portable audio device attached to your computer.\n\n\n                                                              brought to you by\n                                                              SKURTSY","torrent":{"xt":"urn:btih:7c4a2f8ca845ac14e0ae72e7d1278845553b0aec","amp;dn":"Microsoft+Plus%21+Digital+Media+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c4a2f8ca845ac14e0ae72e7d1278845553b0aec","infoHashBuffer":{"type":"Buffer","data":[124,74,47,140,168,69,172,20,224,174,114,231,209,39,136,69,85,59,10,236]},"announce":[],"urlList":[]}}