{"title":"War on Iraq: What Team Bush Doesn't Want You to Know - Willia","uid":5400240,"size":124431958,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7c589f9ae5a46134f009ea0959cd44ca404d76b0&amp;dn=War+on+Iraq%3A+What+Team+Bush+Doesn%5C%27t+Want+You+to+Know+-+Willia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AmateurHistorian","files":8,"time":1267390904,"description":"War on Iraq offers a balanced, non-partisan examination of the current debate in Washington and beyond. In this shocking expose on the impending offensive against Iraq, activist, author, and teacher William Rivers Pitt sits down with former U.N. weapons inspector Scott Ritter to expose the truth behind the hawkish rhetoric of the Bush administration. Ritter--ex-Marine, intelligence specialist, expert on Iraqi military strategy, and Gulf War veteran--dismantles the myths surrounding Saddam Hussein's biological, chemical and nuclear weapons capabilities while revealing the neo-conservative forces pushing the White House toward war. During the seven years the inspections took place, Ritter and other inspectors were able to confirm that Iraq's chemical, biological, and nuclear weapons programs were effectively destroyed, counter to current White House claims. Pitt and Ritter also explain the lack of any plausible link between Saddam Hussein and Al Qaeda, and highlight the absurdity of forcing democracy on a nation that has been divided for centuries. The book closes with a stark forecast for American troops if a ground war ensues and urges the White House to seek a diplomatic solution. A complete listing of contact information for U.S. senators as well as outreach and activist resources is included. ","torrent":{"xt":"urn:btih:7c589f9ae5a46134f009ea0959cd44ca404d76b0","amp;dn":"War+on+Iraq%3A+What+Team+Bush+Doesn%5C%27t+Want+You+to+Know+-+Willia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c589f9ae5a46134f009ea0959cd44ca404d76b0","infoHashBuffer":{"type":"Buffer","data":[124,88,159,154,229,164,97,52,240,9,234,9,89,205,68,202,64,77,118,176]},"announce":[],"urlList":[]}}