{"title":"Ryan Adams - 2008 - Cardinology  [EAC - FLAC]","uid":4637106,"size":277256096,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7ce3aaf407013a1c42e3a29f2e4f678350080f3b&amp;dn=Ryan+Adams+-+2008+-+Cardinology++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1231592485,"description":"Review    by Stephen Thomas Erlewine\n\nSobriety agrees with Ryan Adams, giving him the one thing he's always lacked: focus. Easy Tiger suggested as much, with its tight, clean lines supported by its rehab-celebrating publicity, but its 2008 sequel, Cardinology, reveals that this straight and narrow path was no new detour for Adams, but rather the main road. It's the first time in his solo career that Adams has tread the same trail for two albums in a row, which only confirms the suspicion that now that Adams is sober, he's getting down to the business of being the troubadour he's always aspired to be, assisted by a band so sympathetic to his style that he's named his album after them. In a certain sense, Cardinology does play as a showcase for everything that Ryan Adams &amp; the Cardinals can do: it's rooted in Deadsy country-rock but frequently strays into '80s alt-rock territory, whether it's the sighing, romantic &quot;Cobwebs&quot; or how &quot;Magick&quot; echoes like prime U2. The Cardinals shift moods with ease but Cardinology isn't quite a showcase for how the band plays -- it's too intimate and too concentrated on the songs to be a record about the group itself, nor is it about Adams' range, as earlier records like Gold were. This is a very simple, classicist singer/songwriter album where the pleasure is within the songs themselves, how &quot;Born into a Light&quot; unfolds with understated grace, how &quot;Let Us Down Easy&quot; glides into its call-and-response chorus, how &quot;Natural Ghost&quot; has a comforting spectral quality, how &quot;Evergreen&quot; skips delicately, how the details in &quot;Sink Ships&quot; spill out to its loping beat. These are modest pleasures, but these days Ryan Adams is all about carefully measured craft instead of big statements, a tradeoff that makes his albums more predictable but also more satisfying, as Cardinology quietly proves.\n\nTracks\n01  Born into a Light     Adams     2:16\n02  Go Easy     Adams     2:56\n03  Fix It     Adams     2:58\n04  Magick     Adams     2:17\n05  Cobwebs     Adams     3:56\n06  Let Us Down Easy     Adams     4:20\n07  Crossed Out Name     Adams     2:43\n08  Natural Ghost     Adams     3:37\n09  Sink Ships     Adams     3:42\n10  Evergreen     Adams     3:34\n11  Like Yesterday     Adams     2:30\n12  Stop     Adams     5:34 ","torrent":{"xt":"urn:btih:7ce3aaf407013a1c42e3a29f2e4f678350080f3b","amp;dn":"Ryan+Adams+-+2008+-+Cardinology++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ce3aaf407013a1c42e3a29f2e4f678350080f3b","infoHashBuffer":{"type":"Buffer","data":[124,227,170,244,7,1,58,28,66,227,162,159,46,79,103,131,80,8,15,59]},"announce":[],"urlList":[]}}