{"title":"Thompson-Buckley Family-Wall Street Fabians in Conservative Move","uid":4540081,"size":167147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d971be6ad9282eee7f5d337c6cf4864a68e7b7e&amp;dn=Thompson-Buckley+Family-Wall+Street+Fabians+in+Conservative+Move&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227904624,"description":"This is Scott Thompson&amp;#039;s explosive intelligence report The Buckley Family - Wall Street Fabians in the Conservative Movement (1977) which thorougly exposes how the American conservative movement was infiltrated and taken over by socialist fabians using extensive financial backing from Wall Street bankers. William F. Buckley and his family oversee one of the principle Fabian intelligence networks that has been used to manipulate U.S. conservative forces who stand in the anti-Fabian tradition of the Whigs and Lincoln Republicans. For the past 45 years, the Buckleys and their networks have aided Wall Street in rendering America&amp;#039;s conservatives unable to resist a progressive Fabianization of U.S. policies and institutions, and in transforming conservatives into unwitting carriers of Wall Street&amp;#039;s monetarist policies. It is largely due to the Buckley family that the conservative movement has been torn between two contradictory traditions: one, the Whig tradition of the Federalist American System developed by Benjamin Franklin and Alexander Hamilton, and based on the conception of industrial progress as the key feature of the United States: the other, the knee-jerk abhorrence of change, often taking the form of counter-revolutionism and anti-communism. This second is a purely Fabian system whose actual principle is opposition to the humanist principles underlying the American System and their replacement with the heteronomic Tory &quot;conservatism&quot; of John Locke et al. based on the philosophy of man&amp;#039;s alleged &quot;individual greed&quot;, against which the American Revolution was fought. Find out how one and the same people control both the leftist and rightist movements in USA and how this dialectical pressure from both sides is used to squeeze out what is left of American conservatives which represent the traditional values as were portrayed in American revolution hundreds of years ago. 20 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:7d971be6ad9282eee7f5d337c6cf4864a68e7b7e","amp;dn":"Thompson-Buckley+Family-Wall+Street+Fabians+in+Conservative+Move","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d971be6ad9282eee7f5d337c6cf4864a68e7b7e","infoHashBuffer":{"type":"Buffer","data":[125,151,27,230,173,146,130,238,231,245,211,55,198,207,72,100,166,142,123,126]},"announce":[],"urlList":[]}}