{"title":"The Children of Now - (Malestrom)","uid":4712623,"size":1197069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d9c9a7fc5e79def85c6d1d683779a75ff1b9494&amp;dn=The+Children+of+Now+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1234121218,"description":" &lt;a href=&quot;http://www.image-upload.net/images/fxvqb5jluwkpd6rxdkg2.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/fxvqb5jluwkpd6rxdkg2.jpeg&lt;/a&gt;\n\nMeg Blackburn Losey, &quot;The Children of Now: Crystalline Children, Indigo Children, Star Kids, Angels on Earth, and the Phenomenon of Transitional Children&quot;\nNew Page Books | 2006-12 | ISBN: 156414948X | 250 pages | PDF\n\nThe Children of Now is a groundbreaking work that shows that a large number of kids come into the world bearing inherent gifts that are beyond strange--they are telepathic, understand subtle energies, and/or have amazing psychic abilities. Many of them remember where they were before they came to Earth and often can describe past lives.\n\nMany doctors mislabel them as autistic, ADD, ADHD, or suggest other behavioral difficulties. More than half the time, these doctors are wrong. The Children of Now are not defective--they are differently functional. We are doing ourselves and the world a great disservice by not acknowledging these amazing children and their special gifts.\n\nA surprising percentage of these children carry within themselves wisdom far beyond most adults. The phenomenon is very real, and more and more of these highly evolved children enter our world every day. The Children of Now offers not only genuine stories of many children who have brought amazing talents into our world, but also practical, easy solutions to assist society in supporting and nurturing these gifted--not defective--children and their families, rather than labeling, segregating, and condemning them.\n\nFascinating to anyone with an open mind, and life-illuminating for parents with these incredible kids, Meg offers detailed answers derived from counseling real kids in real families.\n\nThe Children of Now is a must-read for every parent, teacher, caregiver, and child advocate. In it you'll discover:\n\n- Why our children's DNA is different from previous generations'.\n- The traits and needs of the Crystalline Children.\n- The Children of the Stars and why they are here.\n- Real stories of real children as Dr. Meg helps them and their families search for answers.\n- Why these kids are exhibiting telepathy, telekinesis, healing abilities, and more.\n- How to help the Children of Now at home, at school, and socially. ","torrent":{"xt":"urn:btih:7d9c9a7fc5e79def85c6d1d683779a75ff1b9494","amp;dn":"The+Children+of+Now+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d9c9a7fc5e79def85c6d1d683779a75ff1b9494","infoHashBuffer":{"type":"Buffer","data":[125,156,154,127,197,231,157,239,133,198,209,214,131,119,154,117,255,27,148,148]},"announce":[],"urlList":[]}}