{"title":"Twelve Girls Band DVD : Live from Shanghai 2007","uid":4279215,"size":4681426991,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7e3700afeea305ce9acce238055003f8b870a221&amp;dn=Twelve+Girls+Band+DVD+%3A+Live+from+Shanghai+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thuvn205","files":2,"time":1215335682,"description":"12 Girls Band DVD : Live from Shanghai 2007\n\n\n- Genre\t\t: Musical\n- DVD-ISO Size\t: 4.6GB\n- Release\t\t: 5/6/2007 \n- Time\t\t: 90 minutes\n- Region\t\t: All Regions\n\n\nYoung, talented, and beautiful, the 12 Girls Band captivates fans all over again in their dazzling concert DVD Live from Shanghai. The band actually consists of 13 (a baker's dozen?) comely virtuoso young Chinese women, who play both traditional Chinese melodies and Western classical and pop tunes on their classic East Asian instruments, the erhu, pipa, yanguin, dizi, and guzheng. The spectacle is just as entertaining as the tightly delivered musical offerings, and this concert, which also showcases the gorgeous setting and skyline of Shanghai, is about as close to a trip to China as you can get without a passport.\n\nHighlights include the band's renditions of Handel, Beethoven, Mozart, and Bach--the last an especially accomplished, memorable version of the Concerto for Violin in A Minor. Traditional Chinese melodies are striking on pieces like &quot;High Mountain and Floating Water.&quot; The band is joined by the talented singer Lila Downs for such vocals as &quot;La Habanera&quot; from Carmen--for which goosebumps are the order of the evening. Even a hoary jazz standard like &quot;Take Five&quot; sounds fresh in the hands of these enthusiastic musicians. (Tip: Skip over the theme from Titanic, or that refrain may haunt the rest of the concert.) Music fans from across the globe should be dazzled by the talent contained on this single stage.\n\nPrepare to be captivated by the graceful beauty and infectious energy of the 12 Girls Band! Two years after their best-selling, chart-topping US debut, Eastern Energy, the group returns with a brand-new album (Shanghai) and concert DVD (Live from Shanghai), showcasing an eclectic mix of traditional Chinese folk melodies and selections of jazz, classical, and pop music.\n\nFormed in 2001, their 2003 debut album in Japan, Beautiful Energy, sold 2 million units, and ranks as the highest-selling Chinese band in Japan. These 12 talented young women playing traditional Chinese instruments ÃƒÂ¢?? the erhu, pipa, yanguin, and gu zheng ÃƒÂ¢?? create masterful music on a broad musical canvas in an unforgettable and distinctive style all their own.\n\nAmerican audiences will witness the worldwide phenomenon in concert when 12 Girls Band embarks on a major 30-city U.S. tour in the fall of 2007. \n\n\nTrack listing\n1. Freedom\n2. Miracle\n3. My Heart Will Go On (Theme from Titanic)\n4. Carmen: La Harbanera (featuring Lila Downs)\n5. Glory\n6. Shining Energy\n7. Carnival\n8. Great Canyon\n9. Take Five\n10. Georgia on My Mind (Featuring Tim Sheff)\n11. HandelÃƒÂ¢??s Royal Fireworks\n12. New Classicism (Mozart Symphony No.40 G Minor, etc.)\n13. Bach Concerto for Violin in A Minor\n14. Alamuhan\n15. Loulan Girl\n16. Signore Ascolta (Featuring Lila Downs)\n17. Fragile\n18. High Mountain and Floating Water\n19. Summertime (Featuring Tim Sheff)\n20. Flowers and Juveniles\n21. Forbidden City\n22. Nessun Dorma\n23. End Credit: Ode to Joy \n\n\nMY AN OTHER RELEASE AT MININOVA: \n\nTWELVE GIRLS BAND BEAUTIFUL ENERGY MIRACLE CONCERT DVD\n\nGET THERE AND DO SEARCH.\n\n\nEnjoy &amp; keep seed.","torrent":{"xt":"urn:btih:7e3700afeea305ce9acce238055003f8b870a221","amp;dn":"Twelve+Girls+Band+DVD+%3A+Live+from+Shanghai+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e3700afeea305ce9acce238055003f8b870a221","infoHashBuffer":{"type":"Buffer","data":[126,55,0,175,238,163,5,206,154,204,226,56,5,80,3,248,184,112,162,33]},"announce":[],"urlList":[]}}