{"title":"Solid Capture v3.0 (build 218) + Genuine Serial By ChattChitto","uid":4813492,"size":7587420,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7e404e81054674b1f0f822675018bb120686f57a&amp;dn=Solid+Capture+v3.0+%28build+218%29+%2B+Genuine+Serial+By+ChattChitto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1238461817,"description":"Solid Capture v3.0 (build 218) + Genuine Serial\n\n.exe File Format (Setup File - Serial - Instructions)\n\n***********************************************************************************\nSolid Capture v3.0 (build 218)\n\nHomepage: http://www.soliddocuments.com/products.htm?product=SolidCapture\n\n\nSolid Capture - Features:\n~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\nCapture anything on your screen:\n===================================\n\t\t\nRectangle Capture:\n-------------------\nCapture anything in any location on your screen using one of the following options:\n-Rectangle - Draw a rectangle around any portion of your screen and capture everything inside.\n-Rectangle with Frame - Use a resizable frame to measure and capture anything within. Drag its corners and sides to change its dimensions or simply enter the dimensions into the fields and watch the frame adjust to pixel accuracy.\n\t\nWindow Capture:\n----------------\nEasily capture windows on your screen, including scrolling windows. This feature is particularly useful for those who work with documentation. With Window Capture, you can effortlessly capture the following:\n-A whole window - either just the visible window or an entire scrolling window\n-A portion of a window such as a menu or toolbar\n-Multiple windows\n-Drop-down menus\n\t\nFull Screen:\n-------------\nCapture your entire computer screen. If you use multiple monitors, you can choose which screen you want to capture or capture them ALL.\n \t\t\nColor Capture:\n---------------\nTurn your mouse pointer into a magnifier that allows you to zoom into anything on your screen right down to a single pixel. Then capture the color of that pixel and save it to your palette to use in your own creations.\n\t\t\nText Capture:\n--------------\nUse this tool to draw a rectangle around any region of your screen. Any text that is inside the rectangle will be extracted to your clipboard.\n\t\t\nWindow Ruler:\n--------------\nPlace a pixel ruler on your screen that you can move, position horizontally or vertically, and resize to measure anything on your screen.\n\n\nEdit, Save, and Share your Captures:\n======================================\n\t\nCreate a PDF:\n--------------\nQuickly and easily create a PDF file featuring your captured image(s). Simply select one or more captured images, click the Create PDF button, and create a Portable Document Format (PDF) file that is ideal for archiving, e-mailing, and publishing on a Web site.\n\t\t\nPrint:\n-------\nSolid Capture's simple print options allow you to easily format your captures and print them using a selected layout option.\n\t\t\nSave to Your Choice of Format:\n-------------------------------\nSave one or more of your screen captures to your choice of image format. You can choose any of the following formats: PNG, GIF, JPG, TIF, or BMP.\n\t\t\nEdit Image:\n------------\nSend your screen captures to your favorite image editing program. Solid Capture also allows you to easily change your output settings any time, so your screen captures will always be sent to the image editing program of your choice.\n\t\t\nE-mail Instantly:\n------------------\nDrop your screen captures directly into e-mail for fast and easy sharing. You can choose to add your captures as attachments, embed them in the message, or create a PDF attachment.\n \t\t\nExtract and Edit Text:\n-----------------------\nIs there text in your captured image that you would like to re-use? You can &quot;pull&quot; the text right out of your capture and export it to a text editor in one step.\n\n*MicrosoftÃ‚Â® Office 2003 or higher is required for text capture and text editing\n\n\nSimple and Intuitive Interface:\n=================================\n-Main Toolbar - Use the toolbar to easily activate various capture functions, change program settings, and access the help file.\n-Action Buttons - Once you have captured your screen, use the action buttons to print, edit, e-mail, save, and more.\n-Preview Window - The Preview Window allows you view your selected captures as well as add or edit captions for each image.\n-Selection Strip - Use the Selection Strip to select one or more captures to edit, save, print and more. You can also drag-and-drop images into and out of the Selection Strip from locations including folders, editors, and Web browsers.\n\n\nSystem Requirements:\n======================\n-For MicrosoftÃ‚Â® WindowsÃ‚Â® 2000, 2003, XP, or Windows VistaÃ‚Â®.\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\nReport Bad Torrents Here:                    &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\nMy Torrents List And News:                             &lt;a href=&quot;\nhttp://suprbay.org/showthread.php?t=45358&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/showthread.php?t=45358&lt;/a&gt;\n\n[Please Leave A Comment Confirming This Pack]\n\n-----------------------------------------------------------------------------------\n\nFor Torrent Request: ChattChitto(AT)ChattChitto(DOT)com\n[Put The Request Name In The SUBJECT Box &amp; Also Provide It's Webpage, Or Your Request Will Be Ignored Automatically]\n\nReleases VIA RSS Feed:                                    &lt;a href=&quot; http://rss.thepiratebay.se/user/20e2ae0ccf951136732492d37c73af42&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://rss.thepiratebay.se/user/20e2ae0ccf951136732492d37c73af42&lt;/a&gt;","torrent":{"xt":"urn:btih:7e404e81054674b1f0f822675018bb120686f57a","amp;dn":"Solid+Capture+v3.0+%28build+218%29+%2B+Genuine+Serial+By+ChattChitto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e404e81054674b1f0f822675018bb120686f57a","infoHashBuffer":{"type":"Buffer","data":[126,64,78,129,5,70,116,177,240,248,34,103,80,24,187,18,6,134,245,122]},"announce":[],"urlList":[]}}