{"title":"Micro- and Nanosystems for Biotechnology - J. Christopher Love","uid":15067826,"size":8039374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ec7484115ed0b4f9f62b93c4753524e3c4c9c8d&amp;dn=Micro-+and+Nanosystems+for+Biotechnology+-+J.+Christopher+Love&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466789477,"description":"Micro- and Nanosystems for Biotechnology - J. Christopher Love (Wiley-VCH, 2016).pdf\r\n\r\nISBN 978-3-527-33281-6\r\n\r\nEmphasizing their emerging capabilities, this volume provides a strong foundation for an understanding of how micro- and nanotechnologies used in biomedical research have evolved from concepts to working platforms.\r\nVolume editor Christopher Love has assembled here a highly interdisciplinary group of authors with backgrounds ranging from chemical engineering right up to materials science to reflect how the intersection of ideas from biology with engineering disciplines has spurred on innovations. In fact, a number of the basic technologies described are reaching the market to advance the discovery and development of biopharmaceuticals.\r\nThe first part of the book focuses on microsystems for single-cell analysis, examining tools and techniques used to isolate cells from a range of biological samples, while the second part is dedicated to tiny technologies for modulating biological systems at the scale of individual cells, tissues or whole organisms. New tools are described which have a great potential for (pre)clinical development of interventions in a range of illnesses, such as cancer and neurological diseases.\r\nBesides describing the promising applications, the authors also highlight the ongoing challenges and opportunities in the field","torrent":{"xt":"urn:btih:7ec7484115ed0b4f9f62b93c4753524e3c4c9c8d","amp;dn":"Micro-+and+Nanosystems+for+Biotechnology+-+J.+Christopher+Love","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec7484115ed0b4f9f62b93c4753524e3c4c9c8d","infoHashBuffer":{"type":"Buffer","data":[126,199,72,65,21,237,11,79,159,98,185,60,71,83,82,78,60,76,156,141]},"announce":[],"urlList":[]}}