{"title":"POtHS - H E L L - Does NOT Exist - Except These People Have Been","uid":8751277,"size":7157175041,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f5156e28c0e4d8fc3a280b092a7da198b650bbf&amp;dn=POtHS+-+H+E+L+L+-+Does+NOT+Exist+-+Except+These+People+Have+Been&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":-1,"time":1375037760,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nH E L L\nDoes NOT Exist\nExcept These People Have Been THERE and Back\n\n\nPOtHS Comment: These Days we live in now are as &quot;In The Days of Noah.&quot; The King and High Priest will be here soon to pronounce Judgement on The World.\n \n\nINTRODUCTION\n\nWhat Is Hell Like?\n\nHell is eternal. According to Matthew 25:46, Jesus said, &quot;and these shall go away into everlasting punishment, but the righteous into life eternal&quot;. Romans 16:26, speaks of the everlasting God. Hebrews 9:14 refers to the eternal spirit.\n\nThere are four expressions in these three verses to be considered. They are &quot;everlasting punishment&quot;, &quot;eternal life&quot;, everlasting God&quot;, and &quot;eternal spirit&quot;. The only difference between everlasting and eternal in our language is a difference in spelling. They mean the same thing. The Greek word translated as everlasting or eternal in these three passages is the same. It is &quot;ionious&quot; which means eternal, everlasting, without end, never to cease, or indeterminate as to duration.\n\nThere is another argument which can be made against the eternality of hell. which cannot be applied against the eternality of God the Father, God the Spirit, and Heaven. If one were to take the poisition that hell were to last only a thousand years, to be consistent he would also have to contend that the Father, Spirit and Heaven will last for only a thousand years. That is true for the same word used to describe the duration of Hell's punishment is also used to describe the duration of the Father, Spirit and Heaven.\n\nThe very moment that the disobedient cease to be punished, the righteous will cease to be blessed and the Father and Spirit will cease to exist. Hell's punishment will continue forever and ever.  \nUnquenchable Fire\nWhy does the Bible say that the wicked will be destroyed with unquenchable fire?\n\nfirefighter.jpg Unquenchable fire is fire that cannot be put out, but which goes out when it has turned everything to ashes.  Jeremiah 17:27 says Jerusalem was to be destroyed with unquenchable fire, and in 2 Chronicles 36:19-21 the Bible says this fire burned the city &quot;to fulfill the word of the Lord by the mouth of Jeremiah&quot; and left it desolate.  Yet we know this fire went out, because Jerusalem is not burning today.\n\nTo quench means to extinguish or put out.  No one will be able to put out the fire of hell.  That is the strange fire of God.  No one will be able to escape from it by extinguishing it.  Isaiah says of that fire, &quot;Behold, they shall be as stubble; the fire shall burn them; they shall not deliver themselves from the power of the flame: there shall not be a coal to warm at, nor a fire to sit before it&quot; (Isaiah 47:14).  After it has accomplished its work of destruction, that fire will go out.  No one can deliver themselves from its flame by putting it out, but finally not a coal will be left.  So say the Scriptures.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:7f5156e28c0e4d8fc3a280b092a7da198b650bbf","amp;dn":"POtHS+-+H+E+L+L+-+Does+NOT+Exist+-+Except+These+People+Have+Been","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f5156e28c0e4d8fc3a280b092a7da198b650bbf","infoHashBuffer":{"type":"Buffer","data":[127,81,86,226,140,14,77,143,195,162,128,176,146,167,218,25,139,101,11,191]},"announce":[],"urlList":[]}}