{"title":"Zombie Apocalypse Mass Shooter","uid":10846127,"size":14827553,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7f97a4514c93fcc7cef23316e8cabb60a1259f92&amp;dn=+Zombie+Apocalypse+Mass+Shooter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kaloyan78","files":-1,"time":1408782924,"description":"There was a zombie virus outbreak and you are a zombie apocalypse survivor, who finds himself alone in the woods with only his rifle and has to keep himself safe for as long as he could. Grab your rifle and start shooting the infected, who will become more and more. Your goal is to accumulate the highest score possible and then share it with the rest of the world on the leaderboards.\n\n\nYou move by tilting your device back and forward, left and right. The virtual analogue stick on the display will make your character rotate, thus shooting the enemy in different directions. The red button makes your character shoot, while, when you acquire a grenade, a button will appear, allowing you to throw it killing nearby enemies. On the top left of the screen you will see your current score, while next to it is the bullets you have left. Ammunition is limited in single player mode.\n\n\nThe zombies will walk towards you from different directions. When you kill one more will spawn in a different place on the map. Upon reaching 80 or less ammunition, when you kill an infected, an ammunition pickup will spawn with either 50, 100 or 150 bullets. If the bullets drop below 25 a grenade pickup will be dropped from the first zombie you kill, so choose your target wisely.\n\n\nAnother pickup might spawn if you reach a current score of more than 200, which will allow you to shoot bullets in three different directions for a limited time. But be warned, shooting those bullets will double the ammunition consumption.\n\n\n---------- MULTIPLAYER ----------\n\n\nThe game now supports multiplayer mode. Play with your friends in a Player vs. Player mode and try to get higher score that your friends.\n\n\nIn order to play in multiplayer mode a user must create a server on their device (which, on Android device, supports up to 8 players), so that your friends may play, or download the (very small) server for Windows (which supports up to 16 players), so that everyone can play. You may install it on your laptop or notebook, run it in the cafe, for example, take out your phone and start playing with your friends.\n\n\nIn order to connect to the server the player must type in, when prompt from the game, the IP of the server (either the computer's IP address, or the phone/tablet's IP address, if the game is hosted on it). Then, when connected, a window will ask you to input your name and a welcoming message will appear.\n\n\nWindows server download:\n\n\n","torrent":{"xt":"urn:btih:7f97a4514c93fcc7cef23316e8cabb60a1259f92","amp;dn":"+Zombie+Apocalypse+Mass+Shooter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f97a4514c93fcc7cef23316e8cabb60a1259f92","infoHashBuffer":{"type":"Buffer","data":[127,151,164,81,76,147,252,199,206,242,51,22,232,202,187,96,161,37,159,146]},"announce":[],"urlList":[]}}