{"title":"Stephen Fry and friends on Christopher Hitchens - 2011.11.09 Min","uid":6841518,"size":84300648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7fb532c3b8306a9a278676232104f27cbe096914&amp;dn=Stephen+Fry+and+friends+on+Christopher+Hitchens+-+2011.11.09+Min&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1322181900,"description":"\n.\nStephen Fry and friends on the life, loves and hates of Christopher Hitchens\nMini version - x264 mkv\nNov 9 - 2011\n\nFrom the intelligence squared website:\nIn this historic event, Stephen Fry and other friends of Christopher Hitchens came together to celebrate the life and work of this great writer, iconoclast and debater. Fry was joined on stage at the Southbank Centre's Royal Festival Hall by Richard Dawkins and the two discussed Hitch's unflinching commitment to the truth. Hollywood actor Sean Penn was beamed in from LA by Google+ and, between cigarette puffs, read from Hitch's acclaimed work, The Trial of Henry Kissinger. Five friends of Hitch spoke via satellite in New York: satirist Christopher Buckley and editor Lewis Lapham mused on Hitch's prowess as a journalist. 'Like a pot of gold', said Lapham. Martin Amis, Salman Rushdie and James Fenton delighted the audience with stories of Hitchens as a young man. Rushdie drew roars of laughter when he recounted a word game invented by Amis and Hitchens where the word 'love' is replaced with 'hysterical sex'. Particular favourites included Hysterical Sex in the Time of Cholera and Hysterical Sex Is All You Need.\n\nWatching the event with Hitch at his bedside in Texas, Hitch's wife Carol and novelist Ian McEwan provided an email commentary. 'His Rolls Royce mind is still purring beautifully', typed McEwan.\n\nThe event was watched live by 2500 at the venue, and by thousands more in UK cinemas and online.\n\nMedia Info:\n45:44 Min\n512 x 288\nCodec - x264\nFormat/Container - mkv\nFPS - 25.00\nVideo bit rate - 194 Kbps\nAudio - MP3 - 48Kbps - 22.05 KHz - VBR - Mono\n\nNotes:\nWebrip converted to mini mkv \nThis is a smaller, lower quality version.\nMade specifically for people who have slow internet or have to watch their bandwidth use.\nTested using the free VLC media player. \n.","torrent":{"xt":"urn:btih:7fb532c3b8306a9a278676232104f27cbe096914","amp;dn":"Stephen+Fry+and+friends+on+Christopher+Hitchens+-+2011.11.09+Min","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fb532c3b8306a9a278676232104f27cbe096914","infoHashBuffer":{"type":"Buffer","data":[127,181,50,195,184,48,106,154,39,134,118,35,33,4,242,124,190,9,105,20]},"announce":[],"urlList":[]}}