{"title":"ConvertXtoDVD 6.0.0.29 + Patch","uid":13797043,"size":55380019,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8064cd1a144b1bb22168b81c3c9cadb69d4c7c40&amp;dn=ConvertXtoDVD+6.0.0.29+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubberboy37","files":1,"time":1457424774,"description":"Creating DVD's is quite a common undertaking nowadays and perhaps this is why there are loads of applications designed to herlp users in tjhis respect. One of the more popular utilities of this kind is ConvertXtoDVD and, as it's name suggests, it can convert video's to DVD format.\r\n\r\n\r\n\r\nThe software comes with an easy to use interface that makes all the functions available with one or two clicks and it is not cluttered by may buttons, tabs or menu's. Agreat thing about this tool is that it supports not only DVD's but also Blu-Ray disc's for both input and output.\r\n\r\n\r\n\r\nWith ConvertXtoDVD you can edit the audio streams, subtitles and disc chapters as well. If you want to check out the modifications of the work in progress, you can use the preview window on the right side of the main window.\r\n\r\n\r\n\r\nThere are many menu templates you can choose from and make the DVD look more modern or more classic just as easy. More detailed settings allow you to configure the root menu parameters, including background audio, video or image, the chapter menu and many more.\r\n\r\n\r\n\r\nWhen it comes to the supported file types and sources, ConvertXtoDVD offers a variety of options. It can handle AVI, DivX, MKV, MPEG-4, MOV, DV, WMV and WMV HD while the input can come from digital video camera's, capture cards, TV or satellite.\r\n\r\n\r\n\r\nIn case you don't want to burn the data to disc, there's always the possibility to save the DVD structure to a folder on your hard drive or make an ISO image. ConvertXtoDVD can create disc's in both PAL and NTSC region formats, so the compatibility is ensured for all DVD players out there.\r\n\r\n\r\n\r\nAll in all, the application is indeed one that deserves at least a try. Thanks to a solid feature pack, easy to use and quick in processing. ConvertXtoDVD remains one of the best choices in it's category.\r\n\r\n\r\n\r\nChangelog (March 7th 2016):\r\n\r\n- 0010743: [Feature Request] when changing image for menu (background image/video) or for thumbnail let user choose: letterbox/panscan/stretched (felicia) - resolved.\r\n\r\n\r\n- 0011249: [Bug] Video Processing's Resize Filters are Empty and changing it does not effect, CXD uses Linear as default (felicia) - resolved.\r\n\r\n\r\n- 0011244: [Bug] Can't use previous frame function just after seeking (advanced edition window) (cedric) - resolved.\r\n\r\n\r\n- 0010424: [Feature Request] in cut section make nudge &quot;frame&quot; more accurate (cedric) - resolved","torrent":{"xt":"urn:btih:8064cd1a144b1bb22168b81c3c9cadb69d4c7c40","amp;dn":"ConvertXtoDVD+6.0.0.29+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8064cd1a144b1bb22168b81c3c9cadb69d4c7c40","infoHashBuffer":{"type":"Buffer","data":[128,100,205,26,20,75,27,178,33,104,184,28,60,156,173,182,157,76,124,64]},"announce":[],"urlList":[]}}