{"title":"Michel van Rijn - De vijfde Sarcofaag (E-Books)NLT-Release","uid":6941619,"size":1331947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80a0c7228720d30f0db88a6683a0472b73bd6855&amp;dn=Michel+van+Rijn+-+De+vijfde+Sarcofaag+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1326061842,"description":"Michel van Rijn - De vijfde Sarcofaag (E-Book)NLT-Release\n\n\n\nBeschrijving\nVoor liefhebbers van Een Venetiaans geheim en De Da Vinci Code is er nu een nieuwe thriller van internationale allure waarin kunst en religie samenkomen.\n\nIn het jaar 1335 v.C. sterft de jonge farao Toetanchamon. Volgens Egyptisch gebruik worden zijn hart, lever, maag en ingewanden gemummificeerd en in vier kleine sarcofagen bijgezet in zijn graf. Maar in het diepste geheim vindt er nog een mummificatie plaats, die van de hersenen. Deze vijfde sarcofaag vindt echter een andere bestemming.\nRuim drieduizend jaar later vindt de Franse kunsthandelaar-avonturier Axel de St.Cyr de vijfde sarcofaag in Peru. Het voorwerp, dat de kunstwereld op zijn kop zal zetten, trekt ook de aandacht van de Church of Scientology. In het diepste geheim hebben scientology-wetenschappers een techniek ontwikkeld die hen in staat stelt mensen te klonen...\n\n\nMichel van Rijn (1950) is geboren in Parijs. Al op jonge leeftijd zocht hij het avontuur en reisde naar het Midden-Oosten, om van daaruit kunst naar het Westen te smokkelen. In de straten van Beirut leerde hij voor het eerst van dichtbij de gevaren kennen van de illegale kunsthandel en in de jaren die volgden zou hij uitgroeien tot een van de meest gezochte personen in de kunstwereld. Uiteindelijk nam hij contact op met Scotland Yard en kwam hij tot een overeenkomst. Tegenwoordig is hij internationaal een van de bekendste onderzoekers naar illegale kunsthandel.\n\nMet dank aan de originele scanner en spotter.\n\n\nHashcode:\n80A0C7228720D30F0DB88A6683A0472B73BD6855\n\n\nVOOR DE NIEUWSTE FILMS, MUZIEK EN BOEKEN GA JE NAAR NLT-RELEASE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:80a0c7228720d30f0db88a6683a0472b73bd6855","amp;dn":"Michel+van+Rijn+-+De+vijfde+Sarcofaag+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80a0c7228720d30f0db88a6683a0472b73bd6855","infoHashBuffer":{"type":"Buffer","data":[128,160,199,34,135,32,211,15,13,184,138,102,131,160,71,43,115,189,104,85]},"announce":[],"urlList":[]}}