{"title":"The Beatles - Some Other Guy [original live promo].VOB","uid":8742060,"size":72280064,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:812b2e32a6781362aa3e220040b49b6329e831f2&amp;dn=The+Beatles+-+Some+Other+Guy+%5Boriginal+live+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1374815021,"description":"The Beatles - Some Other Guy [original live promo].VOB\n\n\nHQ very rare promo music video. &quot;Some Other Guy&quot; is a rhythm and blues song, written by Jerry Leiber, Mike Stoller and Richard Barrett. It was first released by Barrett as a single in 1962, with a backing band featuring an electric piano, an unusual sound in pop music at the time.\n\nThe song was part of The Beatles' live repertoire in 1962-63, and a recording was made on 19th June 1963 during a live BBC radio performance by the band at The Playhouse Theatre, London. This recording was first released for purchase by the public on the album Live at the BBC in 1994. The song has special significance in Beatles lore, as it is featured in the only known existing film with synchronized sound showing The Beatles performing live at the famous Cavern Club. The crude, grainy footage features John Lennon and Paul McCartney singing the song's melody in unison on Wednesday 22nd August 1962. This is also the first film of Ringo Starr as the Beatles drummer, Pete Best having been discharged the week before. At the end of the song you can hear someone in the audience screaming &quot;We want Pete!&quot;\n\nMcCartney stated: &quot;Some Other Guy&quot; is a great song...It really got us started because that's one of the earliest bits of film of The Beatles. It was the song we sang when Granada Television came to The Cavern. It was also a bit of a muso song...&quot; The song as The Beatles play it is in the key of D, with a slow A-C-D intro and second interval I-â™­VII-I on every tonic (and the equivalent for IV and V). The &quot;muso song&quot; reference is thought to relate to the fact that it is a rare early example of a rock and roll song being topped and tailed by a â™­VII-I cadence.\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Some_Other_Guy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Some_Other_Guy&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/jAnCEAaEP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jAnCEAaEP&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:02:09\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:812b2e32a6781362aa3e220040b49b6329e831f2","amp;dn":"The+Beatles+-+Some+Other+Guy+%5Boriginal+live+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812b2e32a6781362aa3e220040b49b6329e831f2","infoHashBuffer":{"type":"Buffer","data":[129,43,46,50,166,120,19,98,170,62,34,0,64,180,155,99,41,232,49,242]},"announce":[],"urlList":[]}}