{"title":"Pan American - Cloud Room, Glass Room (2013) [FLAC]","uid":8555179,"size":315583618,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:84711fa04615ddec4ed158aac08f094335c27395&amp;dn=Pan+American+-+Cloud+Room%2C+Glass+Room+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1370738828,"description":"\n  Pan American - Cloud Room, Glass Room (2013) [FLAC]\n\n  Released: 2013\n  Duration: 50:07\n  Genre: Electronic\n  Styles: Ambient, Avantgarde, Experimental\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 The cloud Room \n  02 Fifth Avenue 1960 \n  03 Relays \n  04 Glass Room At The Airport \n  05 Laurel South \n  06 Project For An Apartment Building \n  07 Virginia Waveform \n\n  While Mark Nelson's Pan American project has never been prolific, it has been steady. Issuing an album roughly every two years, he and his collaborators have become standard bearers for the Kranky label's gospel of sonic drift and drone. While Nelson's music isn't exactly about stasis, it does chart notions of &quot;change&quot; and development&quot; incrementally if at all. He's always been interested in either the moment itself or in a soundscape that references something other than itself. His love of early skeletal techno, ambient spaces, fluid textures, and suggested melodies rather than fully articulated ones remains ever present. Percussionist Steven Hess is here again, and former Labradford bandmate, bassist Bobby Donne, appears on several cuts. Opener &quot;Cloud Room&quot; is the most &quot;songlike&quot; track from PA since 2004. While it opens with a bright wash of shimmering, distorted sound, Hess' hi-hat, bass drum, and snare create a pulse underscored by Donne's minimal, incantatory bassline. \n\n  Nelson paints the center with ambient washes and cascading waves of subtle guitars simulating a melodic intent. Over seven-and-a-half minutes, some dubwise effects are added to the drums, making the notion of time seem elastic. The dub effect is present on the other two tracks to feature Donne as well. The gloriously twilit &quot;Relays,&quot; where pulsing yet restrained kit work -- with a near metronymic if muted bass drum -- underscores restrained yet heavily treated guitars, loops, and a steady, unmoving bass vamp. Closer &quot;Virginia Waveform&quot; actually opens with the bassline. Nelson's intense yet muted electric guitar plays a blown-out, seemingly never ending chord, while skittering cymbals and hushed snare breaks create tension that reaches catharsis in the center as the guitars and controlled feedback dominate the mix. Layer by layer, though, Nelson strips it all back until nothing but the drums and then silence remain. While &quot;Project Room for an Apartment Building&quot; is ambient to the point of near non-existence; &quot;Fifth Avenue 1960&quot; and &quot;Glass Room at the Airport&quot; add drama and movement, respectively. For longtime fans, Cloud Room, Glass Room offers exactly you desire from PA. For those who've listened in occasionally, enjoyed what you've heard, and are seeking change in Nelson's aural aesthetic, listen elsewhere; this music wasn't made for you in the first place.","torrent":{"xt":"urn:btih:84711fa04615ddec4ed158aac08f094335c27395","amp;dn":"Pan+American+-+Cloud+Room%2C+Glass+Room+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84711fa04615ddec4ed158aac08f094335c27395","infoHashBuffer":{"type":"Buffer","data":[132,113,31,160,70,21,221,236,78,209,88,170,192,143,9,67,53,194,115,149]},"announce":[],"urlList":[]}}