{"title":"Mojosoft BusinessCards MX v4.85 Multilingual with Key [TorDigger","uid":8409522,"size":91084764,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:84fca2d53b281d0570b232e3fcaa15278c055014&amp;dn=Mojosoft+BusinessCards+MX+v4.85+Multilingual+with+Key+%5BTorDigger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":9,"time":1366880832,"description":"Mojosoft BusinessCards MX\n\nBusiness card software BusinessCards MX program for quick and easy design business cards. This program will help to design and print a professional business card. The interface of the program has been designed in such a way that even a beginning user will not have problems with using the program. The process of designing is based on inserting ready for use elements accessible in the program such as figures, images and the background, and freely shifting them on the prepared project. Another advantage of the program is the possibility of saving data about a company or people so that it can be used later while designing a business card.\nThe program uses templates which you can prepare on your own, or you can use ready models, templates of business cards accessible in it. There are 400 examples of business card templates in the program.\nBusinessCards MX offers multi-language support which eases the daily use of the program and will help you to use it as efficiently as possible especially if English is not your native language.\n\nThe attributes of the program:\n\n* operating jpg, bmp, wmf, png, tiff and more graphic formats\n* a dozen or so effects which can be used while working on all objects (text , image , backgrounds) for example: shadows, textures, sepia, gradients and others\n* export to high resolution (300 DPI , 600 DPI) pdf, jpg, tiff, bmp graphics file\n* the size of designed business cards: min 70x40 max 105x65\n* the appearance of the interface can be changed\n* convert and export to CMYK ( with ICC profiles )\n* support right to left languages (like arabic, hebrew)\n* support unicode\n* print on both sides of the paper (duplex printing)\n* multilanguage support: English, German, Portuguese, Spanish, Italian, French, Norwegian, Swedish, Polish, Czech, Hungarian, Russian, Bulgarian, Farsi (Persian), Serbian, Chinese (simplified), Romanian, Croatian\n* 400 supported business card paper for ink jet and laser printers, from Avery, APLI, Hisago, Sigel, A-One, Printec and other manufacturers.\n\nSystem Requirements\n\n* Operating System: Windows 2000 / XP / Vista / Windows 7 / Windows 8\n* CPU: Pentium processor minimum\n* Memory: 512M or more\n* Free hard drive space: 250MB\n\nHomepage: http://www.businesscards-mx.com/business-card.php\n\nInstallation Instructions:\n\n1. Install Program.\n2. Use given Information in Key.txt file to register application.\n3. Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:84fca2d53b281d0570b232e3fcaa15278c055014","amp;dn":"Mojosoft+BusinessCards+MX+v4.85+Multilingual+with+Key+%5BTorDigger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84fca2d53b281d0570b232e3fcaa15278c055014","infoHashBuffer":{"type":"Buffer","data":[132,252,162,213,59,40,29,5,112,178,50,227,252,170,21,39,140,5,80,20]},"announce":[],"urlList":[]}}