{"title":"[NubileFilms] Adriana Chechik, Hollie Mack (Anal Lovers) SD **NE","uid":12515504,"size":375675382,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:857ca687894756b82ac6f445a594a79cbf70947c&amp;dn=%5BNubileFilms%5D+Adriana+Chechik%2C+Hollie+Mack+%28Anal+Lovers%29+SD+%2A%2ANE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"UniX","files":1,"time":1443690067,"description":"[NubileFilms] Adriana Chechik, Hollie Mack (Anal Lovers) SD **NEW OCT 1,2015**\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-28D5_560CDAC1.html\r\n\r\nHollie Mack and Logan Pierce are enjoying themselves as they make out on the scenic balcony outside. When Adriana Chechik spots her liplocked friends from her bedroom, she knows that it's up to her to seduce them both into a hot and horny threesome.\r\n\r\nStrutting into the bedroom where Hollie and Logan have retired, Hollie puts her plan to action. She finds her friends more than willing, and before long she has joined Logan in getting Hollie out of her clothes. Soon Adriana has sampled both Hollie's juices and the musky flavor of Logan's dick. She goes to work on both of them, alternating between the sultry press of her soft lips and the touch of her clever fingers as she works both of her lovers into a sexual frenzy.\r\n\r\nSoon Hollie tires of acting as a passive participant. Climbing off the bed, she joins Adriana on her knees so that the girls can work together to deliver a lusty blowjob that Logan won't soon forget. Using their hands and mouths, they lavish attention on Logan's cock and balls until he is rock hard for them.\r\n\r\nLogan is happy to return the favor of an oral feast when the two girls exchange places with him. Now that he's on his knees, he goes to work licking and suckling their soft pussies and even their tightly puckered anuses. As Hollie and Adriana get increasingly worked up, Logan moves on to pushing his tongue deep into their pulsing twats and their tight ass holes.\r\n\r\nOnce Logan is convinced that Hollie is fully prepped and ready for his love, Logan gets onto his feet and pushes himself deep into her hot channel. Adriana makes sure that Logan is fully seated within his lover's fuck hole and then climbs over Hollie's face so that the blonde can enjoy a pussy feast.\r\n\r\nWhen it's Adriana's turn to get her snatch stuffed, she chooses a stiffie ride. Logan swaps places with Hollie, leaving Adriana free to straddle him while Hollie gets to do some orgasmic face sitting. It's not long before the horny coed decides to turn around so that she's positioned in reverse cowgirl, the perfect way to take Logan's dick deep in her ass.\r\n\r\nHollie is happy to help bring Adriana closer to climax as her lover pumps her hips and enjoys her anal pounding. Using her fingers and tongue, Hollie works Adriana's fuck hole and clit until her woman explodes with orgasmic ecstasy.\r\n\r\nLogan isn't done pleasuring the two girls yet! He urges Adriana onto her belly and coaxes Hollie to lie down on top of Adriana to create a double-stack of warm pussies for him to fuck. He takes Hollie's bald twat first, keeping his strokes long and hard as he brings the blonde coed to another climax.\r\n\r\nWith Hollie still pulsing and quivering on the bed, Logan turns his attention back to Adriana. Her moans of pleasure are loud and long as her ass is once again penetrated and pounded. Logan joins Adriana as she blasts into orbit yet again, pulling out to cover her with his cum","torrent":{"xt":"urn:btih:857ca687894756b82ac6f445a594a79cbf70947c","amp;dn":"%5BNubileFilms%5D+Adriana+Chechik%2C+Hollie+Mack+%28Anal+Lovers%29+SD+%2A%2ANE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857ca687894756b82ac6f445a594a79cbf70947c","infoHashBuffer":{"type":"Buffer","data":[133,124,166,135,137,71,86,184,42,198,244,69,165,148,167,156,191,112,148,124]},"announce":[],"urlList":[]}}