{"title":"Ghost In The Shell 2: Innocence","uid":3817138,"size":7249145856,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:859f25c96c85a0a57826a6f0afd9e71ddc957120&amp;dn=Ghost+In+The+Shell+2%3A+Innocence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sonic_fan1","files":14,"time":1190595381,"description":"Description:\nIt is the year 2032 and Earth is a world where the few remaining humans coexist with artificial replicants, cyborgs and robots.  Batou, a cyborg detective and his partner, Togusa are charged with investigating the bizarre case of a malfunctioning female sex droid that has murdered its owner.  As they delve deeper into the investigation they are forced to confront violent Yakuza thugs, devious hackers, influential government bureaucrats and powerful corporate criminals.\n\nPainstakingly created by Production IG and director, Mamaru Oshii (G.I.T.S, Avalon, Patlabor) Innocence seamlessly combines groundbreaking 2-D and 3-D CG animation techniques to produce and action-packed, sci-fi fable of a solitary cyborg struggling to retain what's left of his humanity in a world where the human soul is gradually fading into obscurity.\n\nDetails:\nRipped from the Region 2 Dual Layer DVD (uncompressed from the original DVD)\n1.85:1 Widescreen PAL\nEnglish 2.0 and 5.1 (Dubbed by the voice actors from the TV series Ghost In The Shell: Stand Alone Complex)\nJapanese 2.0 and 5.1\nEnglish subtitles (no closed captions)\nExtras:\nMaking Of...\nCommentary from Director Mamoru Oshii and Animation Director Toshihiko Nishikubo (Audio Commentary with optional subtitles... subtitles can be played alone during the movie, you don't have to run the audio commentary)\n\nPlease help me out on this one by seeding it as long as you can... I only have 256KBPS upload, so the more people we can get seeding this one, the better!  And, as always, ENJOY!","torrent":{"xt":"urn:btih:859f25c96c85a0a57826a6f0afd9e71ddc957120","amp;dn":"Ghost+In+The+Shell+2%3A+Innocence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"859f25c96c85a0a57826a6f0afd9e71ddc957120","infoHashBuffer":{"type":"Buffer","data":[133,159,37,201,108,133,160,165,120,38,166,240,175,217,231,29,220,149,113,32]},"announce":[],"urlList":[]}}