{"title":"Macromedia Dreamweaver 8.0.2","uid":7474605,"size":63134216,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:85a495fa42510e4d96a38e862965d2e50947cf91&amp;dn=Macromedia+Dreamweaver+8.0.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kekspit","files":-1,"time":1343256342,"description":"                        Macromedia Dreamweaver 8.0.2\n\n\nThis is easily better than the CS versions!\n\nWeb development tool, enabling users to efficiently design, develop and maintain standards-based websites and apps. Dreamweaver 8 is the industry-leading web development tool, enabling users to efficiently design, develop and maintain standards-based websites and applications.\n\nWork with the industry's leading web development tool.\nUse a world-class design and code editor in one tool.\n\nLearn one tool, then learn from the tool.\n\nDreamweaver supports and guides users as their skills grow and web technologies evolve, facilitating easy and quick adoption of new technologies and methodologies.\n\nAdd video easily.\n\nWith Dreamweaver 8 and Flash Video, it's a snap to place video content on the web. Drag and drop Flash Video into Dreamweaver 8 to quickly incorporate video to websites and applications.\n\nSimplify CSS.\n\nThe unified CSS panel provides a powerful and easy way to understand the cascade of styles applied to content as well as quick access to making changes without having to navigate a lot of code through trial and error.\nGet started with XML.\n\nSimply point a web page to an XML file or a URL of an XML feed and Dreamweaver will introspect it to enable dragging and dropping the appropriate fields onto the page.\n\nTap into the vast Dreamweaver community.\n\nOver three million strong, the Dreamweaver community offers many benefits, including the Macromedia Developer Center, developer certification programs, training and seminars, user forums, and independent community support sites. More than 800 free downloadable extensions are available through the Macromedia Dreamweaver Exchange. ","torrent":{"xt":"urn:btih:85a495fa42510e4d96a38e862965d2e50947cf91","amp;dn":"Macromedia+Dreamweaver+8.0.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a495fa42510e4d96a38e862965d2e50947cf91","infoHashBuffer":{"type":"Buffer","data":[133,164,149,250,66,81,14,77,150,163,142,134,41,101,210,229,9,71,207,145]},"announce":[],"urlList":[]}}