{"title":"QL Documentation CD  v 2.91","uid":4686507,"size":348254208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85ba781ad40ecfabd13d42b01143515dcb7d9929&amp;dn=QL+Documentation+CD++v+2.91&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"badaman_es","files":1,"time":1233252053,"description":"QL Is 25!\n\nQL DOCUMENTATION CD v2.91\n.ISO image\nLast Updated: 07/08/07\n\nWelcome to the QL Documentation CD, where I have set out to gather together all the publicly available documents about the QL into one single reference source.\n\nGrateful thanks are due to the various people who helped me gather these together and who gave me permission to use the material concerned, most especially Stuart Honeyball of Miracle Systems Ltd who allowed me to make available in electronic format manuals for his extensive range of QL expansion units, and Tony Firshman who gave me copies of the manuals for his QL hardware products.\n\nThanks are due to Jochen Merz who has allowed me to make available several articles from QL Today originally via my website. Bruce Nicholls and Alfred Kendall located the Hewlett Packard and Epson printer programming information files. Anyone else not mentioned, you are not forgotten but thank you too.\n\nGrateful thanks also to Laurence Reeves who has made available the sources for the Minerva ROM version 1.98, which will no doubt be of great interest to those who wish to tinker with the operating system and machine code generally.\n\nAnd special thanks to Simon Goodwin for sending me a number of documents on subjects as diverse as CPU notes, barcode scanners and Thor documents.\n\nThe idea behind this CD is to provide a &quot;one stop shop&quot; for QL related documentation. With this in mind, if you have any documentation to provide that is not already listed here, please contact us so that we may include it in later editions of this CD.\n\nFinally, thanks to Darren Branagh for his assistance in producing this CD. He's been a big inspiration in prompting me to get the Q-Celt CD-ROMs done for the QL world. I hope they have been of some use and interest to some of you at least!\n\nFinally, please remember that this CD may be freely copied although the material remains the copyright of the respective authors. Do the QL scene a favour and copy this CD for someone who hasn't already got a copy of it!\n\nDilwyn Jones\nhttp://www.dilwyn.uk6.net/index.html\n\nUploaded by:\nJavier Guerra (aka badaman)\nSinclair QL Spanish Resources\nhttp://sinclairql.es","torrent":{"xt":"urn:btih:85ba781ad40ecfabd13d42b01143515dcb7d9929","amp;dn":"QL+Documentation+CD++v+2.91","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ba781ad40ecfabd13d42b01143515dcb7d9929","infoHashBuffer":{"type":"Buffer","data":[133,186,120,26,212,14,207,171,209,61,66,176,17,67,81,93,203,125,153,41]},"announce":[],"urlList":[]}}