{"title":"Brandon_Boyd-Sons_of_The_Sea-CD-FLAC-2014-FORSAKEN","uid":11102125,"size":280576026,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85ee283107335529f942616a6c8bb4e472f59aff&amp;dn=Brandon_Boyd-Sons_of_The_Sea-CD-FLAC-2014-FORSAKEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaRGN","files":-1,"time":1411681606,"description":"Brandon Boyd-Sons of The Sea-CD-FLAC-2014-FORSAKEN\n\n\nRelease info:\n\nArtist : Brandon Boyd\nAlbum : Sons Of The Sea\nLabel : AVOW! Records\nGenre : Pop\nSource : CD\nStreet Date : 2014-09-23\nQuality : 943 kbps / 44.1kHz / 2 channels\nEncoder : FLAC 1.2.1\nSize : 278.05 MB\n\n\nSons of the Sea is the quintessential Brandon Boyd recordan\nintrospective, eclectic collection from the artist, author\nactivist, environmentalist and surfer that will tantalize\nlongtime fans while further spotlighting his evolving interests\nThe acclaimed Incubus vocalist is stretching his formidable\ncreative muscles in a daring new foray into solo music\n\nThe first taste of new material arrived June 25 in the form of\nfour-song EP Compass released worldwide on Avow Records\nINgrooves Fontana). From the eerie, synth-driven obsession of\nLady Black to the upbeat, Beatles-esque musing of Space and\nTime, these songs propel Boyd into exciting, untraveled terrain\nRounded out by the evocative Come Together and Where All the\nSongs Come From, Compass is representative of his innate\nrestlessness. For an artist like Boyd, the thrill and confusion\nof the quest to create will always trump the tangible, material\nrewards bestowed for his efforts\n\nWhile Boyds inviting, empathetic voice is familiar to millions\nSons of the Sea, infuses it in challenging new contexts. Produced\nby the renowned Brendan OBrien Incubus, Pearl Jam, Bruce\nSpringsteen, Rage Against the Machine), the album luxuriates in\ninnovative sonic backdrops, allowing what they coined as oddball\npop to flourish. Leadoff track Jet Black Crow flaunts what\nBoyd calls a stomping playfulness that befits his dreamlike\nmusing on infatuations ups and downs. And he is just as\ncompelling in the records many departures, playing lothario in\nthe seductive Come Together, contemplating his unique creative\nprocess in the piano-driven Avalanche, or paying tribute to\nEmily Dickinsons perspective on an artists responsibility via\nUntetheredtell us the truth, but tell it to us gently, lest\nwe all go blind\n\nBoyd and OBrien joined forces when Incubus went on hiatus\nfollowing 2011s If Not Now, When? After much toiling and\noverthinking about how I was to go about starting a new music\nproject, I decided that the best way forward was to let go\ncompletely! Boyd enthuses. Stop thinking about where, when\nwhat, who and how, and simplyGO\n\nThat ability to overcome doubt and give voice to complex thoughts\napplies to his visual art as well. Boyds third art book, So the\nEcho, will also emerged in September, following up acclaimed\npredecessors White Fluffy Clouds 2003) and From the Murks of the\nSultry Abyss 2007). A compendium of unobstructed watercolor, ink\npieces and photographic spreads, So the Echo offers some of my\nmost vulnerable observations yet, unedited and out on a limb\nAfter all, the echo towards a life of expressivity is only as\n\nThere is no end in creativity, Boyd concludes. Hence, to\nstrive towards an end result is a fools errand. Set goals, make\nmusic and paint pictures, but know that the crux of your\nhappiness balances delicately on the wings of the act of\ncreativity itself. Not at the finish line\n\n\n===============================================================================\n\nPlease Keep it For Continue Seeding and Help Others To Get Download\n\n===============================================================================","torrent":{"xt":"urn:btih:85ee283107335529f942616a6c8bb4e472f59aff","amp;dn":"Brandon_Boyd-Sons_of_The_Sea-CD-FLAC-2014-FORSAKEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ee283107335529f942616a6c8bb4e472f59aff","infoHashBuffer":{"type":"Buffer","data":[133,238,40,49,7,51,85,41,249,66,97,106,108,139,180,228,114,245,154,255]},"announce":[],"urlList":[]}}