{"title":"Jacquou le croquant (France; 2007) French audio with English sub","uid":4983727,"size":1821698732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:860b79494c77a8829106d30b59f961dbf1826fb3&amp;dn=Jacquou+le+croquant+%28France%3B+2007%29+French+audio+with+English+sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":3,"time":1246496237,"description":"Jacquou le croquant (France; 2007)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0418758/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0418758/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Jacquou_le_Croquant&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Jacquou_le_Croquant&lt;/a&gt;\n\nDirector: Laurent Boutonnat\n\nWriter: EugÃƒÂ¨ne Le Roy (novel)\n\n140 min.\n\nRelease Date: 17 January 2007 (Belgium) \n\nFrench audio dialog. Optional English subtitles.\n\nJacquou le Croquant is a 2007 French historical film. Set in the Dordogne during the Bourbon Restoration, it tells the story of a young peasant who leads a revolt against an evil nobleman. It was nominated for two CÃƒÂ©sar Awards in 2008.\n\nPlot: 1815. Jacquou, a young peasant (&quot;Croquant&quot;) from the Perigord region, lives happily with his parents. Misfortune falls upon the family when Jacquou's father is hunted for killing servants of a cruel and arrogant nobleman, the Count of Nansac. Jacquou's father flees the town but promises his son that he will join the family soon. Jacquou is acquainted with Galiote, Nansac's daughter, and her care-taker Lina when his mother works as a laundry maid at Nansac's castle with her identity untold. Jacquou at first tries to harm Galiote by letting pigs out of the pen as she throws pebbles at them, leaving the pigs agitated. However he changes his mind and saves her, leaving both Lina and Galiote impressed and grateful. Soon after this incident Jacquou's mother loses her job and is forced to leave the house with Jacquou. To make everything worse, all her attempts to save her husband fail as well. Jacquou's father is then captured and dies in prison. Upon this knowledge, she makes Jacquou swear to avenge his father's death. Jacquou's mother soon dies due to grief and harsh living conditions.\n\nHaving no one to take care of him, Jacquou begs on the streets alongside other children whom he befriends over time. And one cold winter night, Jacquou decides to kill himself by freezing to death in a cemetery beside a church. He is discovered by a priest who resuscitates him with his friend, the physician. Jacquou grows up under their protection and works as an altar boy.\n\nAfter Jacquou becomes an adult, he has his first confrontation with Nansac at a dance competition. Nansac shows up with his gang of servants, uninvited, and ruins the festive mood among the people. His daughter Galiote joins his father as well and it is revealed that she has a secret longing for Jacquou for having saved her life. Jacquou humiliates Nansac and defies his authority in front of townspeople. Infuriated Nansac soon has his men capture Jacquou and pushes him into the underground well to die. Nevertheless Jacquou manages to get out, finding a room filled with firearms in the process, and plots with his friends to overthrow Nansac. When he returns home, Jacquou finds Galiote in his home, who came in to avoid the rain. Although Jacquou orders her to get out at first, he soon softens and gives her some of his dry clothes before telling her to go home. When Galiote gets out of his house she is faced with an angry mob and narrowly escapes their hands.\n\nJacquou attacks Nansac's castle while a group of his men goes in to secure the weapons he discovered earlier. Many of Nansac's servants are killed by hidden marksmen and the nobles find themselves cornered. Jacquou fights Nansac alone and defeats him. When people urge him to kill Nansac, Jacquou responds that he would rather see him deteriorate miserably. When the castle is lit on fire and everyone seems to have gotten out, the nobles notice that Galiote is still in her room. Jacquou returns to save her and hands her over to Nansac. At then end of the night Jacquou thanks the townspeople for helping him but tells them not to be involved any further as they will probably be executed.\n\nSome time later Jacquou is seen at the court as he faces charge of rioting and sexually assauting Galiote, brought on by Nansac. However Galiote testifies in favor of Jacquou and swears that he never touched her. Jacquou is freed and Nansac tastes another defeat.\n\nNear the end Jacquou's friends tells him that Galiote is about to leave the town in search of work. Persuaded by Lina, Jacquou goes to bid adieu. He finally reconciliates with Galiote as he hugs her.\n\nGaspard Ulliel ...  Jacquou adulte \nLÃƒÂ©o Legrand ...  Jacquou enfant \n\n+++++++++++++++++++++++++++++\n\nRecommended tools for playback (all free downloads):\n\n1. Media Player Classic 6.4.9\n &lt;a href=&quot;\nhttp://download.cnet.com/Media-Player-Classic/3000-2139_4-10518778.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://download.cnet.com/Media-Player-Classic/3000-2139_4-10518778.html&lt;/a&gt;\n\n2. DivX Video Codec:\n &lt;a href=&quot;\nhttp://www.divx.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.divx.com/&lt;/a&gt;\n\n3. Audio filter:\n &lt;a href=&quot;\nhttp://ac3filter.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ac3filter.net/&lt;/a&gt;","torrent":{"xt":"urn:btih:860b79494c77a8829106d30b59f961dbf1826fb3","amp;dn":"Jacquou+le+croquant+%28France%3B+2007%29+French+audio+with+English+sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"860b79494c77a8829106d30b59f961dbf1826fb3","infoHashBuffer":{"type":"Buffer","data":[134,11,121,73,76,119,168,130,145,6,211,11,89,249,97,219,241,130,111,179]},"announce":[],"urlList":[]}}