{"title":"The Goopy Bagha Collection (3 films) - Bangla - AVCHD.AC3 - ENG","uid":9872043,"size":8362459360,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:861824145781c2f8fcacd473fee310aada177661&amp;dn=The+Goopy+Bagha+Collection+%283+films%29+-+Bangla+-+AVCHD.AC3+-+ENG+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"debpk77","files":-1,"time":1396422740,"description":"Three Films of Satyajit Ray\n\nSynopsis:\n\nGoopy Gayen Bagha Bayen: \n\nGopinath Kayen, s/o Kanu Kayen wants to sing, although he does not know the ABC of music. Bagha is a drummer who cannot keep rythm. Both are banished from their homes and meet, by chance, in a forest. Adversity makes them friends and taking pity on them, the king of Ghosts gifts them the power of making music, unlimited travel and the ability to conjure up food at will. They reach Shundi, whoose king is a music lover but who is miserable as his subjects cannot speak because of a spell cast by an evil magician. They charm the court with their music and win the heart of the King, only to learn that Shudi will be invaded by neighbouring Halla. They go to Halla hoping to broker peace and how they manage to do it is the story of this film...\n\nHirok Rajar Deshe: \n\n10 years have passsed since they became the sons-in-law of the King of Shundi and Goopy and Bagha are bored stiff. Suddenly comes an invitation from the Land of Diamonds. The King there is preparing for festivities on his ascension and wants Goopy and Bagha to sing during the celebrations. Delighted the duo goes off to the Land of Diamonds. Travelling incognito, they come across a stark reality. Their host, the King is a ruthless and exploitative tyrant, who brainwashes his opponents using a machine developed by a mad scientist. Teaming up with a fiercely patriotic teacher, Goopy and Bagha get down to setting things right..\n\nGoopy Bagha Firey Elo: \n\nThe old king of Shundi has retired and Goopy and Bagha are kings in his place. But the travel lust gets the better of them again, so leaving the affairs of the Kingdom, the start out, finally reaching the Kingdom of Anandapur. Here they come across Brahmananda, a Tantrik, who tells them that he can reduce their ages by 20 years and make them young again. Goopy and Bagha fall for his promises and he makes them steal some valuable jewels from kings across the world. The evil Brahmananda does not stop at that. He imprisons 15 young boys with the name of Bikram and mesmerises them into being his slaves. He does this for it has been foretold that a boy named Bikram at Anandapur will be the cause of his death. When Goopy and Bagha llearn they have been tricked, they repent and come to the support of Kanu, a young boy, whose real name is Bikram....\n\n\nComments:]\nThese are three films made 11 years apart which are probably the most lovable fantasies ever made. Its not really the story, but the music that made the films great as did of course the irresitible charm of Tapen Chattopadhyay (Gupi) and Robi Ghosh (Bagha). Sadly, there will be no more Gupi Bagha films for Robi Ghosh is no more and nor is Ray and his brilliant musical scores. It is in these films that his musical genius reached its peak, for the songs of Gupi and Bagha are immortalised in the minds of perhaps every Bengali.\n\nUnfortnately these great films are only available in very poor quality and that too not in a single collection. For some time I have been toying with the idea of enhancing the video of these films. I had earlier uploaded &quot;Goopy Gyne Bagha Byne&quot; and &quot;Hirak Rajar Deshe&quot; in x.254/MKV format and will be uploading &quot;Goopy Bagha Phirey Elo&quot; in a coulple of days, as promised a long time earlier. But the enthusiastic response made me think a little bit more ambitiously. What if I could put all the three together in a single collection? Could I add on a menu, as I had once done earlier for &quot;Satyajit ray Presents&quot; although that was in DivX? Could I fit it in one single DVD disc so people can enjoy it off-line? At the same time could I make it possible to play the menu and the movies on the computer as well? The answer was in the AVCHD/Blu-Ray format and so here is the end result. I believe it is the only AVCHD rip on the net.\n\nPlease do read the Uploaders Notes below. It will help you enjoy these immortal movies more.\n\nUploader's Notes:\n\nThe Menus:\nFirst about the menu. It is in two parts. The welcome screen has a rotating cube which gives the DVD covers of each of the three movies and a picture of Satyajit Ray. The background music is the music of the Entry of the Halla King from &quot;Goopy Gyne Bagha Byne&quot;.\n\nThe background image of the main menu is a sketch of the &quot;Dance of the Ghosts&quot; domne by Satyajit Ray before he made &quot;Goopy Gyne&quot;. I have added animation to the still image so that the Ghosts actually dance. The background music is the music from the scene in &quot;Hirak Rajar Deshe&quot; where Hirak is giving away necklaces to his ministers.\n\nThe two menus are in 1080p (1920x1080) size.\n\nHow To Play:\n\nOffline: This is a AVCHD rip with the three parts organised and a menu added in a Blu-Ray format. To play from a DVD disc, use any burning software such as ImgBurn to write the entire AVCHD folder to a 8.5 GB DVD disc. You can then play it on any player that is AVCHD compatible (all blu-ray players are). It works on my Phlips player.\n\nOn your PC: If you don't have a Blu-Ray player, you can watch the movie on your PC. It will not fully play on VLC or any ordinary player. To play this please download a Blu-Ray player software. I recommend Nero Blu-Ray player which plays it perfectly. Just drag and drop the AVCHD folder into Nero Blu-Ray Player.\n\nIf you insist on using your existing software, you can do it still. Just open the folders until you reach the sub-folder called 'STREAM'. There you will find five files. 00000.MTS is GGBB; 00001.MTS is HRD and 00003.MTS is GBFE; 01200.MTS is the Welcome Menu and 01201.MTS is the main Menu. Each will individually play in VLC or MPC etc. But the menus will not respond to mouse clicks on its buttons.\n\nEnjoy!","torrent":{"xt":"urn:btih:861824145781c2f8fcacd473fee310aada177661","amp;dn":"The+Goopy+Bagha+Collection+%283+films%29+-+Bangla+-+AVCHD.AC3+-+ENG+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861824145781c2f8fcacd473fee310aada177661","infoHashBuffer":{"type":"Buffer","data":[134,24,36,20,87,129,194,248,252,172,212,115,254,227,16,170,218,23,118,97]},"announce":[],"urlList":[]}}