{"title":"Borderlands.2.Update.v1.6.0.Incl.DLC-RELOADED","uid":8978606,"size":2218459879,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:865032bc3786bc01f57f3d4f46929bd9d26cc000&amp;dn=Borderlands.2.Update.v1.6.0.Incl.DLC-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":6,"time":1380502157,"description":"\n                                      nERv\n\n\n              Borderlands 2 Update v1.6 Incl. DLC (c) 2K Games\n\n      09/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam+CEG\n            - :.......... DISC(S) .. GAME.TYPE ........: FPS &amp; RPG\n\n\nNote:\n~~~~~\nCheck the included text file for a list of whats been patched. The initial\nSkidrow release patched with our update 1.5 is required in order to use\nthis release.\n\nDLCs included in 1.5 update:\n\n- Borderlands 2: Ultimate Vault Hunters Upgrade Pack\n- Borderlands 2: Sir Hammerlocks Big Game Hunt\n- Borderlands 2: Mr. Torgue s Campaign of Carnage\n- Borderlands 2: Mechromancer Pack\n- Borderlands 2: Captain Scarlett and her Pirates Booty\n\nNew DLCs included with this update:\n\n- Borderlands 2: Creature Slaughterdome (GameStop Preorder)\n- Borderlands 2: Ultimate Vault Hunters Upgrade Pack 2\n- Borderlands 2: Psycho Pack\n- Borderlands 2: Tiny Tinas Assault on Dragon Keep\n- Borderlands 2: Mechromancer Steampunk Slayer Pack\n- Borderlands 2: Collectors Edition Pack\n- Borderlands 2: Premiere Club\n\n--\n\nA new era of shoot and loot is about to begin. Play as one of four new vault\nhunters facing off against a massive new world of creatures, psychos and the\nevil mastermind, Handsome Jack. Make new friends, arm them with a bazillion\nweapons and fight alongside them in 4 player co-op on a relentless quest for\nrevenge and redemption across the undiscovered and unpredictable living\nplanet.\n\nKey Features:\nAll-New Characters and All-New Classes: Four all new playable classes\nincluding the Siren, the Commando, the Gunzerker and the Assassin. Step into\nthe role of the Gunzerker, whose highly deadly skills allow him to dual-wield\nany two weapons found in the game. Not only that, you will build on that skill\nto do more things with two guns than you ever imagined possible. Dual machine\nguns? Cool. Dual rocket launchers? Of course! Dual Sniper Rifles? Sure, if\nthat s your thing! Want to try other styles? More tactical perhaps? There are\nmultiple classes to choose from!\nDynamic Co-op online, and LAN: Share your adventures with friends both online\nand via LAN. Borderlands 2 features a seamless system enabling you to drop in\nand drop out of a campaign without ever having to restart the game. On top of\nthat you can even take your new gear from any game to any other!\nWorld Connected Story: Find yourself left for dead in the frozen tundra of\nPandora as you begin your quest of revenge and redemption. Expose the evil\nsurrounding the Hyperion Corporation and take on the perpetrator of a universe\n-wide grand deception -- the nefarious Hyperion CEO, Handsome Jack. (Oh, also:\nhes stolen credit for the opening of the Vault.)\n87 Bazillion...Everything: In addition to the new gun system, you will lust\nafter procedurally generated shields, grenades, Relics, class mods and much,\nmuch more. And you thought the original Borderlands had a ton of loot!\nBrand new environments on Pandora: Hunt through entirely brand new areas of\nPandora that are more alive than ever! From the arctic tundra, through the\ndangerous grasslands, past the mysterious corrosive caverns to beyond, you ll\nbe surprised by the unpredictable world of Pandora at every turn!\nBrand new enemies: A whole slew of new enemies are out there to kill you in\nBorderlands 2. Hulking, gorilla-like Bullymongs, vicious predatory Stalkers\nand the Hyperion mechanical army, run by Handsome Jack, are just some of the\nnew enemies in Borderlands 2.\n\n\n1. Unrar.\n2. Install the update to where you have the game installed.\n3. Copy over the cracked content from the Crack directory to your game\n   install directory : BinariesWin32\n4. We recommend not allowing the game to go online, use your firewall.\n5. Launch the game with BinariesWin32Borderlands2.exe.\n6. Support the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:865032bc3786bc01f57f3d4f46929bd9d26cc000","amp;dn":"Borderlands.2.Update.v1.6.0.Incl.DLC-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"865032bc3786bc01f57f3d4f46929bd9d26cc000","infoHashBuffer":{"type":"Buffer","data":[134,80,50,188,55,134,188,1,245,127,61,79,70,146,155,217,210,108,192,0]},"announce":[],"urlList":[]}}