{"title":"Hanan Ashrawi - This Side of Peace: A Personal Account (pdf)","uid":8672690,"size":4855481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:872b7ba85d25759a9b31f357031ca5bb34be4963&amp;dn=Hanan+Ashrawi+-+This+Side+of+Peace%3A+A+Personal+Account+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373527143,"description":"Hanan Ashrawi - This Side of Peace: A Personal Account (Simon and Schuster, 1995). 318 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nAutobiography of an Arab Christian politician in Palestine.\n\ndescription:\n\nThis is a personal account of the struggle of Hanan Ashrawi who, by adhering to a moderate political stance, worked for the co-operation and coexistence of Arabs and Jews in Palestine. A Christian woman, living in a predominantly male, moslem community, she affords a glimpse into the truth behind the PLO and tells how she helped to bring the Israeli and Palestinian women's movement together. When the Intifada erupted in Palestine in 1987, Hanan Ashrawi found her way to the front lines of the revolution, becoming a crucial link between the established but exiled leadership of the PLO and the outside world. Later, in 1993, she sat waiting on the White House lawn for the signing of an agreement, and a final handshake, between the Palestinians and the Israelis. Her story is one of an oppressed people, of the hierarchy of the PLO, and of Middle Eastern diplomacy.\n\nFrom Publishers Weekly\n\nAshrawi, who came to international media attention as a spokeswoman for the Palestine Liberation Organization (PLO) during the long, frustrating peace negotiations with Israel, gives a notable behind-the-scenes account of the events leading up to the signing of the accord by Prime Minister Rabin and PLO chairman Arafat on the White House lawn. A major player in these events, she speaks proudly of her participation in organizing the intifada, with passion of her people's anger and humiliation under Israeli occupation and with dissatisfaction of the final agreement, which brought on her resignation. Here we see the human side of the Arab-Israeli dilemma, through the eyes of an independent, intellectual Arab woman brought up in a freethinking Christian-Muslim household where daughters were considered a gift, not a curse. Ashrawi offers a close-up portrait of Arafat as well as of the major American and Israeli negotiators, Palestinian women emerging from passivity to join the intifada, the outrage at the U.S. pro-Israel policy and the dissident Israelis who became her friends. Though committed to peace, Ashrawi is intransigent on still unresolved problems, among them the Arab claim to Jerusalem. A revealing document of a partisan who has helped make Middle East history. Photos not seen by PW. Author tour. \nCopyright 1995 Reed Business Information, Inc.\n\nFrom Library Journal\n\nAshrawi, a Christian Palestinian woman from a prominent family and a political activist who has been a spokesperson for the Palestinian delegation in the on-going peace talks with Israel, provides a rare insight not only into the diplomacy involved but also into her ethnic community. This autobiographical approach is extremely well characterized. Ashrawi delves into the attitudes of many of the Palestinian political elites, examining their cultural heritage and how it has affected their behavior. Of course, she also provides an intimate detailing of the intricate diplomatic process by which the Palestinian delegation treated its demands dealing with the PLO, several Arab states, and the United States. The reader gets a firm feel for the delicacy of multilateral diplomatic talks and the pressure that can be brought to bear by major and more powerful political bodies on groups with no recognized government. This work is essential to the understanding of the current phase of the Arab-Israeli conflict and is required reading.","torrent":{"xt":"urn:btih:872b7ba85d25759a9b31f357031ca5bb34be4963","amp;dn":"Hanan+Ashrawi+-+This+Side+of+Peace%3A+A+Personal+Account+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"872b7ba85d25759a9b31f357031ca5bb34be4963","infoHashBuffer":{"type":"Buffer","data":[135,43,123,168,93,37,117,154,155,49,243,87,3,28,165,187,52,190,73,99]},"announce":[],"urlList":[]}}