{"title":"Orange.County.Choppers.S01E01.The.Goodys.Popcorn.Bike.WS.DSR.x26","uid":9208244,"size":403743776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87405e6106467183e872640e00ee02ff24a14517&amp;dn=Orange.County.Choppers.S01E01.The.Goodys.Popcorn.Bike.WS.DSR.x26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"luxuryoils","files":-1,"time":1384736830,"description":"The world's most renowned custom motorcycle manufacturer and its fearless leader return to television in &quot;Orange County Choppers&quot;, a new eight-episode series premiering on CMT later this year. With production scheduled to begin this summer, the show follows &quot;Orange County Choppers&quot; founder Paul &quot;Senior&quot; Teutul Sr. and his team as they reach new extremes resulting in mind-blowing bikes and state-of-the-art drama. Known for his mustache, tattooed biceps and sleeveless T-shirts, Senior has been at the helm of OCC for more than 10 years. In the '70s, he was running a steel manufacturing business when he started building motorcycles as a hobby. In 1999, he turned his passion project into a fabrication shop he called &quot;Orange County Choppers&quot;. Today, the company that began as a side operation has become a world-famous empire.\n\nSeason 1, Episode 1 - &quot;The Goodys Popcorn Bike&quot;\nBusiness is booming at OCC, and Paul Senior has hired the young, ambitious Evan as creative director, making him in charge of managing and fabricating new bike builds. Goody's Popcorn commissions a chopper that they intend to raffle off to raise money to send popcorn to military troops. Evan helps Jason design the bike and seems to be taking charge of the build, but when he decides to fabricate a unique glass-sided gas tank using an old-school method, the crew becomes skeptical of Evan's skills. Furthermore, Evan takes it upon himself to deal with the client directly, which is against the rules of OCC. Senior puts Evan on probation, forcing him to take a back seat on the next build so he can focus on learning how OCC operates.","torrent":{"xt":"urn:btih:87405e6106467183e872640e00ee02ff24a14517","amp;dn":"Orange.County.Choppers.S01E01.The.Goodys.Popcorn.Bike.WS.DSR.x26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87405e6106467183e872640e00ee02ff24a14517","infoHashBuffer":{"type":"Buffer","data":[135,64,94,97,6,70,113,131,232,114,100,14,0,238,2,255,36,161,69,23]},"announce":[],"urlList":[]}}