{"title":"His Name Was Jason - 30 Years of Friday the 13th {all extras}","uid":7970994,"size":4547930947,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:876cfaa1f3323c3e6f11860e6e221b55e7fc3143&amp;dn=His+Name+Was+Jason+-+30+Years+of+Friday+the+13th+%7Ball+extras%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1356841985,"description":"His Name Was Jason - 30 Years of Friday the 13th\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 649 MiB\nDuration                                 : 1h 17mn\nOverall bit rate                         : 1 167 Kbps\nWidth                                    : 718 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate                               : 29.970 fps\nBits/(Pixel*Frame)                       : 0.097\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://image.bayimg.com/pamccaadj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/pamccaadj.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/His-Name-Was-Jason-Splatter/dp/B001L9EXNO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/His-Name-Was-Jason-Splatter/dp/B001L9EXNO&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1282052/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1282052/&lt;/a&gt;\n\n\nNOTE - This thing has about 50 extras. I could not be bothered to go through and label them.\n\nAmazon.com\n&quot;Jason has no expiration date,&quot; as someone observes in the exhaustive His Name was Jason, a touch-all-the-bases approach to chronicling horror's blankest killer. Yep, it's all too true. Timed to mark the 30th anniversary of the Friday the 13th franchise, but probably more to serve as publicity for the 2009 remake, His Name was Jason is a two-disc set containing the 90-minute title doc plus a bevy of shorter, themed extras. Jason gives a quick run-through of all the Friday the 13th installments, filled out with detailed analysis of Jason as a cultural phenomenon and copious memories from the various casts and crew. (The better-known actors who have passed through the series--namely Kevin Bacon, Corey Feldman, and Crispin Glover--aren't around for interviews.) Special-effects gore maestro Tom Savini's wry delivery guides us through the story, with a few newly-staged murders along the way. Extensive clips are used to illustrate the grisly single-mindedness of Jason's killing, and various directors, including franchise guru Sean S. Cunningham, weigh in on the heaviness of guiding the various episodes. It all seems surreally weird, in the light of the movies' general lousiness and the trashy elevation of the empty-vessel killer to icon status. The 90-minute documentary is just the beginning, it turns out: fans can delve deep into the nuances of life (and death) at Crystal Lake. A 45-minute featurette on the actors who played Jason fills out disc one, and a plethora of other shorts (most of them culled from the same interview sessions, this time without the supporting clips) crowd disc two. There's another hour and 20 minutes of stories from directors, and 30 minutes of screenwriter anecdotes. &quot;Dragged from the Lake&quot; gives light to some amusing discrepancies in the series, as well as detailing actress Adrienne King's horrifying experience with a stalker. Fourteen minutes of fan films give parodistic views of the Jason experience, and &quot;Friday the 13th in 4 minutes&quot; gives a tongue-in-cheek shorthand account of the entire saga. Director Joseph Zito and actor Erich Anderson re-visit the set of The Final Chapter, and actress Gloria Charles takes a tour of the deadly barn from Part 3. Shorter extras include a 5-minute Crystal Lake survival guide (i.e., interviewees reciting the worst mistakes you can make while in proximity to Jason), a quick trip to a Comic-Con, and a tour of Universal Studio's Friday the 13th horror house. Things round off with a funny bogus ad for the law offices of a character from Part 3, Shelly Finkelstein, the kid that introduced the hockey mask into the series. It's a lot of effort for a low point in horror history. --Robert Horton","torrent":{"xt":"urn:btih:876cfaa1f3323c3e6f11860e6e221b55e7fc3143","amp;dn":"His+Name+Was+Jason+-+30+Years+of+Friday+the+13th+%7Ball+extras%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"876cfaa1f3323c3e6f11860e6e221b55e7fc3143","infoHashBuffer":{"type":"Buffer","data":[135,108,250,161,243,50,60,62,111,17,134,14,110,34,27,85,231,252,49,67]},"announce":[],"urlList":[]}}