{"title":"ExploitedCollegeGirls - Sarah","uid":13087407,"size":296446206,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:882e6a05b2365c487a838d46edb5301687ed32f9&amp;dn=ExploitedCollegeGirls+-+Sarah&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":1,"time":1450987366,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/UB\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Sarah\r\nNPP site and the site: ExploitedCollegeGirls.com\r\n\r\nYear: 2015\r\nGenre: Deep Throat, Ball Licking, Sex Toys, Big Tits, Amateur, Casting, POV, Hardcore\r\nDuration: 00:45:50\r\n\r\nFor our Christmas update we decided to find the naughtiest girl on the naughty list and get her on camera. Lucky for us this year's candidate has an amazing ass, triple D cup titties, a super cute face and a husband at home. Wait, a what? Yes, this week's busty blonde nympho has both an insatiable sexual appetite AND a gent at home who thinks he's doing enough to satisfy it. Spoiler alert, he's not. But Jay sure takes a crack at it. Best case scenario - hubs watches this video and learns how to bang wife better. Worst case - hubs is a jealous hillbilly and enlists his kin to track Jay (not his real name, thank god) down and exact revenge.\r\n\r\nIf you like your nymphomaniac housewives thick and pale then Sarah is just about perfect. From her freckly face to her triple D cup funbags to her huge, bouncy ass she's the perfect example of a certain type of girl. We learn about Sarah's &quot;free spirited&quot; ways in the behind the scenes interview as Jay rolls through his standard list of questions. While he rarely slows down (or pays much attention) in this case he runs right into a brick wall when Sarah confesses that she's &quot;kinda&quot; married. By &quot;kinda&quot; we're guessing that Sarah has a guy at home who pays the bills and thinks he's married to her. Let this be a lesson gents, you marry a nympho, she's a timeshare, not a permanent residence. Sarah is not bothered by this, though. She's perpetually and happily horny by nature, and she does what she does. Which suits us and Jay (we really want to stress that's not his real name) just fine. For example, when he asks her to blow him in the car on the way to the shoot, she does not hesitate and swallows his cock to the base with a smile.\r\n\r\nOnce settled on the bed, Sarah reveals her huge natural tits and fine thick ass. Jay's just as excited to start as she is and he gets right to work with his fingers and then a vibrator on her bare pussy. Judging by the way she squirms and moans and the way her pussy creams up, Jay is doing something just right. This is confirmed when, a few seconds later, she squirms her way into a vocal orgasm. After some more deep throat, Jay is ready to ride and slides his cock into Sarah's creamy pussy eventually eliciting another orgasm that she begs for.\r\n\r\nTo get a better look at that big ole booty, he flips her over and readies her for some face down pounding. This seems to hit the spot, she's totally blissed out by the deep penetration. So, after showing Sarah what it's like to get fucked by a pro, Jay has her drop to her knees and covers her with jizz in a big, facial finish. Do you think when Sarah arrived home after the shoot and hubby kissed her on the cheek he had any idea he was tasting Jay (really not his real name, not even close, we promise) jizz?\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 480x270 29.97fps 794kbps\r\nAudio: AAC 22050Hz stereo 65kbps","torrent":{"xt":"urn:btih:882e6a05b2365c487a838d46edb5301687ed32f9","amp;dn":"ExploitedCollegeGirls+-+Sarah","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"882e6a05b2365c487a838d46edb5301687ed32f9","infoHashBuffer":{"type":"Buffer","data":[136,46,106,5,178,54,92,72,122,131,141,70,237,181,48,22,135,237,50,249]},"announce":[],"urlList":[]}}