{"title":"Flax oil as a true aid against arthritis, heart infarction, canc","uid":6382771,"size":1589223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:883a4c3b5c4ffdaf4601017e1f2623e31e930e32&amp;dn=Flax+oil+as+a+true+aid+against+arthritis%2C+heart+infarction%2C+canc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flaxindia","files":1,"time":1305090331,"description":"After three decades of research Dr. Budwig,  sixtime nominee for the Nobel\nAward, found that the blood of seriously ill cancer patients was always,\nwithout exception, deficient in certain important essential ingredients\nwhich included substances called phosphatides and lipoproteins. (The blood\nof a healthy person always contains sufficient quantities of these essential\ningredients. However, without these natural ingredients cancer cells grow\nwild and out of control.)\n\n\nBlood analysis showed a strange greenish-yellow substance in place of the\nhealthy red oxygen carrying hemoglobin that belongs there. This explained\nwhy cancer patients weaken and become anemic. This startling discovery led\nDr. Budwig to test her theory.\n\n\nShe found that when these natural ingredients where replaced over\napproximately a three month period, tumors gradually receded.The strange\ngreenish elements in the blood were replaced with healthy red blood cells as\nthe phosphatides and lipoproteins almost miraculously reappeared. Weakness\nand anemia disappeared and life energy was restored. Symptoms of cancer,\nliver dysfunction and diabetes were completely alleviated.\n\n\nDr. Budwig then discovered an all natural way for people to replace those\nessential ingredients their bodies so desperately needed in their daily\ndiet. By simply eating a combination of just two natural and delicious\nfoods not only can cancer be prevented but in case after case it was\nactually cured. (These two natural foods, organic flax seed oil &amp; cottage\ncheese) must be eaten together to be effective since one triggers the\nproperties of the other to be released.)\n\n\nAfter more than 10 years of solid clinical application, Dr. Budwig\\\\\\'s natural\nformula has proven successful where many orthodox remedies have failed. Dr.\nBudwig\\\\\\'s formula has been used therapeutically in Europe for prevention of:\nCancer! Arteriosclerosis, Strokes, Cardiac Infarction, Heartbeat\n(irregular), Liver (fatty degeneration), Lungs (reduces bronchial\nspasms), Intestines (regulates activity). Stomach Ulcers (normalizes\ngastric juices), Prostate (hypertopic), Arthritis (exerts a favorable\ninfluence), Eczema (assists all skin diseases), Old age (improves many\ncommon afflictions), Brain (strenghthens activity), Immune Deficiency\nSyndromes (multiple sclerosis, autoimmune illnesses)\n\n\nThousands have flocked to hear Dr. Budwig lecture all over Europe. The many\npeople Dr. Budwig\\\\\\'s formula has helped testify to the benefits of her\nremarkable discovery.\n\n\n\n\n--------------------------------------------------------------------------------\n\n\n\nDr. Budwig is internationally recognized as the world\\\\\\'s leading authority\non fats and oils.\n\nShe was one of the first to realize the detrimental effect of processing\nmethods on essential fatty acids.\n\nThe two essential fats are defined as alpha-linolenic LNA , an omega-3\nfatty acid,\n\n and linoleic acid LA an omega-6 fatty acid.\n\n\nThey are two of the 90 essential nutrients necessary for good health.\n\n\nThe essential nutrients must be obtained through the diet and cannot be\nbiosynthesized by the human body. A deficiency of alpha- linolenic acid or\nlinoleic acid potentiates faulty fatty acid metabolism. Essential fatty\nacids are found most abundantly in unadulterated seed oils.\n\nFlaxseed oil is the undisputed champion, containing both essential fats in\nappreciable amounts, and especialy Omega 3 , which most people are\ndeficient of.\n\n\nFlax is nature\\\\\\'s richest source of omega-3 fatty acids with a whopping 57%\nalpha-linolenic acid.\n\n\nEssential fats are classified as polyunsaturated fatty acids. This class of\nfats are relatively unstable when exposed to excessive heat, light and\noxygen. Large commercialized processing methods employ these destructive\nelements, in addition to chemical means, to effectively saturate the\npreviously unsaturated bonds. This mechanism robs the essential fats of\ntheir omega-3 and -6 properties, transforming them into totally saturated,\naltered fats (hydrogenated trans-isomers).\n\n\nDr. Budwig attributes not only the escalating rate of heart disease to\nhazardous processing methods, but also the incidence of cancer, stroke,\neczema, arthritis, MS, IBD, Asthma, Aids, Psoriasis,  and many other\nmaladies of our time.\n\nThis may very well be factually proven, as leading researcher and author,\nDr. Donald Rudin, has reported that most Americans are at least 80% \ndeficient in the essential fats.\n\n\nHormone-like substances, called prostaglandins, are produced from essential\nfatty acids. One of the many important functions of prostaglandins are\ntheir regulating effect on arterial muscle tone. Any disturbance\nfacilitated by a lack of dietary essential fatty acids may disrupt this\nsystem of checks and balances, resulting in arterial muscle spasm.\n\n\nA favorable dietary intake of omega-3 and omega-6 fatty acids in the form\nof flaxseed oil ensures balanced prostaglandin production, thus regulating\nproper arterial constriction and relaxation.\n\nThe best ballance of Omega3 : Omega6 is  1:2.\n\nFlaxseed oil is not suppose to be the only fat in your diet, as in this case \nactual ballance would be 2 :1, what will after 5 - 12 months cause LA \ndeficiency and diseases.\n   \n\nScientific studies have also shown normalization of blood lipids (fats) in\nhyper-lipidemic individuals when supplemented with essential fatty acids.\nDecreases in harmful LDL cholesterol, increase in favorable HDL\ncholesterol, and reduction of triglyceride levels have been demonstrated.\n\nNever has this paradox of decreasing harmful blood lipids by increasing\nfavorable fatty acids been so wonderfully depicted as in the true life\nstory, now made famous in the film, \\\\\\&quot;Lorenzo\\\\\\'s Oil\\\\\\&quot;.\n\n\nFurther, essential fatty acids are paramount in ferrying oxygen from\nhemoglobin (the oxygen carrier in red blood cells) to each and every one of\nour one hundred trillion cells. A lack of oxygen (hypoxia) or loss of\noxygen (anoxia) to the heart muscle with resultant tissue death is the\ndefinition of myocardial infarction (heart attack).\n\n\n\n\n","torrent":{"xt":"urn:btih:883a4c3b5c4ffdaf4601017e1f2623e31e930e32","amp;dn":"Flax+oil+as+a+true+aid+against+arthritis%2C+heart+infarction%2C+canc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"883a4c3b5c4ffdaf4601017e1f2623e31e930e32","infoHashBuffer":{"type":"Buffer","data":[136,58,76,59,92,79,253,175,70,1,1,126,31,38,35,227,30,147,14,50]},"announce":[],"urlList":[]}}