{"title":"vocabulary expansion  Dave Hopkins disk 9 of 25.3gp","uid":5243571,"size":29293810,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:890bfb3f9ed170615669f47064be433d39ff7389&amp;dn=vocabulary+expansion++Dave+Hopkins+disk+9+of+25.3gp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daveshelper","files":1,"time":1261889155,"description":"\n\t\nvocabulary expansion  Dave Hopkins disk 9 of 25\n\nEncoded to .3gp\n\nLow resolution , small file easy to pass along via blue tooth.\n\nIntended for play on IPOD, Cell phone, Hand held\n\nI took this course in Ban Phe Thailand.\n\nIt's a real dog and pony show. You get to watch dave hopkins put his hand to his head, close his eyes and magically recite from memory.\n\nThe man dave hopkins is like the course  fake.\n\nHe claims never to have taught the same lesson plan twice. True only in the respect that he has taught the same lessons thousands of time. Telling class after class the same crap.\n\nOne might be amazed when you talk about the class to any one in the local restaurants and the people can finish the sentences for you.\nThey have herd the same lines about good old dave time and time again.\n\nThen there is the matter of the hundreds of people being defrauded. Many of the Tefl sites (many sites, many names and all belong the thief bruce veld) claim that it is legal to teach in Thailand having no degree. They claim only a Tefl International TESOL certificate is required.\nIt is of course a lie.\n\nI'm one of those. Though I have 131 college credit hours (that's more than 4 years)the subjects are varied and I do not have a 4 year degree.\n\nNote:\nThe exact same course taught by Tefl International has been posted online here: http://thepiratebay.se/user/daveshelper\n\nFree to download, all you need is use a file share program such as uTorrent from utorrent.com.\n\nNo one in their right mind knowing what this is would still pay to take this course.\n\nGetting to know Tefl International:\n\n\n\nThis is more than funny. Despite the humorous side it's disgusting.\n\n\nOr Google  Tefl International + scam\n\n\nThe purpose of posting this entire set of files is to give anyone curious the opportunity to know exactly what it is without being cheated of your money.\n","torrent":{"xt":"urn:btih:890bfb3f9ed170615669f47064be433d39ff7389","amp;dn":"vocabulary+expansion++Dave+Hopkins+disk+9+of+25.3gp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"890bfb3f9ed170615669f47064be433d39ff7389","infoHashBuffer":{"type":"Buffer","data":[137,11,251,63,158,209,112,97,86,105,244,112,100,190,67,61,57,255,115,137]},"announce":[],"urlList":[]}}