{"title":"Slumdog Millionaire 2008 [Dutch Retail]","uid":4784306,"size":4654649344,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:89f679a545acf83c4e22e77868eb7557f904013b&amp;dn=Slumdog+Millionaire+2008+%5BDutch+Retail%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Wetboy101","files":20,"time":1237495327,"description":"Slumdog Millionaire *2008*\n\nRetail DVD met menu en DD 5.1 \n\nVerenigd Koninkrijk\nDrama / Misdaad\n120 minuten\n\ngeregisseerd door Danny Boyle en Loveleen Tandan\nmet Dev Patel, Freida Pinto en Anil Kapoor\n\nHet verhaal van Jamal Malik, een jong weeskind dat besluit deel te nemen aan de Hindi versie van het programma 'Who Wants to be a Millionaire'. Het hele land kijkt toe terwijl Jamal nog maar ÃƒÂ©ÃƒÂ©n vraag verwijderd is van de hoofdprijs. Tijdens de pauze van het programma gebeurt er echter iets waar Jamal niet op had gerekend; hij wordt gearresteerd, omdat de politie zeker weet dat hij de boel aan het oplichten is. Ze kunnen het niet geloven dat een straatjongen zoals hij zoveel kennis heeft. Vastberaden zijn onschuld te bewijzen vertelt Jamal verhalen over de krottenwijk waar hij samen met zijn broer opgroeide, de avonturen die ze beleefden, ontmoetingen met bende's en hij vertelt over zijn vroegere liefde. Elk hoofdstuk in zijn verhaal is een wonderbaarlijke sleutel naar het antwoord op elk van de vragen. Verwonderd over zijn verhalen vraagt de politie zich af wat een jongen als hij - zonder een schijnbaar verlangen naar rijkdom - op zo'n spelvertoning doet. Als de laatste vraag beantwoord moet worden krijgen ze, samen met ongeveer zestig miljoen kijkers antwoord op deze vraag...\n\n\nA Mumbai teen who grew up in the slums, becomes a contestant on the Indian version of &quot;Who Wants To Be A Millionaire?&quot; He is arrested under suspicion of cheating, and while being interrogated, events from his life history are shown which explain why he knows the answers.\n\n\nInfo: \n\nAudio...: DD 5.1 English/Hindi\nMenu....: Yes\nSubs....: Dutch custom, English, French\nExtra's.: No\nUitvoer.: DVD 5\nCover...: No\nMM......: http://www.moviemeter.nl/film/50507","torrent":{"xt":"urn:btih:89f679a545acf83c4e22e77868eb7557f904013b","amp;dn":"Slumdog+Millionaire+2008+%5BDutch+Retail%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89f679a545acf83c4e22e77868eb7557f904013b","infoHashBuffer":{"type":"Buffer","data":[137,246,121,165,69,172,248,60,78,34,231,120,104,235,117,87,249,4,1,59]},"announce":[],"urlList":[]}}