{"title":"Coast to Coast AM 2012.03.01 Space Exploration &amp; Innovation","uid":7186096,"size":56280385,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8a0b13d01bc4526eaa7e2a9d3e6cf34061b8d302&amp;dn=Coast+to+Coast+AM+2012.03.01+Space+Exploration+%26amp%3B+Innovation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ViViDSOL","files":5,"time":1334431408,"description":"Coast to Coast AM 2012.03.01 Space Exploration &amp; Innovation\n\nHost: \tGeorge Noory\nGuests: Neil deGrasse Tyson, Catherine Austin Fitts\n\nAstrophysicist and director of the Hayden Planetarium, Neil deGrasse Tyson, discussed how we can get back on track to become a space-faring society once again, and what we stand to lose if NASA doesn't regain its ground as a force for innovation. The current situation with NASA dependent on the Russians to bring its astronauts to the Space Station saddles the US with an &quot;opportunity cost,&quot; he commented, explaining that if we don't have an ambitious near-term plan to advance the space frontier, then the concept becomes lost from society. The space program in the 1960s was part of a forward-looking culture, and innovation permeated society during this decade, he noted.\n\nBut, when it became apparent that the Russians weren't planning to go to the moon, the US lost interest in further moon missions, because their militaristic motivation was no longer in effect, he explained. Now the motivation for space missions and explorations could be a kind of economic investment, with a potential huge return from new technologies and industries, Tyson said. For instance, the moon could be harvested for Helium 3, useful in nuclear fusion reactors. He suggested that we double NASA's budget and give them a high profile mission statement. This could serve to recreate the innovation culture that prevailed in the 1960s, where people were focused on the future-- we're seeing this now in countries like China more than the US, he pointed out.\n\nTyson touched on intelligent design, arguing against it by citing how there are many things in nature that don't seem like a product of an intelligence, such as natural disasters. He also spoke about the 'open skies' aspect of astronomy, and how many comets &amp; asteroids are given double names because they are discovered by two people, sometimes amateurs, at the same time in different locations.\n\nEconomic Update\n\nFirst hour guest, investment advisor Catherine Austin Fitts joined George in the studio for an update on economic news. It's likely gas prices could rise even higher this year because of geopolitical factors and Middle East tensions, and this will drive up the cost of food and other items as well, she said. &quot;What we're going through is a reset between paper and real things,&quot; and with the debasement of the dollar, all tangible items will be more expensive, she continued. With the inflation of our everyday expenses, people should be prepared to bring down their overhead and/or their debt, and to make sure their income is coming from parts of the economy that are growing, she advised.\n\nNews segment guests: Howard Bloom, Dr. Robin Falkov\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://haydenplanetarium.org/tyson&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://haydenplanetarium.org/tyson&lt;/a&gt; &lt;a href=&quot;\nhttp://solari.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://solari.com&lt;/a&gt;\n\nBook(s):\n\nSpace Chronicles: Facing the Ultimate Frontier &lt;a href=&quot;\nhttp://amzn.to/znyYw2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/znyYw2&lt;/a&gt;\n\nThe Pluto Files &lt;a href=&quot;\nhttp://amzn.to/wElJZf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/wElJZf&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8a0b13d01bc4526eaa7e2a9d3e6cf34061b8d302","amp;dn":"Coast+to+Coast+AM+2012.03.01+Space+Exploration+%26amp%3B+Innovation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a0b13d01bc4526eaa7e2a9d3e6cf34061b8d302","infoHashBuffer":{"type":"Buffer","data":[138,11,19,208,27,196,82,110,170,126,42,157,62,108,243,64,97,184,211,2]},"announce":[],"urlList":[]}}