{"title":"Democracy Now - 08 dec 2010","uid":6022065,"size":453564888,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8a4003e1d2420546a01175f0373e241fd5085f77&amp;dn=Democracy+Now+-+08+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1291825451,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 08, 2010\n\n- Denied Bail, Assange to Remain Jailed in London\n- Wealthy to Benefit Most From Obama-GOP Tax Deal\n- Court Dismisses Suit Challenging U.S. Assassinations\n- U.S. Drops Incentives Deal for Partial Israeli Settlement Freeze\n- Haiti to Hold Runoff Vote in Presidential Election\n- Study: Nepalese Troops Likely Caused Cholera Outbreak in Haiti\n- Iran Nuclear Talks to Resume Talks Next Month\n- Irish Gov't Seeks Approval for Austerity Measures\n- Charges Filed Against Cheney in Nigeria\n- Students Stage Hunger-Strike for DREAM Act Passage\n- Elizabeth Edwards Dies After Cancer Fight\n\n\nSpecial reports\n\n- Attorney: WikiLeaks' Julian Assange Endangered by Bail Denial in London; Still No Charges Filed in Sweden\n\nWikiLeaks founder Julian Assange will remain in custody until at least December 14th, when a British court will take up a Swedish request for extradition. Assange hasn't been charged with a crime but is wanted for questioning in Sweden on allegations of unlawful sexual contact with two women. Assange has maintained his innocence and called the case a political witch-hunt that has intensified with WikiLeaks' release of secret U.S. diplomatic cables. We speak with his attorney, Jennifer Robinson.\n\n\n- Youth Activists Protest Exclusion from U.N. Climate Summit in CancÃƒÂºn\n\nProtests against the U.N. Climate Change Conference in CancÃƒÂºn are growing as civil society groups are frozen out of the talks. Yesterday, indigenous and youth groups demonstrated both inside and outside the summit to call for their inclusion in the negotiations. On Tuesday, activists from Youth for Climate Justice led a walkout inside the heavily-guarded conference halls.\n\n\n- Thousands March in CancÃƒÂºn at La Via Campesina's &quot;Global Day of Action for Climate Justice&quot;\n\nAt the U.N. Climate Change Conference in CancÃƒÂºn, La Via Campesina-the world's largest federation of peasant and smallholder farmers-held what they called the &quot;1,000 CancÃƒÂºns Global Day of Action for Climate Justice.&quot; Several thousand people took to the streets to march in protest of the summit. Democracy Now!'s Mike Burke filed this report.\n\n\n- &quot;Countries Least Responsible for Climate Change are the Ones Most Threatened By It&quot;: Island States Urge Binding Emissions Cuts at UN Climate Summit\n\nInside the U.N. Climate Change Conference in CancÃƒÂºn, one of the most moving speeches on Tuesday was by Marcus Stephen. He is president of Nauru, the world's smallest island nation, covering just eight square miles in the South Pacific. Stephen is the leader of the Pacific Small Island Developing States at the climate change talks. Johnson Toribiong, president of the island state of Palau, also spoke.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8a4003e1d2420546a01175f0373e241fd5085f77","amp;dn":"Democracy+Now+-+08+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4003e1d2420546a01175f0373e241fd5085f77","infoHashBuffer":{"type":"Buffer","data":[138,64,3,225,210,66,5,70,160,17,117,240,55,62,36,31,213,8,95,119]},"announce":[],"urlList":[]}}