{"title":"Rex Dexter of Mars 1 shot 1940 Fox Features","uid":9643952,"size":58100787,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8aeb2c4d7121554c48da1fbcd13e8cbd51d2dcb6&amp;dn=Rex+Dexter+of+Mars+1+shot+1940+Fox+Features&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mothra67","files":-1,"time":1392963980,"description":"In 1939,  Montague Dexter built a rocket ship for that year's World Fair. To demonstrate that it works, he and his wife took off and flew to Mars. Unfortunately, the ship crashed as soon as it reached the red planet. He spent the next sixty one years trying repair the ship.\n\nBy that point, he and his wife were far too old to handle the rigors of space travel. But their son, Rex Dexter, was young and fit. He piloted his parent's space ship to Earth. The Earth of the year 2000 was much more advanced then the world his parents left behind. But young Rex didn't have much time to adjust to the new surroundings as the United States came under attack from a mad scientist holed up in Europe, which was reduced to a radioactive wasteland during a world war that occurred sometime in the 1950s. Rex helped the American military repel the invasion. From that point on, he decided to protect Earth from alien and terrestrial menaces.\n\nRex became romantically involved with Cynde, a girl that he rescued from space pirates in his debut appearance. A little over a year later, a monster he brought from another planet escaped from his ship's haul, leaving massive destruction in it's wake. Although Rex managed to kill the creature, people of Earth were angry at Rex for bringing a monster in the first place and banished him. Luckily for Rex, Cynde joined him into exile.\n\nThe pair spent the next few months in space, flying from planet to planet, stopping any menaces they found along the way. Eventually, Rex got word that Earth was attacked by yet another group of aliens. He was able to stop the invasion and the Earth people gladly forgave him.","torrent":{"xt":"urn:btih:8aeb2c4d7121554c48da1fbcd13e8cbd51d2dcb6","amp;dn":"Rex+Dexter+of+Mars+1+shot+1940+Fox+Features","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aeb2c4d7121554c48da1fbcd13e8cbd51d2dcb6","infoHashBuffer":{"type":"Buffer","data":[138,235,44,77,113,33,85,76,72,218,31,188,209,62,140,189,81,210,220,182]},"announce":[],"urlList":[]}}