{"title":"European Cinema in Motion Migrant and Diasporic Film in Contempo","uid":11459762,"size":2696721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8aef8ed57f86fb35c73e096d19b7c7cd665388e3&amp;dn=European+Cinema+in+Motion+Migrant+and+Diasporic+Film+in+Contempo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415973845,"description":"This collection brings together international experts on the cinema of migration and diaspora in postcolonial and postnational Europe. It offers a comprehensive theoretical and analytical discussion of a highly productive creative sector and documents the spectrum of this area of exploration in European, transnational and World Cinema studies.\n\nPublisher: Palgrave Macmillan (September 15, 2010)\nLanguage: English\nISBN-10: 0230278981\nISBN-13: 978-0230278981\n\nEditorial Reviews\nReview\n\n&quot;An important contribution filled with original work and insightful analyses.&quot; - Randall Halle, Klaus W. Jonas Professor of German Film and Cultural Studies, University of Pittsburgh, USA\n\n&quot;A welcome addition to European cinema studies and a timely contribution to the growing fields of diasporic, migrant and transnational cinemas. This thought-provoking collection, which manages to be both diverse and coherent, will be consulted for years to come.&quot; - Elizabeth Ezra, Professor of Cinema and Culture, University of Stirling, UK\n\n&quot;The editors' avowed awareness of the conceptual problems inherent in their terms and definitions, together with their thorough review of current debates and the contributors' own engaging analyses, provide this book with the potential to open up alluring research avenues across disciplinary and textual boundaries. It is along these yet unexplored intellectual paths that this ambitious project might pave the way to other possible endeavours, resulting in an even more radical questioning of European identities and imageries.&quot; - Mattia Marino, Journal of Contemporary European Studies\n\n&quot;...this volume offers a unique contribution to migration debates...the editors provide an excellent overview of well- and lesser-known European films dealing with migration and multiculturalism.&quot; - Journal of Ethnic and Migration Studies\n\nAbout the Author\nDANIELA BERGHAHN is Reader in Film Studies in the Media Arts Department at Royal Holloway, University of London, UK. She is the author of Hollywood Behind the Wall: The Cinema of East Germany (2005).\n\nCLAUDIA STERNBERG is Lecturer in Cultural Studies at the School of Fine Art, History of Art and Cultural Studies, University of Leeds, UK. She is the author of Bidding for the Mainstream?: Black and Asian British Film since the 1990s (2004).\n\nimage","torrent":{"xt":"urn:btih:8aef8ed57f86fb35c73e096d19b7c7cd665388e3","amp;dn":"European+Cinema+in+Motion+Migrant+and+Diasporic+Film+in+Contempo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aef8ed57f86fb35c73e096d19b7c7cd665388e3","infoHashBuffer":{"type":"Buffer","data":[138,239,142,213,127,134,251,53,199,62,9,109,25,183,199,205,102,83,136,227]},"announce":[],"urlList":[]}}