{"title":"VA - September Songs - The Music of Kurt Weill (1997)","uid":4895914,"size":99278641,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b0eef8bffc3957b3b5bc65b961d126a5d171e06&amp;dn=VA+-+September+Songs+-+The+Music+of+Kurt+Weill+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242326656,"description":"VA - September Songs - The Music of Kurt Weill (1997)\nMP3 | 192 Kbps\n\nFeaturing William S. Burroughs, Bertolt Brecht, Lou Reed, Elvis Costello, PJ Harvey, Nick Cave and others.\n\n\n1. Mack the Knife (Nick Cave) 4:53\n2. Ballad of the Soldier's Wife (PJ Harvey) 4:26\n3. Alabama Song (David Johansen, Ellen Shipley, Bob Dorough) 4:32\n4. Youkali Tango (Teresa Stratas) 6:39\n5. Lost in the Stars (Elvis Costello, Brodsky String Quartet,) 3:56\n6. Pirate Jenny (Lotte Lenya) 4:04\n7. Speak Low (Charlie Haden) 5:31\n8. Oh, Heavenly Salvation (Persuasions) 3:36\n9. Lonely House (Betty Carter) 7:32\n10. Surabaya Johnny (Teresa Stratas, Chamber Sumphony, Gerard Schwarz) 5:58\n11. Furchte Dich Nicht (O'Hara, Mary Margaret) 4:25\n12. September Song (Lou Reed) 7:51\n13. Mack the Knife (Bertolt Brecht) 2:48\n14. What Keeps Mankind Alive? (Burroughs, William S.) 2:46 \n\n\nGerman-born composer Kurt Weill's music has aged quite well through the years and has been rediscovered and reinterpreted by such diverse artists as Louis Armstrong, Bobby Darin, Willie Nelson, the Doors and Teresa Stratas. Just prior to the 70th anniversary of the classic Three Penny Opera, which made its debut in 1928, producer Hal Wilner, who supervised the brilliant 1985 Weill tribute Lost in the Stars, in association with filmmaker Larry Weinstein, gave fans old and new September Songs, a collection of interpretations from the film project of the same name.\nWeinstein, inspired by hearing the Lost in the Stars project, developed his film as a visual follow-up to the record, hiring Wilner to reprise his role as music supervisor. Wilner once again chose a wide array of artists for the project, ranging from pop musicians such as Polly Harvey and Elvis Costello to jazz vocalist Betty Carter, opera soprano Teresa Stratas, beat author William S. Burroughs and the gospel stylings of the Persuasions. Among the true joys of September Songs, aside from the wonderful new renditions, is the inclusion of recordings by Weill's wife Lotte Lenya from 1955 on &quot;Pirate Jenny,&quot; lyricist Bertolt Brecht performing &quot;Mack the Knife&quot; in 1930 in its original German, and Weill himself, joined via modern recording technology by bassist Charlie Haden, singing the beautiful &quot;Speak Low.&quot;\nWithout a weak performance on the entire album, Wilner once again has done an excellent job of capturing the beauty and scope of one of the 20th century's greatest composers.\n-ALLMUSIC\n","torrent":{"xt":"urn:btih:8b0eef8bffc3957b3b5bc65b961d126a5d171e06","amp;dn":"VA+-+September+Songs+-+The+Music+of+Kurt+Weill+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b0eef8bffc3957b3b5bc65b961d126a5d171e06","infoHashBuffer":{"type":"Buffer","data":[139,14,239,139,255,195,149,123,59,91,198,91,150,29,18,106,93,23,30,6]},"announce":[],"urlList":[]}}