{"title":"Remembering Che (ePUB,Retail){32Skulls}","uid":10885042,"size":8974625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c96d238959ba5cf99b3b8dfc1252021def81020&amp;dn=Remembering+Che+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409070622,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\n\nFor the first time, Aleida March evokes the memories of her partner, Ernesto Che Guevara. She describes their great romance and life together from the days when they first met as fellow guerrillas in Cuba's revolutionary war up to the tragic moment when she learned of Che's assassination in Bolivia less than a decade later.\n\nAs Che's widow, Aleida writes with passion and poignancy of their shared political dreams for the future and their family. Never before have readers been offered such an intimate insight into the man behind one of the great political symbols of our time.\n\n* Includes one hundred intimate photos taken from the private family albums of Che with his children and his wife, including the last photos of Che and Aleida together when Che had disguised himself in preparation for his secret mission to Bolivia. * Also includes facsimiles of postcards and letters Che sent to his family from abroad, as well as poems written to Aleida and a moving short story sent from Africa.\n\n* This book reveals Aleida's own great strength and courage as she came to terms with her private loss while under the international spotlight of millions of others who also mourned the death of a world-famous revolutionary, perhaps comparable to Yoko Ono after the death of John Lennon. She also describes her efforts to raise her four children as ordinary children despite their father's legendary status in Cuba and abroad.\n\nAleida March is currently the director of the Che Guevara Studies Center, Cuba.\n\n\nBy Aleida March\nPublished by Ocean Press in 2012\nTags: nonfiction, biography, autobiography\nEPUB, Retail, 190 pages, English ","torrent":{"xt":"urn:btih:8c96d238959ba5cf99b3b8dfc1252021def81020","amp;dn":"Remembering+Che+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c96d238959ba5cf99b3b8dfc1252021def81020","infoHashBuffer":{"type":"Buffer","data":[140,150,210,56,149,155,165,207,153,179,184,223,193,37,32,33,222,248,16,32]},"announce":[],"urlList":[]}}