{"title":"Carbon Nanotubes Science and Applications - M. Meyyappan","uid":15417774,"size":16173720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cc195fa1a22234a96dedb8b4282508b566878d9&amp;dn=Carbon+Nanotubes+Science+and+Applications+-+M.+Meyyappan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469604254,"description":"Carbon Nanotubes Science and Applications - M. Meyyappan (CRC, 2005).pdf\r\n\r\nCarbon nanotubes, with their extraordinary mechanical and unique electronic properties, have garnered much attention in the past five years. With a broad range of potential applications including nanoelectronics, composites, chemical sensors, biosensors, microscopy, nanoelectromechanical systems, and many more, the scientific community is more motivated than ever to move beyond basic properties and explore the real issues associated with carbon nanotube-based applications.\r\n\r\nTaking a comprehensive look at this diverse and dynamic subject, Carbon Nanotubes: Science and Applications describes the field's various aspects, including properties, growth, and processing techniques, while focusing on individual major application areas. Well-known authors who practice the craft of carbon nanotubes on a daily basis present an overview on structures and properties, and discuss modeling and simulation efforts, growth by arc discharge, laser ablation, and chemical vapor deposition. Applications become the focal point in chapters on scanning probe microscopy, carbon nanotube-based diodes and transistors, field emission, and the development of chemical and physical sensors, biosensors, and composites.\r\n\r\nPresenting up-to-date literature citations that express the current state of the science, this book fully explores the development phase of carbon nanotube-based applications. It is a valuable resource for engineers, scientists, researchers, and professionals in a wide range of disciplines whose focus remains on the power and promise of carbon nanotubes.\r\nEditor Meyya Meyyappan will receive the Pioneer Award in Nanotechnology from the IEEE Nanotechnology Council at the IEEE Nano Conference in Portland, Oregon in August, 2011","torrent":{"xt":"urn:btih:8cc195fa1a22234a96dedb8b4282508b566878d9","amp;dn":"Carbon+Nanotubes+Science+and+Applications+-+M.+Meyyappan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cc195fa1a22234a96dedb8b4282508b566878d9","infoHashBuffer":{"type":"Buffer","data":[140,193,149,250,26,34,35,74,150,222,219,139,66,130,80,139,86,104,120,217]},"announce":[],"urlList":[]}}