{"title":"TechApplet USB Lock v1.2 GOTD","uid":15112881,"size":1338984,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8d7aaaf2705d7c060fce7e355f072b9379a07f37&amp;dn=TechApplet+USB+Lock+v1.2+GOTD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":1,"time":1467022836,"description":"TechApplet USB Lock v1.2 GOTD\r\n\r\n\r\nPassword Protect USB Drives\r\nUSB Lock allows you to password protect and secure USB drives, External drives, Memory cards, SD cards and all other types of external storage devices. It use the most advanced techniques of data leak prevention to safeguard your data, ensuring maximum security with minimal effort.\r\n\r\n\r\nLock External Storage Devices\r\nWith USB Lock, you do not have worry about your external storage devices getting lost or stolen. Now you can Lock and encrypt all the data stored on these devices, ensuring complete peace of mind. If somehow anyone gets hold of your drive, there is nothing to worry about as they will never be able to access any data stored on that device. Simplicity with efficiency!\r\n\r\nSingle Click Protection\r\nYes, you read it right, USB Lock protects all your USB and external storage devices with just a single click. All you need is one click to protect your drive along with all the data stored in it. It doesn't require any installation or instructions to follow. Just plug in your portable device and copy the USB Lock program to it or simply download it directly on your USB Drive.\r\n\r\n\r\nEasy to Use\r\nProtecting your USB drives and external drives just became easier. You don't need to be a tech savvy to safeguard your sensitive information against data theft and leakage. USB Lock is the easiest way to do it, without any hassle or technical knowledge. We work hard, so you don't have to.\r\n\r\nCross Platform Protection\r\nNot only USB Lock protects your USB drives and all other external storage devices on Windows platform, but also keeps them protected when you plug in these devices on any computer, running any operating system. Yes, your devices will remain locked and encrypted on Windows, Mac as well as Linux operating systems. A fool proof security that will never let you down, no matter where you go","torrent":{"xt":"urn:btih:8d7aaaf2705d7c060fce7e355f072b9379a07f37","amp;dn":"TechApplet+USB+Lock+v1.2+GOTD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7aaaf2705d7c060fce7e355f072b9379a07f37","infoHashBuffer":{"type":"Buffer","data":[141,122,170,242,112,93,124,6,15,206,126,53,95,7,43,147,121,160,127,55]},"announce":[],"urlList":[]}}