{"title":"Russell Findlay - Caught In The Crossfire (Mobi + Epub)","uid":8215732,"size":2060769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8da16a1596f6ee1f8d999334112bbeeb6bd18764&amp;dn=Russell+Findlay+-+Caught+In+The+Crossfire+%28Mobi+%2B+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kevinkray","files":-1,"time":1362335238,"description":"The deadliest Glasgow gang war of a generation - the Daniel family versus the Lyons - was sparked by an opportunistic cocaine theft from a house party which unleashed a decade of murderous violence. Devastation ensued ...beatings, slashings, abductions, torture and road-rage murder. Homes were firebombed while children slept; families were ripped apart and witnesses forced into protection. Michael Lyons, 21, was slaughtered when a crime summit at a north Glasgow garage turned into a triple shooting bloodbath, and Daniel lieutenant Kevin 'The Gerbil' Carroll, 29, had 10 shots pumped into him outside a suburban Asda supermarket in broad daylight as shoppers fl ed in terror. The desecration of the grave of eight-year-old cancer victim Garry Lyons marked a sickening low. Caught in the crossfire were a band of parents in Milton, Glasgow, who made a brave stand against their community centre being used as a gang hut by the Lyons. Against the odds, they won their six-year battle against routine violence and intimidation and at the same time exposed a shocking and murky nexus between police officers, politicians and the underworld. This is the explosive story of what happened as the Daniel - Lyons feud spiralled out of control and engulfed a whole community.","torrent":{"xt":"urn:btih:8da16a1596f6ee1f8d999334112bbeeb6bd18764","amp;dn":"Russell+Findlay+-+Caught+In+The+Crossfire+%28Mobi+%2B+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da16a1596f6ee1f8d999334112bbeeb6bd18764","infoHashBuffer":{"type":"Buffer","data":[141,161,106,21,150,246,238,31,141,153,147,52,17,43,190,235,107,209,135,100]},"announce":[],"urlList":[]}}