{"title":"Quincy S01E04 Hot Ice, Cold Hearts  DVDRip  DivX","uid":4371627,"size":734488097,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e5e37c1f51ac927ef25c645196e25c33b732d22&amp;dn=Quincy+S01E04+Hot+Ice%2C+Cold+Hearts++DVDRip++DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lee.ka","files":3,"time":1220197733,"description":"Quincy, M.E. (1977)\nS01E04 Hot Ice, Cold Hearts\nFirst aired: 1/2/1977\n \nA couple of cat burglars break into a Mexican museum and steal $4 million dollars worth of jewels. Sealing them in the floor of their boat they sail to California with the intention of fencing them there. Once there one of their crew tries to steal the jewels but is caught. Alex, the main burglar, poisons him with the venom of a fish and dumps him into the harbor. Unfortunately for him Quincy and Lee are nearby and are called to help the dying man. Quincy not only get there to help him but manages to save his life as well. He cannot at first work out what happened to the swimmer but is soon convinced that not all is what it seems.  Fernando Lamas, Robert Alda, Stuart Whitman guest star.\n\nCast: Jack Klugman (Quincy, M.E.), Garry Walberg (Lt. Frank Monahan), Robert Ito (Sam Fujiyama), Lynette Mettey (Lee Potter), Val Bisoglio (Danny Tovo), John S. Ragin (Dr. Robert Astin), Joseph Roman (Sgt. Brill)\n \nGuest cast: Stuart Whitman (Sheriff Parsons), Robert Alda (Professor Wren), Andrew Pine (Alex), Marianna Hill (Lisa), Fernando Lamas (Moreno), Maria Elena Cordero (Maria), Hubert Noel (Jacques), Angus Duncan (Egan), Wolf Roth (Mueller), Peter Bourne (Norkwist), Kipp Whitman (Masters), Ron Hasson (Juan), Patti Chandler (Ann), Andrew Prine (Alex Kale)\n\nDVD&gt;DivX/640x480/1228kbps/23.976fps/mp3/48KHz/stereo/103Kbps/73min/700Mb","torrent":{"xt":"urn:btih:8e5e37c1f51ac927ef25c645196e25c33b732d22","amp;dn":"Quincy+S01E04+Hot+Ice%2C+Cold+Hearts++DVDRip++DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e5e37c1f51ac927ef25c645196e25c33b732d22","infoHashBuffer":{"type":"Buffer","data":[142,94,55,193,245,26,201,39,239,37,198,69,25,110,37,195,59,115,45,34]},"announce":[],"urlList":[]}}