{"title":"Vietnam The 10,000 Day War 08of26 Uneasy Allies 720p Egilman","uid":11343531,"size":671353458,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8e644ec877b70328d5f256dac4c2c98b63be6d7c&amp;dn=Vietnam+The+10%2C000+Day+War+08of26+Uneasy+Allies+720p+Egilman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Egilman","files":-1,"time":1414824014,"description":"Vietnam: The Ten Thousand Day War,\n\nIs a 26-part Canadian television documentary on the Vietnam War, was produced in 1980 by Michael Maclear. The series writer, Peter Arnett, was an Associated Press reporter in Vietnam from 1962 to 1975. Maclear visited Vietnam during the production of the series and had access to film material there. He was the first Western journalist allowed to visit that area since the end of the war.\nThe series aired in Canada on CBC Television, in the United States and in the United Kingdom on Channel 4. CBC aired only 18 of the episodes during the 1980-81 season because the series production was incomplete. The remaining episodes were broadcast during CBC's 1981-82 season. In the US, The documentary series was remastered and consolidated into 13 one hour long episodes By NBC for American television syndication. The Series was released in the UK during the 1984-85 season aired by Channel 4.\n\nThe series was released on videocassette format by Embassy Entertainment, in 1987 and  Bonneville Worldwide Entertainment, in 1998. It won a National Education Association award for best world documentary.  The series was released on DVD By Image Entertainment in 2000 and by Time-Life/Star Vista/VSC in 2013.\n\nVietnam: The Ten Thousand Day War is considered by many as the definitive documentary on The Vietnam conflict. Very broad in scope, some consider it too broad complaining that it doesn't go into enough depth to be considered as a great documentary. In my opinion considering the plethora of documentaries that have come out about Vietnam, this is the only one that give you complete coverage of that 30 year long war. From it's roots in the Japanese occupation of Indochina before WWII to final end in 1975, no other documentary explores the basis and genesis of the war like this one does. It doesn't give an opinion, but allows other to state their opinions so you the viewer can judge the validity of those opinions. The lack of commentary will turn some off, but I find it refreshing to hear those people who were actually there give their ideals  and understandings. It helps you understand the rights and wrongs. Ho Chi Minh was asked after the Japanese surrender, by the US representative, what he wanted from the US government. His answer? NOTHING, given sitting down at the table with a copy of the US Constitution in his hands. An honest appraisal of the war of Vietnamese independence. If I had to recommend a Vietnam documentary to someone, I would recommend this one, the full 26 episode version, not the cut down 13 episode version.\n\nThis release comes from my rip of the 2013 CSC Video 4 disc DVD set, It is coded in x264 and AAC sound at 960x720p (4x3) resolution. It is in full color as shown on TV broadcast back in 1980-85 and I have done no alteration to the video or sound..\n\nUneasy Allies\n\n\n\nAired, CBC, November 5, 1980; UK Channel 4, January 7, 1985\n\nEpisode Eight covers the society in the south during the war. Saigon is a party town. American aid pours into the country, fight during the day live it up at night. in 1965 Premier Ky is in power, the 10th government in 20 months and Americans feel they have a solid ally finally. Ky goes to meet LBJ in Washington to obtain more economic aid. LBJ enthusiastically agrees. Within a month Vietnam has an operating TV station to promote social reforms to the population. The US commits $750,000,000 in aid to Vietnam. Vietnam is corrupt, much of the aid provided goes straight from the supply depots to the streets of Saigon. In 1966 the pentagon reports that 1 in 4 GI's have a venereal disease. American culture is claimed to be  corrupting south Vietnam. where the GI goes so goes &quot;American&quot; culture. To American raised on WWII, Vietnam is a strange place. Americans feel that they alone are doing the fighting. They nickname ARVN missions as &quot;Search &amp; Avoid&quot;. Premier Ky promotes an invasion of the North, he doubts American staying power. Saigon's Army grows to over a million men, but the officers are primarily political appointees and are ineffectual. When the final battle eventually comes, the officers break and run first, then the men. It was a paper army.\n\nTechnical Specs (Ep 01)\n\nVideo Codec:         : AVC\nVideo Bitrate:       : 3,233 kbps\nVideo Aspect Ratio:  : 1.33, (4x3)\nVideo Resolution:    : 960x720\nScan type            : Progressive\nAudio Codec:         : AAC LC\nAudio language:      : English\nAudio Bitrate:       : 192 kbps\nAudio Channels:      : 2 (stereo)\nRun-Time:            : 52 mn\nFramerate:           : 29.970 fps\nNumber of Parts:     : 1\nContainer            : MP4\nPart Size:           : 1.25 GiB\n\nTechnical Specs (Ep 02 thru 26)\n\nVideo Codec:         : AVC\nVideo Bitrate:       : 3,226 kbps\nVideo Aspect Ratio:  : 1.33, (4x3)\nVideo Resolution:    : 960x720\nScan type            : Progressive\nAudio Codec:         : AAC LC\nAudio language:      : English\nAudio Bitrate:       : 192 kbps\nAudio Channels:      : 2 (stereo)\nRun-Time:            : 26 mn\nFramerate:           : 29.970 fps\nNumber of Parts:     : 25\nContainer            : MP4\nPart Size:           : 641 MiB\nSource:              : DVD-rip\nEncoded date         : 2014-10-21\nEncoded by:          : Egilman","torrent":{"xt":"urn:btih:8e644ec877b70328d5f256dac4c2c98b63be6d7c","amp;dn":"Vietnam+The+10%2C000+Day+War+08of26+Uneasy+Allies+720p+Egilman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e644ec877b70328d5f256dac4c2c98b63be6d7c","infoHashBuffer":{"type":"Buffer","data":[142,100,78,200,119,183,3,40,213,242,86,218,196,194,201,139,99,190,109,124]},"announce":[],"urlList":[]}}