{"title":"Najma (1943) Xvid 1cd_Eng Subs_Indian Cinema_The Early Years_Cla","uid":8641194,"size":804557710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ed7ff72f997844191f03aeaf88f5ee9400901b2&amp;dn=Najma+%281943%29+Xvid+1cd_Eng+Subs_Indian+Cinema_The+Early+Years_Cla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1372881751,"description":"Najma (1943) Xvid 2cd_Indian Cinema- The Early Years_Classic [DDR]\n\nCAST:-\nAshok Kumar.....Yusuf Khan\nSitara.................Raziya\nVeena................Najma\nM. Kumar...........Mukarram Nawab\nYakub.................Bedil\nMurad................Dr. Khan, Yusuf's father\nMajid..................Nawab Rafatjah\nRajkumari Shukla\n\nDirected by Mehboob Khan\nProduced by Mehboob Khan\nMusic by Rafiq Ghaznavi\nLyrics by Anjoom Pilibhiti\nPlayback Singers:- Ashok Kumar, Parul Ghosh, Mumtaz, Sitara Devi, AmirBai Karnataki\n\nSongs are included in MP3s\nNajma (1943) 00. Title Music and Screen Credits, Rafiq Ghaznavi\nNajma (1943) 01. Short Prayer\nNajma (1943) 02. Tarsi Hui Hai Muddat Se Aankhein, Ashok Kumar, Anjum Pilibhiti. Rafiq Ghaznavi\t\nNajma (1943) 03. Eid Milo Eid Guiyaan, Various artists, Arzoo Lakhnavi, Rafiq Ghaznavi\nNajma (1943) 04. Mujhe Jo Khilaate Hai Pano Main Mirche, Ashok Kumar, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 05. Bhala Kyun O Ho..Magar Kyun, Parul Ghosh, Mumtaz, Arzoo Lakhnavi, Rafiq Ghaznavi\nNajma (1943) 06. Nazar Kuch Aaj Aisa Aa Raha Hai, Mumtaz, Ashok Kumar, Anjum Pilibhiti, Rafiq Ghaznavi\t\nNajma (1943) 07. Fasl-e-Bahaar Gaaye Jaa..Didye Gam Ruleye Ja, Parul Ghosh, Sitara Devi, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 08. Jal Jaa Jal Jaa Patange Jalte, Sitara Devi, Ashok Kumar, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 09. Kya Mohabbat Ka Yahi Anjaam Hai, Ashok Kumar, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 10. Saajan Ke Naina Jaadu Baan, Amirbai Karnataki, Mumtaz, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 11. Jab Yaad Teri Aati Hain, Sitara Devi, Ashok Kumar, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 12. Gaaoon Khushi Mein Gaaoon, Sitara Devi, Anjum Pilibhiti, Rafiq Ghaznavi\nNajma (1943) 13. END SONG\n\t\nSYNOPSIS:- Najma (1943)\nLucknow medical student Yusuf has fallen in love with Najma, the daughter of his wealthy neighbor, after seeing her only once. Encouraged by his friend Bedil, he decides to pursue her. Najma thinks he is too forward and tries to punish him by putting salt in his food at her family's Eid celebration, but accidentally serves it to his father Dr. Khan instead. Najma then falls in love with Yusuf, meeting him secretly in the garden. Their romance is interrupted when Dr. Khan announces that he has betrothed his son to his cousin Raziya. Although Yusuf initially refuses to marry Raziya because she is an uneducated village girl and he loves Najma, Najma convinces him to marry Raziya to preserve his family's honor. Heartbroken, they both marry other people; Yusuf marries Raziya and Najma weds the wealthy Mukarram Nawab. Raziya finds out about Yusuf's hidden love and becomes very jealous. Meanwhile, Yusuf sinks into depression and Najma becomes ill with worry over him. Mukarram overhears Raziya jealously berating Najma over her love for Yusuf and resolves to kill him. But Mukarram has a serious accident and Yusuf is the only one who can save his life. Yusuf saves Mukarra's life and assures him and Raziya that he does not wish to take Najma away. Giving up each other forever, Yusuf and Najma part.\n\nNajma emphasises the importance of education and the necessity for modern development within the Muslim community, but also portrays the value of family honor and upholding traditions like arranged marriage. The film's upper class Lahknawi protagonists live in an economically privileged world and follow the traditional tehzeeb etiquette of Lucknow. The film mainly deals with family relationships and the effects of tehzeeb on them. Many of these elements became the prototype for later Muslim social films which usually focused on male-female relationships in upper-class Muslim communities\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 730 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 105kb/s VBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Hindi\nRunTime: 1:55:17\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 1:55:17","torrent":{"xt":"urn:btih:8ed7ff72f997844191f03aeaf88f5ee9400901b2","amp;dn":"Najma+%281943%29+Xvid+1cd_Eng+Subs_Indian+Cinema_The+Early+Years_Cla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ed7ff72f997844191f03aeaf88f5ee9400901b2","infoHashBuffer":{"type":"Buffer","data":[142,215,255,114,249,151,132,65,145,240,58,234,248,143,94,233,64,9,1,178]},"announce":[],"urlList":[]}}