{"title":"Libera Angels Sings Christmas In Ireland (for iphone 4&amp;5).mp","uid":9711023,"size":670586977,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8ef0c42b0aa1444caa113396d971877fdae10f0c&amp;dn=Libera+Angels+Sings+Christmas+In+Ireland+%28for+iphone+4%26amp%3B5%29.mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pirataka","files":1,"time":1394112210,"description":"This Christmas, boy choir super-group Libera bring their angelic voices and inspiring music to the holiday season with a new CD and DVD: Angels Sing - Christmas in Ireland. The program features beloved carols old and new, sacred and secular, joyful and tender - all recorded live in the radiant ambiance of St Patrick's Cathedral in Armagh, Ireland. This inspiring concert features favorites such as 'Carol of the Bells,' 'Joy to the World,' 'Silent Night,' 'Danny Boy' and more, and the DVD also contains behind-the-scenes documentary extras. Six of the tracks are previously unreleased, and the remaining songs all feature brand-new arrangements made especially for this recording.\n\nThe distinctive music of Libera has traveled the world, with chart-topping albums and sold-out performances across the globe. The group has performed in front of the Pope during a visit to Yankee Stadium and at the Kennedy Center during a ceremony honoring Beach Boy Brian Wilson. Their signature sound shimmering, mystical chords and harmonies atop traditional and electronic instruments has captured the hearts of music lovers everywhere, and their passionate, dedicated fan base (including over 5 million YouTube views) attest to the enduring power and appeal of this unique group.","torrent":{"xt":"urn:btih:8ef0c42b0aa1444caa113396d971877fdae10f0c","amp;dn":"Libera+Angels+Sings+Christmas+In+Ireland+%28for+iphone+4%26amp%3B5%29.mp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ef0c42b0aa1444caa113396d971877fdae10f0c","infoHashBuffer":{"type":"Buffer","data":[142,240,196,43,10,161,68,76,170,17,51,150,217,113,135,127,218,225,15,12]},"announce":[],"urlList":[]}}