{"title":"CICLO CLASICOS DISNEY NÃ‚Âº 43 - El Planeta del Tesoro","uid":4712620,"size":734132224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ef5102bbc1a87e2360f41be83ebf5af114029e0&amp;dn=CICLO+CLASICOS+DISNEY+N%C3%82%C2%BA+43+-+El+Planeta+del+Tesoro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alf1122","files":1,"time":1234121167,"description":"Cuando era un niÃƒÂ±o, Jim Hawkins leÃƒÂ­a cuentos de piratas y leyÃƒÂ³ sobre el Planeta del Tesoro, donde el viejo CapitÃƒÂ¡n Flint habÃƒÂ­a ocultado su gigantesco tesoro, conocido como el BotÃƒÂ­n de los Mil Mundos. Lo que Jim no sabÃƒÂ­a era que al pasar de los aÃƒÂ±os vivirÃƒÂ­a todo lo relatado en sus cuentos y realizarÃƒÂ­a sus sueÃƒÂ±os de la niÃƒÂ±ez. AquÃƒÂ­ comienza una gran aventura por la gran galaxia. Un dÃƒÂ­a, tras pelearse con su madre, desde el tejado de su casa ve caer una nave justo enfrente de sus ojos; corre hacia allÃƒÂ¡ y un pirata moribundo le da un mapa interestelar que muestra la ruta hacia el Planeta del Tesoro, y al intentar ver lo que era, descubre un misterioso mapa que muestra el camino a uno de los mayores tesoros de toda la galaxia. Se ve envuelto en la aventura mÃƒÂ¡s increÃƒÂ­ble de su vida: Jim sube a bordo del majestuoso galeÃƒÂ³n solar R.L.S. The Legacy como grumete, y zarpa en busca del legendario Planeta del Tesoro. Lo acompaÃƒÂ±an el doctor Delbert Doppler, un torpe astrÃƒÂ³nomo alienÃƒÂ­gena con forma de perro; la Capitana Amelia, una estricta mujer felina, y una tripulaciÃƒÂ³n de alienÃƒÂ­genas amotinados. John Silver, el cocinero del barco (un cyborg, mitad hombre y mitad mÃƒÂ¡quina) se convierte en su protector. Silver es un carismÃƒÂ¡tico personaje que esconde un oscuro secreto y que resulta ser muy diferente de lo que aparenta.\n\n","torrent":{"xt":"urn:btih:8ef5102bbc1a87e2360f41be83ebf5af114029e0","amp;dn":"CICLO+CLASICOS+DISNEY+N%C3%82%C2%BA+43+-+El+Planeta+del+Tesoro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ef5102bbc1a87e2360f41be83ebf5af114029e0","infoHashBuffer":{"type":"Buffer","data":[142,245,16,43,188,26,135,226,54,15,65,190,131,235,245,175,17,64,41,224]},"announce":[],"urlList":[]}}