{"title":"World of Tanks v0.7.3 - Test Client","uid":7203757,"size":3009094937,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8f60ec1d2cc53e66371213e5986cb7c831a26872&amp;dn=World+of+Tanks+v0.7.3+-+Test+Client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_vole","files":1,"time":1335023685,"description":"Commanders!\n\nThe World of Tanks development team gives you the opportunity to participate in the 7.3 mass test. The update will be released in the near future. At this occasion, we would like to ask for your feedback during this process.\n\nIn the meantime, the special World of Tanks 7.3 update will only be available on our test servers. The estimated end date of the 7.3 test is April 25th, 2012. Please note that only those players who registered prior to April 17th, 2012 before 02:00 CEST (00:00pm GMT) would be able to login to the test server.\n \nList of changes between patch 7.2 and test of 7.3:\n\n\t* Added two new maps Dragon's Ridge (first Asian map) and South Coast (a Crimea resort place).\n\t* KV-3 moved from tier 6 to tier 7 as a Soviet heavy tank, and rebalanced.\n\t* T-150 substitutes KV-3 as a Soviet heavy tank tier 6.\n\t* KV-4 added as a Soviet tier 8 heavy tank.\n\t* ST-I added as a Soviet tier 9 heavy tank.\n\t* IS-4 moved from tier 9 to tier 10 in Soviet tech tree and rebalanced.\n\t* KV divided into KV-1 and KV-2. KV-2 becomes a Soviet tier 6 heavy tank.\n\t* Added previously tested French premium vehicles: TD FCM 36 Pak 40 and SPG 10.5 ?m leFH18 B2.\n\t* Added vehicles, available for supertesters only: Soviet heavy tank IS-6 (tier 8) and German TD JagdTiger 8.8cm KwK 43 L/71 (tier 8).\n\t* Fixed and reworked damaged models of M18 Hellcat, ?32, ?30, Ferdinand.\n\t* Fixed and reworked visual models of ?25/2, PzKpfw VI Tiger, KV-3, ?32, ?30, ?-46, KV-5.\n\t* Removed some special modules for top tanks from store.\n\t* Fixed a rare bug with base capture proceeding even though a shell falls between the two tanks capturing the base.\n\t* Fixed a rare bug with incorrect experience distribute among crew members during active &quot;Accelerate crew training&quot; option.\n\t* Fixed the bug when a skill pop-up hint disappeared, if the skill is 0% trained.\n\t* Fixed the &quot;black terrain&quot; graphics display for back issue Radeon video cards.\n\t* Fixed minor interface errors in the tank company window.\n\t* Extended text descriptions of perks and skills.\n\t* Fixed the incorrect cost of radio station FuG 37.\n\t* Fixed names of several American HE shells.\n\t* Added clan logos display on tanks.\n\t* Fixed the issue with non-destruction of antitank hedgehogs (Komarin map) when hit with HE shells in some cases.\n\t* Fixed non-receipt of Fadin's Medal for tanks with autoloader mechanism.\n\t* Added view of ammunition rack explosion to vehicle overtarget markers.\n\t* Fixed several bugs with crew training.\n\t* Fixed the undersized research cost of ?49 from ?8?1.\n\t* Fixed the cost of suspension in TD ?82.\n\t* Fixed mouse inversion operation in SPG view mode.\n\t* Combat levels for htier 5 eavy tanks reduced by 1.\n\t* Fixed disappearance of indicator showing distance to a vehicle in reticle.\n\t* Fixed the rare bug with client failure at screenshot saving.\n\t* Fixed the display of M103 front armor in the game interface.","torrent":{"xt":"urn:btih:8f60ec1d2cc53e66371213e5986cb7c831a26872","amp;dn":"World+of+Tanks+v0.7.3+-+Test+Client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f60ec1d2cc53e66371213e5986cb7c831a26872","infoHashBuffer":{"type":"Buffer","data":[143,96,236,29,44,197,62,102,55,18,19,229,152,108,183,200,49,162,104,114]},"announce":[],"urlList":[]}}