{"title":"The Cars - 1978","uid":4279984,"size":50375694,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8f95796acbac0906fd169d0e40fe358b9337cf55&amp;dn=The+Cars+-+1978&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProhodilMimo","files":11,"time":1215371111,"description":"The Cars were an American rock band that emerged from the early New Wave music scene in the late 1970s. Members of the band were singer and rhythm guitarist Ric Ocasek, singer and bassist Benjamin Orr, guitarist Elliot Easton, keyboardist Greg Hawkes and drummer David Robinson. They hailed from Boston, Massachusetts, and were signed to Elektra Records in 1977.\n\nThe Cars were at the forefront in merging 1970s guitar-oriented rock with the new synth-oriented pop that was then becoming popular and which would flower in the early 1980s. Most of the singles included an Elliot Easton guitar solo, with the sound filled out by Greg Hawkes&amp;#039;s synthesizers and the harmonies of Orr, Easton, Hawkes, and Robinson. Lead vocals were split, with Ric Ocasek taking about 60% and Benjamin Orr taking the remaining 40%.[citation needed] Their most successful song,[citation needed] &quot;Drive&quot;, was sung by Orr. While Ocasek was the sole lyricist and main songwriter for the band, Orr would act as frontman in live appearances.[citation needed]\n\nThe band broke up in 1988, and Orr&amp;#039;s death in 2000 dashed any hopes for a full reunion. Easton and Hawkes joined with Todd Rundgren in 2005 to form a spin-off band, The New Cars, which performs classic Cars (and Rundgren) songs alongside new material on tour.","torrent":{"xt":"urn:btih:8f95796acbac0906fd169d0e40fe358b9337cf55","amp;dn":"The+Cars+-+1978","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f95796acbac0906fd169d0e40fe358b9337cf55","infoHashBuffer":{"type":"Buffer","data":[143,149,121,106,203,172,9,6,253,22,157,14,64,254,53,139,147,55,207,85]},"announce":[],"urlList":[]}}