{"title":"Microwave Engineering of Materials - From Mesoscale to Nanoscale","uid":14709419,"size":28589601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9039870227550e250a4f402c20a32c2532c70eca&amp;dn=Microwave+Engineering+of+Materials+-+From+Mesoscale+to+Nanoscale&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464402411,"description":"Microwave Engineering of Materials - From Mesoscale to Nanoscale - Erwann Guénin (Pan Stanford, 2016).pdf\r\n\r\nISBN 978-981-4669-43-6\r\n\r\nThe use of microwaves has gradually democratized itself in several scientific areas and is now a common methodology in domains as different as chemistry, protein digestion, mining, and metallurgy. Materials chemistry is one field where microwave irradiation technologies are being studied. In recent years, development of nanotechnologies has increased the interest of materials scientists in these new technologies. Microwave methodologies are now routinely used in several areas of materials science, and new advances are ongoing.\r\n\r\nThis book presents recent improvements in microwave engineering of materials and nanomaterials, interactions of microwave chemistry with materials, and advances in microwave technologies in several domains such as polymer synthesis and modification, processing of various materials (ceramics, glasses, metallic alloys, zeolites), and synthesis and functionalization of diverse nanomaterials (carbon nanotubes, MOF semiconductors, inorganic nanoparticles). The book will be of interest to all students and researchers in materials science and nanosciences who want to discover or increase their knowledge of microwave technology","torrent":{"xt":"urn:btih:9039870227550e250a4f402c20a32c2532c70eca","amp;dn":"Microwave+Engineering+of+Materials+-+From+Mesoscale+to+Nanoscale","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9039870227550e250a4f402c20a32c2532c70eca","infoHashBuffer":{"type":"Buffer","data":[144,57,135,2,39,85,14,37,10,79,64,44,32,163,44,37,50,199,14,202]},"announce":[],"urlList":[]}}