{"title":"Statistical Physics of Fracture and Breakdown","uid":13350828,"size":36711564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90a7634e547375a3781c7d2b45257d6752d36ca4&amp;dn=Statistical+Physics+of+Fracture+and+Breakdown&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":4,"time":1454086164,"description":"Statistical Physics of Fracture and Breakdown [Updated at 2016.01.29]\r\n\r\n--------------------------------------------------------------------------\r\n\r\n\r\nBook Series: Statistical Physics of Fracture and Breakdown\r\nEditors: Bikas K. Chakrabarti and Purusattam Ray\r\nPublished by John Wiley &amp; Sons, Ltd\r\n\r\n\r\nWhy does a bridge collapse, an aircraft or a ship break apart? When does a dielectric insulation fail or a circuit fuse, even in microelectronic systems? How does an earthquake occur? Are there precursors to these failures? These remain important questions, even more so as our civilization depends increasingly on structures and services where such failure can be catastrophic. How can we predict and prevent such failures? Can we analyze the precursory signals sufficiently in advance to take appropriate measures, such as the timely evacuation of structures or localities, or the shutdown of facilities such as nuclear power plants?\r\n\r\n\r\nWhilst these questions have long been the subject of research, the study of fracture and breakdown processes has now gone beyond simply designing safe and reliable machines, vehicles and structures. From the fracture of a wood block or the tearing of a sheet of paper in the laboratory, the breakdown of an electrical network on an engineering scale, to an earthquake on a geological scale, one finds common threads and universal features in failure processes. The ideas and observations of material scientists, engineers, technologists, geologists, chemists and physicists have all played a pivotal role in the development of modern fracture science.\r\n\r\n\r\nOver the last three decades, considerable progress has been made in modeling and analyzing failure and fracture processes. The physics of nonlinear dynamic, many-bodied and non-equilibrium statistical mechanical systems, the exact solutions of fibre bundle models, solutions of earthquake models, numerical studies of random resistor and random spring networks, and laboratory-scale innovative experimental verifications have all opened up broad vistas of the processes underlying fracture. These have provided a unifying picture of failure over a wide range of length, energy and time scales.\r\n\r\n\r\nThis series of books introduces readers –in particular, graduate students and researchers in mechanical and electrical engineering, earth sciences, material science, and statistical physics –to these exciting recent developments in our understanding of the dynamics of fracture, breakdown and earthquakes","torrent":{"xt":"urn:btih:90a7634e547375a3781c7d2b45257d6752d36ca4","amp;dn":"Statistical+Physics+of+Fracture+and+Breakdown","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90a7634e547375a3781c7d2b45257d6752d36ca4","infoHashBuffer":{"type":"Buffer","data":[144,167,99,78,84,115,117,163,120,28,125,43,69,37,125,103,82,211,108,164]},"announce":[],"urlList":[]}}