{"title":"HISTORY OF POP AND ROCK MUSIC - part 351","uid":7007408,"size":1846424450,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9144d3b5636b6aed11b67f520da459b5cb3bbb8e&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+351&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1328319550,"description":"                 PART  351\n\n\n\n          IKE &amp; TINA TURNER  -  Honky Tonk Woman  (1970)\n          IKE &amp; TINA TURNER  -  Get Back  (1971)\n          IKE &amp; TINA TURNER  -  Come  Together (1971)\n          IKE &amp; TINA TURNER  -  Soul To Soul  (1971)\n          IKE &amp; TINA TURNER  -  I Want to Take You Higher  (1972)\n          IKE &amp; TINA TURNER  -  Proud Mary  (1972)\n          IKE &amp; TINA TURNER  -  Nutbush City Limited (1973) \n          IKE &amp; TINA TURNER  -  Proud Mary  (1974)\n          IKE &amp; TINA TURNER  -  Baby Get It On  (1975)\n\n\n\n       &quot;Honky Tonk Women&quot; is a 1969 hit song by The Rolling Stones. Released as a single on 4 July 1969 in the UK and a week later in the US, it topped the charts in both nations .Ike &amp; Tina Turner covered the song (1970).\n      &quot;Get Back&quot; is a song by The Beatles, originally released as a single on 11 April 1969, and credited to &quot;The Beatles with Billy Preston. Ike &amp; Tina Turner covered it twice, with one version appearing on their 1971 album &quot;Workin' Together&quot;. It remained a staple of their live show for many years.\n      Tina Turner first covered &quot;Proud Mary&quot; in 1970 with her husband at the time, Ike Turner. The Ike &amp; Tina Turner version was released as a single from their &quot;Workin' Together&quot; album and the song differed greatly from the structure of the original, but is also well known and has become one of Tina's most recognizable signature songs.&quot;Proud Mary&quot; placed at #155 on Rolling Stone's 2004 list of The 500 Greatest Songs of All Time. Both CCR and Ike &amp; Tina Turner's versions of the song received Grammy Hall of Fame Awards, in 1998 and 2003, respectively.\n      &quot;Nutbush City Limits&quot; is a semi-autobiographical rock and roll song written and originally performed by Tina Turner in which she commemorates her rural hometown of Nutbush, Tennessee. Released June 1973, shortly before her separation from then-husband and musical partner Ike Turner, &quot;Nutbush City Limits&quot; was the last hit single the duo would produce together. In the years since, &quot;Nutbush City Limits&quot; has been covered by a number of other artists and Tina Turner herself has also re-recorded several different versions of the song. The initial recording of &quot;Nutbush City Limits&quot; was produced by Ike Turner in May 1973 and released as a single the following month by the couple under their professional name, Ike &amp; Tina Turner. It is characterized by inventive guitar sounds, a significant synthesizer solo and a funky brass section.The song later appeared on their album of the same title, released November 1973, and proved to be the duo's final significant chart hit, reaching #22 on the Billboard Hot 100 and #4 on the UK Singles Chart.\n     \n","torrent":{"xt":"urn:btih:9144d3b5636b6aed11b67f520da459b5cb3bbb8e","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+351","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9144d3b5636b6aed11b67f520da459b5cb3bbb8e","infoHashBuffer":{"type":"Buffer","data":[145,68,211,181,99,107,106,237,17,182,127,82,13,164,89,181,203,59,187,142]},"announce":[],"urlList":[]}}