{"title":"Captain Nice","uid":15396529,"size":923649993,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:917021a1184d3f537c4fd2c4a251b67fa4fa81b0&amp;dn=Captain+Nice&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Psychodad149","files":14,"time":1469403055,"description":"Look! It's the man who flies around like an eagle!\r\n\r\nLook! It's the enemy of all that's illegal!\r\n\r\nLook! At the muscles on those arms, they're like hammers!\r\n\r\nLook! It's the nut who walks around in pajamas!\r\n\r\nThat's no nut, boy -- that's Captain Nice!\r\n\r\nNice???\r\n\r\nNice, Nice, Nice, NICE!!!\r\n\r\n\r\n\r\nStarring William Daniels and Ann Prentiss as Carter Nash/Captain Nice and Police Sgt. Candy Kane, respectively, &quot;Captain Nice&quot; was a short-lived superhero spoof series which ran early in 1967 on NBC. \r\n\r\nProduced by Buck Henry, one of the creative team at legendary series &quot;Get Smart&quot;, &quot;Captain Nice&quot; does have something of the same feel -- and the same jokes. In particular, Agent 86's trademark routine, &quot;I asked you not to tell me that!&quot; makes frequent appearances. Carter Nash and Sgt. Candy Kane have a relationship which definitely suggests that of Max and Agent 99, in that he is largely oblivious to her affections. Sgt. Kane does in fact bear more than a passing resemblance to 99; Carter to Max rather less, but still is the same bumbling man of (mis)action who manages to pull of his mission successfully.\r\n\r\nThe series also has a bit of a feel of the much later &quot;Police Squad!&quot;, Leslie Nielsen's tour de farce. The very first we see of the show, Nash is strolling along, narrating the blessings enjoyed by the citizens of &quot;Bigtown&quot; as various scenes of mayhem occur behind him, ironically punctuating his comments. For that matter, that the place's name is Bigtown suggests &quot;Police Squad!&quot; 's generically named features: The Police Station, The Hospital, Stateville Prison. Even the episode titles foreshadow the peculiar &quot;Police Squad!&quot; titles: &quot;The Man With Three Blue Eyes&quot;, &quot;The Week They Stole Payday&quot;, &quot;One Rotten Apple&quot;.\r\n\r\nNash himself is a police chemist, and owes his job to his uncle, the mayor. He has stumbled upon a formula which, he demonstrates, enables a mouse to overpower a cat. Later, witnessing a violent crime, he consumes the formula himself in order to apprehend the wrongdoers. He stumbles into both his name and his costume fortuitously: the explosion which accompanies his transformation into a flying, muscular marvel leaves his suit in tatters, tatters which remarkably resemble shorts and a cape. When wondrous onlookers ask who he is, he glances at his monogrammed belt buckle, and &quot;CN&quot; no longer stands for Carter Nash but, yes, &quot;Captain Nice&quot;. \r\n\r\nCarter lets his mother in on the secret; she is played by the legendary Alice Ghostley. She gets out her sewing kit and quickly makes him up a superhero costume he can be -- well, if not entirely proud of, at least presentable in. As both Carter and the Captain, he remains rather closely attached to her apron strings, giving her a significant role in the show. His father is played by character actor Byron Foulger, a well-known face and voice at the time. Ironically, he spends most of his time as Dad hidden behind a newspaper, never seen and rarely uttering a word.\r\n\r\nA number of other regular character actors and better-known actors (later on) flesh out the cast. Some include John Dehner, Vic Tayback, Florence Halop, Fred Villani, Daniel Travanti, Charles Grodin, Jo Ann Worley, and Bob Newhart.\r\n\r\nThis does have a lot of good laughs, even if it lacks some of the sophistication of &quot;Get Smart!&quot; and other more enduring series. With only 15 episodes, it remains a nice little slice of TV's history, and is well worth the watching.\r\n\r\nThis torrent is an offering of the Penny Robinson Fan Club-- http://pennyrobinsonfanclub.net\r\n\r\nPlease consider visiting and chipping in a little to help defray our costs. Thank you","torrent":{"xt":"urn:btih:917021a1184d3f537c4fd2c4a251b67fa4fa81b0","amp;dn":"Captain+Nice","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"917021a1184d3f537c4fd2c4a251b67fa4fa81b0","infoHashBuffer":{"type":"Buffer","data":[145,112,33,161,24,77,63,83,124,79,210,196,162,81,182,127,164,250,129,176]},"announce":[],"urlList":[]}}