{"title":"James Sheehan - The Lawyer's Lawyer(Mobi)","uid":11137967,"size":562494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e05ae22500631413c2c491f6e1d44116d0d5d4&amp;dn=James+Sheehan+-+The+Lawyer%27s+Lawyer%28Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Q-13","files":-1,"time":1412129826,"description":"Jack Tobin, the main character of The Mayor of Lexington Avenue returns in this non-stop novel that combines enthralling plot twists with some of the best coutroom fiction being written today.\n\nTobin, known as the lawyer's lawyer--the guy the best lawyer's say they'd want to represent them in a courtroom battle--undertakes the representation of a serial killer who he believes to be innocent. The Chief of Police is outraged, the citizens of Oakville where the murders occurred, erupt, and the State Attorney is out for blood as Jack challenges the criminal justice system once again.\n\nSheehan masterfully weaves stories of love and friendship into one man's uncompromising search for truth within the four corners of a courtroom where it is often spoken about but seldom seen. Jack is in a fight for his life and the outcome is in doubt right up to the turn of the final page.\n\nA trial lawyer himself, James Sheehan is also a top-notch thriller writer. Once again he succeeds in translating the depth of his courtroom knowledge into an entertaining and truly fascinating read.","torrent":{"xt":"urn:btih:91e05ae22500631413c2c491f6e1d44116d0d5d4","amp;dn":"James+Sheehan+-+The+Lawyer%27s+Lawyer%28Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e05ae22500631413c2c491f6e1d44116d0d5d4","infoHashBuffer":{"type":"Buffer","data":[145,224,90,226,37,0,99,20,19,194,196,145,246,225,212,65,22,208,213,212]},"announce":[],"urlList":[]}}