{"title":"ULTIMATE Linux Mint 17 LiveDVD , Cinnamon Edition 64-bit","uid":10642348,"size":2275016990,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:92a09cde1e3e31c5de971bb066c78661fa57afbe&amp;dn=ULTIMATE+Linux+Mint+17+LiveDVD+%2C+Cinnamon+Edition+64-bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheMajstorDane","files":24,"time":1406490153,"description":"This torrent and all content of this release is shared under GPL licence.  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/GNU_General_Public_License&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/GNU_General_Public_License&lt;/a&gt;\n\n\nA FEW NOTES ABOUT THIS RELEASE:\n\n[url=http://www.dodaj.rs/?A/KK/1hRb99NQ/5.jpg][img]http://www.dodaj.rs/t/A/KK/1hRb99NQ/5.jpg[/img][/url]  [url=http://www.dodaj.rs/?30/2x/4ARJMV8g/2.jpg][img]http://www.dodaj.rs/t/30/2x/4ARJMV8g/2.jpg[/img][/url]  [url=http://www.dodaj.rs/?2K/Rt/193p8oJP/12.jpg][img]http://www.dodaj.rs/t/2K/Rt/193p8oJP/12.jpg[/img][/url]\n\nThis &quot;ULTIMATE Mint 17&quot; release is based on standard linux Mint 17 Qiana Cinnamon Edition 64-bit,\nbut bundled with extra software that doesn't come in a standard edition. \nBesides regular software that is included in original .ISO image- here is a list of extra software:\n    \n\nINSTALLED THEME:\n\nVOID theme\n\n\nINSTALLED SOFTWARE: \n\nFurius ISO Mount  - virtual image mount manager\nGmountISO         - virtual image mount manager\nGnome Commander   - file manager\nK4DirStat         - graphical disk usage utility\nNFO Viewer        - simple viewer for NFO files\nTrueCrypt (7.1a)  - powerful on-the-fly encryption software\nAPTonCD           - back up your installed packages to a disc or ISO image\nGparted           - gnome partition tool\nHtop              - terminal task manager\nSystem Profiler and Benchmark   -  displays info about system components\n\nChromium          - internet browser\nOpera             - internet browser\nAzureus           - filesharing torrent client\nDeluge            - filesharing torrent client\nFilezilla         - FTP client\nGoogle Earth      - virtual globe, map and geographical information program\nLinuxDC++         - DC++ filesharing client\nSkype             - VOIP software\nTeamViewer 9      - remote desktop software\n\nComix             - comic book reader\nAdobe Reader      - PDF reader\nAdobe Flash Player- flash player\n\nVirtual Box       - powerful virtualization software\nWine              - Windows program emulator\nPlayOnLinux       - graphical frontend for WINE, specialized for games\n\nCompiz desktop manager\nCompiz Config settings manager\n\nAudacity          - audio editor and recorder\nRadiotray         - online radio streaming player\nISO Master        - read, write and modify ISO images \nK3B               - CD and DVD burner, copier, ripper\nKaffeine          - media player\nMeTV              - television (DVB) viewer\nNero 4Linux       - Nero's CD &amp; DVD burner for linux\nOpenshot Video Editor  - video editor for Linux\nRecordMyDesktop   - desktop session recorder\nSMPlayer          - media player\nSmplayer Youtube Browser  - optional YouTube player\nTVtime            - television (DVB) viewer\nXMMS              - audio player\nGuvcView          - V4L2 video viewer and capture software\nWebcamstudio      - virtual webcam software\n\nRemastersys       - Back up an entire system, including user data, to an installable Live CD/DVD\nAircrack-ng       - 802.11 WEP and WPA-PSK keys cracking program\nReaver            - bruteforce attack tool for WPA/WPA2 WiFi networks\nWireshark         - network protocol analyzer\n\nAs you can see- list contains more than 45 additional programs and functions. For basic usage you don't have to download and install \nany additional software as this release contains more than you need for everyday use. \n\n\n\nHOW TO USE THIS &quot;Ultimate Mint 17 LiveDVD&quot; .ISO :\n\nThis release is Live (just like an original Mint release) so you can try this release without installation to your hard disk.\nAfter you download it- you just have to burn this .ISO image to an empty DVD disc and boot your computer from DVD drive.\nOn first boot screen hit ENTER or wait for default boot option timer to expire and start live system.\nIf you experience slow booting, just be patient and wait a few minutes until live system boots into desktop enviroment.\nThan you can use the live system as it is on a hard disk (but with slower response because it depends of DVD drive's actual speed).\nAlso keep in mind that everything you do on the live system (every change that you make on files,programs and functions on live system) \nwill be erased after first reboot, so if you make or download any important documents be sure to save 'em onto your hard drive \nbefore you shut down live system.\n\n\n\nHOW TO USE THIS &quot;Ultimate Mint 17 LiveDVD&quot; .ISO on USB flash memory stick :\n\nIn case that you don't have a DVD drive on your computer or you don't wanna use it - you could make a live system running from USB flash \nmemory stick. You will get a bit faster response of whole system than as it is on DVD drive. How can you do that? \nVery easy, in two ways- from Windows or from Linux. This torrent contains a small software called \n&quot;Rufus&quot; that will help you to transfer this .ISO distro onto USB stick. First plug your USB memory into computer and Start Rufus \nwith admin privileges and click on drop down menu where it says: &quot;Create a bootable disk using...&quot; choose &quot;ISO image&quot; from drop down menu \nand than click on drive icon next to it and browse for this .ISO.\nAfter warning message click on &quot;OK&quot; and right after that disable your antivirus protection and finally click on &quot;Start&quot; button down bellow  \nto begin creation of USB image. When you done, you have to boot your computer and as a first boot defice specify that USB memory stick. \nThe rest is the same as it's already described for DVD image above. \n(NOTE: you have to disable your antivirus protection because of autorun.inf file that exists within .ISO image and may cause false alert.)\n\nIf you already burned .ISO image on DVD and you still want to have it on USB memory too (Or in case that you don't have Windows at all so you can't \nstart Rufus to transfer files to USB) you can make USB live system right from this LiveDVD. Boot your &quot;Ultimate Mint 17 LiveDVD&quot; from drive and\nafter system boots up go to &quot;Menu&quot;--&gt; &quot;Accessories&quot; --&gt; &quot;USB Image Writer&quot; and on the left browse menu chose this .ISO and on the right \nmenu chose your USB drive and than click on &quot;Write&quot; button, wait for operation to finish and that's it.\n\n\n\nHOW TO INSTALL THIS &quot;Ultimate Mint 17 LiveDVD&quot; on your hard drive:\n\n&quot;Ultimate Mint 17 LiveDVD&quot; can be installed on the hard disk, and then used without the DVD disc. Benefits of installing the hard disk \ncompared to LIVE mode is faster response of the whole system and keeping all the changes you make in the course of work, \nfiles and settings are not deleted after the restart as in LIVE mode. The installation can be started directly from the boot menu by selecting \n&quot;install - start the installer directly&quot; or from the LIVE system by double-clicking on the &quot;Install Custom Live CD&quot; icon on the desktop or \nfrom the &quot;Menu --&gt; Administration --&gt; Install RELEASE&quot;. When you install Linux Mint, it will detect the presence of an already existing \ncomputer system (Win XP, Win 7, Win 8, etc..) And will pump it into your boot loader and will be able to choose which system will be used \nat boot time, so we will have a dual boot Windows / Linux. Or if you want to ,you can tell the installer to remove an existing operating system \nthat you already have in your computer and install only this, all of course depends on your desire.\nIf you are not well informed about how to install Linux Mint on the hard disk - than try first to inform yourself about it before you commit \nto this procedure. Consequences due to improper installation be losing the existing contents of the partitions of your PC. If you decide to \ninstall this release Mint on your hard disk- it is important to note that prior to the installation should be left empty hard disk space \n(unallocated disk space) that will be reserved for Linux files. It is necessary to provide about 11GB of space for the system + 1GB swap, \nso its about 12GB required by the installer. This can be done while the system is in LIVE mode using the Linux partitioning program Gparted. \n&quot;Menu --&gt; System Tools --&gt; Gparted&quot; After running the program click on the partition you want to separate for the installation of Linux and then \noptionally modify (&quot;Shrink&quot;/&quot;Resize / Move&quot;) to separate the free space or to delete an entire partition (&quot;Delete&quot;), and create &quot;unallocated&quot; \nspace on the disk. It is desirable before any modification / deletion of partitions to copy all of your important documents to another location \nin the event of a possible loss of data. After selecting the desired changes to the partitions click on &quot;Edit&quot; and then on &quot;Apply All Operations&quot; \nand the changes will be made.\n\nThen run the installer and follow these steps\n\n(1) Choose the language and click Continue.\n(2) Click on Continue (if all necessary dependencies are satisfied)\n(3) If you want to &quot;dual boot&quot; choose the last option &quot;Something else&quot;, then click on &quot;Continue&quot;\n(4) click on the &quot;free space&quot; which we created earlier and then click on the &quot;+&quot; left below \n(5) In the &quot;Create Partition&quot; dialog 'size' you entered 1024MB, for 'Use as' select &quot;swap area&quot; then click on &quot;OK&quot; and wait for it to create \n    a SWAP partition\n(6) click again on the &quot;free space&quot; and then click on the &quot;+&quot; in the bottom left &quot;Mount Point&quot; drop down menu, choose &quot;/&quot; and click on &quot;OK&quot; \n    and wait for it to create a system partition.\n(7) Optional: In this step, we mark the existing partitions on the hard drive to be automatically mounted at Linux booting. \n    You need to click on the desired partition and click below on &quot;Change&quot;. In the &quot;Edit Partition&quot; dialog &quot;use as&quot; choose &quot;NTFS&quot; from the \n    drop down menu for &quot;Mount Point&quot; type &quot;/windows/ data&quot; if you say a wellknown D:  partition from Windows where we keep all our documents. \n    Confirm the &quot;OK&quot; and wait for the change to apply.\n(8) followed by clicking the &quot;Install Now&quot; on the lower right\n(9) choose the time zone and click on &quot;Continue&quot;\n(10) choose the encoding keyboard and click on &quot;Continue&quot; and the installation begins\n\n\n\nABOUT DEFAULT SYSTEM SETTINGS:\n\n   Account name : Linux MINT 17 Cinnamon\n  Root username : mint17\n  Root password : cinnamon17\n  Computer name : cinnamon17\nKeyboard layout : English US\n      Time zone : Europe, city Belgrade GMT+1\nDefault subtitle encoding VLC player: Eastern European (Windows-1250)\nDefault subtitle encoding SMPlayer: Slavic/Central European Windows (CP-1250)\n\n(NOTE: During installation on hard drive, when installer prompts about username and password, whatever you fill in it doesn't matter- because \nafter installation system will return to its default settings username: mint17, password: cinnamon17 . So you should change your credentials \nAFTER installation.)\n\n\n\nDEFAULT KEYBOARD SHORTCUTS:\n\n          /  - open Home folder\n          -  - Volume Down\n          +  - Volume Up\n          *  - Volume Mute\nPrintScreen  - Take snapshot of current screen and save it to /home/Pictures\nCTRL+ALT+T   - Launch Terminal window\nCTRL+ALT+C   - Launch Calculator\nCTRL+ALT+X   - Launch XMMS player\nCTRL+ALT+V   - Launch VLC Player\nCTRL+ALT+O   - Launch Opera Browser\nCTRL+ALT+S   - Launch Skype\nCTRL+ALT+K   - Launch kaffeine player\nCTRL+ALT+G   - Launch Google Earth\nCTRL+ALT+R   - launch RadioTray player\nCTRL+ALT+F1  - launch first text terminal window (others are F2,F3,F4,F5 and F6)\nCTRL+ALT+F8  - launch user enviroment- desktop\n\n\n\nDEFAULT SYSTEM CONFIGURATION:\n\nAlthough Linux is flexible on any hardware configuration, you might miss some drivers.\nTo check, go to &quot;Menu&quot; --&gt; &quot;Administration&quot; --&gt; &quot;Driver Manager&quot;\n\n\n\nPROPOSALS AND SUGGESTIONS:\n\nIf you have any questions or suggestions regarding this publication, or suggestions about software that should be included in this edition, \nyou can write to my mail: majstor_dane[at]yahoo[dot]com  or majstor.dane[at]hotmail[dot]com\n\n\n\n\n\n\n                                                                     Daniel,\n\n                                                                    July 2014.\n\nThis torrent and all content of this release is shared under GPL licence.  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/GNU_General_Public_License&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/GNU_General_Public_License&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:92a09cde1e3e31c5de971bb066c78661fa57afbe","amp;dn":"ULTIMATE+Linux+Mint+17+LiveDVD+%2C+Cinnamon+Edition+64-bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92a09cde1e3e31c5de971bb066c78661fa57afbe","infoHashBuffer":{"type":"Buffer","data":[146,160,156,222,30,62,49,197,222,151,27,176,102,199,134,97,250,87,175,190]},"announce":[],"urlList":[]}}