{"title":"Safety of Nanomaterials along Their Lifecycle","uid":14853551,"size":4865431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9336997fa4d1fce9ae5b2b9e76d991ffbba4e0b1&amp;dn=Safety+of+Nanomaterials+along+Their+Lifecycle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465452665,"description":"Safety of Nanomaterials along Their Lifecycle - Release, Exposure, and Human Hazards - Wendel Wohlleben et al. (CRC, 2015).pdf\r\n\r\nISBN 978-1-4665-6788-7\r\n\r\nThe incorporation of nanomaterials into products can improve performance, efficiency, and durability in various fields ranging from construction, energy management, catalysis, microelectronics, plastics, coatings, and paints to consumer articles such as foods and cosmetics. But innovation never comes at zero risk. The potential hazards resulting from human exposure during production, use, or disposal has raised concerns and targeted research early on.\r\n\r\nSafety of Nanomaterials along Their Lifecycle: Release, Exposure, and Human Hazards presents the state of the art in nanosafety research from a lifecycle perspective. Although major knowledge gaps still exist, solid data are now available to identify scenarios of critical risk as well as those of safe nanomaterial use for our benefit.\r\n\r\n\r\nThe book is divided into four parts: characterization, hazard, release and exposure, and real-life case studies. To improve coherence throughout the book, various chapters review the same suite of well-characterized, judiciously chosen, and identical industrial nanomaterials. The book is a helpful resource to professionals in product development, industrial design, regulatory agencies, and materials scientists and engineers involved in the safety of nanomaterials","torrent":{"xt":"urn:btih:9336997fa4d1fce9ae5b2b9e76d991ffbba4e0b1","amp;dn":"Safety+of+Nanomaterials+along+Their+Lifecycle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9336997fa4d1fce9ae5b2b9e76d991ffbba4e0b1","infoHashBuffer":{"type":"Buffer","data":[147,54,153,127,164,209,252,233,174,91,43,158,118,217,145,255,187,164,224,177]},"announce":[],"urlList":[]}}