{"title":"Flock of Dodos (2006).avi","uid":3834028,"size":855386702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93401fc9b3f77b44c7492afafe4672cf89df0a77&amp;dn=Flock+of+Dodos+%282006%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"s222","files":1,"time":1191833532,"description":"Evolutionary Ecologist, Randy Olson, tries to find out just who is the real &quot;Flock of Dodos&quot;\n\nFilmmaker and evolutionary biologist Randy Olson tries to figure out if it is the Darwinists or Intelligent Design supporters who will become a flock of dodos.\n\nThe highly anticipated, comic and controversial feature documentary, &quot;Flock of Dodos: the evolution-intelligent design circus,&quot; is the first feature film to take an even-handed look at the intelligent design vs. evolution clash that appeared on the covers of Time and Newsweek in 2005. Filmmaker, scientist, surfer and evolutionary biologist Dr. Randy Olson explores the controversy over the teaching of evolution and the recently developed alternative, intelligent design. Olson, a native of Kansas, visits his home state and the community of Dover, Pennsylvania, which attempted to introduce intelligent design in science classes. Olson draws on basic aspects of evolution as metaphors, including the extinct dodo, which he suggests symbolizes what happens to those unable to change with their environment. Featured are seven top advocates for intelligent design, including Dr. Michael Behe, author of &quot;Darwin&amp;#039;s Black Box,&quot; fourteen evolution Ph.D.&amp;#039;s, a poker game among eight evolutionists, a rabbit eating its own poop, and a flock of animated dodos playing poker, dancing, and helping the audience answer the question, &quot;who really is the &amp;#039;flock of dodos?&amp;#039;&quot;","torrent":{"xt":"urn:btih:93401fc9b3f77b44c7492afafe4672cf89df0a77","amp;dn":"Flock+of+Dodos+%282006%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93401fc9b3f77b44c7492afafe4672cf89df0a77","infoHashBuffer":{"type":"Buffer","data":[147,64,31,201,179,247,123,68,199,73,42,250,254,70,114,207,137,223,10,119]},"announce":[],"urlList":[]}}