{"title":"Abandon All Ships - Take One Last Breath (2nafish)","uid":5974699,"size":138622980,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9361e98489c560bdf726408950051eccf7d4cb0a&amp;dn=Abandon+All+Ships+-+Take+One+Last+Breath+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1290414080,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Take One Last Breath&quot; is a song by Canadian post-hardcore band, Abandon All Ships. It was released as the first single from their debut album, Geeving. The single was released on iTunes on June 29, 2010, followed by the music video being released on June 30, 2010, where it premiered on VH1.\n\nThe music video premiered on VH1 on August 27, 2010 and on MTV's Headbangers Ball on August 24, 2010.\n\nThe music video for the song was directed by Davin Black of 235films, and is a performance-only style music video. It primarily features the band performing either on the ground, or on higher platforms with their instruments. A behind-the-scenes video was posted to Abandon All Ships' YouTube page on July 5, 2010, showing a dispute about lasers that were apparently supposed to be in the video.\n\nThe song was written by the group prior to the release of their self-titled EP. At that time, &quot;Take One Last Breath&quot; was titled &quot;Pedestrians Is Another Word for Speedbumps&quot;. Angelo Aita explained that the song name was changed because the band &quot;changed the song completely...so it's like a new name for a new song&quot; and that Universal Music Canada &quot;wanted [Abandon All Ships] to shorten [the song title] because it was really long.&quot;\n\nGeeving is the debut studio album by Canadian post-hardcore band Abandon All Ships. It was released through Universal Music Canada, Underground Operations, Rise Records, and Velocity Records on October 5, 2010. The album charted at number 16 on the Billboard Top Heatseekers chart, as well as number 27 on the Canadian Albums Chart.\n\nAbandon All Ships is a Canadian post-hardcore band from Toronto, Ontario. Formed in 2006, the group is currently signed to Underground Operations, Universal Music Canada, Rise Records, and are the first band to be signed to Velocity Records. Together, they have one EP named Abandon All Ships and one studio album, Geeving.\n\nAbandon All Ships was founded in 2006 in Toronto, Ontario. Originally, playing covers of Norma Jean songs and having gone through many different band members, most of them attending Dante Alighieri Catholic Secondary, including lead vocalist, Angelo Aita and keyboardist, Sebastian Cassisi-Nunez and their first bassist Francesco Pallota, they eventually toured and opened for many post-hardcore bands such as Silverstein. They quickly became popular on the Internet through MySpace, and were noticed even more after their appearance on the Much Music program Disband. The band was originally conceived as &quot;Abandon Ship&quot; but found the name already in use by an Oregon-based band and Scottish novelty band &quot;A Band on Ship&quot;. In early 2006 the band changed their name to &quot;Abandon All Ships&quot;, retaining the imperative mood of the original name but allowing them to market themselves distinctively.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9361e98489c560bdf726408950051eccf7d4cb0a","amp;dn":"Abandon+All+Ships+-+Take+One+Last+Breath+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9361e98489c560bdf726408950051eccf7d4cb0a","infoHashBuffer":{"type":"Buffer","data":[147,97,233,132,137,197,96,189,247,38,64,137,80,5,30,204,247,212,203,10]},"announce":[],"urlList":[]}}