{"title":"One Hundred Years of Solitude by Gabriel Garci­a Marquez, Gr","uid":8484271,"size":723908226,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9394e0e86fc97569c3892efb0ed00908c135643f&amp;dn=One+Hundred+Years+of+Solitude+by+Gabriel+Garci%26shy%3Ba+Marquez%2C+Gr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tyl3rdurd3n","files":-1,"time":1368814086,"description":"One of the 20th century's enduring works, One Hundred Years of Solitude is a widely beloved and acclaimed novel known throughout the world, and the ultimate achievement of a Nobel Prize winning career.\n\nThe novel tells the story of the rise and fall of the mythical town of Macondo through the history of the family. It is a rich and brilliant chronicle of life and death, and the tragicomedy of humankind. In the noble, ridiculous, beautiful, and tawdry story of the family, one sees all of humanity, just as in the history, myths, growth, and decay of Macondo, one sees all of Latin America.\n\nLove and lust, war and revolution, riches and poverty, youth and senility -- the variety of life, the endlessness of death, the search for peace and truth -- these universal themes dominate the novel. Whether he is describing an affair of passion or the voracity of capitalism and the corruption of government, Gabriel Garcia Marquez always writes with the simplicity, ease, and purity that are the mark of a master.\n\nAlternately reverential and comical, One Hundred Years of Solitude weaves the political, personal, and spiritual to bring a new consciousness to storytelling. Translated into dozens of languages, this stunning work is no less than an accounting of the history of the human race.","torrent":{"xt":"urn:btih:9394e0e86fc97569c3892efb0ed00908c135643f","amp;dn":"One+Hundred+Years+of+Solitude+by+Gabriel+Garci%26shy%3Ba+Marquez%2C+Gr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9394e0e86fc97569c3892efb0ed00908c135643f","infoHashBuffer":{"type":"Buffer","data":[147,148,224,232,111,201,117,105,195,137,46,251,14,208,9,8,193,53,100,63]},"announce":[],"urlList":[]}}