{"title":"Cabaret (1972) 1080p BluRay x264 DTS-SARTRE + Extras","uid":14474675,"size":6325258485,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:94a956cade097289dac9dec83154232e5fb51d6f&amp;dn=Cabaret+%281972%29+1080p+BluRay+x264+DTS-SARTRE+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sartre7","files":28,"time":1461927514,"description":"Originally a 1966 Broadway musical, this groundbreaking Bob Fosse musical was in turn based on Christopher Isherwood's Goodbye to Berlin, previously dramatized for stage and screen as I Am a Camera with Julie Harris as Sally Bowles. Fosse uses the decadent and vulgar cabaret as a mirror image of German society sliding toward the Nazis, and this intertwining of entertainment with social history marked a new step forward for the movie musical. Michael York plays a British writer who comes to Berlin in the early 1930s in hopes of becoming a teacher. He makes the acquaintance of flamboyant American entertainer Sally Bowles, played by Liza Minnelli. Sally works at the Kit Kat Klub, a George Grosz-like Berlin cabaret where each night the smirking, androgynous Master of Ceremonies (Joel Grey) introduces a jazz-driven &quot;girlie show&quot; to his debauched audience. Virtually all the film's musical numbers are staged within the confines of the Kit Kat Klub, and each song comments on the plot and on Germany's &quot;progression&quot; from hedonism to Hitlerism. Most of the Broadway score by John Kander and Fred Ebb was retained, with the welcome addition of &quot;The Money Song.&quot; Although it lost Best Picture to The Godfather, Cabaret won eight Oscars, including awards to Minnelli, Grey, and Fosse.\r\n\r\n\r\n\r\n\r\nSTARS.........: Liza Minnelli, Michael York, Helmut Griem\r\nDIRECTOR......: Bob Fosse\r\nWRITER........: Jay Allen\r\nGENRE.........: Drama | Musical\r\nRATING........: 7.9/10  35,733 votes\r\nMETASCORE.....: 80\r\nIMDB link.....: http://www.imdb.com/title/tt0068327\r\nRUNTIME.......: 2h 03mn\r\nSIZE..........: 5.13 GiB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1080\r\nBITRATE.......: 5000 Kbps (3 Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: English DTS 5.1 768kbps\r\nAUDIO2........: Commentary by Stephen Tropiano\r\nCHAPTERS......: Yes\r\nEXTRAS........: Yes\r\nSUBTITLES.....: ARA, ENG, FRE, PER, SPA\r\nSOURCE........: Untouched Blu Ray\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-04-25\r\n\r\n\r\n\r\n\r\n Blu Ray Extras\r\n================\r\n\r\n\r\n1) Cabaret: The Musical that Changed Musicals - This new documentary is as much a biography of Fosse as it is an account of the making of Cabaret. Because so few of the key creative personnel are still alive, the participants skew heavily toward secondary sources, including Fosse biographers Martin Gottfried and Sam Wasson, and Stephen Tropiano, who supplied the Blu-ray's commentary. Minnelli, Grey and York are interviewed (the latter sounding quite ill), as is songwriter John Kander and dancer Louise Quick. Bebe Neuwirth and Ben Vereen, who were directed by Fosse on other projects, supply their insights, as does Alan Heim, the editor of All That Jazz, and Rob Marshall, director of the film Chicago, of which Fosse was the original director on Broadway. The director's daughter, Nicole, also contributes. The documentary is narrated by Neil Patrick Harris, one of many musical theater stars who played the M.C. in the 1998 Broadway revival of Cabaret. (720p, 28:40)\r\n\r\n2) Cabaret: A Legend in the Making - This excellent documentary from 1997 includes interviews with numerous key players, many of whom are no longer with us, and chronicles the making of Cabaret from its initial greenlight through release and awards season. (480p,17:31)\r\n\r\n3) The Recreation of an Era -If you can ignore the salesmanship of the narration, the chief appeal of this vintage EPK is the footage of Fosse working on set and on location. (480p,6:04)\r\n\r\n4) Kit Kat Klub Memory Gallery - These interview snippets appear to be items that didn't make it into the &quot;Legend in the Making&quot; documentary. They are nevertheless interesting, and some of them contain information about the making of Cabaret that you won't find in any of the other extras. (480p,22:06)\r\n\r\n- Liza Minnelli Remembers: Marisa's Close-Up (1:00), Sally's Look (1:55), Observing the Master (0:47)\r\n- Joel Grey Reminisces: Challenges (0:50), Collective Memory (1:05), Strange Inspiration (0:40)\r\n- Michael York Remembers: A Called Bluff (1:16), Risk Taking (0:34), Rush(es) Hour (0:35), A Happy Accident (0:31)\r\n- Martin Baum Reminisces: Rock 'n' Roll Editing (3:26),  Isherwood's Surprise Reaction (1:27), Smithsonian Honor (0:38)\r\n- Cy Feuer Reminisces: Tomorrow Belongs to Me (1:12)\r\n- Emanuel L. Wolf Remembers: Taking on The Godfather (0:52), Timeless (0:29)\r\n- John Kander Remembers: Playing &quot;What If?&quot; (1:01), Almost a Nervous Breakdown (0:41), Sneaking a Peek (0:14)\r\n- Jay Presson Allen Reminisces: Play vs. Book (0:24), Recruiting Hugh Wheeler (0:14)\r\n- Fred Ebb Remembers: Screening Blues (1:12), Screening Hues (0:44),\r\n\r\n5) Trailer - The original theatrical trailer. (480p,2:56)\r\n\r\n\r\n\r\nScreens\r\n \nhttp://postimg.org/gallery/1w8dkg336","torrent":{"xt":"urn:btih:94a956cade097289dac9dec83154232e5fb51d6f","amp;dn":"Cabaret+%281972%29+1080p+BluRay+x264+DTS-SARTRE+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94a956cade097289dac9dec83154232e5fb51d6f","infoHashBuffer":{"type":"Buffer","data":[148,169,86,202,222,9,114,137,218,201,222,200,49,84,35,46,95,181,29,111]},"announce":[],"urlList":[]}}