{"title":"Family Guy Soundbites One","uid":6829489,"size":91913352,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:94b29ecc10bcde2e44d8746957ada96315fe4617&amp;dn=Family+Guy+Soundbites+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Wopatoolie","files":1,"time":1321731603,"description":"    Back by popular demand, this is a collection of soundbites I took from Family Guy a couple years ago when I was doing a live net radio show, to be placed in between songs for a nice blend to the heavy metal I played....fuck commercials, I did it because I liked it, not to get paid.\n\nBits that are hilarious from the show without needing visuals, these are a great addition to any playlist, whether sitting around with friends partying or anything else.\n\n    I created these, even the ones that have been floating around other torrent sites....but if you get them from anywhere else they are a couple years old and I cannot guarantee them to be quality or bug-free because I only posted them here on TPB, and I don't know what others may have done to them before they re-posted them somewhere else. However, if you get them HERE only on TPB from me these soundbites are 100%\n\n(As I stated before, the sound is generally leveled even across all bits, but making them at 3-4am there are some that are louder or more quiet than others, mainly in part Too, but get that TOO :D)\n\nEnjoy ","torrent":{"xt":"urn:btih:94b29ecc10bcde2e44d8746957ada96315fe4617","amp;dn":"Family+Guy+Soundbites+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b29ecc10bcde2e44d8746957ada96315fe4617","infoHashBuffer":{"type":"Buffer","data":[148,178,158,204,16,188,222,46,68,216,116,105,87,173,169,99,21,254,70,23]},"announce":[],"urlList":[]}}