{"title":"Frontier Ruckus - Deadmalls &amp; Nightfalls [2010][EAC,log,cue.","uid":8750000,"size":290780442,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:955148de53a99e2e680d5b9b0499fc7e3de1e606&amp;dn=Frontier+Ruckus+-+Deadmalls+%26amp%3B+Nightfalls+%5B2010%5D%5BEAC%2Clog%2Ccue.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1375007826,"description":"Artist: Frontier Ruckus\nRelease: Deadmalls &amp; Nightfalls\nReleased: 2010\nLabel: Ramseur Records\nCatalog#: RR3728\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Americana,bluegrass\n\n\n1. Nerves of the Nightmind\n2. Ontario\n3. Springterror\n4. Ringbearer\n5. Silverfishes\n6. The Upper Room\n7. Does Me In\n8. The Tower\n9. Pontiac, the Nightbrink\n10. How Could I Abandon?\n11. I Do Need Saving\n12. Pour Your Nighteyes\n\nIt's not hard to figure out that Frontier Ruckus are from Michigan; there are verbal clues as they drop mentions of East Lansing, White Lake, and Pontiac in the lyrics, but even without them, there's something about the dour classicism and sad, stoic beauty of Matthew Milia's melodies that has sprung from dozens of long nights stuck at home with a few feet of snow outside and a case of beer for company, or buggy evenings by the lake troubled by humidity and heartache. The literate angst and spare, elegant sound of 2010's Deadmalls &amp; Nightfalls, powered by a handful of acoustic instruments (most handled by Milia and bandmate David W. Jones) and some tactfully applied horns (courtesy of Zachary Nichols), suggests a middle ground between the Palace Brothers and Sufjan Stevens, but the effect feels more like the shared experiences of Midwestern brethren than any conscious borrowing, and Milia and his bandmates give this album a full and satisfying sound without sacrificing the open spaces that add so much to the power of this music. Frontier Ruckus' name and approach conjure up images of a rural community, but the concerns of Deadmalls &amp; Nightfalls are largely those of a place where the cities have fallen into disrepair and the suburbs are following their lead; the sorrow of this music speaks of a troubled time and community, but the bittersweet memories and uncomfortable present days in Milia's songs are a shout against the wasted potential of these cities and their people rather than self-pitying navel gazing. In its own subtle way, Deadmalls &amp; Nightfalls is a powerful portrait of the sad state of post-millennial America, and the thoughtful simplicity of Frontier Ruckus' approach speaks as eloquently as any angry shout about life in post-industrial America.\nOn the follow-up to The World Won't End, Joe Pernice and his band of melody makers have created another gleaming gem of intelligent, heartfelt guitar pop. Pernice possesses one of the most beautiful voices in rock music today. Think Colin Blunstone or Steve Martin of the Left Banke for comparisons. His lyrics are smart and literate, but always clear and universal. Lines like &quot;How her hair got lost in the morning light/And her eyes as kind as the morning rain,&quot; sung in a voice that could charm the bees out of their hive, really get you right in the solar plexus. Pernice harmonizing with himself is a truly wonderful thing, like eating two ice cream cones at once on a hot summer day. The sound of the record is as smooth and shiny as the last record, perhaps a bit more rock-oriented with more uptempo tracks than one is accustomed to on a Pernice Brothers release. There are fewer arrangements and more songs that sound like a band playing its heart out (in a gracefully subdued way).\n\nThe key element to their sound on this album is Peyton Pinkerton; his guitar lines are melodic, angular, and often New Order-esque -- which you may not expect from such a resolutely American indie pop band, but remember that Pernice memorably covered &quot;Leave Me Alone&quot; on the underrated Chappaquiddick Skyline record. Every song on Yours, Mine &amp; Ours is top-notch, but a few stand out as instant classic material. The aforementioned &quot;Sometimes I Remember&quot; is perhaps the apex of the disc; the attention to sonic detail is stunning, as are the female backing vocals. &quot;Blinded By the Stars&quot; has wonderfully atmospheric stretches of instrumental grandeur, &quot;Judy&quot; is a dreamy ballad with lovely vocals and a warm cascade of strings and gently plucked guitars, and &quot;How to Live Alone&quot; is a midtempo weeper with really intricate and fun backing vocals that sound lifted straight from a Sandpipers record. Yours, Mine &amp; Ours is a truly grand record, another in the string of classic releases by Joe Pernice. The kind of record you want to start over again from the beginning as soon as it ends. The kind of record that never lands the band responsible on the cover of magazines but will end up on critics' lists at the end of the year. The kind of record fans of intelligent pop music played with real emotion should purchase. Immediately.","torrent":{"xt":"urn:btih:955148de53a99e2e680d5b9b0499fc7e3de1e606","amp;dn":"Frontier+Ruckus+-+Deadmalls+%26amp%3B+Nightfalls+%5B2010%5D%5BEAC%2Clog%2Ccue.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955148de53a99e2e680d5b9b0499fc7e3de1e606","infoHashBuffer":{"type":"Buffer","data":[149,81,72,222,83,169,158,46,104,13,91,155,4,153,252,126,61,225,230,6]},"announce":[],"urlList":[]}}