{"title":"Coast to Coast August 24 Clinton Foundation","uid":15656619,"size":28435788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:970d5983dea63ffea2d51530a83a411e89b6c98b&amp;dn=Coast+to+Coast+August+24+Clinton+Foundation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1472142796,"description":"Coast to Coast August 24,2016\r\nClinton Foundation Scheme\r\nJerome Corsi has been a student and analyst of history, geopolitics and world affairs for decades. He discussed his recent work investigating how the Clintons amassed hundreds of millions of dollars in personal net worth, while building up their Clinton Foundation. He characterizes it as a sordid tale involving suspicions of Enron-like fraudulent accounting practices, as well as several &quot;shell corporations&quot; and &quot;pass-through&quot; bank accounts (which can't be tracked), set up by Bill Clinton. The Clinton Foundation was formed at the end of the 1990s when they were leaving the White House to initially fund Pres. Clinton's Library in Little Rock.\r\n\r\nHowever, the Foundation quickly started raising money for various charitable causes such as for earthquake relief in India, &quot;but these were Clinton self-declared charitable purposes and it violated federal law in that they had no determination letter from the IRS...to raise money for additional purposes,&quot; he argued. Corsi compared such practices to what criminal grifters do in creating charities that play on people's sympathies, but actually use only a small percentage of the funds to assist in the stated cause.\r\n\r\nCorsi was also critical of Bill and Hillary Clinton's enormous speaking fees, which ranged from $500,000 to $1 million per speech. Hillary was giving speeches for Wall Street firms like Goldman Sachs and never releasing the transcripts, &quot;but clearly these firms, paying these kinds of fees, have to feel that they're buying access, have to feel they're getting influence,&quot; he commented. People should demand state-driven investigations of the Clinton Foundation, he suggested, as it can be shown that they have diverted millions of dollars from their coffers, yet we don't know where the funds actually ended up.\r\n \nhttp://www.coasttocoastam.com/show/2016/08/24","torrent":{"xt":"urn:btih:970d5983dea63ffea2d51530a83a411e89b6c98b","amp;dn":"Coast+to+Coast+August+24+Clinton+Foundation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"970d5983dea63ffea2d51530a83a411e89b6c98b","infoHashBuffer":{"type":"Buffer","data":[151,13,89,131,222,166,63,254,162,213,21,48,168,58,65,30,137,182,201,139]},"announce":[],"urlList":[]}}