{"title":"W.Chmielarz - Krolowa Glodu [EPUB+PDF] [Polish]","uid":13666736,"size":1217128,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9713e04a00b8d0275884884688f39b78edd1c5fb&amp;dn=W.Chmielarz+-+Krolowa+Glodu+%5BEPUB%2BPDF%5D+%5BPolish%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":3,"time":1456276597,"description":"Wojciech Chmielarz - Królowa Głodu\r\nformat: EPUB+PDF / jakość: b.dobra\r\n\r\nLiteracki &quot;skok w bok&quot; Wojciecha Chmielarza - autora znanego dotąd głównie z bestsellerowych powieści kryminalnych. Choć autor - jeszcze przed swoim oficjalnym debiutem - próbował już swych sił w krótszych formach na łamach &quot;Nowej Fantastyki&quot;, to tym razem podszedł do tematu zupełnie już na poważnie - i stworzył pełnokrwistą powieść fantastyczną, łączącą w sobie elementy post-apokaliptycznego SF, fantasy - a nawet westernu i horroru! Ta niewielka, lecz bogata formą i treścią powieść, to prawdziwa gratka - zarówno dla miłośników wymienionych gatunków, jak i tych Czytelników, którzy prozę Chmielarza znają z jego dokonań na gruncie kryminału i na tym polu polubili styl pisarza - który niezmiennie utrzymuje świetną formę, udowadniając tym samym, że autor równie doskonale sprawdza się w obu gatunkach!\r\n\r\nMinęło dwadzieścia lat od chwili kiedy żołnierze Korporacji zdobyli Kuźnię Zachodu i dokonali rzezi jej mieszkańców - oraz dziesięć, od dnia w którym wojska Federacji przegnały najeźdźców...\r\nTeraz tereny dawnego księstwa to ziemia niczyja, zamieszkała przez opanowanych &quot;gorączką żywmetalu&quot; awanturników. Założone przez nich miasto - Kaźń - rozrasta się z każdym dniem, a poszukiwaczy nie odstrasza ani epidemia tajemniczej choroby, ani błąkające się po okolicznych lasach potwory.\r\nDo takiego miejsca przybywa młody Holender - Bram Huygens. Powierzono mu do wykonania misję, od której zależy przyszłość dawnego księstwa i jego mieszkańców. Wkrótce Bram przekona się, że w Kaźni każdy ma swoje sekrety - i że niektóre z nich są śmiertelnie groźne...\r\nTymczasem w głębi lasów budzi się nowa siła - potężna, obłąkana, żądna ludzkiego mięsa i zemsty","torrent":{"xt":"urn:btih:9713e04a00b8d0275884884688f39b78edd1c5fb","amp;dn":"W.Chmielarz+-+Krolowa+Glodu+%5BEPUB%2BPDF%5D+%5BPolish%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9713e04a00b8d0275884884688f39b78edd1c5fb","infoHashBuffer":{"type":"Buffer","data":[151,19,224,74,0,184,208,39,88,132,136,70,136,243,155,120,237,209,197,251]},"announce":[],"urlList":[]}}