{"title":"SDL Trados Studio 2009 SP1 Bundle","uid":5423789,"size":1072232566,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:97148bcd0b9b2e640713aafdfeadf9d8c6762d12&amp;dn=SDL+Trados+Studio+2009+SP1+Bundle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jackson16","files":4,"time":1268173808,"description":"Warning: Extraction may take several minutes. Be patient!\n\nThe screenshots are self-explanatory. Install, use the &quot;ActivKits&quot;, point the license manager to the license. Although included, there's no need to install the FLEXnet license server. In the case of Passolo, even though the Trados 2007 installer will say it's launching the installation of Passolo Essentials, it will actually be installing Passolo 2009 SR3 Team Edition. Pay attention during install and make sure you deselect the check box next to the option to install the dongle driver. Then use vnekrilov's patch to activate the application. If Trados Studio 2009 SP1 tries to install Passolo Essentials, cancel it.\n\nTo view the ActivKits AIO as intended, you need Adobe Flash Player installed.\n\nAll credit for the SDL patches and license go to MaddMaxx and Avrin. vnekrilov did the patch for Passolo 2009 Team Edition. If you repost this elsewhere, plase make sure you give them proper credit.\n\nI shouldn't have to say this but any files that need patching CANNOT be in use at the time of patching. Make sure no SDL app is running during patching, including the license manager.","torrent":{"xt":"urn:btih:97148bcd0b9b2e640713aafdfeadf9d8c6762d12","amp;dn":"SDL+Trados+Studio+2009+SP1+Bundle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97148bcd0b9b2e640713aafdfeadf9d8c6762d12","infoHashBuffer":{"type":"Buffer","data":[151,20,139,205,11,155,46,100,7,19,170,253,254,173,249,216,198,118,45,18]},"announce":[],"urlList":[]}}