{"title":"Lubimov (piano) Black Mass - Shostakovich Prokofiev Stravinsky S","uid":9895852,"size":212311069,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:983a7eae1087f3bc89ea1a6746e11351688a226a&amp;dn=Lubimov+%28piano%29+Black+Mass+-+Shostakovich+Prokofiev+Stravinsky+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"magneez","files":5,"time":1396710688,"description":"Igor Stravinsky\nSerenade in A for piano\n\nDmitri Shostakovich\nSonata No. 2 op. 61 for piano\n\nSergey Prokofiev\nSonata No. 7 op. 83 for piano\n\nAlexander Scriabin\nSonata No. 9 op. 68 for piano\n\nAlexei Lubimov - Piano\n\nThis CD's title, Messe Noire, and its dark cover art may mislead some into thinking this album is filled with evil, forbidden things; but the only selection that suggests the diabolical is Alexander Scriabin's macabre Sonata No. 9, &quot;Black Mass,&quot; and it comes at the very end, after Igor Stravinsky's light, neo-Classical Serenade in A, Dmitry Shostakovich's sardonic Sonata No. 2, and Sergey Prokofiev's witty but brutal knuckle-buster, the Sonata No. 7, which all have their dark moments, certainly, but not the same sinister mood found in Scriabin. If pianist Aleksei Lubimov's aim in bringing these Russian masterworks together points to some other unifying idea -- perhaps the significance of the piano in these composers' thinking -- then some other title might have been more helpful. As it is, though, this album seems most unified in Lubimov's vigorous style of playing, brittle execution, and emphasis on the piano's percussive sonorities, evident in each performance. This spiky approach works best in Prokofiev's sonata, and fairly well in Shostakovich's and Stravinsky's pieces; but it seems too sterile in Scriabin's music, which needs more languor and sensuous writhing than clarity or crispness. Other than that, Lubimov's playing is impressive, and he is well recorded by ECM, though in a rather dry acoustic.","torrent":{"xt":"urn:btih:983a7eae1087f3bc89ea1a6746e11351688a226a","amp;dn":"Lubimov+%28piano%29+Black+Mass+-+Shostakovich+Prokofiev+Stravinsky+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"983a7eae1087f3bc89ea1a6746e11351688a226a","infoHashBuffer":{"type":"Buffer","data":[152,58,126,174,16,135,243,188,137,234,26,103,70,225,19,81,104,138,34,106]},"announce":[],"urlList":[]}}