{"title":"Jet Li's Fearless(2006)DVDRip.AC3(ENG)-DROCK","uid":6496432,"size":732314346,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:992f3173b1b48c5bb41c61388bce4d9919bad069&amp;dn=Jet+Li%5C%27s+Fearless%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1309048066,"description":"Fearless opens in Shanghai, China, circa 1910, when wushu master Huo Yuanjia (martial arts superstar Jet Li) prepares to battle one Japanese opponent, Tanaka (Shidou Nakamura), and three American opponents (Anthony de Longis, Jean-Claude Leuyer, and Brandon Rhea) in a massive tournament. The picture then cuts back to Huo's boyhood in the city of Tianjin, in North China, circa 1880, when his father forbids him from engaging in martial-arts training. He must therefore slip off and train covertly. Around 1900, Huo -- then in his twenties -- continues to fight in tournaments. His determination is such that his entire life begins to revolve around championships, and the prospect of becoming the top-ranked fighter in Tianjin turns into a die-hard obsession, despite the repeated warnings of his best friend, Nong (Dong Yong), to cut back. Huo ignores these admonitions, then turns conceited and ultimately refuses to hear an additional word of caution, until his arrogance leads to the death of a fighter and Nong's decision to abandon him as a friend. Driven into exile, Huo journeys to southeastern Asia, where he works alongside rice farmers and divests himself of conceit, then gently touches the spirit of a blind girl. When he finally returns to Tianjin, he has transformed, internally, into a different person altogether. A huge hit in Hong Kong when originally released into theaters in 2006, Fearless was often touted as Jet Li's final film in the wushu school of martial arts. The picture is based on the real-life story of Huo Yuanjia, founder of the Jingwu school of martial arts.\n\nRipped with Handbrake.\n\nLength: 1 Hour 44 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:992f3173b1b48c5bb41c61388bce4d9919bad069","amp;dn":"Jet+Li%5C%27s+Fearless%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"992f3173b1b48c5bb41c61388bce4d9919bad069","infoHashBuffer":{"type":"Buffer","data":[153,47,49,115,177,180,140,91,180,28,97,56,139,206,77,153,25,186,208,105]},"announce":[],"urlList":[]}}