{"title":"ProcessLasso v6.6.0.30 Complete Pack [KEYMAKER]","uid":8609451,"size":11749478,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9987443a5ab619b6fe3ad6b98deaa8dc8959db22&amp;dn=ProcessLasso+v6.6.0.30+Complete+Pack+%5BKEYMAKER%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"XK72","files":9,"time":1372096197,"description":"Please read ReadMe.txt before install the program.\n\nBitSum Process Lasso v6.6.0.30 Complete Pack [MULTILANGUAGE]\nThis pack include all editions of ProcessLasso\n\nProcess Lasso is a utility that allows automation and persistence of various process settings. It also offers dynamic ProBalance process priority and CPU affinity optimization. This technology helps to keep a PC responsive even under heavy loads.\n\nWith Process Lasso, one can set persistent CPU affinities, process priority classes, I/O priority, memory priorities, and application power profiles. These settings get re-applied each time the process is run. Users can also limit the number of instances an application can have, or disallow processes from running entirely. More advanced watchdog rules can be created to take any number of actions based on quotas and thresholds. For instance, trim the working set when a process's working set exceeds a specified amount, or lower the process priority class when an application exceeds a particular amount of CPU utilization for a specific duration.\n\nProcess Lasso's core engine is isolated in a stand-alone process that can be run as a service. This allows for absolutely minimal resource consumption by Process Lasso itself. Even the graphical user interface is written in native C++ and barely consumes 10MB of RAM during its heaviest loads.\n\nDon't be overwhelmed by all the options of Process Lasso. Our ProBalance algorithm works out of the box to restrain unruly programs. No additional configuration necessary!\n","torrent":{"xt":"urn:btih:9987443a5ab619b6fe3ad6b98deaa8dc8959db22","amp;dn":"ProcessLasso+v6.6.0.30+Complete+Pack+%5BKEYMAKER%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9987443a5ab619b6fe3ad6b98deaa8dc8959db22","infoHashBuffer":{"type":"Buffer","data":[153,135,68,58,90,182,25,182,254,58,214,185,141,234,168,220,137,89,219,34]},"announce":[],"urlList":[]}}