{"title":"The Sorcerer's Apprentice (gnv64)","uid":8539058,"size":32286467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99ebbc3742db151a3209e06fc502af8dafd539ce&amp;dn=The+Sorcerer%27s+Apprentice+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1370304231,"description":"The Sorcerer's Apprentice (original edition)\nby David Bronstein, Tom Furstenberg\nCadogan Books | November 1995 | ISBN-10: 1857441516 | DJVU/PDF | 304 pages | 3.88/26.9 mb &lt;a href=&quot;\nhttp://www.amazon.com/Sorcerers-Apprentice-Cadogan-Chess-Books/dp/1857441516&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Sorcerers-Apprentice-Cadogan-Chess-Books/dp/1857441516&lt;/a&gt;\nPDF conversion is mine.\n\nIn this instructive and entertaining book for players of all ages, the legendary David Bronstein, artist and sorcerer of the chessboard, invites the reader to become his apprentice. Bronstein begins with 40 recommendations for the chess novice and then develops the reader's chess skills with examples from his own games, of which there are 222 played between 1938 and 1995 - a career spanning 57 years! Although the book has been written primarily for amateurs, with easy-to-understand commentaries, more experienced players - yes, even grandmasters - will also enjoy Bronstein's many interesting stories and the way in which he waves his magic wand. This is an unconventional book, probably quite unlike anything else the chess world has seen to date, but then again, the main subject is also quite unique!\n\nThis book consists of four major sections: \n- The first is forty of Bronstein's greatest combinations. These forty games have one diagram of the position before the decisive combination. The rest of the page has Bronstein's comment on the combination. \n- The next section is a collection of fifty of his games. Most have a medium amount of annotation, but a few have extensive annotations. Many of the games have cute annecdotes attached to them. These annecdotes are part of the charm of the book. From one of these annecdotes, one can bring proof to the theory that the Russians 'fixed' certain tounamant results. \n- The next section is sixty games by diagram. Practically speaking, this means that there are about 5 diagrams per game. \n- The last section is called seventy picturesque games. Unfortunately, no clue is given to what David Bronstein considers picturesque. \n\nThe added bonus to the book is that between each section there is an interesting article about Bronstein. Overall this is a game collection/autobiography that is as good as Tal's, and this one has the advantage that it has a much larger percentage of Bronstein's chess career that Tal's book has.\n\nCONTENTS\nThe Sorcerer's Apprentice 9\nA Word to the Reader 15\nDevik 19\n40 Combinations 29\n50 Games with Comments 71\n60 Games with Diagrams 205\n70 Picturesque Games 273\nOne Horse is faster than another 287\nIndex of Opponents 295\nIndex of Openings 297\nList of Results 299\n\nA revised and expanded edition of this book was published in 2009 ( http://www.amazon.com/The-Sorcerers-Apprentice-David-Bronstein/dp/9056912720)","torrent":{"xt":"urn:btih:99ebbc3742db151a3209e06fc502af8dafd539ce","amp;dn":"The+Sorcerer%27s+Apprentice+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ebbc3742db151a3209e06fc502af8dafd539ce","infoHashBuffer":{"type":"Buffer","data":[153,235,188,55,66,219,21,26,50,9,224,111,197,2,175,141,175,213,57,206]},"announce":[],"urlList":[]}}