{"title":"Taboo milf Kristi - Teaching My Son a Very Important Lesson 1080","uid":12348852,"size":1179988586,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9a6f5e42008cccb2ddb81bbe12d20a2e3e7511c7&amp;dn=Taboo+milf+Kristi+-+Teaching+My+Son+a+Very+Important+Lesson+1080&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TKTh3K1ng","files":2,"time":1441390139,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/C8v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/C8v&lt;/a&gt;\n\n(Mommy is doing the laundry when she notices that her favorite pair of panties are missing. She tried asking her son through the door if he's seen them.... but after receiving no response mommy has no choice but to walk in and find out what's going on....)\n\nHoney? Can you hear me? What are you doing in there? I'm coming in to see what you are doing..... Honey! Why didn't you answer me? What are you doing.... oh! Oh baby... you aren't doing that, are you? Here, let mommy see... honey!! My panties!! I was looking for these just now, why do you have mommy's panties?? *gasp* Honey! Were you doing what I think you were doing with mommy's panties?\n\nOh honey... my sweet boy... I thought I had more time before I had to.... well.... before I had to teach you the most important lesson that a boy will ever learn. I thought I had so much more time, I really wasn't prepared for this but you are already experimenting so mommy must teach you now. Mommy is going to show you how to.... how to.... well, how to touch yourself to make yourself feel good! You have to learn the proper ways of doing this things and mommy knows exactly how to use *that* thing. Here baby, let me show you. Now you just do what mommy shows you to do and everything will be fine. Good job honey! You are doing so good! Oh wait, no honey... not like that... look, you hold it like this... no no, not like that.... let go of it, you're not doing it right. Let mommy show you how to do it....\n\nYou'll like this video if you enjoy: MILF - Mommy - Virtual Sex - Virtual Handjob - Older Woman - Jerk Off Instruction - JOI","torrent":{"xt":"urn:btih:9a6f5e42008cccb2ddb81bbe12d20a2e3e7511c7","amp;dn":"Taboo+milf+Kristi+-+Teaching+My+Son+a+Very+Important+Lesson+1080","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a6f5e42008cccb2ddb81bbe12d20a2e3e7511c7","infoHashBuffer":{"type":"Buffer","data":[154,111,94,66,0,140,204,178,221,184,27,190,18,210,10,46,62,117,17,199]},"announce":[],"urlList":[]}}