{"title":"XenServer7","uid":15899052,"size":4188746889,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:9ba5408e0ea16d2736f3d49903304d1eb97f18b0&amp;dn=XenServer7&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"XenProvider","files":16,"time":1474987468,"description":"XenServer is an enterprise-class, cloud-proven, virtualization platform that delivers all of the critical features needed for any server and datacenter virtualization implementation.  The following list summarizes some of the key capabilities of XenServer, and a complete technical FAQ can be found on the Citrix support web site.\r\n\r\nCORE PLATFORM\r\n\r\nXenServer is based on the Xen Project™ hypervisor.  The Xen Project hypervisor is a bare metal virtualization platform used by XenServer to deliver near native application performance for x86 workloads in an Intel and AMD environment.  \r\n\r\nMANAGEMENT CAPABILITIES\r\n\r\nMULTI-SERVER MANAGEMENT\r\n\r\nXenCenter provides all the virtual machine management, monitoring and general administration, and general administration functions in a single interface. Administrators can easily manage hundreds of virtual machines from a centralized, highly available management console that installs on any Windows® desktop. The resilient distributed management architecture in XenServer distributes server management data across the servers in a resource pool to ensure that there is no single point of management failure.\r\n\r\nROLE BASED ADMINISTRATION\r\n\r\nRole-based administration improves security and enables delegated access, control, and usage of XenServer pools by maintaining a tiered access structure with varying levels of permissions.\r\n\r\nPERFORMANCE ALERTING AND REPORTING\r\n\r\nReceive immediate notification with historical reporting of VM performance to enable the rapid identification and diagnosis of fault or failure in the virtual infrastructure.\r\n\r\nSCALABLE VIRTUAL INFRASTRUCTURE\r\n\r\nLIVE VM MIGRATION\r\n\r\nXenMotion™ eliminates the need for planned downtime by enabling active virtual machines to be moved to a new host with no application outages or downtime.\r\n\r\nLIVE STORAGE MIGRATION\r\n\r\nMove live running virtual machines and their associated virtual disk image within and across resource pools leveraging local and shared storage. This enables users to move a VM and its virtual disk image from a development to production environment, move between tiers of storage when a VM is limited by storage capacity, and perform maintenance and upgrades with zero downtime.\r\n\r\nHOST FAILURE PROTECTION\r\n\r\nDeliver high availability by automatically restarting virtual machines if a failure occurs at the VM, hypervisor or server level. Link aggregation bonds network interfaces for network redundancy and increased throughput.\r\n\r\nHOST POWER MANAGEMENT\r\n\r\nTake advantage of embedded hardware features to lower datacenter electricity consumption by dynamically consolidating VMs on fewer systems and then powering off underutilized servers as demand for services fluctuates.\r\n\r\nMEMORY OVERCOMMIT\r\n\r\nReduce costs and improve application performance and protection by sharing unused server memory between VMs on the host server.\r\n\r\nHETEROGENEOUS RESOURCE POOLS\r\n\r\nEnables resource pools to contain servers with different processor types, and support full XenMotion, high availability, and shared storage functionality.\r\n\r\nSITE RECOVERY\r\n\r\nProvides site-to-site disaster recovery planning and services for virtual environments. Site recovery is easy to set up, fast to recover, and has the ability to frequently test to ensure disaster recovery plans remain valid","torrent":{"xt":"urn:btih:9ba5408e0ea16d2736f3d49903304d1eb97f18b0","amp;dn":"XenServer7","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ba5408e0ea16d2736f3d49903304d1eb97f18b0","infoHashBuffer":{"type":"Buffer","data":[155,165,64,142,14,161,109,39,54,243,212,153,3,48,77,30,185,127,24,176]},"announce":[],"urlList":[]}}