{"title":"Pixies - Wave Of Mutilation (Best Of Pixies) (2004)@flac","uid":12402356,"size":619056576,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c1eab785f7e51c7e9c014fef0e12379b4686a71&amp;dn=Pixies+-+Wave+Of+Mutilation+%28Best+Of+Pixies%29+%282004%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":41,"time":1442047028,"description":"\n\n4AD tries, tries again with Wave of Mutilation: The Best of the Pixies, the second Pixies best-of they've released since the band broke up in 1992 and the companion piece to the long-awaited, simultaneously released DVD Pixies. Lessons have been learned from 1997's half-baked Death to the Pixies: this compilation's track listing is in more or less chronological order (although Surfer Rosa's &quot;Where Is My Mind?&quot; pops up in the middle of the album, after a string of Doolittle tracks), which helps the flow of the collection; since each of the Pixies' albums had its own distinctive feel, the cut'n'paste approach of the previous best-of didn't always serve the songs it collected. More importantly, Wave of Mutilation boasts 23 songs, as opposed to the 17 on the best-of disc on Death to the Pixies. \nWhile, theoretically, 23 tracks should be enough to capture most, if not all, of the band's definitive moments, that's not quite the case here. The collection does a good job of compiling the band's singles, two excellent B-sides (&quot;Into the White&quot; and &quot;Winterlong&quot;), and many of their key album tracks, but those are so numerous that, for the second time, more than a few of the Pixies' best songs have been left off of their best-of album. The picks from Doolittle are more or less perfect (although including the wonderfully creepy &quot;I Bleed&quot; certainly would've earned some extra credit), but several near-essential songs from each of their other albums are missing in action. Surfer Rosa's &quot;Cactus&quot; and &quot;River Euphrates are at the top of that list. Come On Pilgrim's &quot;I've Been Tired&quot; and &quot;Levitate Me&quot; are missed nearly as much, even though including them would bring the total songs from the eight-song mini-album that appear on Wave of Mutilation to five (making a case for Come On Pilgrim to be considered the Pixies' most consistent -- if not best -- work).\n\nNot coincidentally, the albums that get the shortest shrift on the collection, Bossanova and Trompe le Monde, have also been downplayed in the set lists of the Pixies' reunion concerts. Yes, those two albums aren't quite as strong or immediate as what preceded them. And yes, &quot;Velouria,&quot; &quot;Allison,&quot; and &quot;Dig for Fire,&quot; and &quot;U-Mass,&quot; &quot;Alec Eiffel,&quot; and &quot;Planet of Sound&quot; are good selections from Bossanova and Trompe le Monde. However, the best moments from these albums (that don't already appear on the compilation) reflect the atmospheric sound that made them so unique in the Pixies' catalog. \nBossanova's &quot;The Happening&quot; or &quot;All Over the World&quot; would've been apt nods to the band's sci-fi fetish, while &quot;Letter to Memphis,&quot; &quot;The Sad Punk,&quot; &quot;Motorway to Roswell,&quot; or the title track from Trompe le Monde also would've worked well on the collection. One final, more minor flaw is the collection's bright, shiny artwork, which recalls the mid-'90s work that the design studio v23 did for 4AD artists like Belly and the Breeders. It's attractive, but a little faceless and lacking the dramatic surrealism of Simon Larbalastier's photos, which clothed the Pixies' albums in what seemed like stills from the dreams and nightmares unspooling in the band's songs. In some ways, for die-hard Pixies fans it's easier to miss what isn't here than to appreciate what is; then again, fans can (and probably have) made their own master mixes of what they consider the Pixies' greatest hits. \nEven though the best way to experience the band is still devouring each of their albums, Wave of Mutilation: The Best of the Pixies is intended as a primer to their work, and -- fannish nitpicking aside -- it's a far better overview than what was available before. (AMG)\n\n &lt;a href=&quot;\nhttp://i.imgur.com/rB0J1H7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/rB0J1H7.jpg&lt;/a&gt;\n\n\n01. Bone Machine    [3:03]\n02. Nimrod's Son    [2:16]\n03. The Holiday Song    [2:15]\n04. Caribou    [3:14]\n05. Broken Face    [1:29]\n06. Gigantic (Single Version)    [3:13]\n07. Vamos    [4:18]\n08. Hey    [3:28]\n09. Monkey Gone To Heaven    [2:55]\n10. Debaser    [2:51]\n11. Gouge Away    [2:42]\n12. Wave Of Mutilation    [2:03]\n13. Here Comes Your Man    [3:21]\n14. Tame    [1:56]\n15. Where Is My Mind    [3:49]\n16. Into The White    [4:39]\n17. Velouria    [3:40]\n18. Allison    [1:17]\n19. Dig For Fire    [3:02]\n20. U-Mass    [3:00]\n21. Alec Eiffel    [2:47]\n22. Planet Of Sound    [2:06]\n23. Winterlong    [3:08]\n\n\nGuitar, Vocals - Black Francis\nLead Guitar - Joey Santiago\nBass, Vocals - Kim Deal\nDrums - David Lovering\n\n\nSongwriter - Black Francis (tracks: 1 to 22) \nProducer - Gary Smith (tracks: 2 to 4, 23), Gil Norton (tracks: 6, 8 to 14, 17 to 22), Steve Albini (tracks: 1, 5, 7, 15)\n\n\n2 to 4: from 'Come On Pilgrim' mini-album. Recorded at Fort Apache, Roxbury, MA.\n1, 5, 7, 15: from 'Surfer Rosa' album. Recorded at Q Division, Boston, MA.\n6: from 'Gigantic' single. Recorded at Blackwing, London.\n8 to 14: from 'Doolittle' album. Recorded at Downtown Recorders, Boston, MA. Mixed at Carriage House Studios, Stamford, CT.\n16: from 'Here Comes Your Man' single. Recorded at Fort Apache, Roxbury, MA.\n17 to 19: from 'Bossanova' album.\n20 to 22: from 'Trompe Le Monde' album. Recorded at Master Control, Burback, CA.\n23: from 'Dig For Fire' single. Recorded at Fort Apache, Roxbury, MA. \n\n\nLabel: 4AD\nReleased: 03 May 2004\nCatalogue: CAD 2406CD\n\nCodec: Flac\nCompression Level: 6\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (600dpi)\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:9c1eab785f7e51c7e9c014fef0e12379b4686a71","amp;dn":"Pixies+-+Wave+Of+Mutilation+%28Best+Of+Pixies%29+%282004%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1eab785f7e51c7e9c014fef0e12379b4686a71","infoHashBuffer":{"type":"Buffer","data":[156,30,171,120,95,126,81,199,233,192,20,254,240,225,35,121,180,104,106,113]},"announce":[],"urlList":[]}}