{"title":"Heavy Metal 200o.DVDRIP.(spanish)","uid":5726383,"size":690036736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c45f6c1121fc78d7bfc0744d73b91ca7e004ea4&amp;dn=Heavy+Metal+200o.DVDRIP.%28spanish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1280475197,"description":"Al descubrir una extraÃƒÂ±a piedra fundamental, un minero llamado Tyler (voz de Michael Ironside), Que se encuentra un cristal verde que despierta Zeek (Rick Jones) y es poseÃƒÂ­do por un hambre insaciable de poder y sed de inmortalidad. En su camino a un planeta que tiene una fuente de la inmortalidad, Tyler hace una parada en un planeta designado FAKK Ã‚Â² (FederaciÃƒÂ³n-AsignaciÃƒÂ³n cetogÃƒÂ©nica Killzone), porque sus habitantes llevan algunos inmortalidad agua en sus cuerpos. Tyler secuestra a unas cuantas personas y mata a los demÃƒÂ¡s, pero echa de menos una: Julie (expresado por B-movie reina Julie Strain). Ella jura vengar a su familia y matar a Tyler antes de llegar a la fuente-sin saber que su hermana Kerrie (Sonja Ball) Es en realidad sigue vivo. Ella es ayudado a regaÃƒÂ±adientes por Germaine, un ex miembro de la tripulaciÃƒÂ³n secuestrados Tyler dejÃƒÂ³ abandonada despuÃƒÂ©s de que intentÃƒÂ³ proteger a Kerrie, hermana Julie.\n\nSu bÃƒÂºsqueda los lleva a un estaciÃƒÂ³n espacial que parece ser una cama caliente de la sordidez y la depravaciÃƒÂ³n. Como Tyler prepara a la violaciÃƒÂ³n de camarera en un club de striptease, Julie interviene y trata de matarlo. Sin embargo, Tyler utiliza un suero de su mÃƒÂ©dico de inmediato creado para regenerar sus lesiones, incluso la mayorÃƒÂ­a de los mortales. En ese punto, se explota el club con granadas de bandolera de Julie.\n\nDespuÃƒÂ©s de escapar de la explosiÃƒÂ³n, Julie luego las pistas de Tyler a un desierto donde conoce a un extranjero misterioso llamado Odin (Billy Idol), Y su cargo, Zeek (que es una roca que habla y que siempre se refiere a Julie como &quot;un suave&quot;). Tyler descubre una raza de seres reptiles; reta a un campeÃƒÂ³n y luego a su lÃƒÂ­der a un deathmatch en el que estÃƒÂ¡ casi muerto. Gana lanzando el lÃƒÂ­der en el pozo de lava, a continuaciÃƒÂ³n, afirma que es su nuevo seÃƒÂ±or. Julie entra en la ciudad bajo la apariencia de una mujer a los reptiles encontrados para Tyler, y los intentos de matarlo por interferencia de un cuerno anterior del crÃƒÂ¡neo del seÃƒÂ±or de los reptiles en la garganta de Tyler y tratando de meter la cabeza en una fuente de lava. Su ataque produce un error cuando Zeek, ordenados por su seÃƒÂ±or OdÃƒÂ­n para extraer Julie, tenazas y domina, llevÃƒÂ¡ndola de nuevo a OdÃƒÂ­n, que sÃƒÂ³lo se enoja Tyler.\n\nJulie infiltrados buque de Tyler cuando ella descubre Kerrie todavÃƒÂ­a estÃƒÂ¡ vivo, y descubre que Tyler ha sido destilando el suero inmortalidad de los cuerpos de su gente. Se mete en la ataques de Tyler mÃƒÂ©dico, daÃƒÂ±ando ÃƒÂ©l y revelando que es un robot. El ataque tambiÃƒÂ©n se establece la llamas complejo con una llama azul. Julie logra liberar a Kerrie, y escapan justo antes de los golpes hasta complejos. Tyler ve la explosiÃƒÂ³n desde la distancia, y estÃƒÂ¡ devastada que su fuente de suero regenerativa ha sido destruido. Saca su agresiÃƒÂ³n matando a uno de sus soldados, luego de hacer Julie proclama inmortal para que pueda matar a su violaciÃƒÂ³n y cada hora de cada dÃƒÂ­a para la eternidad. Decidir que el tiempo es la esencia con su nave destruida, y ÃƒÂ©l mismo a tres viales de suero regenerador, que ordena a sus tropas a amasar inmediatamente a la ciudadela donde la inmortalidad que da las aguas se encuentran.\n\nMientras tanto, en la ciudad sagrada donde se encuentra la fuente, Julie sufre el ritual Taarna hizo en la primera pelÃƒÂ­cula y estÃƒÂ¡ equipado con una armadura escasa. Junto con su hermana, y Germaine, los tres defenderse de ejÃƒÂ©rcito de Tyler, a pesar de que no puede asistir a las fuerzas de romper despuÃƒÂ©s de la mayor de la ciudad es asesinado. Del mismo modo que se activa de bloqueo de la fuente, Tyler se enfrenta a Julie una ÃƒÂºltima vez y pelean. Tyler parece tener la ventaja, hasta que Odin interviene y se lastima, dando tiempo a Julie saÃƒÂ±a lÃƒÂ¡grima en Tyler, que se encoge despuÃƒÂ©s de no haber tenido en otra de sus ampollas. OdÃƒÂ­n luego se revela como la ÃƒÂºltima de la raza de criaturas responsable de la creaciÃƒÂ³n de la fuente, y se burla de Julie y Tyler por haberle ayudado a llegar hasta aquÃƒÂ­. Cuando parece que toda esperanza estÃƒÂ¡ perdida, Zeek toma el destino en sus propias manos y tira la llave de cristal de su pedestal, el sellado detrÃƒÂ¡s de Odin el interior de la fuente y enviando a sÃƒÂ­ mismo en las profundidades del espacio.\n\nLa pelÃƒÂ­cula se cierra con Julie siendo ayudado por Germaine y Kerrie, mientras que un monÃƒÂ³logo final es emitido por Zeek, lo que confirma la piedra estÃƒÂ¡ a salvo en su cuidado contra las fuerzas del mal que puede venir a buscarlo de nuevo.","torrent":{"xt":"urn:btih:9c45f6c1121fc78d7bfc0744d73b91ca7e004ea4","amp;dn":"Heavy+Metal+200o.DVDRIP.%28spanish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c45f6c1121fc78d7bfc0744d73b91ca7e004ea4","infoHashBuffer":{"type":"Buffer","data":[156,69,246,193,18,31,199,141,123,252,7,68,215,59,145,202,126,0,78,164]},"announce":[],"urlList":[]}}