{"title":"Friends S10E19 + S10E20 The Last One iPod Video MP4","uid":4193708,"size":195388253,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:9c8e082c68e484cac00893bae20c7f9ae08e81ef&amp;dn=Friends+S10E19+%2B+S10E20+The+Last+One+iPod+Video+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wrs589","files":1,"time":1211110049,"description":"Last episode of Friends (hour long special) in MP4 format ready to play on your iPod Video, video capable iPod Nano, or iPod Classic. Will also play on iPhone and iPod Touch. \nAlso perfect to play on mobile phones that support MP4 format such as Nokia N95 N82 etc.\n\n~~~~~~~~~~~~~~~~~~\n\nVIDEO INFO\nContainer - .mp4\nCodec - mp4 ( AVC1 )\nResolution - 320 x 240\nFrame Rate - 25fps\n\nAUDIO INFO\nCodec - AAC ( mp4a )\nChannels - 2\nSample Rate - 44100hz\n\n~~~~~~~~~~~~~~~~~\n\nRoss wants to be with Rachel, but she still wants to go to Paris. He tries to tell her about his feelings, but Gunther beats him to it. Rachel leaves for the airport, and Ross decides to catch her at the gate. Meanwhile, Erica turns out to be carrying twins: a boy and a girl. Chandler and Monica name the girl Erica, after her surrogate mother, and the boy Jack, after Monica&amp;#039;s father. Mike tells Phoebe that he wants to have babies. Joey buys Monica and Chandler a housewarming present: Chick Jr. and Duck Jr.\nRoss and Phoebe chase Rachel to the airport, but end up at the wrong one. They narrowly make it to the right airport, where Ross declares his love for Rachel, but she gets on the plane anyway. A rejected Ross returns home, where he finds a message on his answering machine, revealing that Rachel got off the plane, just as the real thing shows up behind him. They decide to be together. Meanwhile, Chandler and Monica finish packing for their move to the suburbs, and Joey loses Chick Jr. and Duck Jr. in the foosball table.","torrent":{"xt":"urn:btih:9c8e082c68e484cac00893bae20c7f9ae08e81ef","amp;dn":"Friends+S10E19+%2B+S10E20+The+Last+One+iPod+Video+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c8e082c68e484cac00893bae20c7f9ae08e81ef","infoHashBuffer":{"type":"Buffer","data":[156,142,8,44,104,228,132,202,192,8,147,186,226,12,127,154,224,142,129,239]},"announce":[],"urlList":[]}}