{"title":"Dance For Life","uid":8036785,"size":5212808352,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9ca9a0742942b71ee2b0f4bbf8a9afacdf7c13a4&amp;dn=Dance+For+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GoAaT999","files":5,"time":1358534531,"description":"First in a Series of 4 Programs:  &quot;The Dance for Life&quot;Â© - The First 36 Elements of Spiritual Mastery: The &quot;Inner Keys to the Higher Kingdoms, Translated from the Maharata Texts of 246,000BC; Book One &quot;Restoring Personal Divinity&quot;. Recorded in Sarasota, Florida, March 2002.\n\nIntroduces the Eckasha Force and Radial Body, the Veca Codes of ManU, Opening the Eckasha &quot;Zero Point&quot; Window, Re-Awakening the Rei, the Ki, and the Chi. Provides 5 Masters Level Techniques for Density 1 Radial Body Activation. Contents include: The Primal Life Force Field, the ManU, the EirA, the ManA and the Ec-ka-sha: God-Source, God-Force, and the Cosmic Conscious NO-thing. &quot;Divine Thought Crystals&quot;. The &quot;In-breath and Out-breath of God&quot;. Emanations of Eckasha Primal Substance of Manifestation; Carriers of the Eternal Life Stream; the Unified Field; AT-ONE-MENT.  Cosmic Light-bulbs and Sound-bites&quot; the Tree of Life and Knowledge: Primal Order. The Eckasha Force, the Eckasha Field, the Eckasha Pulse and the Cosmic Ka-Tha-Ra (Light-Sound-One), Dimensionalization, the Divine Blueprint and the 15 Dimensional Time Matrix.  The &quot;15 Rays&quot;, 12 Domains and the 7 Higher and Lower Heavens Eckasha Force (and Personal) Polarization, the 12 Domains of Consciousness and the Atomic Building Blocks of Matter (how Humans are enslaved and don't know it).\n\nManU and the Atomic Life Force Connection Radial and Hova Bodies, Khundaray (Primal Sound Fields), Kee-Ra-ShA (Primal Light Fields), Maharata (Christos Frequencies), the Antakharana (D9 limited), Kundalini and the ManU Techniques, the Sacred Seuriea, Psonns and Meajhe Body. Keylons of Creation and the GOD-Fire Alphabet Fire Letters and Geomancies, Keylon Codes and Crystallized Thought Intention, the DNA Template, Fire Letters and Fire Codes and the Merkaba-Eckasha Force Connection. The Eckasha-ManU Salutation technique.  Veca Codes Healing, Activation and the Eckasha Force Preparatory techniques for using Veca Codes, Maharic Seal, Emerald and Amethyst Awakening Masters Kundalini Activation's and Veca Code Induction's.  Merkaba Fields and the Merkaba Vehicle(s) the five phases of Merkaba development, the Tribal Shield Activation and Salutation Techniques. The Eckasha 12 Point/ 12-Plane Inner Earth Merkaba Vehicle, and the IAHAIA Manu Veca Codes-1 &amp; 2 (of 4), Eckasha Psonns, ManU Phase Eckasha Merkaba Activation. The ManU Seuriea (Dance) Movements - the &quot;Rising Moon&quot;, the &quot;Flowing Waters&quot; and the &quot;Sleeping Flower&quot; - intensify the quantity and quality of all Merkaba, DNA and Radial Body work. Shadow Healing for Density 1 (D1-3) Mastery using the 12 Lessons, 12 Attitudes &amp; 12 Actions of Mastery   to create progressive, and permanent healing of the Shadow Body and the Karmic-Miasmic Imprint. Healing the Shadow of objects, animals, plants, crystals, metals ... and Earth.  The Eckasha-ManU Salutation and Rainbow Roundtables, the creation of more powerful, and protected, personal and planetary healing.","torrent":{"xt":"urn:btih:9ca9a0742942b71ee2b0f4bbf8a9afacdf7c13a4","amp;dn":"Dance+For+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca9a0742942b71ee2b0f4bbf8a9afacdf7c13a4","infoHashBuffer":{"type":"Buffer","data":[156,169,160,116,41,66,183,30,226,176,244,187,248,169,175,172,223,124,19,164]},"announce":[],"urlList":[]}}