{"title":"Pee-Wee's Playhouse Christmas Special (1988) DVDRip H264","uid":5627821,"size":847289570,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d0bb63f4044a16db7806ebd3303affffe32c4f8&amp;dn=Pee-Wee%5C%27s+Playhouse+Christmas+Special+%281988%29+DVDRip+H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"warmore","files":-1,"time":1276548826,"description":"Info:\n------------\nThis is my first ever torrent.  I had to read up how to make it, so I hope I did it right.  I noticed this TV Christmas Special was not on this website.  It's a personal favorite, that I hope to share with my future kids someday.  So I thought you might like it too.\n\nI used the free version of DVDFab to rip the full DVD, then I used handbrake on the &quot;high profile&quot; preset to make the h.264 file.  I think the result is pretty good.  If you play it in something like VLC, you can turn on subtitles, which are the original closed captions from the TV airing back in 1988.\n\nEven though this is from the real commercial DVD, I think it's a transfer from tape or old film onto DVD.  There's some artifacts along the edge, for example, even when watching on DVD.  So this is as good of quality as it gets.\n\nPlay time is 48:02.\n\nPlot:\n------------\nPee-wee Herman and pals are celebrating Christmas in the Playhouse in their own creative ways: Pee-wee makes a list for Santa Claus 1 1/2 miles long, teaches Little Richard how to ice skate, goes for a sleigh ride with Magic Johnson, commands Frankie Avalon and Annette Funicello to make Christmas cards, receives a long phone call from Dinah Shore, even has more musical fun with k.d. lang, the Del Rubio Triplettes and Charo! Finally, Big Red arrives and announces that Pee-wee's Christmas list was so big, he didn't have enough presents for all the children of the world. Will Pee-wee follow his own advice and help others?","torrent":{"xt":"urn:btih:9d0bb63f4044a16db7806ebd3303affffe32c4f8","amp;dn":"Pee-Wee%5C%27s+Playhouse+Christmas+Special+%281988%29+DVDRip+H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0bb63f4044a16db7806ebd3303affffe32c4f8","infoHashBuffer":{"type":"Buffer","data":[157,11,182,63,64,68,161,109,183,128,110,189,51,3,175,255,254,50,196,248]},"announce":[],"urlList":[]}}