{"title":"Peter Gabriel - Sledgehammer","uid":4866475,"size":175398916,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9d6954fe7783a9176060923d07f5de62dc5f9210&amp;dn=Peter+Gabriel+-+Sledgehammer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1240543901,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sledgehammer&quot; is a hit song by Peter Gabriel from his 1986 album So. It peaked at number one in Canada for four weeks on July 21, 1986, number one on the Billboard Hot 100 chart in the United States on July 26, 1986, and number four in the UK singles chart, thanks in part to a popular and influential music video. It was his biggest hit in North America and ties with &quot;Games Without Frontiers&quot; as his biggest hit in the United Kingdom.\n\n&quot;Sledgehammer&quot; spawned a widely popular and influential music video directed by Stephen R. Johnson. Aardman Animations and the Brothers Quay provided claymation, pixilation, and stop motion animation that gave life to images in the song. The video ended with a large group of extras jerkily rotating around Gabriel, among them: Gabriel's daughters Anna and Melanie, the animators themselves, and director Stephen Johnson's girlfriend. Also included were six women who posed as the back-up singers of the song. Gabriel lay under a sheet of glass for 16 hours while filming the stills for the video.\n\nIn 1987, it won nine MTV Video Music Awards, a record which still stands as of 2008. It ranked at number four on MTV's 100 Greatest Music Videos Ever Made (1999). MTV later announced that &quot;Sledgehammer&quot; is the most played music video in the history of the station. &quot;Sledgehammer&quot; has also been declared to be MTV's number one animated video of all time.\n\nThe video was also voted number seven on TMF's Ultimate 50 Videos You Must See - first aired 24 June 2006. It ranked at number 2 on VH1's &quot;Top 20 Videos of the 80's&quot; as well as being named the #1 &quot;Amazing Moment in Music&quot; on the Australian TV show 20 to 1 in 2007.\n\nThe portion of the song featuring the synthesized flute solo was realized in the video by first one and then two oven-ready chickens, headless and featherless, animated using stop-motion. These were animated by Nick Park (of Wallace and Gromit fame) who, at that time was refining his work in plasticine animation.\n\nThe song won Best British Video at the 1987 Brit Awards.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9d6954fe7783a9176060923d07f5de62dc5f9210","amp;dn":"Peter+Gabriel+-+Sledgehammer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d6954fe7783a9176060923d07f5de62dc5f9210","infoHashBuffer":{"type":"Buffer","data":[157,105,84,254,119,131,169,23,96,96,146,61,7,245,222,98,220,95,146,16]},"announce":[],"urlList":[]}}