{"title":"The Great American Songbook - DVD5 - Celebrating 100 years of Mu","uid":9398443,"size":4680839168,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d96a01738ba9c3860e3c25ccbdb7418bb2a2947&amp;dn=The+Great+American+Songbook+-+DVD5+-+Celebrating+100+years+of+Mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1388022490,"description":"The Great American Songbook - DVD5 - Celebrating 100 years of Music in America  [DDR]\n\nEntertainer extrordinaire Michael Feinstein hosts a brand-new documentary on the evolution of the American popular music, told through stories of the greatest songwriters of all time, including Irving Berlin, Cole Porter, George &amp; Ira Gershwin and more.\n\nMusician and historian Michael Feinstein is your host for this whirlwind look at the golden age of American popular song, from the '30s through the '50s. The Great American Songbook offers a look at the significant trends in music and the styles of the great tunesmiths of the day, as well as presents dozens of vintage film clips of such artists as Frank Sinatra, Bing Crosby, Judy Garland, Lena Horne, and many more performances of the great songs celebrated in this film. Along the way, The Great American Songbook also chronicles the history of the American movie musical and how Hollywood and Tin Pan Alley learned to work together.\n\nCONTENTS:-\nMinstrel shows ; Stephen Foster -- Spirituals -- Ragtime -- Blues and jazz -- Publishing and recording -- Operetta ; Friml and Romberg -- Kern and Berlin -- World War I -- Gershwin -- Show boat -- Ziegfeld legacy -- Rodgers and Hart -- Carmichael and Waller -- Depression ; Warren and Dubin -- Arlen, Duke, and Fields -- Porter -- Depression recovery -- 1930s recap (Over the rainbow) -- Hollywood stampede -- Pal Joey -- Hitman Harry -- Freed/Brown and Harburg -- Team Gershwin -- World War II -- Big bands and boogie -- War on their minds -- Styne and Cahn -- Postwar optimism -- New life for old songs -- Songwriter biopics -- Rodgers and Hammerstein -- Stage to screen -- Loesser and more Berlin -- A star is born -- Rock 'n' roll -- Tradition : As time goes by. \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English,\nRunTime 174 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 174 mins","torrent":{"xt":"urn:btih:9d96a01738ba9c3860e3c25ccbdb7418bb2a2947","amp;dn":"The+Great+American+Songbook+-+DVD5+-+Celebrating+100+years+of+Mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d96a01738ba9c3860e3c25ccbdb7418bb2a2947","infoHashBuffer":{"type":"Buffer","data":[157,150,160,23,56,186,156,56,96,227,194,92,203,219,116,24,187,42,41,71]},"announce":[],"urlList":[]}}