{"title":"Nick Land - Fanged Noumena: Collected Writings 1987-2007","uid":10674352,"size":13936208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ebb804a15938416eef81caa546a90c3332d029c&amp;dn=Nick+Land+-+Fanged+Noumena%3A+Collected+Writings+1987-2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"yviw","files":1,"time":1406920452,"description":"Nick Land\nFanged Noumena: Collected Writings 1987-2007\n\n\nMarch 2011\nEdited and with an Introduction by Ray Brassier and Robin Mackay\nPaperback 115x175mm, 670pp. Second edition.\n[First edition: Limited edition of 1000 numbered copies]\nNow also available as a Kindle E-Book Edition.\nISBN 978-0-9553087-8-9\n\n\n\nContents\n\nEditors' Introduction\nKant, Capital and the Prohibition of Incest\nNarcissism and Dispersion in Heidegger's 1953 Trakl Interpretation\nDelighted to Death\nArt as Insurrection\nSpirit and Teeth\nAfter the Law\nMaking it with Death\nShamanic Nietzsche\nCircuitries\nMachinic Desire\nCybergothic\nCyberrevolution\nHypervirus\nNo Future\nCyberspace Anarchitecture as Jungle-War\nMeat (or How to Kill Oedipus in Cyberspace)\nMeltdown\nA ZiiGothic X-Coda (Cooking Lobsters with Jake and Dinos)\nKatasoniX\nBarker Speaks\nMechanomics\nCryptolith\nNon-Standard Numeracies: Nomad Cultures\nOccultures\nOrigins of the Cthulhu Club\nIntroduction to Qwernomics\nTic-Talk\nQabbala 101\nCritique of Transcendental Miserablism\n\n\n\nThe magnitude of Nick Land's influence upon contemporary experimental production is yet to be fully comprehended. Whilst Fanged Noumena goes some way to provide an aetiology of Land's philosophical virulence, those seeking a cure for the 'disease of the earth' are advised to look elsewhere ...\nJake Chapman\n\nLand had the most brilliantly seductive and meteoric mind, endlessly imaginative and capable of adopting, inhabiting and discarding any philosophical position. With him - and rightly so - philosophy infected every area of life, and sheer vitality of life reverberated in his thinking.\nI see Fanged Noumena as a kind of righteous revenge. Nick was dismissed by professional philosophers because they simply didn't want to think and preferred their turgid academic complacency. I always admired him for his unwavering desire to take thought to its absolute limit and then see how much harder one could push.\nSimon Critchley\nThese extraordinary texts, superheated compounds of severe abstraction and scabrous wit, testify to a uniquely penetrating intelligence, fusing transcendental philosophy, number theory, geophysics, biology, cryptography and occultism into startlingly cohesive but increasingly delirious theory-fictions.\nRay Brassier\n\nThis is theory as cyberpunk fiction: Deleuze-Guattari's concept of capitalism as the virtual unnameable Thing that haunts all previous formations pulp-welded to the timebending of the Terminator films. Land's machinic theory-poetry parallelled the digital intensities of 90s jungle, techno and doomcore, anticipating 'impending human extinction becoming accessible as a dance-floor'.\nMark Fisher (K-Punk)\nIn the last half of the twentieth century, academics talked endlessly about the outside, but no-one went there. Land, by exemplary contrast, made experiments in the unknown unavoidable for a philosophy caught in the abstractive howl of post-political cybernetics. Fanged Noumena demonstrates how Land ruined a generation of intellectuals for merely academic philosophy, by opening a speculative singularity where the future used to be.\nIain Hamilton Grant\n\nFanged Noumena brings together the writings of Nick Land for the first time. During the 1990s Land's unique philosophical work, variously described as 'rabid nihilism', 'mad black deleuzianism' and 'cybergothic', developed perhaps the only rigorous and culturally-engaged escape route out of the malaise of 'continental philosophy' - a route which was implacably blocked by the academy. However, Land's work has continued to exert an influence, both through the British 'speculative realist' philosophers who studied with him, and through the many cultural producers - artists, musicians, filmmakers, bloggers - who have been invigorated by his uncompromising and abrasive philosophical vision.\n\nBeginning with Land's early radical rereadings of Heidegger, Nietzsche, Kant and Bataille, the volume then collects together the papers, talks and articles of the mid-90s - long the subject of rumour and vague legend (including some work which has never previously appeared in print) - in which Land developed his futuristic theory-fiction of cybercapitalism gone amok; and ends with his enigmatic later writings in which Ballardian fictions, poetics, cryptography, anthropology, grammatology and the occult are smeared into unrecognisable hybrids.\n\nFanged Noumena allows a dizzying perspective on the entire trajectory of this provocative and influential thinker's work, and will introduce his unique voice to a new generation of readers.\n","torrent":{"xt":"urn:btih:9ebb804a15938416eef81caa546a90c3332d029c","amp;dn":"Nick+Land+-+Fanged+Noumena%3A+Collected+Writings+1987-2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ebb804a15938416eef81caa546a90c3332d029c","infoHashBuffer":{"type":"Buffer","data":[158,187,128,74,21,147,132,22,238,248,28,170,84,106,144,195,51,45,2,156]},"announce":[],"urlList":[]}}