{"title":"El Gran Exodo  [DVDRIP][spanish].","uid":5271211,"size":1459492864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9eda188ebe9d484ec40c87661877e55492bfb3c0&amp;dn=El+Gran+Exodo++%5BDVDRIP%5D%5Bspanish%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":1,"time":1263203645,"description":"\nTitulo original: Die Flucht\nDirector : Kai Wessel\n\nInterpretes :: Maria FurtwÃƒÂ¤ngler, Jean-Yves Berteloot, Tonio Arango, Gabriela Maria Schmeide, JÃƒÂ¼rgen Hentsch, Hanns Zischler, Angela Winkler, Max von Thun, Josef Mattes, Stella Kunkat, Michael Ginsburg, Barbara Morawiecz, Marie-Luise Schramm, Beate Abraham\n\n\n\n\n\nEn verano de 1.944, la condesa Lena von Mahlenberg regresa a Prusia Oriental, a la mansiÃƒÂ³n familiar de la que se ausentÃƒÂ³ ocho aÃƒÂ±os atrÃƒÂ¡s para vivir en BerlÃƒÂ­n y asÃƒÂ­ poder educar a su hija ilegÃƒÂ­tima. Lena, huyendo de la guerra, desea reconciliarse con su padre enfermo y reintegrarse en el mundo de la nobleza prusiana donde creciÃƒÂ³ y se educÃƒÂ³. Incluso se plantea casarse con su antiguo prometido, el conde Heinrich von Gernstorff, convertido ahora en un alto mando del ejÃƒÂ©rcito nazi. Pero la boda debe posponerse a causa del suicidio del hermano pequeÃƒÂ±o de Heinrich, desilusionado por la inÃƒÂºtil prolongaciÃƒÂ³n de una guerra que no va a ganar. AdemÃƒÂ¡s no cesan de aumentar los signos de catÃƒÂ¡strofe inminente: el avance de crecientes avalanchas de refugiados y los frentes de guerra cada vez mÃƒÂ¡s cercanos. A inicios de 1.945 Lena se hace cargo de su familia y los sirvientes y, al igual que otros 12 millones de personas, inicia una arriesgada caminata, hacia un futuro incierto. En su viaje deben hacer frente a heladas temperaturas, feroces vientos, una nieve cegadora y a los bombarderos enemigos para quienes, sobre la blancura de la nieve y el hielo, son una diana perfecta..\n","torrent":{"xt":"urn:btih:9eda188ebe9d484ec40c87661877e55492bfb3c0","amp;dn":"El+Gran+Exodo++%5BDVDRIP%5D%5Bspanish%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eda188ebe9d484ec40c87661877e55492bfb3c0","infoHashBuffer":{"type":"Buffer","data":[158,218,24,142,190,157,72,78,196,12,135,102,24,119,229,84,146,191,179,192]},"announce":[],"urlList":[]}}