{"title":"Gary Hoey - The Endless Summer II Surf Guitar Music","uid":9327021,"size":131448593,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9eeaf60550d8888233bb144e8026dd32ab3f7fd3&amp;dn=Gary+Hoey+-+The+Endless+Summer+II+Surf+Guitar+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386661131,"description":"Source: 1994 CD\n-\nGary Hoey - The Endless Summer II Soundtrack 320cbr (Big Papi) 1994 Electric Guitar\n-\nThe album art is set to an inside cover image of Gary playing guitar in the ocean.  It is not the movie cover art because this release is more about Gary than the movie.  If you know Gary Hoey you will enjoy this.  - Big Papi\n\n By Russell Diederich VINE VOICE\n[quote]This might not be considered surf music, but it definitely shreds. On this strictly instrumental album, Gary Hoey turns his attention to more of a surf-oriented music. Don't worry about the movie if you love surf guitar. Hoey plays on the scale of Dick Dale, fast and loud, sounding a bit like Dale's later stuff sans the rapid picking. Ten of the fourteen tracks are from Hoey's pen, and there are no sleepers here. Jump on and get ready for a ride.\nFor Dick Dale fans, you can get excited here because the King of the Surf Guitar appears on &quot;Shake &amp; Stomp (Part II)&quot;. A great duo between the master and the student. Hoey does an excellent cover of Guaraldi's classic, &quot;Linus and Lucy&quot; in screaming harmonics, heavy rhythm and blinding solos, yet it is very tasteful. &quot;Low Rider&quot; is another cover that Hoey melds to match the theme of the album. Hoey slows it down (in relation to the other tracks) and gets soulful on &quot;Pipe&quot;. &quot;Walkin' the Nose&quot; is a bluesy type number that has had the tempo picked up a bit to give it a shred feeling. &quot;Drive&quot; is an acoustical bit that has a great sound to it.\n\nHoey is a fine guitarist that has been improving since Animal Instinct. This is a great album for guitar lovers, especially if you're into Dick Dale, Joe Satriani, Eric Johnson, and guitar-hero type players. This album is definitely a good time[/quote]","torrent":{"xt":"urn:btih:9eeaf60550d8888233bb144e8026dd32ab3f7fd3","amp;dn":"Gary+Hoey+-+The+Endless+Summer+II+Surf+Guitar+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eeaf60550d8888233bb144e8026dd32ab3f7fd3","infoHashBuffer":{"type":"Buffer","data":[158,234,246,5,80,216,136,130,51,187,20,78,128,38,221,50,171,63,127,211]},"announce":[],"urlList":[]}}