{"title":"Dentro de Garganta Profunda.(Documental).(DVDRip.Divx.Spanish).","uid":4451761,"size":733947904,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9f1e1143c07e7b3c02cc41ad1dce115673445905&amp;dn=Dentro+de+Garganta+Profunda.%28Documental%29.%28DVDRip.Divx.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":1,"time":1224289872,"description":"Dentro de Garganta Profunda\n\nConsiderada generalmente la pelicula mas rentable de todos los tiempos, el film para adultos de 1972 Garganta Profunda fue mas que una excitante curiosidad y un gran exito de taquilla. Estrenada en el mismo momento en que los movimientos nacionales para la liberacion sexual, la igualdad de derechos y los valores contraculturales estaban alcanzando su punto algido, esta pelicula sexualmente explicita se convirtio inesperadamente en el epicentro de una tormenta social y politica sin precedentes, un gran fenomeno cultural cuyo impacto continua afectandonos hoy. Ahora, mas de 30 despues de que Garganta Profunda entrase violentamente por primera vez en la conciencia colectiva, Inside Deep Throat (Dentro de Garganta Profunda), el nuevo documental examina la sima entre las modestas intenciones de los cineastas y el imprevisto legado que crearon sin proponerselo. Fue filmada en 6 dias por 25.000 dolares. El Gobierno estadounidense no queria que se viera. Fue prohibida en 23 estados. Ha recaudado mas de 600 millones de dolares y es el film mas rentable en la historia del cine. Mas de 30 aÃƒÂ±os despues del estreno de la provocativa Garganta Profunda , este documental hace un repaso de la influencia del film sin precedentes en la sociedad de Estados Unidos. Con la narracion en su version original de Dennis Hopper, la cinta recoge opiniones de directores de cine como John Waters y Wes Craven; empresarios de la industria pornografica como Hugh Hefner y Larry Flynt;sexologos, como Helen Gurley Brown; pornostars e incluso una aparicion de Lovelace, protagonista de la pelicula Deep Throat, que murio en el 2002. \n\n\n","torrent":{"xt":"urn:btih:9f1e1143c07e7b3c02cc41ad1dce115673445905","amp;dn":"Dentro+de+Garganta+Profunda.%28Documental%29.%28DVDRip.Divx.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f1e1143c07e7b3c02cc41ad1dce115673445905","infoHashBuffer":{"type":"Buffer","data":[159,30,17,67,192,126,123,60,2,204,65,173,29,206,17,86,115,68,89,5]},"announce":[],"urlList":[]}}