{"title":"Rango(2011)DVDRip.AC3(ENG)-DROCK","uid":6832558,"size":731727581,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f675fb6e23f67963dfa80587be8c2e0623dd573&amp;dn=Rango%282011%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1321917228,"description":"A pet chameleon who has lived his entire life in the confines of a cozy glass terrarium discovers adventure beyond his wildest imagination in this animated Western adventure from Pirates of the Caribbean director Gore Verbinski. When we first meet Rango (voice of Johnny Depp), the sheltered pet chameleon is safe in his terrarium, and embarking on epic adventures through the power of imagination. Then, suddenly, his safe existence is irrevocably upended thanks to a bump in the road that sends him soaring out of a car window and right onto the searing-hot asphalt of a desert highway. On the advice of a wise armadillo who relays the story of the Spirit of the West, our conical-eyed hero sets out in search of a town called Dirt, narrowly escaping a hungry hawk and encountering a self-sufficient pioneer named Beans (voice of Isla Fisher) along the way. Upon arriving in the dusty desert town, Rango wanders into the local bar and convinces the townspeople that he's a notorious gunslinger with a lightning-fast trigger finger. When one of the locals challenges Rango to a showdown on Main Street, the hawk that menaced our hero on his way to town shows up looking for a rematch, and ends up beak-down in the dirt. Convinced that Rango is the real deal, the Mayor (voice of Ned Beatty) decides to name the brave chameleon their new sheriff. But Rango's honeymoon in Dirt is short-lived when bandits steal the town's entire supply of water, and the newly christened sheriff forms a posse in order to get it back. Little do they realize they were all being manipulated by one greedy power-monger who's determined to keep the people of Dirt under his thumb with the help of a diabolical villain named Rattlesnake Jake (voice of Bill Nighy) whose Gatling-gun tail makes Swiss cheese of all challengers. Now, if Rango can just locate the Spirit of the West (voice of Timothy Olyphant) and summon the courage to realize his true potential, perhaps he can finally free the people of Dirt from the tyranny that binds them, and discover his true destiny under the scorching desert sun. \n\nRipped with Handbrake.\n\nLength: 1 Hour 47 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:9f675fb6e23f67963dfa80587be8c2e0623dd573","amp;dn":"Rango%282011%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f675fb6e23f67963dfa80587be8c2e0623dd573","infoHashBuffer":{"type":"Buffer","data":[159,103,95,182,226,63,103,150,61,250,128,88,123,232,194,224,98,61,213,115]},"announce":[],"urlList":[]}}