{"title":"Coast to Coast AM February 18 2013","uid":8163764,"size":56293953,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9fd8d6841531b48d7f5e7b6f600ac38bab353034&amp;dn=Coast+to+Coast+AM+February+18+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1361294873,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-18-13\nHost: \tGeorge Noory\nGuests: \tJohn Hogue, Bruce Helmer\n\nWith the advent of Pope Benedict XVI's sudden resignation, author John Hogue discussed the prophecies of St. Malachy, the 12th century Irish bishop who predicted all the subsequent popes following a vision. Malachy was on a pilgrimage in Rome in 1140 and while situated on a hill at sunset, he &quot;went into an ecstatic trance; his serving monks around him put out candles and paper and started writing down...his utterances of 2 or 3 word Latin mottoes,&quot; Hogue explained. This list was handed to Pope Celestine II, he continued, and was presented as a prophecy of the succession of the Popes with the mottoes representing the name or heraldry of the next 111 Popes, until the Catholic version of the Apocalypse occurs with the selection of the 112th Pope (the Pope after Benedict will be the 112th). Interestingly, Malachy's prophecy disappeared until it was rediscovered in 1595, and there was suspicion that it was a forgery.\n\nThe motto Malachy indicated for the 112th Pope referenced the name Petrus Romanus or Peter of Rome, and Hogue analyzed a number of possible candidates with Peter in their name, though he suspects the next Pope will likely be someone hailing from Italy. According to approved Catholic prophecy (which differs from Malachy's), there are several stages leading up to the Apocalypse, including a time of miracles, with mass healings, Marian apparitions, and signs in the heavens. Hogue wondered if the current spate of meteors and fireballs, as well as the coming of the bright comet ISON later this year might relate to this.\n\nHe also reviewed prophecies of Nostradamus that could relate to our current time frame, the Popes, and the Apocalypse. When Nostradamus wrote &quot;when the great Pontiff will change lands,&quot; this could refer to how the next Pope could become a refugee after the destruction of Rome, Hogue said. For more, check out his blog posting, Pope Benedict XVI Resigns, Prophecies of St. Malachy, Papabille and the Last Pope Petrus Romanus.\nFinancial Planning\n\nFirst hour guest, finance advisor Bruce Helmer offered tips on financial planning. He suggesting that if people consistently invest 10% of their income (your 401K contribution counts toward this), they will probably have enough to retire comfortably when they choose. He believes the stock market is currently undervalued, even though it's near its all time high. &quot;I think it's still under priced, but that doesn't meant there won't be some pullback and volatility...but I think the trend is going to continue up.&quot;\n\nNews segment guests: Howard Bloom, Lauren Weinstein\nWebsite(s):\n\n    hogueprophecy.com\n    brucehelmer.com\n\nBook(s):\n\n    Nostradamus 2012: The End of End Times\n    The Last Pope Revisited\n    Real Wealth\n\n","torrent":{"xt":"urn:btih:9fd8d6841531b48d7f5e7b6f600ac38bab353034","amp;dn":"Coast+to+Coast+AM+February+18+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fd8d6841531b48d7f5e7b6f600ac38bab353034","infoHashBuffer":{"type":"Buffer","data":[159,216,214,132,21,49,180,141,127,94,123,111,96,10,195,139,171,53,48,52]},"announce":[],"urlList":[]}}