{"title":"CoreOS Essentials (2015) (Pdf and Epub) Gooner","uid":12346540,"size":8787811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a08f6bfee9c661a1bd2bf4884d4ba5a127a28b82&amp;dn=CoreOS+Essentials+%282015%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1441364176,"description":"Publisher: Packt Publishing - ebooks Account (June 30, 2015)\nLanguage: English\nISBN-10: 1785283944\nISBN-13: 978-1785283949\n\nDevelop effective computing networks to deploy your applications and servers using CoreOS\n\nAbout This Book\n\nGet to grips with the basics of CoreOS along with managing clusters\nWrite and deploy systemd and fleet units to launch docker containers\nA comprehensive, easy-to-follow guide with an introduction to the new Rocket App Container and the Google Kubernetes cluster manager\n\nWho This Book Is For\n\nIf you are a system administrator with experience in network virtualization and want to develop computing networks for deploying applications and servers, then this is the book for you. Knowledge of Linux operating systems and Docker is expected.\n\nWhat You Will Learn\n\nInstall and set up CoreOS on your machine and learn more about etcd\nWrite and deploy systemd and fleet units\nCustomize your clustering machines with cloud-config\nSet up your Docker container's deployment\nConfigure cluster Central Services and release channels\nFamiliarize yourself with free as well as paid CoreOS services\nGet an overview of CoreOS rkt, a new App Container runtime\nLearn about Kubernetes and set up its cluster\n\nIn Detail\n\nThis book will help you get up and running on using CoreOS to develop effective computing networks. You will begin with understanding the basics of CoreOS. You will then discover what etcd is and how it is used, followed by launching Docker containers with systemd and fleet. Learn how to manage clusters, read system logs, and customize with cloud-config. You will set up the deployment to production using Docker builder and a private Docker registry. You will also see how to set up and use CoreUpdate and Enterprise Registry, and get an introduction to the new App Container called rkt and the newly introduced cluster manager known as Kubernetes.\n\nThis book will equip you with all the information you need to leverage the power of CoreOS and the related containers for the effective deployment of your applications","torrent":{"xt":"urn:btih:a08f6bfee9c661a1bd2bf4884d4ba5a127a28b82","amp;dn":"CoreOS+Essentials+%282015%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a08f6bfee9c661a1bd2bf4884d4ba5a127a28b82","infoHashBuffer":{"type":"Buffer","data":[160,143,107,254,233,198,97,161,189,43,244,136,77,75,165,161,39,162,139,130]},"announce":[],"urlList":[]}}