{"title":"Kingdom Interlinear Translation 1969","uid":4479405,"size":86397162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0dbf45040602bc6ce01d41541abac1aa15064d8&amp;dn=Kingdom+Interlinear+Translation+1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1225492756,"description":"The Kingdom Interlinear Translation has the Greek below the words of the New World Translation's English rendering.\n\nThe average Jehovah's Witness is only given the New World Translation, an erroneous translation of the Bible composed by high school dropouts.\n\nSo you can see why they are not show the original Greek Bible which would contradict the words they are shown in their corrupted version.\n\nThe Jehovah's Witnesses obsess that Jesus is not God and frequently make reference to John 1:1,2 as proof that Jesus is not God because the grammar uses an indefinite article.\n\n&quot;was a god&quot;\n\nas opposed to the original Greek which says\n\n&quot;was God&quot;\n\nKIT (Kingdom Interlinear Translation) is a good Bible to use to counter Jehovah's Witness propaganda because firstly, KIT is a Jehovah's Witness Bible and secondly, because it proves their error in translating John 1:1.\n\nTranslators of the New World Translation\n\nThe following list of translators of the New World Translation is a compilation from a variety of sources:\n\nFrederick W. Franz: Main translator. Took liberal arts sequence at University of Cincinnati; 21 semester hours of classical Greek, some Latin. Partially completed a two-hour survey course in Biblical Greek in junior year; course titled &quot;The New Testament--A course in grammar and translation.&quot; Left in spring of 1914 before completing junior year. Self-taught in Spanish, biblical Hebrew and Aramaic. Entered Brooklyn headquarters facility of Watchtower Society in 1920. Probable ghost writer for J. F. Rutherford (2nd president of WTS) from late 1920s through 1942. Vice president of WTS from 1942 to 1977, president from 1977 until death in 1992 at age 99.\n\nFranz writes in his autobiography: &quot;What a blessing it was to study Bible Greek under Professor Arthur Kensella! Under Dr. Joseph Harry, an author of some Greek works, I also studied the classical Greek. I knew that if I wanted to become a Presbyterian clergyman, I had to have a command of Bible Greek. So I furiously applied myself and got passing grades&quot; (The Watchtower, May 1, 1987, p. 24). Franz gives the impression that the bulk of his Greek studies were &quot;Bible Greek&quot; under &quot;Professor Kensella&quot; and that classical Greek was secondary under &quot;Dr. Joseph Harry.&quot; The opposite is true. As mentioned above, Franz only took one 2-hour credit class of &quot;Bible Greek&quot; but 21 hours of classical Greek. According to the course catalog of 1911, Arthur Kensella was not a professor of Greek, as Franz wrote, but an &quot;instructor in Greek.&quot; Kensella did not have a Ph.D. and he therefore taught entry-level courses.\n\nNathan H. Knorr: No training in biblical languages. Entered Brooklyn headquarters in 1923; 3rd president of WTS from 1942 to 1977. Died 1977 at age 72.\n\nMilton G. Henschel: No training in biblical languages. Private secretary and traveling companion to N. H. Knorr from late 1940s until early 1970s. 4th president of WTS from 1992 to 2000. Still living, age mid-80s.\n\nAlbert D. Schroeder: No training in biblical languages. Took 3 years of mechanical engineering, unspecified language courses in college, dropped out in 1932 and soon entered Brooklyn headquarters. Registrar of &quot;Gilead School&quot; from 1942 to 1959. Still living, age 90.\n\nKarl Klein: No training in biblical languages. Entered Brooklyn headquarters in 1925; member of Writing Dept. since 1950. Died 2001 at age 96.\n\nGeorge D. Gangas: No training in biblical languages. Greek-speaking Turkish national, entered Brooklyn headquarters in 1928 as a Greek translator from English to modern Greek publications. Died 1994 at age 98.\n\nFranz was the only man capable of doing translation work. Gangas was a native Greek speaker, knew little of Koine Greek, and apparently helped out with a variety of non-translation tasks including reviewing the English grammar for continuity of expression. From all information published about him personally, one readily concludes that Knorr was the business administrator for the Translation Committee. Henschel might have been on it to take care of legal/secretarial matters. Schroeder and Klein did the copious footnotes (which included textual sources) and cross references and marginal notes, which in the original six volumes of the NWT were more extensive than in the 1984 edition.\n\nThe NWT Committee has always been extremely secretive, and so information about who was on it has only trickled out of the Brooklyn headquarters as various staff members have left and revealed what they knew. Scant information has been published, other information has leaked by word of mouth.","torrent":{"xt":"urn:btih:a0dbf45040602bc6ce01d41541abac1aa15064d8","amp;dn":"Kingdom+Interlinear+Translation+1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0dbf45040602bc6ce01d41541abac1aa15064d8","infoHashBuffer":{"type":"Buffer","data":[160,219,244,80,64,96,43,198,206,1,212,21,65,171,172,26,161,80,100,216]},"announce":[],"urlList":[]}}