{"title":"Under the Paw - Tom Cox.epub","uid":9272241,"size":339203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a26c1768a7d64cde675015f44ae0d67e3f18a1ef&amp;dn=Under+the+Paw+-+Tom+Cox.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385803309,"description":"For years, Tom Cox might have seemed like a regular, hard-living sort of bloke -- a lover of late nights, rock music and beer -- but he had a dark furry secret. Tom was a cat lover. Always had been, in fact. For a while, he kept his passion in check, but there was only so long he could postpone his true dream, especially after he met Dee, his moggy-loving soulmate. In 2001, Tom left London and his job as a rock critic behind, and he and Dee, replete with Dee's cat Janet and three new kittens, moved to a remote part of Norfolk, a county where they knew not one living human soul. They thought it would be easy. They thought their cat madness had reached its limit. They were very wrong on both counts. In UNDER THE PAW, Tom records the chaos of owning seven of the most charismatic, idiotic and duplicitous cats in the country. How exactly does a person go from living a fancy-free young metropolitan life to suddenly thinking it is normal to be on 24-hour call for multiple sets of whiskers? What are the essential rules of disposing of a dead pheasant? How do you learn to love your wife's ex's favourite pet? Tom addresses all these issues and much more, encountering death, depression, flying fur and the first human sentence spoken by a feline along the way. Running through all the maelstrom is the heartbreaking story of his long and chequered relationship with The Bear, his oldest cat: a &quot;painfully sensitive&quot; survivor moggy who may or may not be an evil genius.","torrent":{"xt":"urn:btih:a26c1768a7d64cde675015f44ae0d67e3f18a1ef","amp;dn":"Under+the+Paw+-+Tom+Cox.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a26c1768a7d64cde675015f44ae0d67e3f18a1ef","infoHashBuffer":{"type":"Buffer","data":[162,108,23,104,167,214,76,222,103,80,21,244,74,224,214,126,63,24,161,239]},"announce":[],"urlList":[]}}