{"title":"Futura Archive Planet Comics 1946 Golden Age SciFi!","uid":8433579,"size":48207102,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a2c32131c5fa3fb9f9bd7da3f7ccbc43e1add720&amp;dn=Futura+Archive+Planet+Comics+1946+Golden+Age+SciFi%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367561504,"description":"Fantastic Art and Story!  I was pleasantly surprised!\n\nMarcia Reynolds was a second-grade technical secretary living in Titan City of Earth sometime in the late 21st century. She had no money and no family, and only a norm-plus rating on the intelligence quota, energo-efficiency and mating potential. In other words, she was a very average human girl, for her time. That was, until she was abducted by the Brain-Lords of Cymradia, and became Specimen Nine of Project: Survival. After her body and mind was tested and probed, the Cymradians determined that she had great potential, describing her as a &quot;prize of prizes&quot; and giving her the lab name, Futura. The Cymradian named Mentor, suspected that though she possessed great courage and foresaw that she would assert herself as a leader. He was proven correct, as Futura proved to be a courageous fighter, successfully managing to rally the other test subjects against the Cymradians. Finally, she escaped in an escape pod, as much of the planet of Cymradia was buried in hot magma from a geyser.\n\nAfter her escape from Cymradia, Futura fell into trouble with a number of space pirates, including Yrina and Blargo.\n\nFutura was a tenacious and savage fighter, a good athlete and she spoke the Trans-Cosmos language. \n\nSeed so all will enjoy    Sharing is caring","torrent":{"xt":"urn:btih:a2c32131c5fa3fb9f9bd7da3f7ccbc43e1add720","amp;dn":"Futura+Archive+Planet+Comics+1946+Golden+Age+SciFi%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2c32131c5fa3fb9f9bd7da3f7ccbc43e1add720","infoHashBuffer":{"type":"Buffer","data":[162,195,33,49,197,250,63,185,249,189,125,163,247,204,188,67,225,173,215,32]},"announce":[],"urlList":[]}}