{"title":"Jefferson Starship - Dragon Fly (1974 quad mix 24/96 lossless 4.","uid":9132973,"size":2165869442,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2da7fa94e01b4409ecf597f716706cddc997bfa&amp;dn=Jefferson+Starship+-+Dragon+Fly+%281974+quad+mix+24%2F96+lossless+4.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OEM","files":6,"time":1383358482,"description":"Jefferson Starship - Dragon Fly (1974 quad mix 24/96 lossless 4.0 DVD-A)\n\n24/96 4.0 lossless MLP (DVD-Audio).\n16/48 4.0 AC3 @ 440kbps (DVD-Video) for compatibility with standard DVD players.\nSlight noise/crackle filtering applied (Izotope RX 2), no EQ, compression, or rear channel boost.\n\nConverted from quad CD-4 vinyl using an AUDIO TECHNICA AT20SLa CD-4 cartridge / JVC 4DD-5 demodulator.\n\n\n&quot;'Dragon Fly' was really the first Starship album. Kantner and Slick fronted the group, bringing only violinist Papa John Creach with them from the Airplane. Ex-Quicksilver Messenger Service member David Freiberg alternated on bass and keyboards with Pete Sears; John Brabata was the drummer; and Craig Chaquico played lead guitar. The instrumental personality of the Airplane was reduced to typical Seventies functional competence, making the band much less interesting but more disciplined than the Airplane. 'Ride the Tiger' was as good a song as anything Kantner or Slick wrote for the Airplane, and 'That's for Sure' was also good. But the rest was filler, with one major exception; Kantner's collaboration with Marty Balin, 'Caroline', the albums best song, on which Balin performed a tremendous vocal.&quot; ***\n - John Swenson, Rolling Stone\n\n&quot;The key cut here is Grace Slick's gnomic &quot;Hyperdrive,&quot; in which supertechnology (spirit-powered, perhaps?) cuts through &quot;corners in time.&quot; If in 1973 you'd been responsible for Baron von Tollbooth and the Chrome Nun (Jefferson Jitney), Thirty Seconds Over Winterland (dead live), and Bodacious D.F. (Marty's party), you'd want to think you'd turned a corner in 1974 yourself. But though this does achieve a slick modernization of their polyvocal sound (Barbata-powered, definitely), with Papa John Creach's fiddle and Craig Chaquico's guitar synthesizing past and future for purposes of metaphor and stage presentation as Marty Balin's cameo contribution links them audibly to their own history, it also proves that you can't get along forever on generalized imprecations against the powerful and invidious oriental-occidental comparisons.&quot; C+\n- Robert Christgau, Village Voice","torrent":{"xt":"urn:btih:a2da7fa94e01b4409ecf597f716706cddc997bfa","amp;dn":"Jefferson+Starship+-+Dragon+Fly+%281974+quad+mix+24%2F96+lossless+4.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2da7fa94e01b4409ecf597f716706cddc997bfa","infoHashBuffer":{"type":"Buffer","data":[162,218,127,169,78,1,180,64,158,207,89,127,113,103,6,205,220,153,123,250]},"announce":[],"urlList":[]}}