{"title":"The Sounds - Crossing the Rubicon (2009) [FLAC] politux","uid":5855152,"size":350881320,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2fdfae01a552c52a8f332eead16c3a9f264671f&amp;dn=The+Sounds+-+Crossing+the+Rubicon+%282009%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1285576885,"description":"On their third album, Crossing the Rubicon, the Sounds haven't deviated much from the formula of their first two records. Why should they when it works as well as it does? The lively guitar punch, the '80s synthesizers, singer Maja Ivarsson's insistent and distinctive vocals, and above all the hooky but substantial songwriting all added up to something pretty impressive on 2006's Dying to Say This to You. It would have been a mistake to merely copy the template and insert new songs, though, and the band does add some new twists to both the sound and scope of the record. Unlike on the first two albums, which sounded like an exciting new wave-inspired band ripping through their songbook, there is seemingly more thought and planning behind this album. The band worked with a variety of producers and spent more time crafting precise arrangements and trying to make each song a separate entity. They add a level of studio craft and attention to detail to their sound that could bug some of their fans who might have preferred a more immediate sounding album, it's true. The high ratio of songs with huge hooks and the basic structural similarity to past works should keep most of them on board, though. It's no crime to expand and grow your sound as long as you do it right, and the Sounds have done that here. The best songs, like the super slick and stadium-sized &quot;No One Sleeps When I'm Awake&quot; (produced by James Iha and Adam Schlesinger), the emotionally devastating &quot;Dorchester Hotel,&quot; the nostalgic rocker &quot;Underground,&quot; or the epic Springsteen-esque &quot;The Only Ones,&quot; have a depth and power the band just couldn't deliver before. Only a couple of songs fail to measure up to the high standards established elsewhere but they don't ruin the listening experience, though the very Nordic pseudo-rapping and generally embarrassing thematic nature of &quot;Beatbox&quot; come very close. Crossing the Rubicon is the sound of a band reaching their potential as artists and it's very satisfying to see and, more importantly, to hear.\n\nSource: CD\nReleased: 2009\nGenre: Rock\nStyle: Synthpop\nQuality: Lossless\nCodec: FLAC\n\nTracks:\n\n  1. No One Sleeps When I'm Awake  4:09\n  2. 4 Songs &amp; A Fight         \t   3:24\n  3. My Lover   \t           4:25\n  4. Dorchester Hotel   \t   4:08\n  5. Beatbox  \t                   4:02\n  6. Underground  \t           3:47\n  7. Crossing The Rubicon  \t   2:03\n  8. Midnight Sun  \t           4:30 \n  9. Lost In Love  \t           5:05\n  10. The Only Ones  \t           4:44\n  11. Home Is Where Your Heart Is  7:39\n  12. Goodnight Freddy             4:04\n","torrent":{"xt":"urn:btih:a2fdfae01a552c52a8f332eead16c3a9f264671f","amp;dn":"The+Sounds+-+Crossing+the+Rubicon+%282009%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2fdfae01a552c52a8f332eead16c3a9f264671f","infoHashBuffer":{"type":"Buffer","data":[162,253,250,224,26,85,44,82,168,243,50,238,173,22,195,169,242,100,103,31]},"announce":[],"urlList":[]}}