{"title":"Details for MiniXP ( XP Pro SP3 nLited for install on Dell Mini","uid":4544427,"size":243293913,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a3650e67cd65bc37ae3fa256aa84411436e9d3b4&amp;dn=Details+for+MiniXP+%28+XP+Pro+SP3+nLited+for+install+on+Dell+Mini+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"courtster","files":5,"time":1228070933,"description":"A very impressive torrent I got from another source for all you Mini 9 owners - cheers toNkanoid:\n\n&quot;Well, I looked all over for a good small XP for my Mini 9 but I didn&amp;#039;t find what I wanted.\nSo, if you want something done right, you have to do it yourself.\nKeeping with that saying, I recommend you nLite you own XP for your own install.\nBut for those with a Dell Mini 9 looking for an easy install, this torrent is for you.\nThis is my first torrent so I hope you guys enjoy it.\nI included the nLite INI file so you can see what was removed.\nThe base OS was Windows XP Pro SP3.\nYOU NEED YOUR OWN KEY!\nIt boots very fast and takes up about 600MB.\nAfter installing, everything worked 100% except the Bluetooth and the touch pad.\nI didn&amp;#039;t slip stream either driver so you&amp;#039;ll have to install that after Windows is up and running.\nThe drivers are included in the torrent as self extracting RAR files (no need for WinRAR).\nISO is also packed as a self extracting RAR file.\nAlso, I highly recommend disabling the the page file (virtual memory) after install too.\nA pagefile will wear down your SSD faster.\nI run this XP on my Dell Mini with no problems, none the less...\nINSTALL AND RUN AT YOUR OWN RISK!\nI am not responsible for any damage or lost data.\nThis OS needs to be installed fresh, no upgrades allowed.&quot;","torrent":{"xt":"urn:btih:a3650e67cd65bc37ae3fa256aa84411436e9d3b4","amp;dn":"Details+for+MiniXP+%28+XP+Pro+SP3+nLited+for+install+on+Dell+Mini+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3650e67cd65bc37ae3fa256aa84411436e9d3b4","infoHashBuffer":{"type":"Buffer","data":[163,101,14,103,205,101,188,55,174,63,162,86,170,132,65,20,54,233,211,180]},"announce":[],"urlList":[]}}