{"title":"Lesbian Anal POV 4 (MILF Edition / Dana Vespoli, Evil Angel / 20","uid":10380719,"size":1972991287,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:a46f2da47dd836bd390b228fcf243c3ba485a703&amp;dn=Lesbian+Anal+POV+4+%28MILF+Edition+%2F+Dana+Vespoli%2C+Evil+Angel+%2F+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"makintos13","files":5,"time":1403068139,"description":"Lesbian Anal POV 4 (MILF Edition / Dana Vespoli, Evil Angel / 2014)\n\nWhen gorgeous Evil Angel director Dana Vespoli films her anal play sessions with her sensuous girlfriends, she likes to get close and personal. Dana's 'Lesbian Anal P.O.V. 4,' subtitled 'MILF Edition,' is a first-person document of backdoor perversion featuring stunning, mature ladies that truly appreciate a woman's touch. These sultry butt-sluts are the center of the directors attention as she trains her camera on ripe, beautiful asses she tenderly invades with fingers, toys, tools, toes ... and her trusty strap-on dildo! First, legendary bombshell Julia Ann is in town, and Dana can't wait to get inside the buxom blonde's incredibly big, soft, bodacious ass. She pushes ass-reaming toys into Julia's elastic anus while Julia buzzes her clit using a powerful vibrator!\n\nNext, the tattooed, exotic porn auteur butt-fucks irrepressible Phoenix Marie, exploring the famed anal queen's thick, juicy rump with fingers, toes and big toys. Mature, kinky supermodel India Summer strips to her lingerie and fishnets and spreads her long, shapely legs wide so the director can probe the sultry brunette's sensitive asshole with huge toys, even a metal speculum. Finally, cute, stacked blonde Cherie DeVille enjoys her very first experience with an anal strap-on, passionately riding Dana's dong while fingering herself to an intense vaginal/anal climax. 'Lesbian Anal P.O.V. 4' delivers the MILFs promised in the sub-title; it's sizzling, intimate girl-girl sodomy between luscious, sexually aggressive ladies!\n\nLisa Ann, Shyla Stylez, Jayden Jaymes, London Keyes, Diamond Foxxx, Charley Chase, Sarah Vandella, Lexi Love, Samantha Saint, Natasha Nice, Adrianna Nicole, Jayden Cole\n\nAnal, All Girl, MILF\n\nScreens:\n &lt;a href=&quot;\nhttp://imgfun.biz/img-53a102bcb1600.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-53a102bcb1600.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:a46f2da47dd836bd390b228fcf243c3ba485a703","amp;dn":"Lesbian+Anal+POV+4+%28MILF+Edition+%2F+Dana+Vespoli%2C+Evil+Angel+%2F+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a46f2da47dd836bd390b228fcf243c3ba485a703","infoHashBuffer":{"type":"Buffer","data":[164,111,45,164,125,216,54,189,57,11,34,143,207,36,60,59,164,133,167,3]},"announce":[],"urlList":[]}}