{"title":"Buster Keaton Remembered (Movies Film Art Ebook).pdf","uid":12181937,"size":40433299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4b8e17e39e148d3aa92b9fa4abbe32f6520311b&amp;dn=Buster+Keaton+Remembered+%28Movies+Film+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1438467600,"description":"Abrams / 2001 / Pdf / English / ISBN10 0810942275 / 238 p / 38.5 MB\n\nKnown for his legendary stone face and physical gags, Buster Keaton was a genius of silent-film comedy. Decades after their release, his movies remain unsurpassed marvels of comic invention and mechanical timing. In Buster Keaton remembered, an illustrated survey of Keaton's career, Eleanor Keaton, his wife of 26 years, and film historian Jeffrey Vance provide a personal account of this icon of American cinema. Drawing on professional papers, screenplays, studio records, and scrapbooks, the authors trace Keaton's beginnings in vaudeville, where he perfected his gags; his first silent shorts with Roscoe Arbuckle; the brilliant features he conceived, directed, produced, and performed in; and his later sound films for M-G-M and others. Fresh prints of classic film stills and never-before-published photos from the Margaret Herrick Library of the Academy of Motion Picture Arts and Sciences, together with a lively, anecdotal text, offer a behind-the-scenes look at how Keaton came up with his hilarious ideas, choreographed his elaborate stunts, and crafted his films","torrent":{"xt":"urn:btih:a4b8e17e39e148d3aa92b9fa4abbe32f6520311b","amp;dn":"Buster+Keaton+Remembered+%28Movies+Film+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4b8e17e39e148d3aa92b9fa4abbe32f6520311b","infoHashBuffer":{"type":"Buffer","data":[164,184,225,126,57,225,72,211,170,146,185,250,74,187,227,47,101,32,49,27]},"announce":[],"urlList":[]}}