{"title":"The Encyclopedia of American Prisons (2003).pdf Gooner","uid":14653106,"size":4574206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4e4dd9b4612a7a947c89d50c53c86fb8e380be8&amp;dn=The+Encyclopedia+of+American+Prisons+%282003%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1463668979,"description":"The Encyclopedia of American Prisons (2003).pdf Gooner\r\n\r\nPublisher: Facts on File Inc (31 Jan. 2003)\r\nLanguage: English\r\nISBN-10: 0816045119\r\nISBN-13: 978-0816045112\r\n\r\nThe United States currently holds the highest incarceration rate per capita of all western nations. There are over two million men and women incarcerated in the U.S., and over 1,500 more are being locked up weekly. Prisons are such a fundamental part of criminal justice today that it is hard to imagine our society without them. \r\n\r\nThe Encyclopedia of American Prisons is a comprehensive reference work covering the full gamut of the American penal system. From the early Pennsylvania and Auburn models, both of which drove many prisoners mad, to limited contemporary efforts to privatize prisons, this book covers the entire history of prisons in America. \r\n\r\nEntries include important figures such as famous and infamous wardens, notable prisoners, prisons, escapes, prison riots, fires, prison society, convict labor, scandals and triumphs, reformers, terminology, and much more. The Encyclopedia of American Prisons also covers key social issues connected to prisons such as overcrowding, mistreatment of prisoners, and the cost of maintaining prison programs. \r\n\r\nSubjects covered include: - Abuse and torture in prison - George V. Bennett - David Berkowitz (aka Son of Sam) - Disease in prison - Dorothea Dix - Capital punishment - Good-time credits - Juvenile delinquency - Mentally ill inmates - Ed Morell, tortured convict and reformer - Punishments and prisons in Colonial America - Recidivism - Women's prisons","torrent":{"xt":"urn:btih:a4e4dd9b4612a7a947c89d50c53c86fb8e380be8","amp;dn":"The+Encyclopedia+of+American+Prisons+%282003%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e4dd9b4612a7a947c89d50c53c86fb8e380be8","infoHashBuffer":{"type":"Buffer","data":[164,228,221,155,70,18,167,169,71,200,157,80,197,60,134,251,142,56,11,232]},"announce":[],"urlList":[]}}