{"title":"Mosby's Drug Guide for Nursing Students, 11E [PDF] [StormRG]","uid":11078315,"size":81728031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a590b5ff72f0979a2064e5fff8665a5049e328da&amp;dn=Mosby%27s+Drug+Guide+for+Nursing+Students%2C+11E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":2,"time":1411365107,"description":"Author: Linda Skidmore-Roth\nSeries: Mosby's Drug Guide for Nursing Students\nPaperback: 1280 pages\nPublisher: Mosby; 11 edition (July 25, 2014)\nLanguage: English\nISBN-10: 0323170218\nISBN-13: 978-0323170215\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_______________________________________________________________________________\n\n\nThis portable, student-friendly reference provides information on 50 drug classifications and more than 4,000 individual generic and trade name drugs - including 20 new FDA-approved drugs. Drug monographs are organized alphabetically for quick reference, and important data on interactions and therapeutic outcomes is also included to help prevent errors. In all, this full-color reference equips you with all the information you could possibly need to master safe drug administration in a wide variety of scenarios.\n\nMonographs organized alphabetically by name allow fast retrieval of important information.\nComprehensive drug monographs throughout the text contain:\nGeneric names\nRx or OTC designations\nPronunciations\nU.S. and Canadian trade names\nFunctional and chemical classifications\nPregnancy category\nControlled-substance schedule\nDo-not-confuse drugs\nActions\nTherapeutic outcomes\nUses\nUnlabeled uses\nDosages and routes\nAvailable forms\nAdverse effects\nContraindications\nPrecautions\nPharmacokinetics and pharmacodynamics\nDrug/herb, drug/food, and lab test interactions\nNursing considerations\nTreatment of overdose\nConcise, practice-oriented nursing considerations include assessment, implementation, patient/family education, and evaluation.\nIV drug information is highlighted in one easy-to-find place, under the Implementation heading, and includes special considerations, Y-site, syringe, and additive compatibilities.\nHigh alerts drugs are identified by those that pose the greatest risk for patient harm if administered incorrectly.\nCanadian brand names are designated by a maple leaf icon.\nNursing alert icons identify considerations that require special attention.\nCommon and life-threatening side effects are highlighted for easy identification.\nDo Not Confuse headings help you avoid administering the wrong drugs.\nTall Man lettering is applied to easily confused drug names, as recommended by the FDA.\nTherapeutic Outcome headings in monographs encourage critical thinking and provide a focus for the plan of care.\nExtensive interactions information including lab test interferences is included.\nFlexible, water-resistant cover provides durability in the clinical setting.\nSafe Medication Administration Guide in the back of the book includes a nomogram for calculation of body surface area.\nDrug Categories section features nursing diagnoses, generic drugs, and highlighted key drugs in each category.\n13 illustrations and an atlas of medication administration show mechanisms or sites of action for select drug classes.\nPharmacokinetics and pharmacodynamics in chart form offer easy access to information.\nNEW! 20 of the latest FDA-approved drugs have been added.\nNEW! Common drugs seen on the NCLEX Exam have been highlighted to help in review.\nUPDATED! Black Box Warnings include alerts to dangerous and/or life-threatening adverse effects.\nNEW! Thousands of new and updated drug facts cover the areas of doses, side effects, pharmacokinetics, interactions, and nursing considerations.","torrent":{"xt":"urn:btih:a590b5ff72f0979a2064e5fff8665a5049e328da","amp;dn":"Mosby%27s+Drug+Guide+for+Nursing+Students%2C+11E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a590b5ff72f0979a2064e5fff8665a5049e328da","infoHashBuffer":{"type":"Buffer","data":[165,144,181,255,114,240,151,154,32,100,229,255,248,102,90,80,73,227,40,218]},"announce":[],"urlList":[]}}