{"title":"Lefty Kreh on Fly Casting DVD, 2004","uid":9207984,"size":3849467904,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a591063226e9e8e615535c281442af8d3c622d63&amp;dn=Lefty+Kreh+on+Fly+Casting+DVD%2C+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sofi.dalo","files":9,"time":1384730842,"description":"Lefty covers the basics of fly casting in detail, demonstrating casting aids and exercises that will help beginning and advanced fly casters improve their distance and accuracy. Lefty then demonstrates 20 specific casts that every fly fisherman should know, including instruction on: Casting in the wind; Various roll casts; Double-hauling techniques; Casting in tight places; Changing directions quickly; and more. The DVD provides a 2nd angle of viewing for most of the demonstrations. DVD, 68 min.\nThis is the most comprehensive fly casting tape to date from the world's most recognized fly fisherman. Lefty covers the basics of fly casting in detail, demonstrating casting aids and exercises that will help beginning and advanced fly casters improve their distance and accuracy. Lefty then demonstrates 20 specific casts that every fly fisherman should know, including instruction on\nCasting in the wind\nVarious roll casts\nDouble-hauling techniques\nCasting in tight places\nChanging directions quickly\nMany more\nAs a special feature, on the DVD, we've provided and optional 2nd angle of viewing for most of the demonstrations. This allows the viewer to analyze Lefty's technique from both side and behind the cast, fully demonstrating how the casting motion determines accuracy and distance.\n","torrent":{"xt":"urn:btih:a591063226e9e8e615535c281442af8d3c622d63","amp;dn":"Lefty+Kreh+on+Fly+Casting+DVD%2C+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a591063226e9e8e615535c281442af8d3c622d63","infoHashBuffer":{"type":"Buffer","data":[165,145,6,50,38,233,232,230,21,83,92,40,20,66,175,141,60,98,45,99]},"announce":[],"urlList":[]}}