{"title":"After Hitchcock Influence, Imitation, and Intertextuality(pdf){Z","uid":11388337,"size":6823394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a690e960d2f5698bd368ec60c786ad2bf5a4db2b&amp;dn=After+Hitchcock+Influence%2C+Imitation%2C+and+Intertextuality%28pdf%29%7BZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415296995,"description":"Alfred Hitchcock is arguably the most famous director to have ever made a film. Almost single-handedly he turned the suspense thriller into one of the most popular film genres of all time, while his &quot;Psycho&quot; updated the horror film and inspired two generations of directors to imitate and adapt this most Hitchcockian of movies. Yet while much scholarly and popular attention has focused on the director's oeuvre, until now there has been no extensive study of how Alfred Hitchcock's films and methods have affected and transformed the history of the film medium. In this book, thirteen original essays by leading film scholars reveal the richness and variety of Alfred Hitchcock's legacy as they trace his shaping influence on particular films, filmmakers, genres, and even on film criticism. Some essays concentrate on films that imitate Hitchcock in diverse ways, including the movies of &quot;Brian de Palma&quot; and thrillers such as &quot;True Lies&quot;, &quot;The Silence of the Lambs&quot;, and &quot;Dead Again&quot;. Other essays look at genres that have been influenced by Hitchcock's work, including the 1970s paranoid thriller, the Italian giallo film, and the post-&quot;Psycho&quot; horror film. The remaining essays investigate developments within film culture and academic film study, including the enthusiasm of French New Wave filmmakers for Hitchcock's work, his influence on the filmic representation of violence in the post-studio Hollywood era, and the ways in which his films have become central texts for film theorists.\n\nPublisher: University of Texas Press (25 February 2007)\nLanguage: English\nISBN-10: 029271338X\nISBN-13: 978-0292713383","torrent":{"xt":"urn:btih:a690e960d2f5698bd368ec60c786ad2bf5a4db2b","amp;dn":"After+Hitchcock+Influence%2C+Imitation%2C+and+Intertextuality%28pdf%29%7BZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a690e960d2f5698bd368ec60c786ad2bf5a4db2b","infoHashBuffer":{"type":"Buffer","data":[166,144,233,96,210,245,105,139,211,104,236,96,199,134,173,43,245,164,219,43]},"announce":[],"urlList":[]}}