{"title":"HuniePop V1.2.0 (Valentines Update ^^ThePirateBen^^ [UNCENSORED]","uid":12006830,"size":702691760,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a7b092c32c735d96af398d9593432181a153d665&amp;dn=HuniePop+V1.2.0+%28Valentines+Update+%5E%5EThePirateBen%5E%5E+%5BUNCENSORED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThePirateBen","files":1,"time":1433920317,"description":"HuniePop is a unique sim experience for PC, Mac and Linux. It's a gameplay first approach that's part dating sim, part puzzle game, with light RPG elements, a visual novel style of presentation, an abrasive western writing style and plenty of &quot;plot&quot;.\n\nAfter a pathetic attempt to try and pick up Kyu, a magic love fairy in disguise, she decides to take you under her wing and help you out with your crippling inability to meet new women. After a few dating lessons and some sound advice, Kyu sends you out into the world ready to take on the dating world and a wide cast of beautiful babes.\n\n    8 gorgeous girls each with their own personalities, preferences and style. (Rumor has it there are several secret characters to unlock as well!)\n    More than 20 in-game locations each with beautiful hand painted environment art and many with full day/night cycles.\n    Over 250 unique items (food, drinks, gifts, accessories) that you can purchase, unlock, collect and give as gifts.\n    A beautifully composed soundtrack containing over 20 tracks of original music inspired by eastern pop, jazz and bossa nova melodies.\n    Thousands of lines of dialog, fully and professionally voice acted, complete with a unique character lip-syncing system.\n    Customize girls' appearances with unlockable outfits and hairstyles! The girls will also dress up for dates! (Or dress down afterwards...)\n    Collect nearly 50 stunning CG photos depicting the girls in various scenarios, including steamy bedroom scenes.\n    An addicting match-3 style puzzle dating system with it's own unique twists including upgradeable traits/stats, the ability to move any number of positions and special date gifts that have a variety of interesting effects on the puzzle.\n\n==========================================================\nSystem Requirements\n\n\n    Minimum:\n        OS: Windows XP+\n        Processor: 1.2 GHz\n        Memory: 2 GB RAM\n        Graphics: DirectXÂ® 9 Compatible Graphics Card\n        DirectX: Version 9.0a\n        Hard Drive: 1 GB available space \n==========================================================","torrent":{"xt":"urn:btih:a7b092c32c735d96af398d9593432181a153d665","amp;dn":"HuniePop+V1.2.0+%28Valentines+Update+%5E%5EThePirateBen%5E%5E+%5BUNCENSORED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7b092c32c735d96af398d9593432181a153d665","infoHashBuffer":{"type":"Buffer","data":[167,176,146,195,44,115,93,150,175,57,141,149,147,67,33,129,161,83,214,101]},"announce":[],"urlList":[]}}