{"title":"Molly Hatchet-Double Trouble Live(1985)(2008 SPV Rem.)[EAC-FLAC]","uid":4773042,"size":537760239,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7df359d2b2f50368b9e60d375ebb11afd6b6b8d&amp;dn=Molly+Hatchet-Double+Trouble+Live%281985%29%282008+SPV+Rem.%29%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":26,"time":1237117720,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\nAhh... Southern Rock. Breathe deeply and you can smell it. Well, not the music, but you can sure fill your nostrils with the heavy aroma of Jack Daniels. Southern Rock comes in many different packages, like Little Feat, very funky; the Outlaws, country influence; Blackfoot, who veered heavily towards hard rock; the Allman Brothers, carrying the flag for the blues; and of course Lynyrd Skynyrd, the ultimate Southern rock band. Molly Hatchet are the Stones and rhythm and blues influenced Southern rock band. What all the bands have in common is gruff vocals, a penchant for guitar solos, and no regard to dress sense as long as it?s blue jeans and cowboy boots, topped off by a Stetson hat. Also scant notice is taken of expanding waistlines and certainly no regard is wasted in keeping a stable line-up. Molly Hatchet are true to form in all these elements.\n\nThis album catches Molly Hatchet in fine form with the great Danny Joe Brown out in front with his hard living attitude and great diction. He sang and lived the Southern attitude to the maximum, a great focal point, charisma just oozed from this man, his vocals completely dominate these recordings, which is no mean feat considering what is behind him. Danny Joe Brown can be heard at his absolute best on Hatchet?s tribute to Lynyrd Skynyrd, when they break into a eleven minute version of ?Freebird? in the middle of this set. The song is given an emotional introduction before the band came crashing in. What a band, too. By now and after six years on the road, when this concert was recorded on a home coming gig in Dallas, Texas and a sultry night in Jacksonville, Florida, the Hatchet had reduced to a twin lead guitar attack (there had originally been three) comprising of Dave Hlubek, who turns in a fine display of slide playing, and other original Hatchet man Duane Roland. Backing them up are Bruce Crump on drums and the marvelously monikered Riff West on bass. Sitting quietly at the side of the stage was the recently acquired John Galvin on keyboards, but there really isn?t much room in Southern Rock for tinkling of the ivories with all the guitar and vocal action going on.\n\nAll the classic Hatchet songs are featured here in all their glory. (One glance at the song titles will tell you what they are about.) The band takes most songs on the gallop and only occasionally swaggers into a canter. Certainly do not bother looking for any ballads here; not an album to sit down to. Instead, turn up the volume to eleven and do some grotesque gurning down at the front of the stage. Every song here would go down well at the front in Tahitian Queens famous rock ?n? roll Happy hour on Friday evening.\n\nMolly Hatchet is now embarking on their 25-year anniversary tour. But, is it really Molly Hatchet you may ask? After this long life span all of the original members of the band have left. Even this line-up, which played together six years after the band?s conception, only contained three originals, and none of these guys are presently with the band. Over the years new guys arrived to fill the shoes of those who left and Southern Rock is an attitude, not a line-up. So what the heck, if it sounds good and feels good, love it. Deep Purple have only got the drummer left from the original quintet, and they make Spinal Tap look like a stable animal.\n\n[Amazon Customer Reviews]\n\n\n\nThis was Molly Hatchet at their peek in the mid 1980's. You will not find a better mixed and performed live CD. If 24 bit remastering would help (it's still good the way it is) then it should be done. This CD is in the same league, if not better than UFO's &quot;Strangers in the Night&quot; as top live CD's ever released. Almost every song is awesome. Molly Hatchet was firing on all six cylinders when this CD was released, never to be the same again. Look at Hatchet today. It just does not compare. Danny Joe on vocals had enough grit to bring &quot;Bloody Reunion&quot; and enough finesse and class for &quot;Stone in your Heart&quot; and &quot;Satisfied Man&quot;. Someone previously mentioned that Hatchet never had good background vocal harmonies, so what they do now is no different than before. That is not true. Just check them out on &quot;Stone in Your Heart&quot; and &quot;Satisfied Man&quot;. Incredible. A true gem. Every true fan of Heavy Metal with melody or even a fan of Southern Rock should have a copy of this CD. Dave Hlubek and Duane Roland on guitar- amazing. Bruce Crump (I think) sounds like Deep Purple's Ian Paice. The same ferocious and precise drumming, with awesome fill-ins.Track Listings\n\n[Amazon Customer Reviews]\n\n\n1. Whiskey Man\n2. Bounty Hunter\n3. Gator Country\n4. Flirtin' With Disaster\n5. Stone in Your Heart\n6. Satisfied Man\n7. Bloody Reunion\n8. Boogie No More\n9. Free Bird\n10. Dreams I'll Never See\n11. Edge of Sundown\n12. Fall of the Peacemakers\n13. Beatin' the Odds \n\n\n\n\n\nDuane Roland - Guitar\nDave Hlubek - Guitar\nBobby Ingram - guitar\nJohn Galvin - keyboards &amp; organ\nDanny Joe Brown - Lead vocal\nBanner Thomas - Bass guitar\nBruce Crump - Drums\nJohn Galvin - Keyboards\n\n\n","torrent":{"xt":"urn:btih:a7df359d2b2f50368b9e60d375ebb11afd6b6b8d","amp;dn":"Molly+Hatchet-Double+Trouble+Live%281985%29%282008+SPV+Rem.%29%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7df359d2b2f50368b9e60d375ebb11afd6b6b8d","infoHashBuffer":{"type":"Buffer","data":[167,223,53,157,43,47,80,54,139,158,96,211,117,235,177,26,253,107,107,141]},"announce":[],"urlList":[]}}