{"title":"The Case for Faith - Lee Strobel (Audiobook)","uid":4621747,"size":159035417,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a9b641c4f0a4ea26830e835544dcbd82cb23fca5&amp;dn=The+Case+for+Faith+-+Lee+Strobel+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":1,"time":1231066481,"description":"The Case for Faith - Lee Strobel (Audiobook)\n\nRead by Dick Fredricks\n\nThanks a Million to the Original Uploader.\nThe entire message of the Bible explained in the layman's language. A must have for all Christians. \n\nOriginal Uploaders Comments:\n\nAward-winning reporter and author Lee Strobel (The Case for Christ) once again uses his investigative skills to address the primary objections to Christianity. As a former atheist, Strobel understands the rational resistance to faith. \nHe even names the eight most convincing arguments against Christian faith: \n\n1) If there's a loving God, why does this pain-wracked world groan under so much suffering and evil?\n2) If the miracles of God contradict science, then how can any rational person believe that they're true?\n3) If God is morally pure, how can he sanction the slaughter of innocent children as the Old Testament says he did?\n4) If God cares about the people he created, how could he consign so many of them to an eternity of torture in hell just because they didn't believe the right things about him?\n5) If Jesus is the only way to heaven, then what about the millions of people who have never heard of him?\n6) If God really created the universe, why does the evidence of science compel so many to conclude that the unguided process of evolution accounts for life?\n7) If God is the ultimate overseer of the church, why has it been rife with hypocrisy and brutality throughout the ages?\n8) If I'm still plagued by doubts, then is it still possible to be a Christian?\n\nThese are mighty tough questions, and Strobel fields them well. This is audiobook of substance and merit, one that will help Christians defend their faith, especially during the hardest of times, when they have to defend their faith to themselves in moments of doubt. \n\nFormat: mp3\nRuntime: 11 hours\nBitrate: 32 kbps\nMy Rating: 10/10\n\nKindly Seed for as long as possible.\n\nUploaded by Indian Christian\n\n","torrent":{"xt":"urn:btih:a9b641c4f0a4ea26830e835544dcbd82cb23fca5","amp;dn":"The+Case+for+Faith+-+Lee+Strobel+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b641c4f0a4ea26830e835544dcbd82cb23fca5","infoHashBuffer":{"type":"Buffer","data":[169,182,65,196,240,164,234,38,131,14,131,85,68,220,189,130,203,35,252,165]},"announce":[],"urlList":[]}}