{"title":"Democracy Now - 09 nov 2011","uid":6805935,"size":456745346,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a9d14e53dfb0cf731091e1d3cbfb06da8f943e40&amp;dn=Democracy+Now+-+09+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1320863808,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 09, 2011\n\n-  Repeal of Ohio Anti-Union Law Tops Election Day Results\n-  IAEA Questions Iranian Nuclear Program\n-  U.S. Official: IAEA Report May Not Contradict View Iran Has Abandoned Nuclear Weapons\n-  Syrian Gov't Attacks Continue in Homs as Death Toll Passes 3,500\n-  Obama Admin Expands Drilling in Gulf of Mexico, Alaska\n-  Cain Denies Latest Sexual Harassment Allegations\n-  Occupy Protesters to March From Wall Street to D.C.\n-  Folk Duo Crosby and Nash Performs at OWS\n-  Gitmo Prisoner Appears for 1st Military Trial Under Obama\n-  Italian PM Berlusconi Announces Resignation\n-  Obama Touts Education Reforms in Philadelphia\n-  Thousands of Haitian Cholera Victims Sue United Nations\n-  Carter: Haitians Should Be Allowed to Rebuild Without Foreign Interference\n\n\nSpecial reports\n\n- Election Day 2011: In State After State, &quot;Remarkable Wins for Progressive Politics&quot;\n\nAdvocates for labor, women's and immigration rights are celebrating a number of key victories in Tuesday's state elections. In Ohio, voters defeated Republican Gov. John Kasich's controversial limits on the collective bargaining rights of state employees. In Arizona, Russell Pearce, the architect of the state's controversial anti-immigration law has lost his state senate seat in an unprecedented recall vote. Meanwhile, in Maine, voters have defeated a Republican measure that barred same-day voter registration on election day. For analysis, we're joined from Ohio by reporter John Nichols of The Nation magazine. &quot;There were many political consultants, political insiders, who said, 'Oh, don't pick this fight.' You'll note that President Obama and the Washington Democrats stayed clear of this battle in Ohio,&quot; Nichols says. &quot;But in Ohio on the ground, this grassroots movement, which put literally thousands and thousands of people, tens of thousands of people, at the doors, turned back a national conservative agenda. That's a big deal.&quot;\n\n\n- Mississippi Rejects Bill to Grant Pre-Embryonic &quot;Personhood,&quot; Outlaw Fertility Aid, Birth Control\n\nVoters in Mississippi have overwhelmingly defeated an amendment to establish that a fertilized human egg is a person, despite support for the measure from the Republican and Democratic candidates for governor. If passed, it would have made Mississippi the first state to grant constitutional rights to embryo from the moment of conception. We speak with Diane Derzis, owner of Mississippi's only abortion clinic, the Jackson Women's Health Organization. She notes supporters had hoped to use the Mississippi measure to mount a legal attack on Roe v. Wade, the 1973 U.S. Supreme Court decision that established the right to abortion. &quot;If you make a fertilized egg a person, not only have you banned abortion immediately, you have banned most forms of birth control, as they work by preventing implantation of a fertilized egg. That's very clear. There's no two ways about that,&quot; Derzis says. Efforts are underway in at least six states, and at the federal level, to adopt similar laws.\n\n\n- As Cain Denies Mounting Allegations, Supporters Malign Female Accusers, Sexual Harassment Victims\n\nRepublican presidential candidate Herman Cain has strongly rejected sexual harassment allegations against him, saying they &quot;simply didn't happen,&quot; and vowing not to withdraw from the 2012 presidential race. On Tuesday, Cain denied the claims of his latest accuser, Sharon Bialek, who said Cain groped her and tried to force her to commit a sexual act in 1997. Also Tuesday, another woman, Karen Kraushaar, confirmed publicly for the first time she had accused Cain of sexual harassment when they both worked for the National Restaurant Association in the 1990s. We speak with Dahlia Lithwick, senior editor at Slate. &quot;I think this goes to these archetypes that, if you fail everything else, just accuse women of being insane, accuse them of being trampy, accuse them of being hysterics. I think that is a little bit of what you are hearing here,&quot; Lithwick says. &quot;I find it fascinating that you never hear these accusations turned against male accusers of misconduct. These are really, really Shakespearean ideas of women as emotional and unhinged.&quot;\n\n\n- Bank Transfer Day: Kristen Christian on How She Inspired Mass Exodus From Big Banks to Credit Unions\n\nProtests were held across the country Saturday to mark Bank Transfer Day, a campaign to move accounts from big banks into community banks or credit unions. Credit unions attracted more than 40,000 new account holders, reporting about $80 million in new savings, or an average of about $2,000 per new account holder. The campaign was organized by Kristen Christian when she learned that Bank of America planned to charge her a $5 monthly debit card fee. Her Facebook post urging friends to abandon big banks unwittingly blossomed into a national campaign. Although the campaign was neither inspired by nor organized by the cyber-activist group Anonymous or the Occupy Wall Street movement, it did benefit from their support. &quot;The message from Bank Transfer Day was not the fee itself, but actually the principle behind it. Because at least with BofA, the fee only applied to account holders with less than $20,000 in combined accounts. So, based on principle, I couldn't support a business that would directly target the impoverished and working class,&quot; Christian says.\n\n\n- &quot;Corporations Are Not People&quot;: Activists Push Amendment to Revoke &quot;Corporate Personhood&quot;\n\nAfter an Election Day that saw a number of wins for progressive causes nationwide, activists opposed to &quot;corporate personhood&quot; - the notion that corporations have equal rights to individuals - are pushing ahead with a campaign to add a twenty-eighth amendment to the U.S. Constitution that would reject the idea that corporations are people and reverse the 2010 landmark case Citizens United v. Federal Election Commission. In a 5-to-4 vote, the Court ruled corporations have First Amendment rights and that the government cannot impose restrictions on their political speech - clearing the way for corporations and other special interest groups to spend unlimited amounts of money on elections. We speak to John Bonifaz, a constitutional attorney and co-founder and director of Free Speech for People.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a9d14e53dfb0cf731091e1d3cbfb06da8f943e40","amp;dn":"Democracy+Now+-+09+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d14e53dfb0cf731091e1d3cbfb06da8f943e40","infoHashBuffer":{"type":"Buffer","data":[169,209,78,83,223,176,207,115,16,145,225,211,203,251,6,218,143,148,62,64]},"announce":[],"urlList":[]}}