{"title":"Books about CIA - Marchetti, Blum, Agee, Prouty, etc","uid":12090801,"size":41104254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9f277d345fdbee5b71543bd3a5cc3d9261959da&amp;dn=Books+about+CIA+-+Marchetti%2C+Blum%2C+Agee%2C+Prouty%2C+etc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chiky5chiken","files":21,"time":1436039812,"description":"Eight books and two articles in this torrent (each in both Nook and Kindle format)\n\nThe US Government is not what it seems. If you think that the CIA is just another government agency controlled by the President, you couldn't be more mistaken. According to Colonel Fletcher Prouty (book &quot;The Secret Team&quot;), who worked for many years as a CIA point of contact in the Air Force, the Agency has infiltrated many other government agencies, including the Customs Service, Federal Aviation Administration, Pentagon and White House staff and has a large worldwide logistical base (including its own air force), which allows the CIA to initiate covert operations without either President's approval or coordination with the Pentagon, and often against direct orders of the President. According to Jesse Ventura there is a &quot;CIA person&quot; assigned to each state government in the US; Ventura was interrogated by a group of CIA agents before taking office as Minnesota governor. The Agency's main activity is clandestine operations (which almost always violate American and international laws), whereas collection of intelligence is only a small part of its budget. The President and Congress do not even know what the Agency is doing half the time, and the Agency routinely manipulates both by feeding them false intelligence. The disinformation often takes the form of planned releases disguised as either &quot;leaks&quot; (the Pentagon Papers) or writings of &quot;dissident&quot; journalists such as Seymour Hersh. According to Peter Dale Scott the CIA is a part of the &quot;Deep State,&quot; i.e. an invisible and unelected part of the government that is really in charge of what is going on. The US President is powerless against the Deep State and has no other choice but to go along with clandestine operations and CIA's foreign policy, otherwise he will be either assassinated (like JFK) or framed and removed from office (like Nixon). Infiltration and manipulation of the mainstream media allow the CIA to convince the public that such events are caused either by a lone gunman or by serious offenses committed by the President. At the same time the Agency has long been instructing its media assets to deride skeptics as kooky conspiracy theorists. However, there are many decent people working in the CIA who are not involved in those sinister things.\n\nAmerican War Machine - Deep Politics, the CIA Global Drug Connection, and the Road to Afghanistan (Peter Dale Scott; 2010)\n\nAmerica's Deadliest Export - Democracy - The Truth about U.S. Foreign Policy and Everything Else (William Blum; 2013)\n\nArticle - The CIA and the Media - Carl Bernstein (Rolling Stone, 1977)\n\nConfessions of an Economic Hit Man (John Perkins; 2004)\n\nDeadly Deceits - My 25 Years in the CIA (Ralph W. McGehee; 1983)\n\nDeclassified CIA document (1968) about conspiracy theories Doc #1035-960\n\nExtreme Prejudice (Susan Lindauer; 2010)\n\nInside the Company - CIA Diary (Philip Agee; 1975)\n\nThe CIA and the Cult of Intelligence (Victor Marchetti and John D. Marks; 1983)\n\nThe Secret Team - The CIA and Its Allies in Control of the United States and the World (L. Fletcher Prouty; 1997)","torrent":{"xt":"urn:btih:a9f277d345fdbee5b71543bd3a5cc3d9261959da","amp;dn":"Books+about+CIA+-+Marchetti%2C+Blum%2C+Agee%2C+Prouty%2C+etc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9f277d345fdbee5b71543bd3a5cc3d9261959da","infoHashBuffer":{"type":"Buffer","data":[169,242,119,211,69,253,190,229,183,21,67,189,58,92,195,217,38,25,89,218]},"announce":[],"urlList":[]}}