{"title":"Murder After Midnight - Murder Cases - MP3 - Slimoo","uid":5742004,"size":1211559351,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:aa91ea501f9e8e9069b2c6f0ada60fcbbdae893f&amp;dn=Murder+After+Midnight+-+Murder+Cases+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":139,"time":1281068643,"description":"Murder After Midnight Audio Murder &amp; Crime Cases - LBC\n139 episodes - 64k - Mp3 - Slimoo\n\n\nMurder After Midnight were short and some not so short murder and crime cases by Martin Fido &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Martin_Fido&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Martin_Fido&lt;/a&gt;\n\n\nMurder After Midnight were broadcast on LBC so Clive Bull &amp; Bob could eat their microwave Chicken curry's\n(After years of research Clive and Bob decided Chicken Curry was the only decent thing to Microwave)\n\n[b]About these files:[/b]\n[color=blue]I have been working on these for some months after finding them on various file-sharing sites.\nI've noticed some are now being posted as torrents so have rushed this before they end up here.\nBecause there were many, many issues with them which I have now sorted?\n\nWere 48k Mono 1 Channel\nNow 64k 2 Channel\n\nLevels were mixed as I doubt they came from the same person.\nLevels now match, ish.\n\nEndings and starts missing. \nFixed so all now have them and fade in and out.\n\nUnedited - 1 had 22 mins extra on a 12 minute ep.\n\nNaming of these were poor to say the least.\nEach case was checked and re-named so a Google should find the case if you want to read more.\n\nWas &gt; E23_Scheuring___Hasen\nShould be and now is &gt; Jens Soering &amp; Elizabeth Haysom\nWas &gt; E17_Stark_Weather.\nShould be and now is &gt; Charles Raymond Starkweather \n\nAs you can see you would never find more details on cases with such poor naming.\n\n\nThe quality on some of these is not great.[/color]\n\n\n\n\nMurder After Midnight - Abraham Thornton - Mary Ashford - The Erdington Murders \nMurder After Midnight - Albet (Albie) Dryden - Harry Collinson \nMurder After Midnight - Alfred Whiteway - Tow Path Murders \nMurder After Midnight - Anna Schonleben (Zwanzinger) - Bavaria's Premiere Poisoner \nMurder After Midnight - Archibald Thomson Hall - The Killer Butler \nMurder After Midnight - Arthur (J) Maundy Gregory - Victor Grayson \nMurder After Midnight - Augustus Raymond Margary - The Margary Affair \nMurder After Midnight - Belle Sorenson Gunness (Brynhild Paulsdatter StÃƒÂ¸rseth) \nMurder After Midnight - Bonnie &amp; Clyde \nMurder After Midnight - Burning Of Evelyn Foster \nMurder After Midnight - Charles (Charley) Brewster Ross - First Kidnapping For Ransom In America \nMurder After Midnight - Charles (Charlie) Frederick Peace \nMurder After Midnight - Charles (Chuck) Stuart \nMurder After Midnight - Charles Mohun, 4th Baron Mohun - Richard Hill \nMurder After Midnight - Charles Raymond Starkweather \nMurder After Midnight - Cheryl (Turner) Crane - Johnny Stompanato \nMurder After Midnight - Christiana Edmunds - The Chocolate Cream Poisoner \nMurder After Midnight - Chung Yi Miao - A Theory \nMurder After Midnight - Chung Yi Miao - Wai Sheung Yi Miao \nMurder After Midnight - Colonel Thomas Blood - The Crown Jewels \nMurder After Midnight - Deacon William Brodie \nMurder After Midnight - Dennis Nilsen - The Muswell Hill Murderer \nMurder After Midnight - Dickens Tombs - John C. Colt \nMurder After Midnight - Doctor Robert George Clements \nMurder After Midnight - Dr Jeffrey R. MacDonald \nMurder After Midnight - Dr Joan Francisco - Tony Diedrick \nMurder After Midnight - Dr. James Howard Snook - Theora Hix \nMurder After Midnight - Edith Thompson &amp; Frederick Bywaters - Percy Thompson \nMurder After Midnight - Elizabeth (Elza) Fenning - Arsenic In The Dumplings \nMurder After Midnight - Elizabeth (Elza) Ross &amp; Edward Cook - Catherine Walsh \nMurder After Midnight - Elizabeth (Treat) Canning \nMurder After Midnight - Elizabeth I \nMurder After Midnight - Elizabeth Jeffries &amp; John Swan - Joseph Jeffries \nMurder After Midnight - Elizabeth Jeffries \nMurder After Midnight - Ernest Albert Walker \nMurder After Midnight - Florence Elizabeth Maybrick \nMurder After Midnight - Florence Ricardo (Campbell - Bravo) - Charles Bravo \nMurder After Midnight - Francis (Flossie) Forsyth \nMurder After Midnight - Frederick Ellison Morton - Ernest Brown \nMurder After Midnight - Gaston Dominici - Sir Jack Drummond \nMurder After Midnight - George Ball &amp; Samuel Angeles Elltoft \nMurder After Midnight - George Chapman \nMurder After Midnight - George Henry Lamson \nMurder After Midnight - Gianni Versace \nMurder After Midnight - Greta Peltz (Vera Stretz) - Fritz Gebhardt \nMurder After Midnight - Harriet (Clara Burton) Buswel - The  Great Coram Street Murder Mystery \nMurder After Midnight - Harry Dobkin - Rachel (Dubinski) Dobkin - The Air Raid Murder \nMurder After Midnight - Harry Kendall Thaw - Part 01 \nMurder After Midnight - Harry Kendall Thaw - Part 02 \nMurder After Midnight - Harry Kendall Thaw - Part 03 \nMurder After Midnight - Harry Kendall Thaw - Part 04 \nMurder After Midnight - Harry Roberts, John Duddy, John Edward (Jack) Witney - The Shepherd's Bush Murders \nMurder After Midnight - Henry Wainwright &amp; Alice Day - Harriet Lane \nMurder After Midnight - Horace George Raynor - William Whiteley \nMurder After Midnight - Injun Joe \nMurder After Midnight - Israel (Lobulsk) Lipski \nMurder After Midnight - James Blomfield Rush - Isaac Jermy, Isaac Jermy Jermy - Murders At Stanfield Hall \nMurder After Midnight - James Cook \nMurder After Midnight - James Greenacre \nMurder After Midnight - Jean Pierre Vaquier - The Dapper Frenchman At The `Blue Anchor \nMurder After Midnight - Jeannie Donald - Helen Priestly \nMurder After Midnight - Jens Soering &amp; Elizabeth Haysom \nMurder After Midnight - John Barbot - Matthew Mills \nMurder After Midnight - John Bishop,Thomas Williams, Michael Shields, James May - (London Burkers) - Bethnal Green Murders \nMurder After Midnight - John Brook &amp; Nicholas Johnson - The Barn Restaurant Murder \nMurder After Midnight - John Christie - 10 Rillington Place \nMurder After Midnight - John Dillinger \nMurder After Midnight - John Donald Merrett (Chesney) \nMurder After Midnight - John F. Kennedy Assassination \nMurder After Midnight - John George Haigh - Acid Bath Murderer \nMurder After Midnight - John Nichols Thom (Mad Tom) \nMurder After Midnight - John Wayne Gacy, Jr. - The Clown That Killed \nMurder After Midnight - JonBenÃƒÂ©t Patricia Ramsey - Child Beauty Pageant \nMurder After Midnight - Josslyn Hay, 22nd Earl Of Erroll - Delves Broughton \nMurder After Midnight - Kate (Bloody Benders) Bender \nMurder After Midnight - Kate (Catherine Lawler) Webster - The Barnes Mystery \nMurder After Midnight - Kenneth Erskine - The Stockwell Strangler \nMurder After Midnight - Lindy Chamberlain-Creighton - Dingo \nMurder After Midnight - Little Eva Coo (nÃƒÂ©e Eva Curry) \nMurder After Midnight - Little Willy (William) Starchfield \nMurder After Midnight - Lizzie Borden \nMurder After Midnight - Lord Lucan \nMurder After Midnight - Luxtons - West Chapple Farm \nMurder After Midnight - Madame Marie-Marguerite (Alibert) Laurent Fahmy \nMurder After Midnight - Madeleine Hamilton Smith - Pierre Emile L'Angelier \nMurder After Midnight - Marbella Strangeways - Major George Strangeways \nMurder After Midnight - Maria Marten - William Corder - The Red Barn Murder \nMurder After Midnight - Marilyn Monroe \nMurder After Midnight - Marvin Gaye \nMurder After Midnight - Mary (Margaret) Eleanor Wheeler \nMurder After Midnight - Mary Blandy \nMurder After Midnight - Mary Queen Of Scots \nMurder After Midnight - Mia Walters &amp; Sergeant Emmett-Dunne \nMurder After Midnight - Michael Lupo \nMurder After Midnight - Mormon Mark William Hofmann \nMurder After Midnight - Morris Brewer - The Virgin Murder \nMurder After Midnight - Mrs Alice Wheeldon \nMurder After Midnight - Mrs. Elvira Dolores Barney - Michael Stephen \nMurder After Midnight - Murder In Paris \nMurder After Midnight - Murder Of Alfred Oliver - Philip Yale Drew \nMurder After Midnight - Murf The Surf (Jack Roland Murphy) \nMurder After Midnight - OJ Simpson \nMurder After Midnight - Pamela Ann (Wojas) Smart - Gregory Smart \nMurder After Midnight - Paul Helfeld &amp; Jacob Lepidus - The Tottenham Outrage \nMurder After Midnight - Peter Manuel - The Beast Of Birkenshaw \nMurder After Midnight - Peter William Sutcliffe - The Yorkshire Ripper \nMurder After Midnight - Police Sergeant Stephen Jones - Madealline Jones \nMurder After Midnight - Pope John Paul I (Albino Luciani) \nMurder After Midnight - Professor John White Webster (Harvard) - The Parkman Murder \nMurder After Midnight - Professor William Douglas \nMurder After Midnight - Rachel Nickell - The Wimbledon Common Murder \nMurder After Midnight - Rasputin \nMurder After Midnight - Raymond Sidney Cook -  Eric Jones -  Valerie 'Kim'  Dorothy Newell \nMurder After Midnight - Richard Archer Prince (William Archer Flint) - William Terriss \nMurder After Midnight - Robert Christian Hansen \nMurder After Midnight - Robert Emmet Chambers, Jr - Preppie Killer \nMurder After Midnight - Ronald True - Olive (Gertrude Yates) Young \nMurder After Midnight - Ruth Ellis \nMurder After Midnight - Sean Richard Sellers - The Oklahoma Devil Worshiper \nMurder After Midnight - Sir Edmund Berry Godfrey \nMurder After Midnight - Sir James Graham - Nicked By The Railway Men \nMurder After Midnight - Sir Thomas Overbury - Robert Carr \nMurder After Midnight - Special Crime Caper [b]&lt;&lt; Parts 01 &amp; 02[/b] \nMurder After Midnight - Starr Faithfull - Long Island Boat Party \nMurder After Midnight - Staunton Saga - The Penge Murder Mystery \nMurder After Midnight - Steinie Morrison - Leon Beron \nMurder After Midnight - Stephen Lawrence \nMurder After Midnight - Susanna (Auntie Susi) Olah \nMurder After Midnight - The Krays \nMurder After Midnight - Thomas Cullen Davis \nMurder After Midnight - Thomas Greenaway - Wicked Weeping Billy White \nMurder After Midnight - Thomas Henry Hocker - Eugene de la Rue \nMurder After Midnight - Toni (Cecil England) Mancini &amp; Violette (May Watts) Kaye - The Brighton Trunk Murders \nMurder After Midnight - Violet Sydney - Croydon Family Poisonings \nMurder After Midnight - Weldon Atherston Thomas Weldon Anderson) \nMurder After Midnight - William De Marisco \nMurder After Midnight - William Desmond Taylor \nMurder After Midnight - Winnie Ruth McKinnell Juddi - The Trunk Murderess \nMurder After Midnight - Yakov Peters (Jacob Peters) v Peter The Painter (Peter Piaktow) \n\n\n\nAudio Format : MP3\nDuration : 5 to 56mn 1s\nBit rate mode : Constant\nBit rate : 64 Kbps\nChannel(s) : 2 channels\nSampling rate : 22.1 KHz\nResolution : 16 bits\n \n\n\n[","torrent":{"xt":"urn:btih:aa91ea501f9e8e9069b2c6f0ada60fcbbdae893f","amp;dn":"Murder+After+Midnight+-+Murder+Cases+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa91ea501f9e8e9069b2c6f0ada60fcbbdae893f","infoHashBuffer":{"type":"Buffer","data":[170,145,234,80,31,158,142,144,105,178,198,240,173,166,15,203,189,174,137,63]},"announce":[],"urlList":[]}}