{"title":"From Mamb Hip Hop: A Bronx Tale","uid":5565354,"size":2172083004,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aaf749ba8cd0ac636ea6d3f96801196846eab74a&amp;dn=From+Mamb+Hip+Hop%3A+A+Bronx+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubusdemonoid","files":-1,"time":1273963374,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\n\n\nFrom Mambo to Hip Hop: A Bronx Tale is an hour-long documentary that tells a story about the creative life of the South Bronx, beginning with the Puerto Rican migration and the adoption of Cuban rhythms to create the New York salsa sound; continuing with the fires that destroyed the neighborhood but not the creative spirit of its people; chronicling the rise of hip hop from the ashes; and ending with reflections on the power of the neighborhood's music to ensure the survival of several generations of its residents, and, in the process, take the world's pop culture by storm.\n\nThe DVD features Angel RodrÃƒÂ­guez, Benny Bonilla, Bobby Sanabria, Bom 5, Carlos &quot;Charlie Chase&quot; Mandes, Clemente &quot;Kid Freeze&quot; Moreno, Curtis &quot;Caz&quot; Brown, David Gonzalez, Mr. and Mrs. Salsa, Eddie Palmieri, Emma RodrÃƒÂ­guez, Jean Manuel Massenya, Louis Mercado, Luis &quot;Trace&quot; Otero, Luis &quot;Track II&quot; Mateo, Luis Chalusian, Orlando MarÃƒÂ­n, &quot;Popmaster Fabel&quot; PabÃƒÂ³n, Ray Barretto, Sandra MarÃƒÂ­a Esteves, Tony &quot;Peanuts&quot; Aubert, Willie ColÃƒÂ³n and also Featuring Rock Steady Crew and Dnynamic Rockers.\n\nBonus Materials include extra Interviews with: Mike Amadeo, Joe Conzo Sr., Marta Moreno Vega, DJ Hess, Paula Grillo, Jo-Jo Torres, Orlando MarÃƒÂ­n, Pebblee Poo, as well as outtakes of featured artists.\n\nI've included the soft-coded Spanish subtitles (only subs on DVD).\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:aaf749ba8cd0ac636ea6d3f96801196846eab74a","amp;dn":"From+Mamb+Hip+Hop%3A+A+Bronx+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf749ba8cd0ac636ea6d3f96801196846eab74a","infoHashBuffer":{"type":"Buffer","data":[170,247,73,186,140,208,172,99,110,166,211,249,104,1,25,104,70,234,183,74]},"announce":[],"urlList":[]}}