{"title":"Secularisations and Their Debates (2013) [PDF]","uid":10566829,"size":2229031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab3ee2ae665cc89a210a3b99ea6faa812af865d2&amp;dn=Secularisations+and+Their+Debates+%282013%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405530409,"description":"Title: Secularisations and Their Debates - Perspectives on the Return of Religion in the Contemporary West \nEditors: Matthew Sharpe, Dylan Nickelson\nCategory: Academic/Religion\nSeries: Sophia Studies in Cross-cultural Philosophy of Traditions and Cultures (Book 5)\nPublisher: Springer; 2014 edition (November 12, 2013)\nLanguage: English\nISBN-10: 9400771150\nISBN-13: 978-9400771154 \n\nPromotional info/Publisher's summary - &quot;This volume explores timely topics in contemporary political and social debates, including: the new atheisms, the debate between Habermas and the Pope on the fate of modernity, and the impact of new scientific developments on traditional religions.\n\nThis book collects articles first presented at the Deakin University &quot;World in Crisis&quot; workshop, held November 2010 by leading Australasian philosophers and theologians. It addresses questions raised by the recent, much-touted return to religion, including possible reasons for the return and its practical, political, and intellectual prospects.\n\nSecularisation and Their Debates is not afraid to provide answers to such questions as:\n\nIs religion only ever a force of political reaction in modernity, or are there resources in it which progressive, even secular social movements, could engage with or adopt?\nAre the new atheisms, or on the opposite side, the new fundamentalisms, really novel phenomena, or has religion only ever been artificially sidelined in the modern Western states?\nHas modern liberalism only really been kidding itself about its non-doctrinal neutrality between different faiths, and if so, what should follow?\nThis book will appeal to researchers in the philosophy of religion, social sciences, political philosophy, and anthropology.&quot;\n\nThis torrent contains a fully indexed, browse-able and searchable copy of the book in PDF form. The front cover image is also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:ab3ee2ae665cc89a210a3b99ea6faa812af865d2","amp;dn":"Secularisations+and+Their+Debates+%282013%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab3ee2ae665cc89a210a3b99ea6faa812af865d2","infoHashBuffer":{"type":"Buffer","data":[171,62,226,174,102,92,200,154,33,10,59,153,234,111,170,129,42,248,101,210]},"announce":[],"urlList":[]}}