{"title":"NCH FlexiServer v1.77 with Key [TorDigger]","uid":7852975,"size":3457433,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab5548fd612ef7c6a543962053f8556844152198&amp;dn=NCH+FlexiServer+v1.77+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1353665821,"description":"FlexiServer Productivity &amp; Attendance Software\n\n\nEasily track employee attendance and computer usage\n\nFlexiServer tracks staff hours and computer activity. It makes tracking hours worked, vacation and sick leave easier for both HR and employees. It also has computer usage monitoring for quality control, security or legal compliance.\n\nTrack staff check in times and working hours\nKnow what your staff is working on\nCreate a flexible working environment\nView reports for each employee\nTrack Employee Hours and Attendance\n\nFlexiServer is software for automatic employee time attendance logging. It also features additional tools for quality assurance monitoring and reporting, and works with home or remote employees.\n\nKnow What Staff Members Are Working On\n\nFlexiServer gives managers the confidence they need to know that things are getting done without needing to micro-manage. Monitoring is non-invasive and respects the employees' need for privacy, allowing them to enter private mode when necessary, while creating a paper trail that can be referenced should there be need.\n\nCreate a Flexible Working Environment\n\nWith FlexiServer you can track and monitor employee hours from a remote location. Simply have work-at-home staff or other remote employees install FlexiStaion to monitor the hours put in away from the office.\nImprove Productivity and Efficiency\n\nImprove the way your business operates by using reports for job-costing. Know exactly what tasks your staff is working on and which are taking the most time. See what percentages of a staff member's time are spent in each application.\nAdditional Benefits\n\nEmployees don't need to fill out time sheets to record their hours\nEmployers don't need to constantly remind staff to record and submit their hours\nHuman Resources and managers have 24/7 access to hours and reports\nManagement can easily monitor outsourced, contract or remote employees\nEmployees can work more flexible hours, working when and where they want\nPrevent computer or misuse such as viewing pornography or illegal downloads\n\nFeatures\n\nLogs employee time attendance automatically\nDetects breaks and idle time automatically\nAlternatively enter hours manually through a web form\nPrivate mode available to employees for extra privacy on breaks or when completing personal tasks\nTakes and archives screenshots on five minute intervals\nLink hours and attendance information to payroll software\nShows the online status of all team members\nReal time screen monitoring available for Quality Assurance\nEmail monitoring can store all emails sent by employees\nGenerate reports on employee application and document usage\nNo extra hardware or dedicated server is required, FlexiServer can run on an HR or manager's computer\nWorks behind fire walls and routers\nCan be used over the internet or a local network\n\nHow It Works\n\nThe manager or bookkeeper runs FlexiServer on their computer. Whenever the manager or bookkeeper wants to view reports they can log onto FlexiServer with their web browser and use the control panel.\nAll staff then run FlexiStation on their computers. FlexiStation runs in the background logging hours worked. Workstations will monitor hours even if the FlexiServer computer is offline, all the cached data will be sent to FlexiServer when it comes back online. FlexiStation provides employees a subset of features so they can manually enter hours, view individual reports, request time-off or report a colleague who has called in sick.\n\nSystem Requirements:\n\nFlexiServer - For the Main Computer\t\nWorks on Windows 7, XP, Vista and 8\nThis can be a manager's computer. No dedicated server is required.\n\nHomepage: http://www.nchsoftware.com/flexi/index.html\n\nInstallation Instructions:\n\n1. Install program.\n2. Use given key to register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:ab5548fd612ef7c6a543962053f8556844152198","amp;dn":"NCH+FlexiServer+v1.77+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab5548fd612ef7c6a543962053f8556844152198","infoHashBuffer":{"type":"Buffer","data":[171,85,72,253,97,46,247,198,165,67,150,32,83,248,85,104,68,21,33,152]},"announce":[],"urlList":[]}}