{"title":"Need for Speed Most Wanted-SKIDROW","uid":7771820,"size":5694237200,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:abb45880cb76b4315a00a9ccfbdadab60fbe8770&amp;dn=Need+for+Speed+Most+Wanted-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tykoon123","files":2,"time":1351548458,"description":"S K I D R O W\n.the leading force.\n\nproudly presents\nNeed for Speed: Most Wanted (c) Electronic Arts\n\n29-10-2012......Release Date - Protection................EACore\nRacing.............Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nNeed for Speed: Most Wanted is an open world Racing game. The game is\nthe 19th release in the long-running Need for Speed franchise, but\nhearkens back to the earliest games in the series as players compete\nin races with police unified against them. Races have a set beginning\nand end point, with the open world game design allowing players to\ncomplete each using whatever path they can find. Additional features\nof performance include a unique blend of Simulation and Arcade\ngameplay, social play options through the Autolog 2 feature, exciting\nmultiplayer support, and a large selection of vehicles.\n\nElude the Cops, and Competitors in Open World Racing Play\n\nTo be &quot;Most Wanted,&quot; players need to outrun the cops, out drive your\nfriends, and outsmart your rivals. With a relentless police force\ngunning to take you down, you'll need to make split second decisions.\nUse the open world to your advantage to find hiding spots, hit jumps\nand earn new vehicles to keep you one step ahead. In true Criterion\nGames fashion, your friends are at the heart of your experience. In\nan open world with no menus or lobbies, you'll be able to instantly\nchallenge your friends and prove your driving skill in a variety of\nseamless multiplayer events. Your rivals will do everything they can\nto stop you from getting to the top. In this world, only one thing is\ncertain - there can only be one &quot;Most Wanted.&quot;\n\nTake to the streets and become the Most Wanted driver in Fairhaven\nCity.\n\nFeatures:\n\nOpen World Action - Lose the cops, your way. Hit jumps and shortcuts,\nlay low, or shake the cops in surroundings that play to your car's\nunique strengths. Freedom is everything. Drive anywhere with your\nfriends, discover hidden gameplay or utilize your knowledge of the\ncity to beat them in a never-ending supply of challenges.\n\nNonstop Multiplayer - Pick a car, hook up with friends and jump into a\nnonstop playlist of tight, competitive events. No lobby screens means\nthe action never stops. Score big, rank up and earn endless rewards\nand upgrades. Keep the fierce rivalries going between events with\nendless opportunities to race, battle and explore in a huge open world.\n\nBeat Your Friends - Autolog 2 ratchets up the intense competition with\npersonalized race recommendations and feeds broadcasting all of your\nmost newsworthy scores, speeds and times to your friends. Earn Need for\nSpeed points at all times on any system as you try to out drive your\nfriends and become the Most Wanted.\n\nRacing Without Rules - It's survival of the fastest as Need for Speed:\nMost Wanted fuses the franchise's, authentic &quot;real car&quot; feel with the\nintense speed and aggression of Burnout. Power down, slide out, and\nbattle your way past cops and rivals using pure driving skill, and\nheavy doses of nitrous.\n\nThe Best Performance Cars - Need for Speed: Most Wanted features the\nmost high-profile performance vehicles around. A sampling of these\ninclude: Porsche 911 Carrera S, BMW M3 Coupe, Lamborghini Aventador\nLP 700-4, Ford Mustang Boss 302, and Subaru Cosworth Impreza STI CS400.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:abb45880cb76b4315a00a9ccfbdadab60fbe8770","amp;dn":"Need+for+Speed+Most+Wanted-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abb45880cb76b4315a00a9ccfbdadab60fbe8770","infoHashBuffer":{"type":"Buffer","data":[171,180,88,128,203,118,180,49,90,0,169,204,251,218,218,182,15,190,135,112]},"announce":[],"urlList":[]}}