{"title":"Clasico NÃ‚Âº16: La bella durmiente","uid":4529073,"size":734289920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:abe60528f51cadcb6fbdd600ab100bcd5d004b07&amp;dn=Clasico+N%C3%82%C2%BA16%3A+La+bella+durmiente&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NITRISH","files":1,"time":1227478619,"description":"A la ceremonia de bautismo de la princesa Aurora fueron invitadas tres hadas buenas, pero no MalÃƒÂ©fica, el hada mala. Las tres hadas buenas, Flora, Fauna y Primavera, le concedieron dones. Flora, la belleza; Fauna, una hermosa voz . Cuando la tercera iba a hacer su regalo, irrumpiÃƒÂ³ en el castillo MalÃƒÂ©fica, molesta por no haber sido invitada, y lanzÃƒÂ³ a Aurora una maldiciÃƒÂ³n, segÃƒÂºn la cual morirÃƒÂ­a al pincharse con el huso de una rueca el mismo dÃƒÂ­a en que cumpliese diecisÃƒÂ©is aÃƒÂ±os. Afortundamente, Primavera no habÃƒÂ­a hecho todavÃƒÂ­a su regalo a Aurora, y usÃƒÂ³ sus poderes para cambiar la maldiciÃƒÂ³n de MalÃƒÂ©fica: Aurora no morirÃƒÂ­a al pincharse con la rueca, sino que ÃƒÂºnicamente caerÃƒÂ­a en un profundo sueÃƒÂ±o, del que sÃƒÂ³lo podrÃƒÂ­a despertarla un beso de su verdadero amor. Para proteger a Aurora de MalÃƒÂ©fica, las hadas buenas la llevaron a vivir con ellas en el bosque, y le cambiaron el nombre por Rosa.\n\nRosa creciÃƒÂ³ sin saber que era una princesa, y se convirtiÃƒÂ³ en una hermosa mujer. Un dÃƒÂ­a, sus tres &quot;tÃƒÂ­as&quot;, Flora, Fauna y Primavera, la enviaron a recoger fresas. Mientras cantaba, fue escuchada por el prÃƒÂ­ncipe Felipe, que cazaba en el bosque. Se encontraron, y al instante se enamoraron el uno del otro, aunque cada uno de ellos desconocÃƒÂ­a la identidad del otro. (En este pasaje se encuentra la canciÃƒÂ³n &quot;Once Upon a Dream&quot;, que se ha convertido en un clÃƒÂ¡sico de las pelÃƒÂ­culas de Disney). Se despidieron con la promesa de encontrarse de nuevo esa misma noche, pero, al regresar a casa, sus &quot;tÃƒÂ­as&quot; la esperaban para revelarle su verdadera identidad y su compromiso matrimonial con un prÃƒÂ­ncipe llamado Felipe.\n\nLas hadas y Aurora regresaron al castillo de los padres de la princesaÃ‚Â´, donde iba a celebrarse su fiesta de cumpleaÃƒÂ±os. AtraÃƒÂ­da por la magia de MalÃƒÂ©fica, Aurora subiÃƒÂ³ a una habitaciÃƒÂ³n del castillo que llevaba tiempo sin usarse, en la que encontrÃƒÂ³ una rueca. Se pinchÃƒÂ³ el dedo y cayÃƒÂ³ en un profundo sueÃƒÂ±o. Las hadas llevaron a la dormida Aurora a la la torre mÃƒÂ¡s alta del castillo y la depositaron en la cama, con una rosa roja en la mano. Hicieron que todo el reino cayera en el mismo sueÃƒÂ±o que Aurora. Felipe habÃƒÂ­a sido capturado por MalÃƒÂ©fica para evitar que besara a Aurora y la despertarÃƒÂ¡, pero las tres hadas buenas le ayudaron a escapar y le explicaron la historia de la maldiciÃƒÂ³n. Felipe logrÃƒÂ³ dar muerte a MalÃƒÂ©fica y rompiÃƒÂ³ el hechizo con un beso. Al final de la pelÃƒÂ­cula los dos amantes bailan juntos, felices al averiguar que estaban prometidos desde su nacimiento.\n","torrent":{"xt":"urn:btih:abe60528f51cadcb6fbdd600ab100bcd5d004b07","amp;dn":"Clasico+N%C3%82%C2%BA16%3A+La+bella+durmiente","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe60528f51cadcb6fbdd600ab100bcd5d004b07","infoHashBuffer":{"type":"Buffer","data":[171,230,5,40,245,28,173,203,111,189,214,0,171,16,11,205,93,0,75,7]},"announce":[],"urlList":[]}}