{"title":"Jay and Silent Bob Strike Back(2001)DVDRip.AC3(ENG)-DROCK","uid":6495411,"size":732038148,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac8ed8e3982b3b23338377500646f801454011a3&amp;dn=Jay+and+Silent+Bob+Strike+Back%282001%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1309045671,"description":"The frequently recurring title characters, employed by writer and director Kevin Smith as supporting players in several of his films, are put to rest with this comedy that focuses on them exclusively. Jay (Jason Mews) and Silent Bob (Smith) are a pair of stoned New Jersey slackers who have long been used as the templates for a pair of popular comic book heroes, Bluntman and Chronic. When they learn that their alter egos are to be turned into a major motion picture without their consent or compensation, the pair sets off for Hollywood to sabotage the production. Along the way, they encounter an ape, a nun (Carrie Fisher), the cast of Scooby-Doo, a Charlie's Angels-style band of sexy women who use them as stool pigeons in a diamond heist, and an unhinged wildlife ranger (Will Ferrell). They also meet up with some regulars from the Smith canon, including Alyssa Jones (Joey Lauren Adams), Brian O'Halloran as Dante Hicks, Jason Lee as Banky Edwards, Alanis Morissette as God, and actors Ben Affleck and Matt Damon in dual roles as themselves and two other familiar characters. Jay and Silent Bob Strike Back co-stars numerous other recognizable performers in roles of various sizes, including Shannen Doherty, Jason Biggs, James Van Der Beek, Shannon Elizabeth, Tracy Morgan, Judd Nelson, Chris Rock, and George Carlin, among others. \n\nRipped with Handbrake.\n\nLength: 1 Hour 44 Minutes","torrent":{"xt":"urn:btih:ac8ed8e3982b3b23338377500646f801454011a3","amp;dn":"Jay+and+Silent+Bob+Strike+Back%282001%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8ed8e3982b3b23338377500646f801454011a3","infoHashBuffer":{"type":"Buffer","data":[172,142,216,227,152,43,59,35,51,131,119,80,6,70,248,1,69,64,17,163]},"announce":[],"urlList":[]}}