{"title":"Antonio.Negri.A.Revolt.That.Never.Ends.2004.DVDRip.XviD-AUTONOMi","uid":4559026,"size":528424644,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:acd9bf5723ffdcb7420a0a3ea9673217d996dfd2&amp;dn=Antonio.Negri.A.Revolt.That.Never.Ends.2004.DVDRip.XviD-AUTONOMi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Toba","files":-1,"time":1228599948,"description":"Over the years, few intellectuals have experienced as much admiration and hatred as Antonio Negri. His international best-selling book, Empire, a critical analysis of the new global economy coauthored with Michael Hardt, was hailed as a new manifesto for the 21st century, and turned Negri into a leading spokesperson for the international anti-globalization movement. Antonio Negri: A Revolt that Never Ends profiles the controversial life and times of this important moral and political philosopher, militant, prisoner, refugee, and so-called &quot;enemy of the state.&quot; It traces his roots in the radical left-wing movements in Italy during the 60s and 70s, illustrated through incredible archival footage of strikes, factory occupations, terrorist actions, violent street confrontations, and government trials of dissidents. During these tumultuous decades Negri spent ten years in prison and fourteen years in Parisian exile, where he contributed to philosophical debates with authors such as Gilles Deleuze. The film features interviews with Negri (conducted following his April 2003 release from confinement), public speaking appearances, plus commentary from his coauthor Michael Hardt, and Italian and French colleagues. Antonio Negri explores this visionary theoretician's lifelong political struggle, now being expressed in works of contemporary relevance such as Empire and its sequel, Multitude: War and Democracy in the Age of Empire, a powerful intellectual project in protest of the new global order.","torrent":{"xt":"urn:btih:acd9bf5723ffdcb7420a0a3ea9673217d996dfd2","amp;dn":"Antonio.Negri.A.Revolt.That.Never.Ends.2004.DVDRip.XviD-AUTONOMi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd9bf5723ffdcb7420a0a3ea9673217d996dfd2","infoHashBuffer":{"type":"Buffer","data":[172,217,191,87,35,255,220,183,66,10,10,62,169,103,50,23,217,150,223,210]},"announce":[],"urlList":[]}}