{"title":"Star Wars: Riptide (by Paul S. Kemp)","uid":9185453,"size":293102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad50d616c4b94cb1a717df1c139326fbc992306f&amp;dn=Star+Wars%3A+Riptide+%28by+Paul+S.+Kemp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timberley","files":-1,"time":1384293031,"description":"Riptide is a paperback novel by Paul S. Kemp. It is the sequel to Crosscurrent, also by Kemp, and was released on October 25, 2011.\n\nThe book features Jaden Korr as one of the main characters. He is a Jedi Knight best known as a main character of a 2003 videogame Star Wars: Jedi Knight: Jedi Academy.\n\n==Publisher's summary==\nWhen a ship full of Sith warriors arrived in Galactic Alliance space, the fight to destroy it accidentally uncovered a deadly menace: a long-hidden group of clones, secretly created as insidious weapons capable of wielding the Force and heedless of the differences between light side and dark side. Now the clones have escaped -- and evidence suggests they are flawed by genetic disease and violent madness.\n\nJedi Knight Jaden Korr pursues the clones, hoping to heal them but prepared to destroy them. What he doesn't know is that Sith agents are hot on his heels, determined not only to recover the clones for their Master but to capture Jaden for their own dark-side purposes. In a life-or-death battle, Jaden will confront a shocking reality that will rock him to his core and bring him face-to-face with the question of what makes a man... and a Jedi. ","torrent":{"xt":"urn:btih:ad50d616c4b94cb1a717df1c139326fbc992306f","amp;dn":"Star+Wars%3A+Riptide+%28by+Paul+S.+Kemp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad50d616c4b94cb1a717df1c139326fbc992306f","infoHashBuffer":{"type":"Buffer","data":[173,80,214,22,196,185,76,177,167,23,223,28,19,147,38,251,201,146,48,111]},"announce":[],"urlList":[]}}