{"title":"Bones.S02E01.HDTV.XviD-LOL.avi","uid":3517868,"size":366987264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ad6de9f5f48bfe34eddd6a49224fffa96efd2cca&amp;dn=Bones.S02E01.HDTV.XviD-LOL.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kopimi","files":1,"time":1157069663,"description":"Bones\n\nFrom executive producers Barry Josephson and Hart Hanson comes the darkly amusing drama Bones, inspired by real-life forensic anthropologist and novelist Kathy Reichs. Forensic anthropologist Dr. Temperence Brennan, who works at the Jeffersonian Institution and writes novels as a sideline, has an uncanny ability to read clues left behind in a victim&amp;#039;s bones. Consequently, law enforcement calls her in to assist with murder investigations when the remains are so badly decomposed, burned, or destroyed that the standard identification methods are useless. Brennan&amp;#039;s equally brilliant colleagues at the Jeffersonian&amp;#039;s Medico-Legal Lab include earthy and bawdy Angela Montenegro, who&amp;#039;s created a unique way to render an original crime scene in a three-dimensional computer image; Brennan&amp;#039;s assistant, Zack Addy, a young prodigy whose genius IQ actually gets in the way of his finishing the several doctorates he&amp;#039;s begun; &quot;the bug guy&quot;, Dr. Jack Hodgins, who&amp;#039;s an expert on insects, spores and minerals, but conspiracy is his hobby; and Brennan&amp;#039;s boss, imposing lab director Dr. Daniel Goodman. Brennan often finds herself teamed with Special Agent Seely Booth, a former Army sniper who mistrusts science and scientists when it comes to solving crimes. Brennan and Booth clash both professionally and personally, but so far the chemistry between them has only played out in a fictionalized account in Brennan&amp;#039;s lastest mystery novel.\n\nSeason 2, Episode 1 &quot;The Titan on the Tracks&quot;\n","torrent":{"xt":"urn:btih:ad6de9f5f48bfe34eddd6a49224fffa96efd2cca","amp;dn":"Bones.S02E01.HDTV.XviD-LOL.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad6de9f5f48bfe34eddd6a49224fffa96efd2cca","infoHashBuffer":{"type":"Buffer","data":[173,109,233,245,244,139,254,52,237,221,106,73,34,79,255,169,110,253,44,202]},"announce":[],"urlList":[]}}