{"title":"Sexually Broken--TWO blonde pixies Odette Delacroix and Emma Hai","uid":9791411,"size":630289359,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:adf7768685917955112b67738a58e1c85d496e4f&amp;dn=Sexually+Broken--TWO+blonde+pixies+Odette+Delacroix+and+Emma+Hai&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1395252934,"description":"\nTWO blonde pixies Odette Delacroix and Emma Haize tag teamed by cock! Brutal deep throat, squirting! | Odette Delacroix | Emma Haize | Matt Williams\n\nMarch 14, 2014\n\n\nLow bitrate MP4 and iPod + Pics.\n\n\nIn a tag team for the ages, today at Sexuallybroken we have not one but TWO adorable, tiny, blonde pigtailed pixies with serious deep throat skills ready to be completely destroyed by cock. Both Odette Delacroix and Emma Haize are as cute as they come, and combined are more adorable then a bag of kittens. In this case, these kittens are going to get stuffed full of dick until their eyes water.\n\nBound on our well used fuck table, Emma Haize is in a very unique position that actually incorporates in her shoes as part of her bondage. The classic fuck me position gets a fresh twist with a metal bar that goes through the heels of her shoes, keeping her legs up towards the ceiling where they belong. Odette is bound and bolted to the floor with her skinny legs spread wide and a vibrator shoved between them. Their precious heads are side by side, allowing them to share every moan and shriek. It is go time.\n\nThe cocks run a train on these pixies. We will not be satisfied until we have tattooed our initials on their tonsils. For as little as they are, both of them bring some serious dick sucking skills to the table. All 10 inches of the BBC disappear completely down Odette's greedy little gullet. As Odette gets her throat plowed, Emma is getting her tiny shaved pussy reshaped. The vibrator is pulling orgasm after orgasm out, the rock hard cock makes them cum helplessly. Their moans of pleasure echo off of the walls of the studio, only interrupted when the cocks are shoved down their throats.\n\nIt is a blowjobageddon. These two suck themselves silly, and Emma is fucked ragged. Not content with the orgasms the cock is milking out of Emma, we finger blast her until she squirts. The fingers own her pussy, she literally can not help herself. We milk the squirt out of her pussy and fling it on her face. All the while Odette is still bound and cumming. These two have been fucked and sucked into an undone puddle of limp flesh that can not even see straight. We leave them bound and covered with their own cum. They are even cuter when cum covered. \n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_14odelacroix_ehaize2/SexuallyBroken-Odette-Delacroix-Emma-Haize-Matt-Williams-TWO-blonde-pixies-Odette-Delacroix-and-Emma-Haize-tag-teamed-by-cock-Brutal-deep-throat-squirting.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_14odelacroix_ehaize2/SexuallyBroken-Odette-Delacroix-Emma-Haize-Matt-Williams-TWO-blonde-pixies-Odette-Delacroix-and-Emma-Haize-tag-teamed-by-cock-Brutal-deep-throat-squirting.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n  &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:adf7768685917955112b67738a58e1c85d496e4f","amp;dn":"Sexually+Broken--TWO+blonde+pixies+Odette+Delacroix+and+Emma+Hai","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf7768685917955112b67738a58e1c85d496e4f","infoHashBuffer":{"type":"Buffer","data":[173,247,118,134,133,145,121,85,17,43,103,115,138,88,225,200,93,73,110,79]},"announce":[],"urlList":[]}}