{"title":"The Elder Scrolls Arena (Easy Install)","uid":7557299,"size":10392702,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae451c89dc46b0891be932e2fcec87776ff3d2d9&amp;dn=The+Elder+Scrolls+Arena+%28Easy+Install%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"floppytactics","files":1,"time":1345653294,"description":"The Elder Scrolls: Arena is an open world epic fantasy action role-playing video game developed by Bethesda Softworks and released in 1994 for PC DOS. It is the first game in the Elder Scrolls series. In 2004, a downloadable version of the game was made available free of charge as part of the 10th anniversary of The Elder Scrolls series, but newer systems may require an emulator such as DOSBox to run it, as Arena is a DOS-based program.[1]\n\nLike its sequels, Arena takes place in the continent of Tamriel, complete with wilderness, dungeons, and a spell creation system that allows players to mix various spell effects into a new spell as long as they have the money to pay for it.\n\n\n-----------------------------------------------------------------------------------\n\n\nInstead of having to download dosbox and doing all the manual work, Simply run the setup program like any other modern game and play from the shortcut.\n\n\nCommon FAQ:\n\n\nQ: Does it contain any viruses?\nA: No, I've made this purely for fun and comfortability. Installer is created using InnoSetup.\n\n\nQ: Where's the copy protection code? I can't get out the first dungeon!\nA: Open Arena's Manual from the start menu, the codes are on pages 4 and 5.\n\n\nQ: Game runs too fast, how do I slow this babe down?\nA: DOSBox has been preconfigured to run the game at normal speed for every system, While in the game press ESC and increase the graphics detail bar to full, it should be fine now.\n\n\n\nEnjoy! :-)\n","torrent":{"xt":"urn:btih:ae451c89dc46b0891be932e2fcec87776ff3d2d9","amp;dn":"The+Elder+Scrolls+Arena+%28Easy+Install%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae451c89dc46b0891be932e2fcec87776ff3d2d9","infoHashBuffer":{"type":"Buffer","data":[174,69,28,137,220,70,176,137,27,233,50,226,252,236,135,119,111,243,210,217]},"announce":[],"urlList":[]}}