{"title":"The Quatermass Xperiment 1955 BrRip Mp4 Lee1001","uid":9843117,"size":931743019,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aef23b9ffb443886081606c46a26609fb86dca85&amp;dn=The+Quatermass+Xperiment+1955+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":1,"time":1396025087,"description":"The Quatermass Xperiment 1955 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0049646/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0049646/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Quatermass_Xperiment&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Quatermass_Xperiment&lt;/a&gt;\nAn astronaut turns into a giant cactus monster in Val Guest's classic sci-fi thriller, based on the BBC TV serial by Nigel Kneale. The film that built the reputation of Hammer Films.\n\nThe Quatermass Xperiment is a thoughtful, hard-hitting, and bizarrely touching landmark of the sci-fi genre, endlessly referenced and recycled in subsequent film and TV.\nIt was the enormous success of this Hammer version of Nigel Kneale's TV series which began the whole horror boom in Britain. As a result of its popularity, the company decided to tackle the Frankenstein monster, and subsequently discovered that the public's appetite for myth and fantasy was practically insatiable. The theme of the film (man returns from space as a kind of monster) is by now fairly stereotyped, but it's amazing how impressive Richard Wordsworth's performance remains. Phil Leakey's make-up manages to convey the idea of a whole body in the process of decomposition; and staggering over bombsites, his deformed arm wrapped pathetically in an old overcoat, Wordsworth's Victor remains one of the most sympathetic monsters in movie history. Perhaps the most remarkable thing about the film, in retrospect, is the way in which its opening sequence mirrors so precisely the intrusion of Hammer into the cosy middle class domesticity of British cinema in the late '50s. Two insipid lovers are sent screaming from their haystack bower as a huge tubular rocket ship (looking less like a spacecraft than an enormous phallus) plunges into the ground where they have been lying.\n\nProfessor Bernard Quatermass is both excited and concerned when a rocket that he designed and launched crash-lands in the south of England. The rocket has travelled further into space than any previously manned flight, but the professor has had no contact with its three-man crew since shortly after take-off. To his relief, one of the crew, Victor Carroon, has survived, but the other two are missing, only their empty spacesuits remaining. Seeing that Carroon is in a near-comatose state, Quatermass has him taken to his laboratory, where he and his colleague, Dr Briscoe, subject him to a series of examinations. Incredibly, the astronaut appears to be undergoing some kind of physiological change, from which Quatermass deduces he must have made contact with some alien life form whilst in deep space. Carroon's wife, Judith, is equally concerned for her husband's well being. When she learns that Carroon has been moved to a hospital, she sees her chance and absconds with him, not realising that he is literally a changed man. The next day, Quatermass learns that something has broken into a zoo and drained the life of several animals. Carroon is no longer a man but is rapidly mutating into a new form of life, one that can directly absorb the life force of any plant or animal on contact. If Quatermass is right, the creature will soon be able to reproduce itself like a plant, by releasing spores into the air. Unless he can find and destroy it, the human race could be extinct within a matter of hours... \n\nThis shoestring budget sci-fier began the craze in Great Britain for the modern horror film.\n\nOne of the attractions of this film is the plethora of well-known British actors that make up the cast list. This includes Gordon Jackson, Thora Hird (magnificent as a down-and-out drunk), Lionel Jeffries and a very young Jane Asher (playing the sweetest little girl imaginable). Richard Wordsworth gives the film its most memorable performance, even though he has virtually no dialogue. \n\nVariety, published on 6 November 1956, reported that a nine-year old boy died of a ruptured artery at a cinema in Oak Park, Illinois during a showing of this.The Guinness Book of Records subsequently recorded the incident as the only known case of an audience member dying of fright while watching a horror film.\n\nVIDEO\nSize.... 888mb\n\nDuration.... 01:21:58\nCodec.... h264\nFrame Width..... 1440\nFrame Height.... 900\nData Rate.... 1387kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 123kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:aef23b9ffb443886081606c46a26609fb86dca85","amp;dn":"The+Quatermass+Xperiment+1955+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aef23b9ffb443886081606c46a26609fb86dca85","infoHashBuffer":{"type":"Buffer","data":[174,242,59,159,251,68,56,134,8,22,6,196,106,38,96,159,184,109,202,133]},"announce":[],"urlList":[]}}