{"title":"Charlaine Harris - Sookie Stackhouse 11 - Dead Reckoning","uid":6545327,"size":1485799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af3e7b96965c31498f10a3b5c1b3ceaed1a82573&amp;dn=Charlaine+Harris+-+Sookie+Stackhouse+11+-+Dead+Reckoning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brownkity","files":1,"time":1310832237,"description":"Thia is the Charlaine Harris Sookie Stackhouse Series Book (The Southern Vampire Mysteries) 11 Dead Reckoning PDF\nThe books upon which the hit HBO series True Blood is based\n\nCharlaine Harris (born November 25, 1951) is a New York Times bestselling author who has been writing mysteries for over twenty years. She was born and raised in the Mississippi River Delta area of the United States. She now lives in southern Arkansas with her husband and three children. Though her early works consisted largely of poems about ghosts and, later, teenage angst, she began writing plays when she attended Rhodes College in Memphis, Tennessee. She began to write books a few years later. Her later books have been in the urban fantasy genre.\n\n Harris created The Southern Vampire Mysteries series about a telepathic waitress named Sookie Stackhouse who works in a northern Louisiana bar. The first book in the series, Dead Until Dark, won the Anthony Award for Best Paperback Mystery in 2001. Each book follows Sookie as she tries to solve mysteries involving vampires, werewolves, and other supernatural creatures. The series has been released in Australia, New Zealand, Japan, Spain, Greece, Germany, the Netherlands, Belgium, France, Argentina, Poland, Brazil, Great Britain, Ireland, Mexico, Norway, Finland, Sweden, Lithuania, Hungary, Bulgaria, Portugal, Iceland, Czech Republic and Romania.\n\nSookie Stackhouse has proven to be so popular that Alan Ball, creator of the HBO television series Six Feet Under, announced he would undertake the production of a new HBO series based upon The Southern Vampire Mysteries. He also wrote and directed the pilot episode for the series, True Blood, which premiered on September 7, 2008 on HBO. Harris has written ten novels in the series, and the television show is a hit for HBO.\n\nThis is the only book I included in this upload...\n\n11.Dead Reckoning (May 3rd 2011)\n\nI uploaded the following books separately already.\nThe Books are as follows\n\n1.Dead Until Dark (May 2001)\n2.Living Dead in Dallas (March 2002)\n3.Club Dead (May 2003)\n4.Dead to the World (May 2004)\n5.Dead as a Doornail (May 2005)\n6.Definitely Dead (May 2006)\n7.All Together Dead (May 2007)\n8.From Dead to Worse (May 2008)\n9.Dead and Gone (May 2009)\n10.Dead in the Family (May 2010)\n\n\n\n\nAlthough HBO was slow in their release of True Blood, Charlaine Harris published the first of her series in 2001... this seems to be what the child-friendly Twilight Saga was taken from (release of the first novel, Twilight, in 2005)\nBut then again, there were many books on vampires before this, and no one has a claim on all things vampire...\n\nHave fun reading this while waiting for the HBO series on Sundays...\nI can't wait for the next book...\t\n\nIf you are looking for all of her other books, click on my username (brownkity) above to go to my profile, where you will find the rest of The Southern Vampire Mysteries there along with some other downloads.","torrent":{"xt":"urn:btih:af3e7b96965c31498f10a3b5c1b3ceaed1a82573","amp;dn":"Charlaine+Harris+-+Sookie+Stackhouse+11+-+Dead+Reckoning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af3e7b96965c31498f10a3b5c1b3ceaed1a82573","infoHashBuffer":{"type":"Buffer","data":[175,62,123,150,150,92,49,73,143,16,163,181,193,179,206,174,209,168,37,115]},"announce":[],"urlList":[]}}