{"title":"Son Kite - Colours - Remixed (2014) FLAC","uid":11445164,"size":269199032,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:afc49645ce108123d5e6ecb1d9d1770ce747727e&amp;dn=Son+Kite+-+Colours+-+Remixed+%282014%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shambu69","files":-1,"time":1415843183,"description":"\nPsy-Trance / Progressive Trance / Downtempo / Psybient\n\n\nTracklist:\n01. Let Us Be (LOUD Remix) (7:53)\n02. Games And Watch (Liquid Soul Remix) (9:01)\n03. Jukebox (Antix Remix) (10:22)\n04. The Stars Within Us (Donato Dozzy Remix) (8:29)\n05. On Air (Carbon Based Lifeforms Remix) (7:35)\n\nAbout:\nSon Kite 2014 revival!\n\nWe guess that you all remember the classic Son Kite album &quot;Colours&quot; from 2004. Widely regarded one of the trendsetting acts in the progressive scene, the Swedish duo's last album as Son Kite is a milestone and an inspiration to many.\nNow - 10 years later - we have the privilege to present a new and exclusive remix-release with 5 brand new remixes by no other than Loud, Liquid Soul, Antix, Donato Dozzy, and Carbon Based Lifeforms.\n\nThe release is separated into a part 1 and a part 2, and will be released with a few weeks in between. Expect fresh new interpretations of the highest caliber.\nThe Israeli phenomenon Loud is behind a classy remix of &quot;Let Us Be&quot;. With a 90's inspired gritty bassline they have made a heavy-hitter of a psychedelic remix for the festival dancefloors, while Liquid Soul's remix of &quot;Game And Watch&quot; is crisp, sharp and floating trance for the morning hours. Ultra smooth Liquid Soul signature sound.\n\nThe third remix is by the Antix-brothers. For almost 14 years the two from Down under have pushed the boundaries of deep and hypnotic music, and their tribal techy interpretation of &quot;Jukebox&quot; will be equally suitable in the peak-hours in a dark and sweaty club as well as at secret parties in the Australian outback.\nOn the last tracks there is less emphasis on the dance floor. Donato Dozzy has taken &quot;The Stars Within Us&quot; in an interesting direction with a mix of drony dub techno and electronica, and finally the Swedish ambient duo Carbon Based Lifeforms have made a stellar, cinematic and acidy downbeat remix for one of the biggest hits on &quot;Colours&quot;; &quot;On Air&quot;.\nA diverse and coulourful tribute to one of the best albums in the past 10 years.\n\nreleased 20 March 2014\n\nGenre: Psy-Trance, Progressive Trance, Downtempo, Psybient\nSource: WEB\nCountry: Israel\nYear of publication: 2014\nPublisher (label): Echoes Records\nFLAC (* .flac)\nAudio Bitrate: lossless\nDuration: 00:43:21\n\nSupport the artists you like by buying their music!","torrent":{"xt":"urn:btih:afc49645ce108123d5e6ecb1d9d1770ce747727e","amp;dn":"Son+Kite+-+Colours+-+Remixed+%282014%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afc49645ce108123d5e6ecb1d9d1770ce747727e","infoHashBuffer":{"type":"Buffer","data":[175,196,150,69,206,16,129,35,213,230,236,177,217,209,119,12,231,71,114,126]},"announce":[],"urlList":[]}}