{"title":"Zeitgeist The Movie (2007) [DVD - NTSC - VERY GOOD MOVIE]","uid":4011439,"size":3132396613,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b00b6c049ca548a47d3d9c72f8510edc2e5ec5e3&amp;dn=Zeitgeist+The+Movie+%282007%29+%5BDVD+-+NTSC+-+VERY+GOOD+MOVIE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lkobescak","files":4,"time":1202119051,"description":"Zeitgeist the Movie\n-------------------\n\nFormat: NTSC/DVD\n\nZeitgeist, the Movie is a 2007 web film produced by Peter Joseph that presents a number of conspiracy theories related to Christianity, the attacks of 9/11, and the Federal Reserve Bank. It was released free online via Google Video in June of 2007. A remastered version was presented as a global premiere on November 10, 2007 at the 4th Annual Artivist Film Festival &amp; Artivist Awards. The creator lists sources and an interactive transcript (which goes into more details) on his website (See link below)\n\nPart I: The Greatest Story Ever Told\nPart I evaluates Christian beliefs established in the Bible and critiques the historicity of the Bible. In furtherance of the Jesus myth hypothesis, this part argues that the historical Jesus is a literary and astrological hybrid, and that the Bible is based on astrological principles documented by many ancient civilizations, especially pertaining to movement of the sun through the sky and stars. The movie specifically mentions the story links between Jesus Christ and the Egyptian Sun God Horus. According to the movie, Religion and myths in general can be used to motivate people to be good or remember important astrological occurrences, but ultimately if the majority of people believe in something that is not true, then they are in danger of being controlled (or oppressed).\n\n\nPart II: All the World&amp;#039;s a Stage\nAccording to Part II, the United States was warned about the impending September 11, 2001 attacks, that NORAD was purposely confused through wargames to allow the planes to reach their targets, and how the World Trade Center buildings underwent a controlled demolition. Additionally, the film argues that six of the named hijackers are still alive, that Hani Hanjour could not have flown Flight 77 into the Pentagon, that the Bush Administration covered up the truth in the 9/11 Commission Report, and that the mainstream media has failed to ask important questions about the official account. The movie claims 9/11 was engineered to remove the rights of the citizens and make more money for those in power.\n\n\nPart III: Don&amp;#039;t Mind the Men Behind the Curtain\nAccording to Part III, powerful bankers have been conspiring for world domination and increased power and the rich of society have been using their wealth to increase financial panic and foster a consolidation of independent competing banks. The film details the Theory of Electronic Conspiracy and claims that the \nFederal Reserve System, the central bank of the United States, was created in order to steal the wealth of the nation. It makes claims of war profiteering by \na rich few. It describes the goal of these bankers as world power over a controllable public. This section also claims that there is a clandestine movement \nto usurp the American constitution and dollar by merging the United States, Canada and Mexico into a North American Union, a super-state similar to the European Union, which the movie maintains, together alongside with the African Union and the proposed Asian Union, will gradually be merged into a One World government. The movie concludes that under such a government, every human being will be implanted with a RFID microchip which will be used to monitor individuals and suppress dissent. The movie ends, however, on an optimistic note, expressing confidence at the overthrow of oppressive forces and the ultimate triumph of revolution.\n\n\nRun Time: 1 hr 55 min\n\n\nTo purchase a DVD copy for $5 or to watch this video with subtitles in several languages, please visit the authors websites at: www zeitgeistmovie com\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found at www infowars com or www.prisonplanet.tv\n\n------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:b00b6c049ca548a47d3d9c72f8510edc2e5ec5e3","amp;dn":"Zeitgeist+The+Movie+%282007%29+%5BDVD+-+NTSC+-+VERY+GOOD+MOVIE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b00b6c049ca548a47d3d9c72f8510edc2e5ec5e3","infoHashBuffer":{"type":"Buffer","data":[176,11,108,4,156,165,72,164,125,61,156,114,248,81,14,220,46,94,197,227]},"announce":[],"urlList":[]}}