{"title":"Goodbye My Fancy (1951) Xvid 1cd - A Joan Crawford Film [DDR]","uid":9339822,"size":759770536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1a009bc6fc8205c0e6d106bd5862a1879b6b79a&amp;dn=Goodbye+My+Fancy+%281951%29+Xvid+1cd+-+A+Joan+Crawford+Film+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1386907298,"description":"Goodbye My Fancy (1951) Xvid 1cd - A Joan Crawford Film [DDR]\n\nGoodbye, My Fancy is a 1951 romantic comedy film starring Joan Crawford, Robert Young, and Frank Lovejoy in a light tale about a woman and her old flame. Distributed by Warner Bros., the film was based on the 1948 play of same name by Fay Kanin and adapted for the screen by Ivan Goff and Ben Roberts. The film was directed by Vincent Sherman and produced by Henry Blanke. Goodbye, My Fancy was the third and last cinematic collaboration between Sherman and Crawford. The first two were Harriet Craig (1950) and The Damned Don't Cry! (1950).\n\nCAST:-\nJoan Crawford..........Agatha Reed\nRobert Young............Doctor James Merrill\nFrank Lovejoy...........Matt Cole\nEve Arden.................Miss 'Woody' Woods\nJanice Rule...............Virginia Merrill\nLurene Tuttle.............Ellen Griswold\nHoward St. John.......Claude Griswold\nViola Roache .......... Miss Shackelford\nEllen Corby............... Miss Birdshaw\nMorgan Farley.......... Doctor Pitt\nVirginia Gibson....... Mary Nell Dodge\nJohn Qualen............. Professor Dingley\n\nDirected by Vincent Sherman\nProduced by Henry Blanke\nScreenplay by Ivan Goff, Ben Roberts\nBased on \tGoodbye, My Fancy: A Comedy in Three Acts, by Fay Kanin\n\nMOVIE REVIEW:- Goodbye My Fancy (1951)\nU.S. Representative Agatha Reed (Crawford) returns to her alma mater to receive an honorary degree. Reed was expelled from the school years earlier for participating in an all-night date with young professor, Dr. James Merrill (Young), now the university president. The romantic fires are rekindled when the two meet. Matt Cole (Lovejoy), a photographer who loves Reed, believes her feeling for Merrill is simply an unresolved hold-over from her girlhood and follows her to the school.\n\nA subplot involves Reed embroiled in a university matter over progressive teaching methods with Dr. Pitt (Morgan Farley), trustee Claude Griswold (Howard St. John) and his wife Ellen Griswold (Lurene Tuttle). After a series of misunderstandings, Reed realizes she belongs with Cole and should put away her romantic fancies of Merrill. Other players in the film include Eve Arden, Janice Rule, and Ellen Corby.\n\nBased on a play by Fay Kanin, this comedy drama follows a successful congresswoman's emotional journey back to her alma mater. When Agatha Reed (Joan Crawford) is offered an honorary degree at her former college, she is forced to remember the reason she was expelled to begin with. Nearly twenty years prior, Agatha (Crawford) had an affair with Dr. James Merrill (Robert Young), one of her professors. After her departure, Dr. Merrill (Young) slowly rose through the ranks, eventually becoming the president of the school. Despite having left under less than desirable circumstances, Agatha is excited to see him and hopes to rekindle their relationship. Meanwhile, newspaper reporter Matt Cole (Frank Lovejoy), not only follow's Agatha to her former university, but unsucessfully proposes marriage. Unfortunately for him, the alumna's eyes are set firmly towards her old flame. However, once Matt (Lovejoy) and Agatha team up in a passionate attempt to update the school's outdated curriculum, she realizes who she truly loves.\n\nSYNOPSIS:- Goodbye My Fancy (1951)\nCongresswoman Agatha Reed returns to her alma mater for homecoming, although she's more interested in renewing her romance with an old flame who's now the college president. Their attempts at rekindling any sparks are thwarted by the arrival of another rival for her affections and the showing of her controversial film which could put her former beau's job in jeopardy. \n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 108 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 108 mins","torrent":{"xt":"urn:btih:b1a009bc6fc8205c0e6d106bd5862a1879b6b79a","amp;dn":"Goodbye+My+Fancy+%281951%29+Xvid+1cd+-+A+Joan+Crawford+Film+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a009bc6fc8205c0e6d106bd5862a1879b6b79a","infoHashBuffer":{"type":"Buffer","data":[177,160,9,188,111,200,32,92,14,109,16,107,213,134,42,24,121,182,183,154]},"announce":[],"urlList":[]}}