{"title":"Biblical Errancy , A Reference Guide by Dennis Mckinsey","uid":10810797,"size":34402743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1c3f6d58f81c09ca9fcf372bd8a297fdfbbbafd&amp;dn=Biblical+Errancy+%2C+A+Reference+Guide+by+Dennis+Mckinsey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kundalini666","files":1,"time":1408426956,"description":"This important new volume is the most comprehensive critique of the Bible ever written.\n\nAuthor C. Dennis McKinsey believes that Americans have only seen or heard the good things about the Bible, without any exposure to its many shortcomings. McKinsey argues that the lack of criticism of biblical writings has wrongly affected millions of people in their beliefs, allowing many to believe the Bible to be the infallible word of God. He maintains that it is becoming imperative not only that the Bible's inadequacies be exposed, but that its negative teachings be corrected.\n\nMcKinsey thinks the Bible is a deceptively inaccurate conglomeration of mythology and folklore masquerading as a valid picture of historical reality. In The Encyclopedia of Biblical Errancy, McKinsey strives to tell both the good and the bad of biblical writings with the most comprehensive and thoroughly-researched expos? of the Bible's many errors, contradictions, and fallacies. Loaded with thousands of biblical citations, The Encyclopedia of Biblical Errancy vividly proves the Bible to be its own worst enemy.\n\n_________________________________________________________________________\n\nCONCLUSION FROM THE BOOK:\n\nCONCLUSION\n\nIn light of all of the information to be found in this text, the only conclusion one can objectively formulate with respect to the Bible is that the book is a veritable cornucopia of contradictions, errors, fallacies, bad math, erroneous science, foul language, poor geography, false teachings, inaccurate prophecies, illusory promises, imprecise quotations, deceptive interpretations, and degenerate heroes. \n\nWhen all these considerations and many more are combined with the fact that the central figure for all Christians made more incorrect statements, invalid prophecies, and contradictory comments than anyone else in scripture, the biblical tragedy reaches truly monumental proportions. But certainly for all biblicists a consideration that should lie near the apex of their concerns is the plight in which they have inadvertently placed themselves by propagating scripture. While contending that atheists and those of a similar persuasion are jeopardizing their fate by not lending credibility to scripture or believing in a supreme being, they are engaging in a wager of the first magnitude from their own perspective. Not only does what they label &quot;God's word&quot; reek with all of the previously mentioned failings and inadequacies, but it repeatedly portrays God in a manner that can only be described as odious and appalling. One can only imagine the frightening fate that awaits those who have devoted so much time, energy, and wealth convincing others that the Bible is his word when God is finally given an opportunity to even the score for their ghastly and blasphemous portrayal of his alleged words and deeds.\n\n_____________________________________________________________________\n\nEnjoy!;)\n\n","torrent":{"xt":"urn:btih:b1c3f6d58f81c09ca9fcf372bd8a297fdfbbbafd","amp;dn":"Biblical+Errancy+%2C+A+Reference+Guide+by+Dennis+Mckinsey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1c3f6d58f81c09ca9fcf372bd8a297fdfbbbafd","infoHashBuffer":{"type":"Buffer","data":[177,195,246,213,143,129,192,156,169,252,243,114,189,138,41,127,223,187,186,253]},"announce":[],"urlList":[]}}