{"title":"EnigmaT Set Rips { Cuts } - June 15th, 2014","uid":10361520,"size":1187398746,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b250b1fb6ac26b151fa71a3805378328d2278f3a&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+15th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":140,"time":1402812667,"description":"EnigmaT Set Rips { Cuts } - June 15th, 2014\n\n1Touch - ID (Cut From 1Touch Set)-enTc\n2Sher - Largo (Cut From Marlo Set)-enTc\n4 eYe - Control (Cut From Palagano Set)-enTc\nA.R.D.I. - Kobia (Souhail Semlali &amp; Naoufal Lamrani vs Matt Chowski Remix) (Set Rip)-enTc\nAdam Deane - Crucial State (A &amp; Z Remix) (Cut From Maximal Set)-enTc\nAirwave - The Moment of Truth (Matt Holliday Remix) (Cut From J00F Set)-enTc\nAlexander Hristov - Sunset Beach (Oluca Remix) (Cut From SLang Set)-enTc\nAly &amp; Fila Feat. Jaren - For All Time (Avenue One Remix) (Cut From Ferry Set)-enTc\nAndrea Montorsi - Rock You (Cut From Lynam Set)-enTc\nAndy Moor - Fade To Light (ReOrder Remix) (ASOT 667 Rip)-enTc\nAnother World - Holding The Sun (Cut From Feel Set)-enTc\nAnthony Mea - Talk To Me (Ronfoller Remix) (Cut From SLang Set)-enTc\nArtra &amp; Holland - Save Me (Original Mix) (Cut From Angel Ace Set)-enTc\nArtra &amp; Holland feat. KheDa - ID (Cut From 1Touch Set)-enTc\nAudien - Serotonin (Dub Mix) (Cut From Ferry Set)-enTc\nAYDA &amp; Wach - Opena (Venus Mix) (Set Rip)-enTc\nAYDA - Pharoah (Wach Remix) (Set Rip)-enTc\nBibetic - Dinosaur (Original Mix) (Cut From Quintino Set)-enTc\nBluSkay &amp; KeyPlayer - Desolation (-SHORT- Cut From GO Set)-enTc\nCapital Cities - One Minute More (ID Remix) (-LIVE- GDJB Rip)-enTc\nChris Voro - Alter Ego (Too Dusty Remix) (Cut From Patterson Set)-enTc\nCiro Visone - The Day After (Reiklavik &amp; TrancEye Remix) (Cut From Bobina Set)-enTc\nCoe - Going Underground (Original Mix) (Cut From 1Touch Set)-enTc\nColdplay - Midnight (Markus Schulz Remix) (-LIVE- GDJB Rip)-enTc\nDaniel Skyver - Landslide (Cut From Bukovski Set)-enTc\nDaniel Tajna - Exelxi (Cut From Marlo Set)-enTc\nDanilo Ercole - Little Planet (Cut From Barone Set)-enTc\nDanjo - Hollow Glory (Moon.Bay Remix) (Cut From GO Set)-enTc\nDanny Legatto &amp; Sky Sound - Skyfire (Original Mix) (Cut From Cormack Set)-enTc\nDanny Legatto - Syriana (Original Mix) (Cut From Cormack Set)-enTc\nDany - Between Lights (Tensile Force Remix) (Cut From 9axis Set)-enTc\nDash Berlin feat. Christon Rigby - Underneath The Sky (ASOT 667 Rip)-enTc\nDeadmau5 - Phantoms Can't Hang (ASOT 667 Rip)-enTc\nDeng and Slavak - Escape From A Dying Planet (Feri Remix) (Cut From Barone Set)-enTc\nDesknights - Void (Original Mix) (Cut From Angel Ace Set)-enTc\nDezze &amp; Shoreliners - Sumr (Nigel Good Remix) (Cut From Ronde Set)-enTc\nDigital Department feat. Cara Leigh - You Put A Spell (Wild Guess' Incantation) (Cut From Config Set)-enTc\nDimitris Athanasiou - Just Think About (Cut From SLang Set)-enTc\nDJ Eco - Borealis (Andy Tau Remix) (Cut From 1Touch Set)-enTc\nDouble V - Bomber (Cut From Marlo Set)-enTc\nDuran &amp; Aytek - First Sight (Holbrook &amp; SkyKeeper Bootleg) (Cut From 1Touch Set)-enTc\nEssonita feat. Love Dimension - Like The Millions (Upfly Remix) (Cut From Feel Set)-enTc\nEximinds - Poseidon (Original Mix) (Cut From MORPH Set)-enTc\nFaruk Sabanci &amp; ReOrder - Just Livid (ASOT 667 Rip)-enTc\nFaruk Sabanci - Acid Punk (Cut From Ferry Set)-enTc\nFederico Scavo - Baion (Cut From Kiholm Set)-enTc\nFerry Tayle Feat. Suncatcher - Origami (Album Mix) (ASOT 667 Rip)-enTc\nFon.Leman - ID {GES Festival Sessions Album Mix} (Cut From M.Pravda Set)-enTc\nFrank Wannders - Java (Cut From Palagano Set)-enTc\nGaia - Empire Of Hearts (Johann Stone Remix) (ASOT 667 Rip)-enTc\nGareth Emery feat. Gavin Beach - Eye Of The Storm (1Touch Acoustic Mix) (Cut From 1Touch Set)-enTc\nGH - Cumulus (Cut From Barone Set)-enTc\nGiuseppe Ottaviani &amp; Marc van Linden - Through Your Eyes (Will Atkinson Tribal Re-Rub) (Cut From UKTuni Set)-enTc\nHassan Jewel - Perception (Nivaya Remix) (Cut From Team140 Set)-enTc\nHassan Jewel - Perception (Vlind Remix) (Cut From Saux Set)-enTc\nHenry Cullen &amp; Marcello Perri - Detatched (Cut From J00F Set)-enTc\nID - ID (1Touch Remix) (Cut From 1Touch Set)-enTc\nIlya ViG Feat. Hanna Finsen - Second Life (Alexey Ryasnyansky Remix) (Cut From Akku Set)-enTc\nIrdi - ID (Cut From 1Touch Set)-enTc\nJason Ross - Burma (Cold Blue Remix) (Cut From Patterson Set)-enTc\nJohn 00 Fleming &amp; Christopher Lawrence - Predator (Original Mix) (Cut From J00F Set)-enTc\nJohn O'Callaghan pres. Joint Operations Centre - Castlevania (Cut From Patterson Set)-enTc\nJordan Suckley &amp; Paul Webster- Help (Daniel Skyver Remix) (Cut From Suckley Set)-enTc\nK-Narf &amp; DJ T.H. feat. Gracie - Dreams (Rene Ablaze Remix) (Cut From Suckley Set)-enTc\nKam Delight - Clear Sky (Cut From GO Set)-enTc\nKarimstar - Endless Roads (Ula Remix) (Cut From Cormack Set)-enTc\nKastis Torrau &amp; Arnas D - Take Over (Cut From SLang Set)-enTc\nLunarbeam feat. Marija Trapkiewicz - Panic (Bloodgroove &amp; Kikis Remix) (Cut From Ronde Set)-enTc\nMagnus - 9 A.M. (Cut From Patterson Set)-enTc\nMark Nails feat. Molly Bancroft - Open Your Eyes (Mark Bester &amp; Winter State Mix) (Cut From Palagano Set)-enTc\nMark Nails feat. Molly Bancroft - Open Your Eyes (Mark Bester &amp; Winter State Remix) (Set Rip)-enTc\nMarkus Schulz &amp; Elevation - Finish Line (Mr. Pit Remix) (-LIVE- GDJB Rip)-enTc\nMarkus Schulz - Dancing In The Key Of Life (M.I.K.E. Push Remix) (-LIVE- GDJB Rip)-enTc\nMaRLo and Fisherman &amp; Hawkins - Forces (ASOT 667 Rip)-enTc\nMateusz - Zeal (Original Mix) (Cut From MORPH Set)-enTc\nMauro Picotto &amp; Riccardo Ferri - New Time, New Place (Markus Schulz Remix) (-LIVE- GDJB Rip)-enTc\nMaximal - ID (Cut From Maximal Set)-enTc\nMcms -The End of Consciousness (Cut From Barone Set)-enTc\nMichael A - Belle Mont (Cut From Ronde Set)-enTc\nMichael Badal - Carivale (Cut From Marlo Set)-enTc\nMichael Pilyavskiy - Tear for Peace (Original Mix) (Cut From 1Touch Set)-enTc\nMike EFEX - Machine City (-LIVE- GDJB Rip)-enTc\nMindset - Ever After (Hazem Beltagui Remix) (Cut From Barone Set)-enTc\nMino Safy - Out of Control (Original Mix) (Cut From Feel Set)-enTc\nMorvan - Wonder (Cut From Ronde Set)-enTc\nNafis - ID (Blood Groove &amp; Kikis Remix) (Cut From 1Touch Set)-enTc\nNetsky - 500 Days Of Summer (Woody Remix) (Cut From 1Touch Set)-enTc\nNianaro - Centum (Original Mix) (Cut From Angel Ace Set)-enTc\nNico Parisi &amp; Gai Barone - Perla (Dmitry Molosh Remix) (Cut From Barone Set)-enTc\nNicolas Petracca - Echoes From Outer Space (Danny Lloyd Remix) (Cut From Barone Set)-enTc\nNitrous Oxide Feat. Neev Kennedy - Let Your Heart Beat Home (Cut From Beat Service Set)-enTc\nO.B.M Notion vs. Mostfa &amp; Mostfa - Caribbean (Etasonic Remix) (Cut From Above Clouds Set)-enTc\nOBM Notion vs. Mostfa &amp; Mostfa - Caribbean (BluSkay Remix) (Cut From Indayo Set)-enTc\nPaul Hided - Centrino (Cut From RAM Set)-enTc\nPaul Oakenfold feat. Tiff Lacey - Hypnotised (ID Remix) (-LIVE- GDJB Rip)-enTc\nPaul Surety feat. Rita Raga - Beneath the Mask (Cut From Uplift Set)-enTc\nPhil Dinner - You Need Me (Dub Mix) (Cut From Bobina Set)-enTc\nPhilippe El Sisi &amp; Sarah Lynn - Look Above (Original Mix) (Cut From Saux Set)-enTc\nPlamady &amp; Magic Sound - Wonderland (Original Mix) (Cut From Feel Set)-enTc\nPlamady feat. Olya Satsiuk - Close to Me (Rave CHannel Remix) (Cut From 1Touch Set)-enTc\nPlaten &amp; Clarks - GET U (Clarks A7 Remix) (Cut From Feel Set)-enTc\nPRT Stacho - Children of War (Yuriy From Russia Remix) (Cut From Config Set)-enTc\nPsychic Element - City Skyline (2014 Remix) (Cut From Jerom Set)-enTc\nQuincy - Acid Jungle (Manu Riga Deacidified Remix) (Cut From Barone Set)-enTc\nQuintino - Go Hard (VIP EDIT) (Cut From Quintino Set)-enTc\nReii - 3 In The Shade (Cut From SLang Set)-enTc\nRene Ablaze &amp; Jam Da Bass - We Love Trance (Festival Anthem) (Cut From Cormack Set)-enTc\nRene Dale pres. STR84WARD - Sometimes (Cut From Uplift Set)-enTc\nReOrder - Beyond Horizons (Frozen Skies Club Mix) (Cut From Cormack Set)-enTc\nReOrder - Beyond Horizons (Paul Shields Remix) (Cut From UKTuni Set)-enTc\nReOrder - One Upon A Love (Den Rize Remix) (Cut From 1Touch Set)-enTc\nRichard Durand - Blast (ASOT 667 Rip)-enTc\nRobert Natus - Spektrum Paranoid (Itzaia Remix) (Cut From Patterson Set)-enTc\nRussell G - Shimmer (Cut From Barone Set)-enTc\nSean McCaff - Old School (BP Remix) (Cut From SLang Set)-enTc\nSebastian Brandt - Repercussion (Cut From Patterson Set)-enTc\nSedi - Zyzzx (Sergey Shemet Remix) (Cut From 1Touch Set)-enTc\nSied Van Riel Feat. Alicia Madison - Gravity (Sneijder Remix) (ASOT 667 Rip)-enTc\nSimon Moon Sunflare &amp; Magic Sense - Opera (Neo Kekkonen 138 Remix) (Cut From Extravagance Set)-enTc\nSolarstone &amp; Orkidea - Slowmotion III (Original Mix) (-LIVE- GDJB Rip)-enTc\nStoneface &amp; Terminal with Ronski Speed &amp; Synthea - Yuma (Progressive Mix) (Cut From Boom Jinx Set)-enTc\nSun &amp; Set - WhiteOut (Illusion Remix) (Cut From MORPH Set)-enTc\nSymbolic &amp; Vertical Mode - Moving Forward (Cut From Patterson Set)-enTc\nSyn Cole - Bright Lights (Cut From Ferry Set)-enTc\nSynchronice - Threshold (Cut From Juventa Set)-enTc\nThe Sacred Moon - Oblivion (Original Mix) (Cut From El Jay Set)-enTc\nThe Thrillseekers vs Ian Standerwick - Like They Used To (ASOT 667 Rip)-enTc\nTiesto &amp; Dzeko &amp; Torres - Can't Forget (Set Rip)-enTc\nTiesto &amp; Fred Falke Feat. Elan Lea - Calling On Angels (Set Rip)-enTc\nTiesto &amp; MOTi Feat. Denny White - Don't Hide Your Light (Set Rip)-enTc\nTim Verkruissen &amp; AM2.0 - Meet Me In Bloemendaal (Original Mix) (Cut From Cormack Set)-enTc\nTimewave - Overdrive (Cut From J00F Set)-enTc\nType 41 feat. Goshen Sai - Never Looking Back (Cut From Uplift Set)-enTc\nUDM - Recollection (Marcel Kenenberg Remix) (Cut From Cormack Set)-enTc\nUltimate - The Next Point (ASOT 667 Rip)-enTc\nVini Vici - Expender (Royal Flush Remix) (Cut From UKTuni Set)-enTc\nWitness 45 - Superhero (Cut From Team140 Set)-enTc\nXerox &amp; Illumination - Turbolance (Outsiders Remix) (Cut From J00F Set)-enTc\nXTranceproyect - Believe In Yourself (Original Mix)  (Cut From Cormack Set)-enTc\nZombie Nation - Kernkraft 400 (Beat Service Bootleg) (Cut From Beat Service Set)-enTc\n","torrent":{"xt":"urn:btih:b250b1fb6ac26b151fa71a3805378328d2278f3a","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+15th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b250b1fb6ac26b151fa71a3805378328d2278f3a","infoHashBuffer":{"type":"Buffer","data":[178,80,177,251,106,194,107,21,31,167,26,56,5,55,131,40,210,39,143,58]},"announce":[],"urlList":[]}}