{"title":"Learning Java through Applications (A Graphical Approach) [black","uid":8430766,"size":12968488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b28eabf3c9babbd33a3610aea38016db7eb31b09&amp;dn=Learning+Java+through+Applications+%28A+Graphical+Approach%29+%5Bblack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"black-14","files":-1,"time":1367482228,"description":"Learning Java Through Applications emphasizes Java's graphical capabilities and the ability to create graphical user interfaces. The book uses 15 complete Java programs in order of increasing complexity, including geometric patterns, games, puzzles, number theory problems, and cryptography, to teach students the Java programming language and concepts. New features of Java 5.0 are covered in detail, including enumerated types, &quot;for-each&quot; statements, generics, autoboxing, and static imports. Each chapter contains a capstone program that involves graphics and illustrates the language features introduced in that chapter. The specifications for the program are discussed first, followed by the code and its explanatory text emphasizing the programming techniques used. Because complete programs are included, programmers have the opportunity to explore the design choices involved. Additionally, UML diagrams are included when appropriate to help them understand the overall design of each example. ","torrent":{"xt":"urn:btih:b28eabf3c9babbd33a3610aea38016db7eb31b09","amp;dn":"Learning+Java+through+Applications+%28A+Graphical+Approach%29+%5Bblack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28eabf3c9babbd33a3610aea38016db7eb31b09","infoHashBuffer":{"type":"Buffer","data":[178,142,171,243,201,186,187,211,58,54,16,174,163,128,22,219,126,179,27,9]},"announce":[],"urlList":[]}}