{"title":"Evangelion 1.11 Blu-Ray HD Rip 1080p (Eng)","uid":6323123,"size":11313282560,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b29fe65859409cf385e6f59034074eb4c07e122f&amp;dn=Evangelion+1.11+Blu-Ray+HD+Rip+1080p+%28Eng%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KingCus","files":1,"time":1303010216,"description":"[img]http://collection.animeindia.com/wp-content/uploads/2010/05/dvd-5037-evangelion-111-you-are-not-alone-blu-ray-funimation-prod.jpg[/img]\n\n[b]Description:[/b]\nThis is the highest quality Blu-Ray rip I could possibly attain. Has great video and audio. This is such a great series. I highly recommend watching this!\n\n[b]Video:[/b]\n Length 1:41:07\n Codec - H264 MP4\n Bitrate - 15,000\n Framerate - Same as Source (23.9)\n Resolution - 1920x1080\n \n[b]Audio:[/b]\n In English\n Codec - AAC\n Bitrate - 320 kbps \nSample Rate - 48000 Hz\n Channels - 5.1 multichannel\n\n[b]Synopsis:[/b]\nIn 2000 the Second Impact occurred, flooding the world and killing nearly half its population. Fifteen years later gigantic beings called Angels have appeared with the apparent intent of finding Lilith, the Second Angel, and thus initiating the Third Impact to finish the job. Lilith is concealed deep under the headquarters of the organization NERV, however, and NERV has developed the one weapon capable of stopping the Angels: biomechanical humanoids called Evangelions, giant mecha which synchronize with specially-chosen youths and can generate their own AT fields, a force field-like defense which makes the Angels mostly invulnerable to conventional weaponry. Shinji Ikari, 14-year-old son of NERV director Gendo Ikari, is one such youth, the so-called Third Child, and has been called to Tokyo-3 for exactly that purpose. Though reluctant to help a father who has never had a relationship with him and nearly overwhelmed by both the burden of responsibility placed on him and the horror of battling the Angels, Shinji assumes his expected role, battling a trio of Angels with the support of the entire NERV staff behind him and, in the last case, with the assistance of the mysterious First Child, Rei Ayanami, in her own Evangelion. Behind the scenes, his father and the even more secretive organization SEELE carry out ulterior motives which seem to have everything to do with the Angels' onslaught.","torrent":{"xt":"urn:btih:b29fe65859409cf385e6f59034074eb4c07e122f","amp;dn":"Evangelion+1.11+Blu-Ray+HD+Rip+1080p+%28Eng%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b29fe65859409cf385e6f59034074eb4c07e122f","infoHashBuffer":{"type":"Buffer","data":[178,159,230,88,89,64,156,243,133,230,245,144,52,7,78,180,192,126,18,47]},"announce":[],"urlList":[]}}