{"title":"Bon Jovi - It's My Life   (2nafish)","uid":5354163,"size":172269572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b35e723cf4a0da3131e546752c94e1aad73e92d8&amp;dn=Bon+Jovi+-+It%5C%27s+My+Life+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265883297,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;It's My Life&quot; is Bon Jovi's first single from the album Crush. It was released on May 23, 2000. It was written by Jon Bon Jovi, Richie Sambora and Max Martin.\n\n&quot;It's My Life&quot; became one of the most successful Bon Jovi singles, hitting #1 across many countries (however, it only reached #33 in the band's native US) and most importantly, became a symbol of the band's longevity as they prevailed through many different changes in the mainstream rock scene with admirable success. It was credited with reviving their career after they came off a five year break, during which they each pursued individual solo careers. It was also credited with introducing the veteran band to an entirely new, younger audience.\n\nPaul Anka covers Bon Jovi's &quot;It's My Life&quot; on his 2005 album, &quot;Rock Swings.&quot;\n\nWayne Isham directed this music video. Will Estes as Tommy and Shiri Appleby as Gina are the two main characters (as it says in the lyrics &quot;for Tommy and Gina, who never back down&quot;) but not portrayed as a working-class couple. At the beginning, Tommy is watching a video of the concert on his computer. Gina calls and during the whole video, Tommy runs through the streets of Los Angeles up to the Bon Jovi concert, getting chased by dogs, running a marathon, and posing for pictures and jackknifing a truck. The video was inspired by the movie Run Lola Run. Jon Bon Jovi met Will Estes on the set of U-571 and chose him to be in his next video, &quot;It's My Life&quot;.\n\nCrush is Bon Jovi's seventh studio album, released on June 13, 2000 through Island/Mercury. It was their first studio album since These Days was released in 1995. The album produced by Luke Ebbin, Jon Bon Jovi and Richie Sambora. Crush, which also produced such hits as &quot;It's My Life&quot; and &quot;Thank You For Loving Me&quot;, became the band's fifth consecutive UK #1 album, sold eight million copies worldwide, and helped introduce them to a new, younger fan base. Crush was nominated for Best Rock Album at the 2001 Grammy Awards.\n\nCrush became the band's most popular studio album in the United States since Keep the Faith. The album debuted at #9 on the Billboard 200, spent 51 weeks on the chart, and, according to Nielsen Soundscan, it has sold 2,071,000 copies in the U.S as of 2009.\n\nThe album topped the European album chart for seven weeks, spent fifteen weeks in the Top 10, and received 2x Platinum certification by the IFPI Europe. The album was #6 on the 2000 Europe Year-End albums chart, #7 on the 2000 CNN WorldBeat albums chart, and sold 8 million copies worldwide. Crush debuted at #1 in UK and became the band's fifth consecutive UK #1 album, but it was the last to go Platinum.\n\nThe first single, &quot;It's My Life&quot;, is among the most popular recent Bon Jovi singles and was the #3 bestselling single worldwide in 2000. &quot;It's My Life&quot; topped the European singles chart for 4 weeks.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b35e723cf4a0da3131e546752c94e1aad73e92d8","amp;dn":"Bon+Jovi+-+It%5C%27s+My+Life+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b35e723cf4a0da3131e546752c94e1aad73e92d8","infoHashBuffer":{"type":"Buffer","data":[179,94,114,60,244,160,218,49,49,229,70,117,44,148,225,170,215,62,146,216]},"announce":[],"urlList":[]}}