{"title":"la linea  by Osvaldo Cavandoli - serie 100 and serie 200","uid":12496558,"size":4684947456,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b43665baa2ea232d484cfc1f9706ee754ce2e513&amp;dn=la+linea++by+Osvaldo+Cavandoli+-+serie+100+and+serie+200&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IImultipleII","files":334,"time":1443277203,"description":"Creator\r\nOsvaldo Cavandoli\r\n\r\nVoice\r\nCarlo Bonomi\r\n\r\nMusic\r\nFranco Godi e Corrado Tringali\r\n\r\nYear\r\nserie 100: 1977-1980\r\nserie 200: 1984\r\n\r\nLanguage\r\n&quot;Grammelot&quot;\r\n\r\n\r\n\r\nThe beloved humorist Osvaldo &quot;Cava&quot; Cavandoli (1920-2007) was born in Maderno sul Garda, Italy, but moved to Milan when he was two years old.\r\nIn 1938 he left high school to work as a technical designer for Alfa Romeo in Arese and Cemsa in Saronno.\r\nIn 1944, he started working with Nino Pagot (the creator, along with Carlo &quot;Perogatt&quot; Peroni, of the world famous character Calimero,) getting involved, amongst other things, in the production of the first full length Italian animated feature, I fratelli Dinamite (The Dynamite Brothers, 1949).\r\nIn 1950, along with Ugo Moroni (aka A. Gelsi), he established his own company, Pupilandia, and started working independently as a director and a producer of stop motion films.\r\nCavandoli is best known for the genius of a character he created from a single line, aptly known as LA LINEA (The Line).\r\nCreated in 1969, La Linea (voiced by actor Carlo Bonomi in Milanese gibberish) has been awarded in countless international festivals and broadcasted on televisions throughout the world.\r\n&quot;Sometime in 1969 I was tidying up my desk and I also started to declutter all the things in my mind that tied me to the past. With the experience and knowledge I had gained during my working years, I knew I had to leave the beaten track and mark my own path. There I was, staring at the blank paper, scribbling. The pen was permanently moving, drawing lines. As I looked down on the lines I suddenly realised that the best idea was to cut things down to one single line and say everything I wanted to express with this one line.&quot;\r\nOriginally created to advertise Lagostina products on the Italian TV, La Linea was featured in 35 2-minute commercials produced between 1969 and 1976.\r\nIn 1971, Cavandoli produces 8 3-minutes shorts, with music by Franco Godi, that are distributed and broadcasted in many countries around the world. In the same year, he's awarded the Critics' Prize at the Annecy Festival, and, the following year, at the Zagreb Film Festival.\r\nIn 1977, thanks to an international co-production, Cavandoli creates 25 2-1/2 minute shorts that are distributed in Germany, Switzerland, France, Poland, Hungary, Turkey, Sweden, Canada, South Africa and Israel.\r\nIn 1979 he starts the production of 30 more shorts.\r\nIn 1978 he creates La Sexylinea, a 4-minute short that is very well received in all the major film festivals around the world.\r\nIn 1982, Cavandoli directs 26 animated shorts of Pimpa, the character created by Francesco Tullio Altan.\r\nIn 1983, he produces a new 25-episode series of La Linea for Quipos.\r\nIn the meantime, La Linea becomes the testimonial for many companies around the world, including the Touring Club of Switzerland, a medical cream in Germany, an insurance company in South Africa, consolidating his international popularity.\r\nIn the United States, the cartoons were featured on the children's TV series The Great Space Coaster.\r\nIn 1992 Cavandoli produces Trazom, a 7-minute short featuring La Linea, to celebrate the bicentennial of the passing of the great Austrian composer Wolfgang Amadeus Mozart.\r\nIn 2003, a set of 3 DVDs with all La Linea episodes was released in Germany.\r\nIn 2005, the video for the Jamiroquai song (Don't) Give Hate a Chance paid homage to Cavandoli. The video features 3D representations of La Linea, as well as the animator's hand and pencil.\r\nIn June 2006 Cavandoli has been honored by the Annecy Museum and the Annecy International Animation Festival.\r\n\r\n\r\n\r\nDVD 1\r\nla linea - serie 100\r\n3.06 Gb\r\n\r\n\r\nDVD 2\r\nla linea - serie 200\r\n1.3 Gb\r\n\r\n\r\nMenù\r\nDirect access to episodes\r\n\r\n\r\nla linea serie 100\r\nepisodes from 101 to 156 (complete)\r\nepisodes time: 2' 30''\r\n\r\n\r\nla linea serie 200\r\nepisodes from 200 to 225 (complete)\r\nepisodes time: 2' 30''\r\n\r\n\r\nVideo Details\r\nDVD5 - PAL\r\nScreen = 4:3\r\n720 x 576 pixels\r\n\r\n\r\nAudio\r\n192kbps - 48.0 KHz\r\n2 channels - AC3","torrent":{"xt":"urn:btih:b43665baa2ea232d484cfc1f9706ee754ce2e513","amp;dn":"la+linea++by+Osvaldo+Cavandoli+-+serie+100+and+serie+200","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43665baa2ea232d484cfc1f9706ee754ce2e513","infoHashBuffer":{"type":"Buffer","data":[180,54,101,186,162,234,35,45,72,76,252,31,151,6,238,117,76,226,229,19]},"announce":[],"urlList":[]}}