{"title":"Catalysts For Fine Chemical Synthesis Vol 5","uid":12074925,"size":3919008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4cc022bf8b29dfca7d03e31e9c9251eb30361f1&amp;dn=Catalysts+For+Fine+Chemical+Synthesis+Vol+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435614156,"description":"Catalysts For Fine Chemical Synthesis Vol 5 - Regio- and Stereo- Controlled Oxidations and Reductions - Stanley M. Roberts and John Whittall (Wiley, 2007).pdf\n\nISBN 978-0-470-09022-0\n\nVolume 5 in the &quot;Catalysts for Fine Chemical Synthesis&quot; series describes new procedures for the regio- and stereo-controlled transformations of compounds involving oxidation or reduction reactions. It describes a wide range of catalysts, including organometallic systems, biocatalysts and biomimetics. This volume also includes descriptions of a variety of conversions, including: Baeyer-Villiger oxidations; Epoxidation reactions; Hydroxylation reactions; Oxidation of alcohols to aldehydes, ketones and carboxylic acids; Reduction of ketones; and Reduction of alkenes including Î±, Î²-unsaturated carbonyl compounds. The book will be an important text for practising synthetic organic chemists in industry and academia.Protocols are written in a standard format by the authors who have discovered themHints, tips and safety advice (where appropriate) is given to ensure that the procedures are reproducibleIndications are given as to the range of starting materials used and, where appropriate, comparisons to alternative methodologyIncludes relevant references to the primary literature","torrent":{"xt":"urn:btih:b4cc022bf8b29dfca7d03e31e9c9251eb30361f1","amp;dn":"Catalysts+For+Fine+Chemical+Synthesis+Vol+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4cc022bf8b29dfca7d03e31e9c9251eb30361f1","infoHashBuffer":{"type":"Buffer","data":[180,204,2,43,248,178,157,252,167,208,62,49,233,201,37,30,179,3,97,241]},"announce":[],"urlList":[]}}