{"title":"Melanie Fiona - It Kills Me   (2nafish)","uid":5320627,"size":119674884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b4e75eeb34bd0845c3517a423db30e4c63a3afab&amp;dn=Melanie+Fiona+-+It+Kills+Me+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1264810282,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\n&quot;It Kills Me&quot; is the title of a number-one US R&amp;B single by Melanie Fiona. The track spent four weeks at number-one on the US Billboard R&amp;B singles chart.  Fiona received a Grammy nomination in the category of Best Female R&amp;B Vocal Performance for the track. The awards are to be presented on January 31, 2010.\n\nThe Bridge is the debut album by Canadian American R&amp;B/soul singer-songwriter Melanie Fiona, released under the SRC/Universal Motown label in June 2009. It was released in the United States on November 10, 2009. The album originally debuted atop of the Top R&amp;B/Hip-Hop Albums chart and at #57 on the Billboard 200 charts, it has since reached a peak of #42 on the charts. The album received favorable reviews.\n\n&quot;Give It to Me Right&quot; is the debut single from The Bridge. The song peaked at number 57 on the U.S. Billboard Hot R&amp;B/Hip-Hop Songs chart.\n\n&quot;Monday Morning&quot; has already charted in Switzerland and peaked at number 1.\n\n&quot;It Kills Me&quot; was Fiona's first entry on the Billboard Hot 100, charting at #49.  and the single charted at #1 on the U.S. R&amp;B chart.\n\nThe album is a mixture of soul, R&amp;B, neo soul, reggae and hip hop music influenced by pop music. In an interview, Fiona described the album's sound as &quot;pop soul&quot;. On the album, she worked with Andrea Martin, Rob Fusari, Peter Wade Keusch, Sidh Solanki, Vada Nobles, Bill Blast, Future Cut, Stereotypes, Dan Strong, JK, Jay Fenix, Affiliate.\n\nMelanie Fiona Hallim (born July 4, 1983) is a Canadian R&amp;B singer-songwriter from Toronto, Ontario. She was born to Guyanese immigrant parents (mixed with black, Indian, and Portuguese ethnicities) and grew up in the inner city of Toronto. Living in a music filled household, Fiona says she always knew music was her passion. Her father was a guitarist in a band and would allow her to sit on the stage when she was younger as he practiced, and remembers her mother playing music at home; everything from The Ronettes to Whitney Houston.\n\nFiona was featured on Reggae Gold 2008 with the Supa Dups-produced &quot;Somebody Come Get Me&quot;. Her debut album The Bridge was released in the summer of 2009. She worked on the album with Future Cut, Vada Nobles, Stereotypes, J. Phoenix, Peter Wade and Salaam Remi. The debut single &quot;Give It to Me Right&quot; was released to radio stations on February 28, 2009, and peaked at #20 on Billboard's Canadian Hot 100 and #41 on the UK Singles Chart.  The second single, &quot;It Kills Me&quot;, became her breakout song on the Billboard Hot 100 where it cracked the Top 50, along with hitting #1 on the Hot R&amp;B/Hip-Hop Songs chart. The song earned Fiona a Grammy Award nomination for Best Female R&amp;B Vocal Performance. The Bridge also earned Fiona a NAACP Image Award nomination for Outstanding New Artist.\n\nShe is set to go on tour with Alicia Keys.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b4e75eeb34bd0845c3517a423db30e4c63a3afab","amp;dn":"Melanie+Fiona+-+It+Kills+Me+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4e75eeb34bd0845c3517a423db30e4c63a3afab","infoHashBuffer":{"type":"Buffer","data":[180,231,94,235,52,189,8,69,195,81,122,66,61,179,14,76,99,163,175,171]},"announce":[],"urlList":[]}}