{"title":"Striking Poses-Shannen Doherty","uid":5151412,"size":1571932160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b66558a997204bf96ce771ecdce7a5295633fed2&amp;dn=Striking+Poses-Shannen+Doherty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bozo57","files":-1,"time":1257583653,"description":"Synopsis\n\nPhotographer Gage Sullivan (Doherty) is first seen driving down a dark road in a car and stopping to bury some bloody clothes. At a motel, tow FBI agents capture her and question her about the clothes. She tells her story in flashback. Gage works for a tabloid called &quot;Celebrity Scandal&quot; and finds herself the target of a camera-wielding stalker. On the advice of her assistant, Casey (Tamara Gorski), Gage hires a &quot;guardian angel&quot; Nick Angel (Joseph Griffin), of Angel Security. Of course, Nick is devastatingly handsome, and very good at his job. Nick sets Gage up with a new identity as &quot;Julie Summerfield,&quot; but their every move is being watched by the stalker, who wears a bad wig and chews bubblegum. While Nick and Gage are out getting acquainted, Casey lets in the wrong pizza boy, who kidnaps her and sends Gage photos of the beaten assistant floating in a bathtub, apparently dead. Now Gage is mad, and hires a psycho hit man named Murray the Badger (Aidan Devine) to kill the stalker. Nick doesn't trust the Badger, with good reason -- he wears a bad wig and blows bubblegum. Badger waylays Nick but lets Gage get away, and the film comes back to the motel where it started. The flashback is over, but there's another 40 minutes of movie to go, as Gage makes some shocking revelations and learns that she's at the center of a very clever plot, then sets out to turn the tables on the bad guys. - Robert Firsching, All Movie Guide\n","torrent":{"xt":"urn:btih:b66558a997204bf96ce771ecdce7a5295633fed2","amp;dn":"Striking+Poses-Shannen+Doherty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b66558a997204bf96ce771ecdce7a5295633fed2","infoHashBuffer":{"type":"Buffer","data":[182,101,88,169,151,32,75,249,108,231,113,236,220,231,165,41,86,51,254,210]},"announce":[],"urlList":[]}}