{"title":"Boston: Third Stage [MFSL Gold UDCD582]","uid":4437428,"size":242030125,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b68ad4f77e6cd7c78de84537177666537744c307&amp;dn=Boston%3A+Third+Stage+%5BMFSL+Gold+UDCD582%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy247","files":-1,"time":1223636481,"description":"Artist: Boston\nAlbum: Third Stage\nYear: 1987\nFormat: FLAC\nMFSL: Gold UDCD 582\n\n\nThird Stage is the third album by American rock band Boston released September 23, 1986 on MCA Records. The album was recorded at Tom Scholz' Hideaway Studio over a six-year period &quot;between floods and power failures&quot;.\n\nAfter winning a legal battle with Epic Records, Scholz switched their recording label to MCA. The first track on this album, &quot;Amanda&quot;, actually written in 1980, became the band's only #1 single. The track reached and stayed at #1 for two weeks in November 1986. It was followed by the second Top 10 single from the album, &quot;We're Ready,&quot; which reached #9 in 1987.\n\nThird Stage went to #1 on The Billboard 200 where it stayed for four weeks. The album was the first CD formatted album to be certified gold (500,000 copies) by the Recording Industry Association of America (RIAA). It was also certified gold in the LP format, making what is believed to the first album to be so certified in both these formats.\n\nThe album was a first in many respects: the first Boston LP to feature electronic drum samples, the first to feature songs not written by either Scholz or Delp, the first Boston LP without original members Barry Goudreau, Sib Hashian and Fran Sheehan (though Hashian and Sheehan were included in the early recording sessions and Sheehan received a writing credit), and the first (and only) Boston LP without the iconic guitar UFO dominating the cover art, though a small image of it is present. Original drummer Jim Masdea (who played on the demos that made a bulk of the first Boston album) plays drums on most of the album. This LP was also the first Boston recording to use the Scholz-invented Rockman guitar processor. No orchestral sounds or synthesizers were used on the album.\n\n\nTrack listing\n\n* All songs written by Tom Scholz, except where noted.\n\n01.Amanda 4:16 \n02.We're Ready 3:58 \n03.The Launch 2:55 \n04.Cool The Engines (Scholz, F. Sheehan, Delp) 4:24 \n05.My Destination 2:19 \n06.A New World (Masdea) 0:37 \n07.To Be A Man 3:30 \n08.I Think I Like It (Scholz, J. English) 4:07 \n09.Can'tcha Say/Still In Love (G. Green, Scholz, Delp) 5:13 \n10.Hollyann 5:09 \n\nPersonnel\n\nBrad Delp - lead vocals, harmony vocals \nTom Scholz - guitars, organs, bass, drums, percussion \nJim Masdea - drums, percussion \nSib Hashian - drums, percussion \nFran Sheehan - bass \nGary Pihl - guitar \n\n","torrent":{"xt":"urn:btih:b68ad4f77e6cd7c78de84537177666537744c307","amp;dn":"Boston%3A+Third+Stage+%5BMFSL+Gold+UDCD582%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b68ad4f77e6cd7c78de84537177666537744c307","infoHashBuffer":{"type":"Buffer","data":[182,138,212,247,126,108,215,199,141,232,69,55,23,118,102,83,119,68,195,7]},"announce":[],"urlList":[]}}