{"title":"IMSI.TurboCAD.MAC.Pro.v7.5.3.MacOSX.Incl.Keymaker-CORE.zip","uid":10000046,"size":702535800,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b6b369d8b960dca199a9aa4022e61e0076e09c8e&amp;dn=IMSI.TurboCAD.MAC.Pro.v7.5.3.MacOSX.Incl.Keymaker-CORE.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1397972012,"description":"Compatible With Mavericks OS X 10.9\n\n\nDesign Anything with Complete 2D/3D Design Tools\nTurboCADÂ® Mac Deluxe 2D/3D is the complete precision design solution making it easy to design anything. Through a simple interface, use the design wizard to quickly layout floor plans, diagrams, and illustrations. Access over 38,000 pre-drawn CAD symbols and 1,000 floor plans to speed design. Choose advanced architectural tools for 2D/3D home design or 3D surface and ACISÂ® solid modeling tools for engineering designs. Import and export file between many popular formats, including AutoCADÂ® .DWG 2013, or print designs to your specifications. Online help, video tutorials, and user tips even help you improve skills. Perfect for architects, engineers, designers and more.\n\n\nCreate and Easily Manage Detailed Designs\nSpeed design with over 38,000 pre-drawn symbols. Organize layers into layer sets for optimal drawing management.\n\n\nPrecise Architectural Design Features\nQuickly create floor plans with the drafting assistant or choose from 1,000 included pre-drawn plans. Speed architectural design with parametric doors and windows. When placed into the self-healing walls, TurboCAD will automatically create an opening in the wall to speed architectural design. Plus new version offers new roof and slab tools for complete home design.\n\n\nShare Designs with Ease\nEasily import existing designs from popular CAD and graphic design file formats, including new AutoCADÂ® 2013 DWG/DXF. Just as easily, export your precision designs and technical drawings from TurboCAD to other CAD formats, or choose a popular desktop publishing formats to create brochures or other marketing materials. Even print design to your specifications with new easy to use print options.","torrent":{"xt":"urn:btih:b6b369d8b960dca199a9aa4022e61e0076e09c8e","amp;dn":"IMSI.TurboCAD.MAC.Pro.v7.5.3.MacOSX.Incl.Keymaker-CORE.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6b369d8b960dca199a9aa4022e61e0076e09c8e","infoHashBuffer":{"type":"Buffer","data":[182,179,105,216,185,96,220,161,153,169,170,64,34,230,30,0,118,224,156,142]},"announce":[],"urlList":[]}}