{"title":"Hydrocarbon Process Safety 2nd ed - Clifford Jones","uid":12545453,"size":2952522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6d3942721388fe71475c9377d89a8ed5fa9ce4a&amp;dn=Hydrocarbon+Process+Safety+2nd+ed+-+Clifford+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1444466067,"description":"Hydrocarbon Process Safety 2nd ed - Clifford Jones (Whittles, 2014).pdf\r\n\r\nExpanded and updated, this new edition of a bestseller treats this important field in a holistic manner. The structure of the previous book has been retained, but enhanced with new text and illustrations, and more numerical problems with a wider scope. Readers will find much on the background to the industry and details of such centrally important operations as refining, heat exchange, cracking, polymerisation and hydrogenation.\r\n\r\nThere is a chapter on offshore matters, which includes some incidents that occurred since the first edition. National and international standards are considered as these relate to such things as site layout. The coverage of the fire and explosion behaviour of hydrocarbons has been extended, in particular in relation to flash points. The topic of leaked gas detection has been introduced, and there is considerable extension of the coverage of static electricity hazards.\r\n\r\nThere is more on liquefied natural gas (LNG), including details of processes for its regasification. Natural gas condensate features, having grown considerably in importance since the first edition. Re-refining of crude oil products that have previously been used as lubricants or as hydraulic fluids has also experienced growth, and this too has its place in the book from the perspective of safety. Tight gas and coal bed methane feature, as does the controversial matter of hydraulic fracture to obtain them.\r\n\r\nThe chemical processing chapter has been extended to include hydrocracking, hydrodesulphurisation and hydrodenitrogenation. The COMAH (Control of Major Accident Hazards) regulations are covered and sign conventions for hazards are explained with illustrations","torrent":{"xt":"urn:btih:b6d3942721388fe71475c9377d89a8ed5fa9ce4a","amp;dn":"Hydrocarbon+Process+Safety+2nd+ed+-+Clifford+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6d3942721388fe71475c9377d89a8ed5fa9ce4a","infoHashBuffer":{"type":"Buffer","data":[182,211,148,39,33,56,143,231,20,117,201,55,125,137,168,237,95,169,206,74]},"announce":[],"urlList":[]}}