{"title":"O'Reilly - Gradle For Android","uid":12512690,"size":1105889259,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b9f0f67bd847c1c7d84948e84087717a363258c6&amp;dn=O%27Reilly+-+Gradle+For+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":19,"time":1443598685,"description":"Whether you are new to Gradle or an experienced Android developer, Java consultant Ken Kousen will help you get better acquainted with the Gradle automated build system. With ?enough Groovy to get by,? you?ll learn Groovy?s relationship to Java and how it defines both static and dynamic variables. You?ll also build and run a simple Android app, test it, and modify it to add capabilities. The video includes:\r\n\r\n- Gradle basics: use a Gradle build for a Java project, define custom tasks and insert them into the Gradle directed acyclic graph, and add plugins using a buildscript\r\n- Build types: create debug-and-release Android application packages (APK), and learn how to sign and prepare a release APK\r\n- Run tests: test non-user interface components, specifically data access layers\r\n- Use a third-party UI testing library: test UI components, and run tests on all connected devices simultaneously\r\n- Define multiple flavors: create different versions of the same application, change images and other resources, and generate multiple APKs\r\n\r\nIn addition to learning how to build multi-module projects, you?ll also add an Android library project to a top-level project, and use it to access a web service and update the UI.\r\nKen Kousen, president of Kousen IT, Inc., is a technical trainer, mentor, and consultant in all areas related to Java, specializing in Android, Spring, Hibernate/JPA, Groovy, and Grails. He is the author of Making Java Groovy (Manning) and the upcoming O?Reilly book, Gradle for Android","torrent":{"xt":"urn:btih:b9f0f67bd847c1c7d84948e84087717a363258c6","amp;dn":"O%27Reilly+-+Gradle+For+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f0f67bd847c1c7d84948e84087717a363258c6","infoHashBuffer":{"type":"Buffer","data":[185,240,246,123,216,71,193,199,216,73,72,232,64,135,113,122,54,50,88,198]},"announce":[],"urlList":[]}}