{"title":"Kate Bush - Hounds Of Love (1985) [EAC-LAME 320kbps]","uid":4641712,"size":114189168,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba2a49cd768f9d955ded04d18231034bdf1fbf64&amp;dn=Kate+Bush+-+Hounds+Of+Love+%281985%29+%5BEAC-LAME+320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"h_benotto","files":12,"time":1231738466,"description":"Kate Bush's strongest album to date also marked her breakthrough into the American charts, and yielded a set of dazzling videos as well as an enviable body of hits, spearheaded by &quot;Running Up That Hill,&quot; her biggest single since &quot;Wuthering Heights.&quot; Strangely enough, Hounds of Love was no less complicated in its structure, imagery, and extra-musical references (even lifting a line of dialogue from Jacques Tourneur's Curse of the Demon for the intro of the title song) than The Dreaming, which had been roundly criticized for being too ambitious and complex. But Hounds of Love was more carefully crafted as a pop record, and it abounded in memorable melodies and arrangements, the latter reflecting idioms ranging from orchestrated progressive pop to high-wattage traditional folk; and at the center of it all was Bush in the best album-length vocal performance of her career, extending her range and also drawing expressiveness from deep inside of herself, so much so that one almost feels as though he's eavesdropping at moments during &quot;Running Up That Hill.&quot; Hounds of Love is actually a two-part album (the two sides of the original LP release being the now-lost natural dividing line), consisting of the suites &quot;Hounds of Love&quot; and &quot;The Ninth Wave.&quot; The former is steeped in lyrical and sonic sensuality that tends to wash over the listener, while the latter is about the experiences of birth and rebirth. If this sounds like heady stuff, it could be, but Bush never lets the material get too far from its pop trappings and purpose. In some respects, this was also Bush's first fully realized album, done completely on her own terms, made entirely at her own 48-track home studio, to her schedule and preferences, and delivered whole to EMI as a finished work; that history is important, helping to explain the sheer presence of the album's most striking element -- the spirit of experimentation at every turn, in the little details of the sound. That vastly divergent grasp, from the minutiae of each song to the broad sweeping arc of the two suites, all heavily ornamented with layered instrumentation, makes this record wonderfully overpowering as a piece of pop music. Indeed, this reviewer hadn't had so much fun and such a challenge listening to a new album from the U.K. since Abbey Road, and it's pretty plain that Bush listened to (and learned from) a lot of the Beatles' output in her youth. [Those seeking to hear the full, exquisite sonic range of Hounds of Love (or any of Bush's pre-1990s albums, for that matter) should ignore the U.S.-made EMI America CDs and go for any of the British CD editions, either individually or in the This Woman's Work set; or, better still on Hounds of Love, the boxed edition with bonus tracks released in conjunction with EMI's 100th anniversary in 1997.]","torrent":{"xt":"urn:btih:ba2a49cd768f9d955ded04d18231034bdf1fbf64","amp;dn":"Kate+Bush+-+Hounds+Of+Love+%281985%29+%5BEAC-LAME+320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba2a49cd768f9d955ded04d18231034bdf1fbf64","infoHashBuffer":{"type":"Buffer","data":[186,42,73,205,118,143,157,149,93,237,4,209,130,49,3,75,223,31,191,100]},"announce":[],"urlList":[]}}