{"title":"SCOREtv: Holiday Edition 2 (The Score Group) [DVDRip]","uid":8787373,"size":372837764,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bc3de36dfb2904fe7310eda50b6e960550526a71&amp;dn=SCOREtv%3A+Holiday+Edition+2+%28The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1375858530,"description":"SCOREtv: Holiday Edition 2 (The Score Group) [DVDRip]\n\nSamantha, Destiny Rose, Desiree, Kelly Christiansen, Maserati, Melissa Manning, Nancy Navarro, Minka, Jasmine Shiraz\n\n\nSCOREtv is back with an all-new Holiday Edition, and it's going to be jiggle belles all the way. Tits the season for giving the world more big boobs, and we're keeping abreast of the situation with holiday hooters and cleavage cheer. This edition stars Kelly Christiansen, Samantha 38G, Destiny Rose, Maserati, Minka, Melissa Manning and Desiree with very special guests Venera, Micky Bells, Jasmine Shiraz, Beverly Paige, Karen Fisher and Nancy Navarro. A sensational cast of Santa's helpers! Over one hour of tits and giggles that's unlike anything you'll see anywhere else! Happy Holidays!\n\n'TIS THE SEASON FOR THE BUSTIEST, HORNIEST HOLIDAY SHOW EVER!\n\nNaturally stacked redhead Desiree gets a special holiday gift...nipples clamps! And she tries them on just for us!\n\nMidwestern girl-next-door Destiny Rose, popping out of a tight sweater, tries on candy tassles and lets a lucky guy eat them off her nipples.\n\nBlonde bombshell Kelly Christiansen invites your host to demonstrate a wireless vibrator...on her pussy, of course. He buzzes until she cums!\n\nPlumper superstar Samantha 38G oils up her gigantic naturals until the oil is dripping off her rack, then demonstrates the &quot;Five Things You Can Do With Your Boobs For The Holidays.&quot;\n\nBlack 'n' super-stacked H-cupper Maserati, tits bulging out of her bra, sings a special holiday song that'll put in the mood, then creams her tits.\n\nNewcomer Melissa Manning is a good-girl-next-door, but when she sees a candy cane, she can't help but suck it like it's a cock!\n\nLatina natural Nancy Navarro is your sock-it-to-me go-go girl.\n\nK-cup superstar Minka tries on tight sweaters that barely fit over her KK-cup super-rack.\n\nA lucky guy gets a special present...a model in a box, and out pops super-stacked natural Jasmine Shiraz.\n\nFrosty the Snowman gets lapdances from Desiree, Destiny Rose and Maserati that make his carrot hard.\n\nBusty blonde Venera, Micky Bells and Beverly Paige audition to be Santa's helper. Their credentials: endless cleavage!\n\nScreens: &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=597eb76g4w3mwkcqm0iu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=597eb76g4w3mwkcqm0iu.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=p3q9wjgeury9sucax5yz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=p3q9wjgeury9sucax5yz.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:bc3de36dfb2904fe7310eda50b6e960550526a71","amp;dn":"SCOREtv%3A+Holiday+Edition+2+%28The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3de36dfb2904fe7310eda50b6e960550526a71","infoHashBuffer":{"type":"Buffer","data":[188,61,227,109,251,41,4,254,115,16,237,165,11,110,150,5,80,82,106,113]},"announce":[],"urlList":[]}}