{"title":"Lonely Planet - Russia - 7th Edition (2015).epub Gooner","uid":14706859,"size":89427312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc4ed48d186ded9a8add67edac19dd23b2aa2460&amp;dn=Lonely+Planet+-+Russia+-+7th+Edition+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"GoonerTPB","files":1,"time":1464370039,"description":"Lonely Planet - Russia (Travel Guide) - 7th Edition (2015).epub Gooner\r\n\r\nPublisher: Lonely Planet; 7 edition (13 Mar. 2015)\r\nLanguage: English\r\nISBN-10: 1742207332\r\nISBN-13: 978-1742207339\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Russia is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Take an awe-inspiring walk through Red Square, hike amongst the geysers and volcanoes of Kamchatka, or sweat it out in a traditional Russian banya (bathhouse); all with your trusted travel companion. Get to the heart of Russia and begin your journey now!\r\n\r\nInside Lonely Planet's Russia Travel Guide:\r\n\r\n* Color maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - history, politics, literature, cinema, religion, performing arts, music, visual art, architecture, cuisine, landscapes, wildlife.\r\n\r\n* Over 80 maps\r\n\r\n* Covers Moscow, St Petersburg, the Golden Ring, Kaliningrad, European Russia, the Volga Region, the Russia Caucasus, Sochi, Lake Baikal, the Urals, Yekaterinburg, Siberia, Irkutsk, Vladivostok, Kamchatka and more\r\n\r\nThe Perfect Choice: Lonely Planet Russia, our comprehensive guide to Russia, is perfect for both exploring top sights and taking roads less traveled.\r\n\r\n* Looking for a guide focused on Moscow or St Petersburg? Check out Lonely Planet's Moscow or St Petersburg guides for a comprehensive look at all these cities have to offer. Looking for more extensive regional coverage? Check out Lonely Planet's Trans-Siberian Railway guide.\r\n\r\nAuthors: Written and researched by Lonely Planet, Simon Richmond, Marc Bennetts, Greg Bloom, Marc Di Duca, Anthony Haywood, Anna Kaminski, Tom Masters, Leonid Ragozin, Tamara Sheward, Regis St Louis and Mara Vorhees.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:bc4ed48d186ded9a8add67edac19dd23b2aa2460","amp;dn":"Lonely+Planet+-+Russia+-+7th+Edition+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc4ed48d186ded9a8add67edac19dd23b2aa2460","infoHashBuffer":{"type":"Buffer","data":[188,78,212,141,24,109,237,154,138,221,103,237,172,25,221,35,178,170,36,96]},"announce":[],"urlList":[]}}