{"title":"Ryan Adams - 2001 - Gold  [EAC - FLAC]","uid":4655533,"size":456286494,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bc96308b8c5b54e7658cb9589f075a42dc2a839a&amp;dn=Ryan+Adams+-+2001+-+Gold++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1232193428,"description":"Ryan Adams - 2001 - Gold  [EAC - FLAC]\n\nReview     by Mark Deming\n\nOne would think that being Ryan Adams would be a pretty good deal at the time of this album's release; he had a major-label deal, critics were in love with him, he got to date Winona Ryder and Alanis Morissette, Elton John went around telling everyone he was a genius, and his record company gave him carte blanche to do whatever he wanted. But to listen to Gold, Adams' first solo album for his big-league sponsors at Lost Highway, one senses that there are about a dozen other musicians Adams would love to be, and nearly all of them were at their peak in the early to mid-'70s. Adams' final album with Whiskeytown, Pneumonia, made it clear that he was moving beyond the scruffy alt-country of his early work, and Gold documents his current fascination with '70s rock. Half the fun of the album is playing &quot;Spot the Influence&quot;: &quot;Answering Bell&quot; is a dead ringer for Van Morrison (with fellow Morrison enthusiast Adam Duritz on backing vocals), &quot;Tina Toledo's Street Walkin' Blues&quot; is obviously modeled on the Rolling Stones, &quot;Harder Now That It's Over&quot; sounds like Harvest-period Neil Young, &quot;New York, New York&quot; resembles Stephen Stills in his livelier moments (Stephen's son, Chris Stills, plays on the album), and &quot;Rescue Blues&quot; and &quot;La Cienega Just Smiled&quot; suggest the influence of Adams' pal Elton John. Of course, everyone has their influences, and Adams seems determined to make the most of them on Gold; it's a far more ambitious album than his solo debut, Heartbreaker. The performances are polished, Ethan Johns' production is at once elegant and admirably restrained, Adams is in strong voice throughout, and several of the songs are superb, especially the swaggering but lovelorn &quot;New York, New York,&quot; the spare and lovely &quot;When the Stars Go Blue,&quot; and the moody closer, &quot;Goodnight, Hollywood Blvd.&quot; But while Gold sounds like a major step forward for Adams in terms of technique, it lacks the heart and soul of Heartbreaker or Pneumonia; the album seems to reflect craft rather than passion, and while it's often splendid craft, the fire that made Whiskeytown's best work so special isn't evident much of the time. Gold sounds like an album that could win Ryan Adams a lot of new fans (especially with listeners whose record collections go back a ways), but longtime fans may be a bit put off by the album's richly crafted surfaces and emotionally hollow core.\n\n\nTracks\n01   New York, New York      Adams      3:47\n02   Firecracker      Adams      2:48\n03   Answering Bell      Adams      3:02\n04   La Cienega Just Smiled      Adams      4:59\n05   The Rescue Blues      Adams      3:36\n06   Somehow, Someday      Adams      4:23\n07   When the Stars Go Blue      Adams      3:31\n08   Nobody Girl      Adams, Johns      9:39\n09   Sylvia Plath      Adams, Causon      4:08\n10   Enemy Fire      Adams, Welch      4:04\n11   Gonna Make You Love Me      Adams      2:34\n12   Wild Flowers      Adams      4:55\n13   Harder Now That It's Over      Adams, Stills      4:31\n14   Touch, Feel &amp; Lose      Adams, Rawlings      4:13\n15   Tina Toledo's Street Walkin' Blues      Adams, Johns      6:04\n16   Goodnight, Hollywood Blvd.      Adams, Causon      3:23 ","torrent":{"xt":"urn:btih:bc96308b8c5b54e7658cb9589f075a42dc2a839a","amp;dn":"Ryan+Adams+-+2001+-+Gold++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc96308b8c5b54e7658cb9589f075a42dc2a839a","infoHashBuffer":{"type":"Buffer","data":[188,150,48,139,140,91,84,231,101,140,185,88,159,7,90,66,220,42,131,154]},"announce":[],"urlList":[]}}