{"title":"Mae - Discography (2003-2011) [FLAC]","uid":10873260,"size":2369667460,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bd2970523bd50db4b21ff93b732fe25a0983151d&amp;dn=Mae+-+Discography+%282003-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"politux","files":-1,"time":1408981490,"description":"\n  Mae - Discography (2003-2011) [FLAC]\n\n  Genre: Rock\n  Styles: Indie, Emo, Alternative\n  Source: CD \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  2003 Destination: Beautiful\n  2004 Destination: B-Sides\n  2005 The Everglow\n  2007 Singularity\n  2009 (m)orning\n  2010 (a)fternoon\n  2011 (e)vening\n  \n  Boasting a sound that straddled the border of alternative rock and emo-pop, Mae (an acronym for Multisensory Aesthetic Experience) was formed in early 2001 by guitarist Matt Beck, drummer Jacob Marshall, bassist Mark Padgett, keyboardist Rob Sweitzer, and vocalist Dave Elkins. The band initially started out as a project between Elkins and Marshall, students at Old Dominion University in Norfolk, VA. Recording sessions were booked at Padgett's home studio, and the duo quickly grew into a quintet as the co-founders rubbed shoulders with other local musicians. Nearly eight months later, Mae had cemented its sound and landed local shows with the likes of the Movielife, River City High, and the Exit. In the process, the group also recorded songs for a debut album, Destination: Beautiful, which was released in early 2003 by Tooth &amp; Nail.\n\n  While touring to support Destination: Beautiful, guitarist Matt Beck stepped down from his post and was replaced by former Unsung Zeroes guitarist Zach Gehring. Destination: B-Sides surfaced near the end of 2004. Mae's second proper studio album, The Everglow, followed in 2005, and the band's dedicated audience (not to mention its coveted spot on the Warped Tour that summer) helped the album peak at number 51 on the Billboard 2000. Mae joined the Virgin College Mega Tour in early 2006, appearing alongside Over It and Yellowcard in the process, and a bonus edition of The Everglow appeared that April with additional tracks and a bonus DVD. The musicians' contract with Tooth &amp; Nail ran out later that year, and they went on to sign a deal with Capitol, thus making Mae a major-label act.\n\n  Singularity was released during the summer 2007 and cracked the Top 40, selling roughly 17,000 copies during its first week. It proved to be Mae's only release for Capitol, however, as the band left the label's roster in 2008 and forged ahead as an independent act. Early the following year, the (m)orning EP became Mae's first independently released disc, although it received a widespread release in September courtesy of Cell Records. They followed up quickly in 2010 with another EP, (a)fternoon.\n\n  Note to downloaders\n\n  I don't claim that this is a complete discography. I have collected as much material as I could find.  If something is missing you can try to find it and upload it for the community. Asking for it here won't help.\n\n  Thanks to all the original rippers and uploaders. :)\t\t","torrent":{"xt":"urn:btih:bd2970523bd50db4b21ff93b732fe25a0983151d","amp;dn":"Mae+-+Discography+%282003-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2970523bd50db4b21ff93b732fe25a0983151d","infoHashBuffer":{"type":"Buffer","data":[189,41,112,82,59,213,13,180,178,31,249,59,115,47,226,90,9,131,21,29]},"announce":[],"urlList":[]}}