{"title":"The History Of American Railroads - The Era of Diesel","uid":10593716,"size":2930481742,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd4eaaf950fe6f49c930f34ff0f1acabf6c85022&amp;dn=The+History+Of+American+Railroads+-+The+Era+of+Diesel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"InfinityPlus","files":4,"time":1405834667,"description":"In The Era of Diesel, we examine the golden age of America's railroads as we travel across the United States on the great passenger trains of the 1950s. With stunning photography and fabulous color footage, this is a journey you don't want to miss!\n\n1. The Great Passenger Trains of the East\n\nIn this chapter, we travel from Illinois to the East Coast on the New York Central, the Penn Central, the Pennsylvania, the B&amp;O, and many others as we try to recapture the lost glamour of passenger train travel at its best.\n\n2. The Great Passenger Trains of the South\n\nJourney with us to Atlanta, the railroad hub of the South, as we embark on another series of historic passenger train journeys. The Nashville, Chattanooga and St. Louis, and Atlantic Coast Line are just a few of the historic train lines that await us.\n\n3. The Great Passenger Trains of the West\n\nBefore the advent of the interstate highway system, westbound passenger trains offered the best means of capturing the great sweeping panoramas of the American West. Come aboard the Rio Grande, the Santa Fe, the Union Pacific, and many others as we relive American train travel in its glory years.\n\n4. The Transition Years\n\nIn this chapter, we examine the story of America's great railroads during the transitional years of the '60s and '70s. This was a difficult time for America's great passenger trains, as one by one, they embarked on their final journeys.","torrent":{"xt":"urn:btih:bd4eaaf950fe6f49c930f34ff0f1acabf6c85022","amp;dn":"The+History+Of+American+Railroads+-+The+Era+of+Diesel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd4eaaf950fe6f49c930f34ff0f1acabf6c85022","infoHashBuffer":{"type":"Buffer","data":[189,78,170,249,80,254,111,73,201,48,243,79,240,241,172,171,246,200,80,34]},"announce":[],"urlList":[]}}