{"title":"Fritz Lang - M (1931)","uid":6800298,"size":3536384827,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd84a906e424e1077d0841433563383cbef93ec3&amp;dn=Fritz+Lang+-+M+%281931%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1320626079,"description":"Fritz Lang - M (1931)\n\nGerman with English subtitles\n &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v712/buttzilla/folder2/mov1442.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v712/buttzilla/folder2/mov1442.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1140.photobucket.com/albums/n575/anchovyffrnc/Clipboard01-4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1140.photobucket.com/albums/n575/anchovyffrnc/Clipboard01-4.png&lt;/a&gt;\n\n~~with all extras~~\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0022100/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0022100/&lt;/a&gt;\n\nBased on the fiendish killings which spread terror among the inhabitants of DÃƒÂ¼sseldorf in 1929, there is at the Mayfair a German-language pictorial drama with captions in English bearing the succinct title &quot;M,&quot; which, of course, stands for murder. It was produced in 1931 by Fritz Lang and, as a strong cinematic work with, remarkably fine acting, it is extraordinarily effective, but its narrative, which is concerned with a vague conception of the activities of a demented slayer and his final capture, is shocking and morbid. Yet Mr. Lang has left to the spectator's imagination the actual commission of the crimes.\n\nPeter Lorre portrays the Murderer in a most convincing manner. The Murderer is a repellent spectacle, a pudgy-faced, pop-eyed individual, who slouches along the pavements and has a Jekyll-and-Hyde nature. Little girls are his victims. The instant he lays eyes on a child homeward bound from school, he tempts her by buying her a toy balloon or a ball. This thought is quite sufficient to make even the clever direction and performances in the film more horrible than anything else that has so far come to the screen. Why so much fervor and intelligent work was concentrated on such a revolting idea is surprising.\n\nIt is unfurled in a way that reveals Mr. Lang and Thea von Harbou, his wife, evidently studied what happened in DÃƒÂ¼sseldorf during the score of atrocious murders, which incidentally caused young women to go about armed with pepper in case they were picked out by the slayer as possible victims. In the film the Commissioner of Police gives all his attention to trying to track the murderer down. He goes about his work in a systematic fashion, but when another crime is perpetrated he is talked to heatedly over the telephone by his superior.\n\nSo far as the film spectator is concerned, there is no mystery concerning the criminal. He is perceived looking into a mirror, making grimaces at himself, and later dawdling along the street, looking into shop windows. He has a habit of whistling a few bars of a tune, and apparently it is something he has little control over, for this whistling is actually responsible for his capture.\n\nMr. Lang has the adroit idea of having thugs, pickpockets, burglars and highwaymen eventually setting about to apprehend the Murderer. His crimes are making things too hot for them and, bad as they are, they are depicted as being almost sympathetic characters compared to the Murderer. Every criminal in the town is told by the chief crook to be on the lookout for anybody who looks suspicious. Beggars and peddlers, as well as the thieves and swindlers, are all eager to catch the Murderer.\n\nIt is not astonishing that anybody doing a kindly turn for a child is suspected of being the criminal. A harmless individual is almost mobbed by hysterical women and enraged men. Meanwhile the Murderer is at large and has boastfully written of his last crime to the newspapers. The letter is analyzed. It was written evidently on a rough wooden table, and the sleuths draw circles about the map of the town as they widen their search.\n\nBut his capture does not come about through the minions of the law. It is a blind man, a peddler of toy balloons, who gives the alarm. He had sold a balloon a few days before to the man who had whistled the notes of an operatic tune. Suddenly the blind man several days later hears the melody whistled again, and it dawns upon him in a few seconds that the Murderer is passing. He gives the alarm, and in the course of the chase a youth, who had marked in chalk the letter &quot;M&quot; on his hand, slaps the suspect on the back.\n\nThere is a wild chase, the crooks being eager to get their man. They are willing to risk being held for crimes, and when the Police Commissioner understands from a prisoner that he and others were following the Murderer, the official is so stunned that he lets the cigar he is smoking drop from his mouth. One perceives the panting Murderer trying to get the lock off a door, his eyes wilder than ever, and perspiration dripping from his forehead. But the frantic, shrieking man is finally captured by the thieves, and a most interesting series of scenes is devoted to his trial. He bleats that he is a murderer against his will, whereas those before him commit crime because they want to. A thief presides at the trial. The Murderer has counsel, who says that the Murderer needs a doctor more than punishment. Then the Murdered is handed over to the police and a mother of one of the fiend's little victims declares that the death of the man will not give her back her child.\n\nIt is regrettable that such a wealth of talent and imaginative direction was not put into some other story, for the actions of this Murderer, even though they are left to the imagination are too hideous to contemplate.\nM.H., NY Times, April 3, 1933\n\n------my rip-----\n\n~~~~~~ M.avi ~~~~~~                                     \n\n                                                               \n\nFile Size (in bytes):...........................1,626,085,376                     \n\n                                                                                \n\n--- Video Information ---                                                       \n\nVideo Codec Name:...............................XviD ISO MPEG-4              \n\nDuration (hh:mm:ss):............................1:51:02                \n\nFrame Count:....................................159712             \n\nFrame Width (pixels):...........................528                  \n\nFrame Height (pixels):..........................432                  \n\nAspect Ratio:...................................1.222                     \n\nFrames Per Second:..............................23.976          \n\nVideo Bitrate (kbps):...........................1684                 \n\n......MPEG-4......B-VOP........................                    \n\nQuality Factor (bits/pixel)/frame:..............0.308&quot;                     \n\n                                                                                \n\n--- Audio Information ---                                                       \n\nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \n\nAudio Sample Rate (Hz):.........................48000             \n\nAudio Bitrate(kbps):............................128                 \n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \n\nAudio Channel Count:............................1       \n\n**********************************************\n\n    Freakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n    The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n    If you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n                           \n   &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n    'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&quot;    ","torrent":{"xt":"urn:btih:bd84a906e424e1077d0841433563383cbef93ec3","amp;dn":"Fritz+Lang+-+M+%281931%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd84a906e424e1077d0841433563383cbef93ec3","infoHashBuffer":{"type":"Buffer","data":[189,132,169,6,228,36,225,7,125,8,65,67,53,99,56,60,190,249,62,195]},"announce":[],"urlList":[]}}