{"title":"Football Manager 2009 9.30.PATCH","uid":4743855,"size":245028358,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bd96e77edaac83c630d2ab2dc74f6eb79b8f634b&amp;dn=Football+Manager+2009+9.30.PATCH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ilefx","files":1,"time":1235703394,"description":"Football Manager 2009 9.30.PATCH\n\n\nlatest\n\ncomment it the lic not working from 9.2 or 9.1\n\n\nSEED/ENJOY\n\n\n\n\n\n\nFootball Manager 2009 v9.3.0 \n----------------------------\n\nCompatibility\n=========\n- Improved compatability on Unified Shader and Discrete Shader Video Cards including the Radeon 9200, GeForce3 Ti 500 and GeForce4 Ti 4400 series.\n\nCrash Fixes\n===========\n- Fixed an occassional crash if a human manager applies for another job when his current club has no chairman.\n\nGeneral\n======= \n- Fixed bug where the game didn't automatically unregister players from German B teams at the start of a new season. If the user didn't do it manually, these players would be restricted to 3 in the first team.\n- Fixed bug where occassionally a player would not become &quot;home-grown&quot; at a club after being there for enough time.\n- When picking European squads for clubs which have have affiliated B clubs, the correct number of home-grown players is now displayed.\n- Fixed bug where reserve teams playing in main leagues would not include players from the first team if they were made available for the reserve team.\n- Human managers now don't need to learn a language if it is the default language of their second nation.\n- Fixed bug where Darijo Srna didn't gain Ukrainian nationality at Shakhtar due to not speaking Russian or Ukrainian.\n- Adjusted away team attendance when match is played at a stadium shared by both the home and the away team\n- Adjusted assistant manager comments on the gaps between defense/midfield/attack when using defensive midfielders or attacking midfielders\n- Fixed bug where players from a club's first team might request transfers after the B team gets relegated.\n- Adjusted attendances in international matches for away teams in cases where the away team was in fact playing in their home nation (for example when hosting competitions)\n- Adjusted boost in attendance after moving to a new stadium\n- Make some improvements to the referee strip selection code.\n- If a club's youth team has a tour arranged, the first team can now schedule friendlies for the same dates.\n- Fixed bug where a player was being reported as injured for '1 day' when his actual return date was longer.\n- Improved physio assessment of a player's likely return date, dependant upon physio's ability.\n- Adjusted second nationalities of French newgens born in big cities\n- Adjusted general chances of second nationalities for newgens\n- Fixed bug where player didn't see the benefit of taking Croation nationality, when it would help their club get around foreigner restrictions.\n- Stopped players gaining days toward a nationality simply by moving between A &amp; B teams.\n- Improved statistics generated for non-active teams.\n- Stopped players taking up a nationality in-order to play for that nation when they have declared for a different nation already.\n- Ensured record transfer fee matches up with the transfer fee shown in the player history.\n- Stopped young referees e.g. Stuart Attwell getting their date of birth randomised.\n- Stadiums without a pitch type entered in the database now default to grass pitches.\n- Adjusted the filling of attributes left blank in the DB for non-players\n- Players now start learning the language of future transfer teams as soon as the deal is signed.\n- Players unhappy at the sale of a star player now are no longer unhappy once a star player has been signed to replace them.\n- Unattached players can no longer have Short-term Plans of &quot;Looking to see out the remainder of his playing days at the club&quot;.\n- Players no longer complain about not playing if they have only just come back from injury.\n- Players no longer request to be transfer listed a few days after a transfer window has just closed.\n- Fixed continuing Save Game User's Shortlist and Scouting screens take a long time to access and players are no longer shown on there.\n- Fixed giving a player an injection will put them out for the same amount of time as sending them to the Physio.\n- Fixed contract length being greyed out with a date of Jan 1900.\n- Teams now respect over age squad selection rules in lower division italian leagues.\n- Fixed game slowdown whilst processing January to March.\n- Stopped the board being refered to as the Football Association in the Confidence screen.\n- Improved memory usage for games running many leagues with full detail matches.\n- Transfer records now display the same fee as shown in the players history screen.\n- Fixed a bug where a player fluent in a language of his current nation might not be able to gain nationality because he cannot speak the language.\n- Reduced the number of assists generated for players in non-active leagues.\n- Stopped an &quot;Unknown Referee&quot; being picked for the Korean All-Star cup and some Blue Square North/South matches.\n- Stopped a player sometimes losing some ability in a position after training has been completed and they are still being played in that position.\n- Improved pitch conditions deterioration rates.\n\nInterface\n=========\n- Search results now sorted by name for ease of use.\n- Can now search media sources using search box.\n- Fixed bug where failed transfers would sometimes remain on the transfer centre screen.\n- Wages shown in transfer centre now use the correct format set in the preferences.\n- Match screen overview panel now shows full details on matches played using the quick match engine.\n- Added 'Relationship With You' to AI manager's personal section so that you can see their relationship with you more easily (and without having to go to the interaction screen).\n- Fixed a bug in match classic view where player names would sometimes be left on the pitch.\n- Added 'Record Transfers' to View menu in Transfers section. Can now see Top 25 transfers, viewable by world, nation or competition.\n- Fixed a situation where a yellow card would not appear on the match time slider.\n- Manager resignations now appears in their achievements page.\n- Fixed processing info occasionally incorrectly showing a goal as having been scored in e.g. (58 + 1).\n- Fixed a bug which allowed you to discipline a player for unprofessional behaviour for no reason.\n- Stopped draggable player names on the award voting screen if the human could not vote in that award.\n- Fixed a bug on the award voting screen where it could confuse who you voted for if you swap candidates positions.\n- Fixed a bug where a 'PR' icon would show for a player but there would be no reaction shown in his profile.\n- Fixed code in a string on the player profile about the captain being changed too soon.\n- Added a &quot;Clear All&quot; button to the team talk screen.\n- Fixed issue with team talk option not being available if already in tactics at half time\n- Match view should be remembered properly when set before match\n- Player attributes now colour-coded on all screens\n- Fixed issues with tactics buttons not being visible in TV View in a human vs human hotseat game\n- Long distances can now be set to miles or kilometres\n- Overspend on salary now shown in red on manager overview screen\n- Match score display more consistent everywhere\n- Removed unecessary season selection list when arranging a friendly at a club\n\nFinances\n========\n- Adjusted the board limits for allowing movement of money to wage budget with smaller clubs when current wages are very low compared to the current wage budget\n- Adjusted the sponsorship deal values to better reflect the new league level and reputation in cases where smaller teams go up the leagues and have renewable sponsorships set in the DB\n- Enabled the game to re-evaluate any sponsorship deals set to be of fixed value in the DB to prevent teams from being stuck with the same level of sponsor income\n- Adjusted collective win bonuses for Brazilian clubs\n- Adjusted ticket prices in Brazil\n- Adjusted board renewing expiring kit sponsorships after old deal expires\n- Adjusted Turkish Super Cup ticket pricing and gate receipts split between teams\n- Finetuned kit sponsorship value calculations\n- Adjusted chances for starting new stadium planning\n- Adjusted transfer budget calculations for promoted teams\n- Adjusted board ambition effects on transfer budgets\n- Adjusted board limitations on how much excess wage budget is allowed to be moved towards transfers\n- Adjusted ticket prices in Turkey\n- Fixed club wage total calculations when club has players on a B-club contract\n- Adjusted modelling of bankrupt clubs\n- Adjusted chances for tycoon takeovers at smaller clubs\n- Adjusted Finnish finances\n\nContracts\n=========\n- Forced newgens to start with youth contracts whenever possible instead of professional contracts in nations where the minimum age for pro contracts was set to lower than general newgen creation age\n- Fixed contract type issues with some young players.\n- Lowered amount of players on month to month contracts.\n- Stopped Players demanding an inferior squad status.\n- Fixed staff leaving club without any news items and whilst they were under contract.\n\nMedia\n=====\n- Fixed news item describing player as 'Looks Set To Have A Bright Future At Club' when he is transfer-listed.\n- Added 'View Assignments' button to scout match report news items so you can more easily view or change that scout's assignments.\n- Fixed non-player bio message says newly appointed coach began his career with a spell as coach from January 1900.\n- Fixed national player/coach sacking being reported as being released by their club.\n- Host announcement news items no longer state the wrong year for the Champions and EURO Cups.\n- Teams no longer listed incorrectly in loan transfer limit exceeded news item.\n- Managers at A-League clubs can no longer declare interest in other A-League clubs players until the 2010 season.\n- Improved text layout for 'Where Are They Now' news to make it easier to read.\n- Fixed extra line gap in the boards feeder ckub response news item.\n- Addressed issue of club-specific media sources reporting on other clubs in the same division.\n- Fixed foreign bookmakers offering odds for nations they don't cover.\n- Fixed a missing ending to a sentance in the scout next opposition news under rare circumstance.\n- Stopped a sentance saying you have a contract until 1900 when taking over at an amateur club.\n\nNetwork Game\n============\n- Fixed bug where server couldn't kick/ban/force continue a &quot;New Network Client&quot;\n\nPress Conferences\n=================\n- Fixed user being asked question about who will win title when title has already been won.\n- Stopped a follow-on question being generated to the &quot;Entire Team&quot; answer to &quot;What is the strongest/weakest area of the team&quot;.\n- Press conference asks question about user's dropping of a player when he has been called up as a late replacement.\n- Fixed a bug where as national team manager you could be asked about the need to spend to strengthen the squad.\n- Stopped journalists sometimes picking on your choice of player to counter a dangerman as incorrect when he is in fact a good choice.\n- Fixed bug where the headline &quot;[User] knows spirit can't be maintained&quot; would appear, which is the opposite of what you said.\n- Fixed a bug where you would get asked a question about poor form when you are recently unbeaten.\n- Stopped manager being asked a question about the need to buy players outside of transfer windows.\n\nAwards\n=================\n- Fixed some problems with the Brazilian golden boot award\n- Fixed a bug where B-team players would be linked with winning the Spanish Young Player of the Year\n- Bulgarian Cavalier of Fairplay award is now given out.\n- Danish national awards should favour player's playing in bigger leagues more.\n- Fixed a problem with the European Golden Boot whereby if the scores were level it would sort by most appearances instead of least.\n\nInternational Management\n========================\n- Facilitated choosing international squad by adding more detailed stats to the Stats option in the National Pool 'View' menu.\n- Players with multiple nationalities now assume the nationality of the current national team they represent. Their nationality will become 'fixed' once they win a full cap at senior or u21 level.\n- Fixed rare instance of rejected call-up player retiring and being described as &quot;left out&quot; of international squad.\n- Fixed news item after submitting squad containing two separate strings regarding same player's possible first appearance.\n- Fixed issue where even a slight rift with a club manager would see them withdraw their players from your squad for friendlies.\n- AI National teams now leave some space in their squads for virtual goalkeepers if there are no real gks available.\n- Fixed player wrongly described as &quot;excluded&quot; from a national team squad when he was playing for one of the nation's other national teams.\n- Fixed bug which was stopping some players from announcing their international retirements following competitions / unsuccessful qualifying etc.\n- Fixed squad corruption issue caused by failure to hire manager properly which could occur if human was offered a national youth job e.g. U19s.\n- Fixed user being unable to add some dual-nationality players to National Squad or National Pool.\n- Fixed rare issue where dual-nationality player would still mention which nation he would like to play for, even after he had won full caps for them.\n- Fixed national Team described as &lt;team#1-short&gt; in biased-selection news item\n- Improved international squad selections.\n- Fixed national team captain/vice-captains set in the database not being used by the game.\n- Fixed national manager retiring just before major finals.\n\n\nBoard Takeovers\n===============\n- Fixed bug where tycoon chairmen could sometimes come from an extinct nation.\n- Ensured B-teams don't get given a chairman when promoted to an active league.\n- Fixed tycoon takeover collapsing due to a disagreement of the club's valuation when the club's worth is fairly insignificant.\n\nTransfers\n=========\n- Offers made for other managers are now cancelled when a human adds themselves as manager of a team.\n- Loan bids now get processed quicker on a transfer deadline day.\n- Loan transfer windows now only apply to domestic loans.\n- Extended the January transfer window to 2nd Feb 2009 for some nations as 31st Jan 2009 is on a Saturday.\n- Players on domestic loans don't get their appearances counted towards the number of clubs allowed to play for in a year.\n- Cannot offer contract to player dialog box now contains a valid reason when bidding on American Developmental League players.\n- Transfer rejection option &quot;offer isn't good enough&quot; is no longer available for selection when rejecting an enquiry.\n- Stopped B/C team managers transfer-listing players owned by the human A team manager.\n- Players who aren't likely to make it at top clubs are now more interested in moving to good Championship clubs.\n- More managers now being sacked/moving.\n- More free agents signed in the transfer window.\n- Fixed some Illogical hiring of managers due to thier coach reputation\n- AI Team keeps bidding for same player despite player continually rejecting them\n- Stopped Young, non-eu players who are recent signings being transfer listed at game start in Spain.\n- Made it easier to loan out players.\n- Stopped AI negotiating to fee much less than amount offered.\n- AI Manager not doing coownership anymore\n- Made it harder to sign top regen talent due to contract expiry and lack of interest from other clubs.\n- Stopped players from stating they are not willing to leave due to recent arrival - When in fact he signed 3 years ago.\n- Stopped low Co-Ownership bids from being accepted incorrectly in Italy.\n- Toned down the amount of money man city are prepared to spend on non world class players.\n- Loan rejected with rejecting club wanting a Ã‚Â£0 Fee.\n- Fixed After selling a player who had been out on loan, the User is still getting Match Reports on him.\n- Fixed team rejecting original offer for a player but after enquiring they will accept less for him.\n- Ensured human managers face more competition from other clubs outside of the transfer window.\n- Toned down foreign managers being appointed in France.\n- Fixed Vacant manager job being shown on Job Security but not on Job Centre.\n- Fixed loan offers being rejected because 'the club are not looking to loan the player out at the present time' - when the player is loan listed.\n\nConfidence\n==========\n- Board Confidence is disappointed that the team failed to win promotion when they are still in the promotion playoffs\n- After losing in promotion playoffs Board Confidence says &quot;The board are pleased that the team won promotion from the Second Division this season&quot;\n- Promoted through playoffs meeting the minimum expectation of promotion but Board Confidence is disappointed that I only challenged for the title\n- Mourinho sacked a week before the Champions League final.\n- Transfers arranged prior to managerial appointment no longer count towards new managers confidence feedback.\n\nCompetitions\n============\n\nInternational\n-------------\n- Euro U21 Championship Qualifying now takes place in 2007/08.\n- Fixed Confederations Cup squad rules.\n\nEurope\n------\n- Updated calculation of European coefficients for new 2009 formats of the competitions.\n- Fixed bug where teams could not submit a full European squad in Febuary if they had selected a lesser number of players earlier in the season.\n\nSouth America\n-------------\n- Fixed Libertadores prelim and group draws.\n\nAustralia\n---------\n- Pre-season cup final is now over 1 leg instead of 2.\n- Fixed bug where Australian youth league isn't played after the first season.\n\nBrazil\n------\n- Fixed Brazilian league gate receipt percentages.\n\nBulgaria\n--------\n- Fixed Cup of Bulgaria.\n\nCzech Rep\n---------\n- Improved players transfer values.\n\nDenmark\n-------\n- Points system used for Danish disciplinary rules.\n- Improved Danish players transfer values.\n\nEngland\n-------\n- Fixed players not getting cup-tied in the English League Cup.\n- Fixed English League Cup semi-final away goals rule.\n- FA Cup regional draw fix now also applies to pre patch 2 saves.\n- Fixed Conference League Cup Semi-Final incorrectly being played as Wembley.\n\nGermany\n-------\n- Fixed German Cup final not played in Berlin.\n- Players now go on holiday for longer between seasons.\n\nIndia\n-----\n- Implemented new Indian Federation Cup structure.\n\nRep. Ireland\n------------\n- Fixed wrong play-off format for First Division relegation/promotion play-off.\n- Fixed issue whereby a non-league side that wins the First Division relegation/promotion play-off wasn't getting promoted.\n\nIsrael\n------\n- Fixed the U19 leagues that mirror the Premier and National league not reflecting increase in number of teams in Premier and National league as from 2009 season.\n- Updated Israeli Premier/National League Toto Cup schedules.\n- Improved Israeli player transfer values.\n\nItaly\n-----\n- Pescara deducted a point.\n- Venezia new points deduction.\n- Fixed Serie C cup prizes.\n- Serie C Cup Semifinals Correct Scheduling.\n- Venezia will start C1/A with a -4 deduction point instead of the current -2.\n- Avellino points deduction changed to -2.\n\nMexico\n------\n- First 11 squad selection rules in Mexico apply only to the starting lineup and are not used during the match.\n- Mexican B clubs can now qualify for the playoffs even though they cannot be promoted.\n\nN.Ireland\n---------\n- Fixed a problem where Northern Irish Premier Division playoff would sometimes be created twice.\n- Northern Irish Premier Division now has a 38 game season.\n\nNorway\n------\n- Updated Norwegian Premier league scheduling for 2009.\n\nPoland\n------\n- Polish FA Cup round 1 and 2 draw fixed.\n- Fixed a problem with players sometimes not being banned after getting a red card in league matches.\n\n\nSweden\n------\n- Fixed prize money Swedish Premier division.\n\nTurkey\n------\n- Fixed problem in Turkey where if a foreign sub comes on for a previous foreign substitute, the game counted both players as being on the pitch when working out if the players on pitch broke the foreign player limit.\n\nUnited States\n-------------\n- AI MLS teams are now more active in signing Designated Players from outside the MLS.\n- Teams Allocation funds are not re-calculated when a new manager is hired.\n- Allocation funds are not re-calculated for a human manager each season.\n- Percentage of transfer revenue made available no longer displayed for MLS teams as it is irrelevent.\n- Toronto FC's 5 American International slots are now correctly used in the game.\n- All MLS teams team roster information is now displayed e.g. number of international players registered.\n- AI teams no longer place zero value on player rights transfers.\n- Stopped AI teams offer Designated Player contracts to players when the wage cap applies if they haven't the space in the cap to pay them.\n- Fixed bug were Senior Developmental and Developmental players contracts weren't been re-newed if they hadn't been offered a contract after only a month was remaining on their current contract.\n- starting draft allocation transfer are now loaded correctly at the start of a new game.\n- Injured players can no longer be waived.\n- Designated players with valid contracts can no longer be wavied.\n- MLS teams don't release top talents after signing replacements when under the MLS squad limits.\n- AI teams no longer ignore player rights when signing a player who has valid player rights with another MLS team.\n\nUruguay\n-------\n","torrent":{"xt":"urn:btih:bd96e77edaac83c630d2ab2dc74f6eb79b8f634b","amp;dn":"Football+Manager+2009+9.30.PATCH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd96e77edaac83c630d2ab2dc74f6eb79b8f634b","infoHashBuffer":{"type":"Buffer","data":[189,150,231,126,218,172,131,198,48,210,171,45,199,79,110,183,155,143,99,75]},"announce":[],"urlList":[]}}