{"title":"Stormy Weather (1943) Xvid 1cd - Subs-Eng-Francais- Musical - Le","uid":11426225,"size":814896072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bda20f4e1642576e2e8235a2eec878a880181936&amp;dn=Stormy+Weather+%281943%29+Xvid+1cd+-+Subs-Eng-Francais-+Musical+-+Le&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1415668965,"description":"Stormy Weather (1943) Xvid 1cd - Subs-Eng-Francais- Musical - Lena Horne [DDR]\n\nStormy Weather is a 1943 American musical film produced and released by 20th Century Fox. The movie is considered one of the best Hollywood musicals with an African-American cast, the other being MGM's Cabin in the Sky. The film is considered a primary showcase of some of the top African-American performers of the time, during an era when African-American actors and singers rarely appeared in lead roles in mainstream Hollywood productions, especially those of the musical genre.\n\nCAST:-\nLena Horne\nBill Robinson\nCab Calloway and His Cotton Club Orchestra\t\nKatherine Dunham and Her Troupe\nFats Waller \nThe Nicholas Brothers\nAda Brown\nDooley Wilson\nThe Tramp Band \n\nDirected by Andrew L. Stone\nProduced by William LeBaron\nWritten by Jerry Horwin, Seymour B. Robinson\nMusic by Harold Arlen\nRunning time 78 minutes\n\nMOVIE REVIEW:- Stormy Weather (1943)\nStormy Weather takes its title from the 1933 song of the same title, which is performed near the end of the film. It is based upon the life and times of its star, dancer Bill &quot;Bojangles&quot; Robinson. Robinson plays &quot;Bill Williamson,&quot; a talented born dancer who returns home in 1918 after fighting in World War I and tries to pursue a career as a performer. Along the way, he approaches a beautiful singer named Selina Rogers, played by Lena Horne in one of her few non-MGM film appearances (and one of only two films from the 1930s-40s in which Horne played a substantial role). The character of Selina was invented for the film; Robinson did not have such a romance in real life. Dooley Wilson co-stars as Bill's perpetually broke friend.\n\nOther notable performers in the movie were Cab Calloway and Fats Waller (both appearing as themselves), the Nicholas Brothers dancing duo, comedian Miller, singer Ada Brown, and Katherine Dunham with her dance troupe. Despite a running time of only 77 minutes, the film features some 20 musical numbers. This was Robinson's final film (he died in 1949); Waller died only a few months after its release.\n\nThe film's musical highlights include Waller performing his composition &quot;Ain't Misbehavin',&quot; Cab Calloway leading his band in his composition &quot;Jumpin' Jive,&quot; and a lengthy sequence built around the title song, featuring the vocals of Lena Horne and the dancing of Katherine Dunham. Horne also performs in several dance numbers with Robinson.\n\nThe movie was adapted by Frederick J. Jackson, Ted Koehler and H.S. Kraft from the story by Jerry Horwin and Seymour B. Robinson. It was directed by Andrew L. Stone.\n\nIn 2001, Stormy Weather was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant.&quot; It was released on DVD in North America in 2005.\n\nDancing great Bill 'Williamson' sees his face on the cover of Theatre World magazine and reminisces: just back from World War I, he meets lovely singer Selina Rogers at a soldiers' ball and promises to come back to her when he &quot;gets to be somebody.&quot; Years go by, and Bill and Selina's rising careers intersect only briefly, since Selina is unwilling to &quot;settle down.&quot; Will she ever change her mind? Concludes with a big all-star show hosted by Cab Calloway.\n\nSOUNDTRACK NOTES:_\nThe soundtrack has been released on CD by 20th Century Fox references 7822-11007, though Sunbeam Records released the soundtrack on vinyl in 1976. This record included Lena Horne singing &quot;Good For Nothin' Joe,&quot; a song that did not appear in the movie.\nCritical reception\n\nShane Vogel suggests that Lena Horne and Katherine Dunham's performances of &quot;Stormy Weather&quot; in the film are, like Ethel Waters's performance of the song in The Cotton Club Parade of 1933, African American modernist critiques of American culture\n\nFred Astaire told the Nicholas Brothers that the &quot;Jumping Jive&quot; sequence was &quot;the greatest movie musical number he had ever seen&quot;.\nPerformance\n\nThe musical numbers in the movie contain elements of minstrelsy. The performance of a cakewalk for example, features flower headdresses reminiscent of the Little Black Sambo figures used in historical misrepresentations of Black American males. &quot;Stormy Weather&quot; and other musicals of the 1940s opened new roles for blacks in Hollywood, breaking through old stereotypes and far surpassing limited roles previously available in race films produced for all-black audiences.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 675 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 78 mins\nSubtitles: Eng, Francais\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:bda20f4e1642576e2e8235a2eec878a880181936","amp;dn":"Stormy+Weather+%281943%29+Xvid+1cd+-+Subs-Eng-Francais-+Musical+-+Le","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda20f4e1642576e2e8235a2eec878a880181936","infoHashBuffer":{"type":"Buffer","data":[189,162,15,78,22,66,87,110,46,130,53,162,238,200,120,168,128,24,25,54]},"announce":[],"urlList":[]}}