{"title":"Wreck it Ralph 2012(PORsub-DELUXE)).avi","uid":7901099,"size":890168696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bdb0a9810c3da7ffb1c3bd73884402ffe654b1f6&amp;dn=Wreck+it+Ralph+2012%28PORsub-DELUXE%29%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1354927277,"description":"* XVID CAM  * 01H33M57S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n- Portuguese subtitles\n\n\n* Plot :\n\nWhen Litwak's Arcade closes at night, the various video game characters leave their normal in-game roles and are free to travel to other games. Within the game Fix-It Felix, Jr., the characters celebrate its titular hero but shun the game's villain character, Wreck-It Ralph. At a support group for video game antagonists, Ralph reveals his desire to stop being the bad guy. Back at home, Ralph finds the other characters celebrating their game's 30th anniversary without inviting him. Felix reluctantly invites Ralph to join them, but the others ostracize him, saying he would have to earn a medal, just as Felix does in their game.\n\nWhile visiting Tapper's, Ralph meets a soldier from the first-person shooter Hero's Duty, who tells him the game's winner receives a medal. Ralph enters the game and encounters Sergeant Calhoun, its no-nonsense leader. Between game sessions, Ralph climbs the game's central beacon and collects the medal, accidentally hatching a Cy-Bug, one of the game's enemies. The Cy-Bug clings to Ralph as he stumbles into an escape pod that launches him out of the game. Meanwhile, with Ralph missing, a girl reports to Litwak that Fix-It Felix, Jr. is malfunctioning. Since broken games get unplugged, leaving their characters homeless, Felix sets off to find Ralph.\n\nRalph crash-lands in Sugar Rush, a kart-racing game. As he searches for his medal, he meets Vanellope von Schweetz, a glitchy character who makes off with the medal, planning to use it to buy entry into an after-hours race. King Candy and the other racers refuse to let Vanellope participate, claiming that she is not really part of the game. Ralph helps Vanellope build a kart. At her home, Diet Cola Mountain, he discovers that she is a natural racer.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:bdb0a9810c3da7ffb1c3bd73884402ffe654b1f6","amp;dn":"Wreck+it+Ralph+2012%28PORsub-DELUXE%29%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdb0a9810c3da7ffb1c3bd73884402ffe654b1f6","infoHashBuffer":{"type":"Buffer","data":[189,176,169,129,12,61,167,255,177,195,189,115,136,68,2,255,230,84,177,246]},"announce":[],"urlList":[]}}