{"title":"Lens Design 4th Edition{BBS}","uid":6658219,"size":9246101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be90a0c4f7a5058080c97ec16bb2a5f468e1d7fb&amp;dn=Lens+Design+4th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315407346,"description":"There is no shortage of lens optimization software on the market to deal with today's complex optical systems for all sorts of custom and standardized applications. But all of these software packages share one critical flaw: you still have to design a starting solution. Continuing the bestselling tradition of the author's previous books, Lens Design, Fourth Edition is still the most complete and reliable guide for detailed design information and procedures for a wide range of optical systems.\n\nMilton Laikin draws on his varied and extensive experience, ranging from innovative cinematographic and special-effects optical systems to infrared and underwater lens systems, to cover a vast range of special-purpose optical systems and their detailed design and analysis. This edition has been updated to replace obsolete glass types and now includes several new designs and sections on stabilized systems, the human eye, spectrographic systems, and diffractive systems. A new CD-ROM accompanies this edition, offering extensive lens prescription data and executable ZEMAX files corresponding to figures in the text.\n\nFilled with sage advice and completely illustrated, Lens Design, Fourth Edition supplies hands-on guidance for the initial design and final optimization for a plethora of commercial, consumer, and specialized optical systems.\nProduct Details\n\n    * Hardcover: 487 pages\n    * Publisher: CRC Press; 4 edition (December 19, 2006)\n    * Language: English\n    * ISBN-10: 0849382785\n    * ISBN-13: 978-0849382789","torrent":{"xt":"urn:btih:be90a0c4f7a5058080c97ec16bb2a5f468e1d7fb","amp;dn":"Lens+Design+4th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be90a0c4f7a5058080c97ec16bb2a5f468e1d7fb","infoHashBuffer":{"type":"Buffer","data":[190,144,160,196,247,165,5,128,128,201,126,193,107,178,165,244,104,225,215,251]},"announce":[],"urlList":[]}}