{"title":"The Technopriests - Books 1 &amp; 2 (Jodorowsky &amp; Janjetov) [PDF]","uid":5783469,"size":97901665,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bf5573a7181b95378586cf15e2de4547aa6cfed2&amp;dn=The+Technopriests+-+Books+1+%26+2+%28Jodorowsky+%26+Janjetov%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naba888","files":2,"time":1282507549,"description":"The Technopriests - Books 1 &amp; 2 (Jodorowsky &amp; Janjetov) [PDF]\n\nAlbino is an old man, recording his memories in the spaceship where he navigates through space with his pet Tinigrifi, leading 500,000 young technopriests to the promised galaxy. His story begins when a spaceship of pirates attack on the sacred asteroid where Panepha, a young virgin destined to become oracle of the Imperial Palace, lived. The three pirates rape Panepha and she gives birth to three children: Almagro, Albino and Onyx. Albino is rejected by his mother, who creates and leads the Great Kamenvert Factory. But Albino doesn't like making cheese, he wants to be a videogame creator. With some reluctance, his mother sends him to Don Mossimo, the director of a technopriest training school. There he begins his journey to become Supreme Technopriest and start a new society, where human relationships will be valued more highly than scientific advance.\n\nBook 1: Albino must undergo many trials before becoming the Supreme Techno Priest, master of games and virtual reality. From his birth on the Sacred Asteroid, to his violation of the highest cybernetic access levels, he recounts his rise to glory amid the din and clamor of a cosmic struggle. A tale of the power of dreams.\n\ntags: mystic, initiation, enlightenment, GOD, SELF, comics, Jodorowsky, cybernetic, sci-fi, priest, Loyola, cult, illuminati, freemason, Lucifer, cosmos, consciousness, illusion, dream, angel","torrent":{"xt":"urn:btih:bf5573a7181b95378586cf15e2de4547aa6cfed2","amp;dn":"The+Technopriests+-+Books+1+%26+2+%28Jodorowsky+%26+Janjetov%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf5573a7181b95378586cf15e2de4547aa6cfed2","infoHashBuffer":{"type":"Buffer","data":[191,85,115,167,24,27,149,55,133,134,207,21,226,222,69,71,170,108,254,210]},"announce":[],"urlList":[]}}