{"title":"EnigmaT Set Rips { Cuts } - July 25th, 2013","uid":8739759,"size":1616917305,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bfa6148aa8590aeb3d9def92e591eb397851f052&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+25th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":178,"time":1374712091,"description":"Aerofeel5 - Stay Where You Are (Original Mix) (-Short- Cut From Oakenfold Set)-enTc.mp3\nAimoon &amp; Offshore Wind - Meteor Shower (Original Mix) (Cut From Tempo Set)-enTc.mp3\nAkira Kayosa &amp; Carly Kling - Ransom (Chris Metcalfe Remix) (Cut From Akira Set)-enTc.mp3\nAkira Kayosa &amp; Carly Kling - Ransom (Original Mix) (Cut From Feel Set)-enTc.mp3\nAkira Kayosa &amp; Hugh Tolland - Kaipara (ReOrder Remix) (Cut From Feel Set)-enTc.mp3\nAkira Kayosa &amp; Hugh Tolland - Kaipara (ReOrder Remix) (Cut From Saux Set)-enTc.mp3\nAlex Bartlett &amp; Martin Roth - Off The World (Fabio XB with Peter Santos &amp; Festival Geyser 2013 Remix) (Set Rip)-enTc.mp3\nAlex Ender - Unconquered (Original Mix) (Cut From Feel Set)-enTc.mp3\nAlex M.O.R.P.H - Eternal Flame (Solarstone Pure Mix) (Cut From Solarstone Set)-enTc.mp3\nAllen &amp; Envy vs. Chris Cockerill - Acidic (Set Rip)-enTc.mp3\nAmitacek - Positive (Cut From Amitacek Set)-enTc.mp3\nAndrew Stets - Last Day Of Summer (Aleksey Sladkov Remix) (Cut From Anderson Set)-enTc.mp3\nAndrew StetS - Last Day Of Summer (Cut From Bjorn Set)-enTc.mp3\nAneym And Jan Martin - Young &amp; Proud (Cut From Sync Set)-enTc.mp3\nAruna - Reason To Believe (Steve Kaetzel Original Mix) (Cut From Tritonal Set)-enTc.mp3\nAruna - Reason To Believe (Steve Kaetzel Remix) (ABGT 037 Rip)-enTc.mp3\nAyla - Sun Is Coming Out (Adam Ellis &amp; Pete UniQue Remix) (Cut From ReeVe Set)-enTc.mp3\nBasemental Level - Moments at Jazz (Original Mix) (Cut From KIWAMU Set)-enTc.mp3\nBen Nicky &amp; James Dymond - Refresh (Cut From Dymond Set)-enTc.mp3\nBinary Finary &amp; Alan Crown - Escherian (Original Mix) (Cut From Bin Fin Set)-enTc.mp3\nBinary Finary &amp; Lele Troniq feat. Christina Novelli - Waiting For The Sun (James Dymond Remix) (Cut From Dymond Set)-enTc.mp3\nBinary Finary - The Annex (Dirkie Coetzee Remix) (Cut From Dirkie Set)-enTc.mp3\nBinary Finary Feat. Alan Crown One - Escherian (ABGT 037 Rip)-enTc.mp3\nBinary Finary vs Iversoon &amp; Alex Daf - Dark Side (Original Mix) (Cut From Bin Fin Set)-enTc.mp3\nBrezza, JP DJ &amp; Natalie Gioia - Per Sempre (Extended Mix) (Cut From Darey Set)-enTc.mp3\nC-Systems feat. Hanna Finsen - Save The Moment (DJ Feel Remix) (Cut From Feel Set)-enTc.mp3\nCalvin Harris feat. Ayah Marar - Thinking About You (Firebeatz Remix) (Cut From Claessen Set)-enTc.mp3\nChris Hampshire - Ninety Four (Liam Wilson Remix) (Cut From Stowers Set)-enTc.mp3\nChristian Drost - Essence (Original Mix) (Cut From Solarstone Set)-enTc.mp3\nCiro Visone - Lost Control (Original Mix) (Cut From Vale Set)-enTc.mp3\nCiro Visone - Rebel (Cut From Team 140 Set)-enTc.mp3\nCj Arthur &amp; Adam Naval - Crescencia (Dave Cold Remix) (Cut From Team 140 Set)-enTc.mp3\nCJ Arthur &amp; Adam Navel - Crescencia (Original Mix) (Cut From Amitacek Set)-enTc.mp3\nCraving - Hong Kong (Original Mix) (Cut From Feel Set)-enTc.mp3\nCymatics - A New Beginning (Original Mix) (Cut From Sty Set)-enTc.mp3\nD.E.C.A.D.A &amp; Sourcee feat. Janies - Close To Me (Original Dub Mix) (Cut From Akira Set)-enTc.mp3\nD.E.C.A.D.A - Vitam (Original Mix + PROFF Remix) (Cut From Bjorn Set)-enTc.mp3\nDave202 feat. Maurizio Pozzi vs. Alpha Duo - We Are Requiem (Alpha Duo Energize Mash) (Cut From ReeVe Set)-enTc.mp3\nDeleirum feat. Sarah McLachlan - Silence (Adam Deane Re-Edit) (Cut From Dymond Set)-enTc.mp3\nDeng &amp; Slavak - Legend Of Ararat (Domased Electronica Remix) (Cut From Young Free Set)-enTc.mp3\nDirkie Coetzee feat. Nanje Nowack - Silent Heart (Original Mix) (Cut From Dirkie Set)-enTc.mp3\nDJ Boronin - Playback (Kamil Ciacka &amp; Enroute Remix) (Cut From Several Spirits Set)-enTc.mp3\nDJ Feel &amp; Emilio Fernandez - Diggin' This Feeling (Fred Baker's Progressive Remix) (Cut From Shah Set)-enTc.mp3\nDK Project - Night Dreams (Naoufal Lamrani Remix) (Cut From Ronny K Set)-enTc.mp3\nDNS Project - Confront (Cut FroM Tydi Set)-enTc.mp3\nDon Diablo &amp; Matt Nash - Starlight (Could You Be Mine) (Cut From Schossow Set)-enTc.mp3\nDreamy - Memorial Memories (Sky Flight Remix) (Cut From Sty Set)-enTc.mp3\nDziastinas - Time Shift (Cut From Several Spirits Set)-enTc.mp3\nE.T Project - Distant Memories (BluSkay Remix) (Cut From Uplift Set)-enTc.mp3\nEddie Lung &amp; DJ T.H. - Instant (Thomas Coastline Remix) (Set Rip)-enTc.mp3\nEli &amp; Fur - Nightmares (ABGT 037 Rip)-enTc.mp3\nEric Rigo - Back Home (Cut From Several Spirits Set)-enTc.mp3\nFabio Mazzei &amp; Marco Calanni - Night (KIWAMU Remix) (Cut From KIWAMU Set)-enTc.mp3\nFilip Le Frick - Supabass (Cut From Calabro Set)-enTc.mp3\nFleming &amp; Lawrence - Beyond The Limit (Diego Morrill Remix) (Cut From Team 140 Set)-enTc.mp3\nFloE - Neon (Original Mix) (Cut From Kaeno Set)-enTc.mp3\nFon.Leman - Subortus (Original Mix) (Cut From Anderson Set)-enTc.mp3\nFranz - Emerge (Dreamy Remix) (Cut From Suzy Set)-enTc.mp3\nFrench Solar - Magnetic (Jackob Liedholm Remix - Suspect 44 Edit) (Set Rip)-enTc.mp3\nFull Gear Flavor - Fall In (Original Mix) (Cut From Oakenfold Set)-enTc.mp3\nFull Tilt - Bookie (Original Mix) (Cut From Kaeno Set)-enTc.mp3\nFuture Disciple - Jacobs Ladder (Cut From Oakenfold Set)-enTc.mp3\nGetting Over - Extant (Cut Fro GO Set)-enTc.mp3\nGrant Lewis - Granted (Original Mix) (Cut From Bin Fin Set)-enTc.mp3\nGrazba - Night Wolves (Cut From Lazarus Set)-enTc.mp3\nH3F - Climax (Lindell &amp; Vuonnala Remix) (Cut From Pit Set)-enTc.mp3","torrent":{"xt":"urn:btih:bfa6148aa8590aeb3d9def92e591eb397851f052","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+25th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa6148aa8590aeb3d9def92e591eb397851f052","infoHashBuffer":{"type":"Buffer","data":[191,166,20,138,168,89,10,235,61,157,239,146,229,145,235,57,120,81,240,82]},"announce":[],"urlList":[]}}