{"title":"Mobile Observatory - Astronomy v2.1.0","uid":9078699,"size":22402687,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:bfb1c08e9f9236b69e83bee8200fecad73c8bfe9&amp;dn=Mobile+Observatory+-+Astronomy+v2.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1382346681,"description":"\nMobile Observatory is one of the most complete astronomy apps on the Android market and the perfect tool for anybody interested in the sky's wonders, from the occasional sky gazer to the passionate amateur astronomer.\n\nYou want to know if the next lunar eclipse is visible from your location or when the next bright comet is visible? You would like to be notified by your smart phone the next time, Jupiter and the Moon meet in the sky? \n\nYou want to know what the blazing bright object in the evening sky is? You want to be always up-to-date which celestial events are visible from your location? Then this app is a must-have for you!\n\nThe app does not only include a live, zoomable sky map telling you what sky object you are looking at but provides you with loads of detailed extra information on stars, planets, deep sky objects, meteor showers, comets, asteroids, lunar and solar eclipses as well as detailed ephemeris of all included sky objects and an interactive top-down view of the Solar System. All that in just one app!\n\nMain Features\n\n- Zoomable sky map showing stars, planets, asteroids, and more (above and below the horizon)\n- Interactive top-down view of the Solar System\n- Live mode (point device on sky and get information on what you see)\n- Calendar showing detailed descriptions of celestial events\n- Push celestial events to your phone's calendar and set a reminder alarm\n- Rise, set, and transit times for any object\n- Position of any object in the sky (altitude and direction)\n- Twilight times, length of day\n- Bright Star Catalog (~9000 stars) with detailed information\n- More than 400 000 additional stars from the PPM Star Catalog (Android 3.1 or higher required)\n- 2500 selected NGC objects (galaxies, clusters, ...)\n- Messier Catalog (110 objects) complete with images\n- Caldwell Catalog (110 objects) complete with images\n- Hidden Treasures Catalog (109 objects) complete with images\n- Meteor streams (begin, maximum, hourly rate, ...)\n- Lunar and solar eclipses information\n- Lunar librations, ascending node, maximum declination\n- Bright comets (automatically selected according to the date)\n- Dwarf planets: The five known dwarf planets\n- Minor planets: bright, near Earth, trans-Neptune (more than 10000 in the database)\n- Update database online: download up-to-date orbital elements of comets and minor planets\n- Moon phases, the apparent view of the sun and planets\n- Current image of the Sun and sunspot number\n- Automatically generated visibility report for any object\n- Simulation of light pollution\n- Intuitive User Interface: quickly find what you are looking for\n- Widget with rise &amp; set times of the Sun and Moon\n- Maintain your favorite locations in a list\n- Automatic location determination from the mobile network or GPS\n- Select a location from a built-in database or online via Google Maps\n- 400 observatory locations\n- Choose any time and date\n- Detailed ephemeris, visibility information of all objects\n- Dates of conjunctions between any object with planets or the Moon\n- 3D-view of the Moon and the planets\n- Accurate calculations for dates between 1900 and 2100\n\nWhat's New:\n\n- Quicker launch of app\n- New Time Slider: change the time or day by sliding a finger\n- Navigation in Top Down View improved\n- Improved on-screen object information in Sky View and Top Down View\n- Atmospheric extinction taken into account in Sky View (stars fainter near the horizon)\n- New button in Menu for quick access of Sky Zenith View\n- Change stellar field depth\n- Improved object selection on double-tap in Sky View\n- Zoom with volume buttons\n- Updated French translation\n- Small bug-fixes\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.kreappdev.astroid&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.kreappdev.astroid&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bfb1c08e9f9236b69e83bee8200fecad73c8bfe9","amp;dn":"Mobile+Observatory+-+Astronomy+v2.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb1c08e9f9236b69e83bee8200fecad73c8bfe9","infoHashBuffer":{"type":"Buffer","data":[191,177,192,142,159,146,54,182,158,131,190,232,32,15,236,173,115,200,191,233]},"announce":[],"urlList":[]}}