{"title":"The Fixx - Stand or Fall [promo].VOB","uid":6056107,"size":156295168,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c06f78e1b8c5d97d0cdd32d60c823df670de4a64&amp;dn=The+Fixx+-+Stand+or+Fall+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1292921369,"description":"The Fixx - Stand or Fall [promo].VOB\n\n\n\nHQ rare promo music video. &quot;Stand or Fall&quot; is a song from Shuttered Room, the debut studio album by British new wave band The Fixx, released in 1982.\n\nShuttered Room has been released in a number of different configurations. Though the front cover artwork remains consistent across the releases, the tracks, track order, and even the credits can vary from release to release\n\nBassist Charlie Barret left The Fixx just after the recording of their first album, Shuttered Room, in 1982. This album featured the band's initial hits, &quot;Stand or Fall&quot; and &quot;Red Skies&quot;, both of which charted in the US and the UK, albeit outside of the top 50. (They would be the band's only charting singles ever in the UK.) The band found particular success in Canada, where &quot;Stand or Fall&quot; was a top 10 hit. The band achieved its greatest success in the U.S. and Canada.\n\nBarret was replaced on bass by Alfie Agius for the Shuttered Room tour. Agius' stay in the band was short-lived, though, as he left during the 1983 recording of their next album Reach the Beach, after having recorded three tracks. Agius is credited as co-writer on all the album's tracks, but the group for this album was officially credited as a quartet (Curnin, Greenall, West-Oram and Woods).\n\nReach the Beach became (and remains) the group's most commercially successful album. Agius' bass work is featured on the album's first two singles &quot;Saved by Zero&quot; and &quot;One Thing Leads to Another&quot;. Both these singles cracked the US top 40, and &quot;One Thing Leads To Another&quot; became the band's biggest-ever hit (#3 Canada, #4 US, and #33 Australia). Replacement bassist Dan K. Brown performed on one album track, which was also the third US top 40 single from the album: &quot;The Sign of Fire&quot;. \n\nBrown filled the bass spot in the Fixx for the subsequent tour, and was promoted to full membership status in the band. He stayed with The Fixx until 1994, when he left the band and later went on to play the tuba professionally '.' Chris Tate was later hired to play the bass until 2003, when Gary Tibbs, formerly a member of Roxy Music, The Vibrators and Adam and the Ants, replaced Tate on bass.\n\nLong-time bassist Dan K. Brown re-joined the band in 2008, replacing Tibbs. The Fixx regularly tour the U.S., and recently celebrated 25 years of making music together, accompanied by the release of the 2 CD set Twentyfifth Anniversary Anthology compilation.\n\nThe Fixx are recording their 10th studio album &quot;Something Ahead of You&quot; due for release in April 2011.\n(video does not have any logos)\n\n\n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Shuttered_Room&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Shuttered_Room&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Fixx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Fixx&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/aAbckAAdJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aAbckAAdJ&lt;/a&gt; \n  \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9641kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:03:46\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*       &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:c06f78e1b8c5d97d0cdd32d60c823df670de4a64","amp;dn":"The+Fixx+-+Stand+or+Fall+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c06f78e1b8c5d97d0cdd32d60c823df670de4a64","infoHashBuffer":{"type":"Buffer","data":[192,111,120,225,184,197,217,125,12,221,50,214,12,130,61,246,112,222,74,100]},"announce":[],"urlList":[]}}