{"title":"Best Witness: The Mel Mermelstein Affair and the Triumph of Hist","uid":11720875,"size":1061760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c09754dba91091e4daf6655b25906696d3ab8111&amp;dn=Best+Witness%3A+The+Mel+Mermelstein+Affair+and+the+Triumph+of+Hist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424808292,"description":"Cutting through veritable mountains of misinformation and silence, this is the book that describes the little-known trial of Mel Mermelstein vs. the Institution for Historical Review and Libery Lobby. Working from a six-foot pile of sworn depositions, court filings and trial records, the author confronts the most untouchable issue of our day, the so-called &quot;Holocaust&quot; of six millions Jews by the Nazis. Neither the author, Michael Collins Piper, nor the IHR nor Liberty Lobby &quot;deny the Holocaust&quot;. But they know - as do all criminal investigators and millions of murder mystery fans - that the truth is in the details&quot;. And to get at the truth of the holocaust, allegedly the greatest crime of history, the details have to be known. The trial of the IHR and Liberty Lobby became the trial of Mel Mermelstein, as the reader will see. The book contains only a fraction of the whole truth about the holocaust but it is important for that reason. As it turned out, Mel Mermelstein, the self-described &quot;best witness&quot; to the holocaust, with the aid of five law firms, the entire press of the world and a Jewish judge, came out a bad loser against two institutions with no Establishment support whatsoever and the hostility of the press. The book will be revelation to most readers and a bitter pill to many who may have forgotten that in America those who debunk sacred cows have rights as well as those who worship them","torrent":{"xt":"urn:btih:c09754dba91091e4daf6655b25906696d3ab8111","amp;dn":"Best+Witness%3A+The+Mel+Mermelstein+Affair+and+the+Triumph+of+Hist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c09754dba91091e4daf6655b25906696d3ab8111","infoHashBuffer":{"type":"Buffer","data":[192,151,84,219,169,16,145,228,218,246,101,91,37,144,102,150,211,171,129,17]},"announce":[],"urlList":[]}}