{"title":"Aaliyah - Aaliyah (Bonus Track Version) (256kbps M4A itunes)","uid":9747124,"size":127245354,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c0ba72cca34772d60fee246f6106f4a7fc9d1623&amp;dn=Aaliyah+-+Aaliyah+%28Bonus+Track+Version%29+%28256kbps+M4A+itunes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":15,"time":1394599787,"description":"Aaliyah is the third and final studio album by American R&amp;B recording artist Aaliyah, released on July 7, 2001, by Blackground Records and Virgin Records. After releasing her 1996 album One in a Million and raising her profile with hit soundtrack singles, Aaliyah started working on the album in 1998, but rescheduled its recording around her developing film career. She resumed its recording in 2000 at Sing Sing Studios in Australia, where she shot her role for the 2002 film Queen of the Damned during the day and recorded songs at night. Aaliyah worked primarily with Blackground's in-house crew of writers and producers, including Bud'da, J. Dub, Rapture, and Eric Seats, as well as longtime collaborator Timbaland.\n\nAn R&amp;B and neo soul album, Aaliyah has a diverse musical style that incorporates contemporary urban genres such as funk, hip hop, and soul, as well as electronica, Middle-Eastern, alternative rock, and Latin elements. Its production is characterized by synthesizer melodies, fragmented beats, distorted guitar, and eccentricly manipulated vocals and song structures. The album's lyrics explore the complexities of romantic relationships and stages of love, with perspectives that veer between a sexy, empowered female and a scorned lover. Most of the album was written by lyricist Static, who shared a close friendship and strong rapport with Aaliyah. She viewed the album as a reflection of herself as both a young adult and a matured vocalist.\n\nUpon its release, Aaliyah received highly positive reviews from critics, who praised its creative R&amp;B production, Static's songwriting, and Aaliyah's vocal performance. It debuted at number two on the Billboard 200, but sold diminishingly afterwards. Since Blackground and Virgin wanted a high charting single to increase sales, Aaliyah shot a music video for &quot;Rock the Boat&quot; in the Bahamas, but died in a plane crash on a return flight to the United States on August 25, 2001. After her death, the album's sales skyrocketed and propelled it to number one on the Billboard 200. By December 2009, it had sold 2.6 million copies, according to Nielsen SoundScan. Aaliyah was released during a period of peak activity in contemporary R&amp;B and, since its initial reception, has been cited by critics as one of the best R&amp;B albums of its time.\n\n\n\n\n\n\n\n\nTrack listing\t\n\n1. &quot;We Need a Resolution&quot; (feat. Timbaland)\n2. &quot;Loose Rap&quot; (feat. Static Major)\n3. &quot;Rock the Boat&quot; \n4. &quot;More Than a Woman&quot; \n5. &quot;Never No More&quot;\n6. &quot;I Care 4 U&quot; \n7. &quot;Extra Smooth&quot;\n8. &quot;Read Between the Lines&quot;(feat. Static Major) \n9. &quot;U Got Nerve&quot; \n10. &quot;I Refuse&quot;\n11. &quot;It's Whatever&quot;\n12. &quot;I Can Be&quot;\n13. &quot;Those Were the Days&quot;(feat. Static Major)\n14. &quot;What If&quot;\n15. &quot;Try Again&quot;\n\n\n\n\nAlbum for Your Itunes\n","torrent":{"xt":"urn:btih:c0ba72cca34772d60fee246f6106f4a7fc9d1623","amp;dn":"Aaliyah+-+Aaliyah+%28Bonus+Track+Version%29+%28256kbps+M4A+itunes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0ba72cca34772d60fee246f6106f4a7fc9d1623","infoHashBuffer":{"type":"Buffer","data":[192,186,114,204,163,71,114,214,15,238,36,111,97,6,244,167,252,157,22,35]},"announce":[],"urlList":[]}}