{"title":"Brother Sun, Sister Moon [1972] 720x480 - XviD + Norsub","uid":4946606,"size":1467697535,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c0db2ccb46c41d57a6b7b40d9b7d26708391e380&amp;dn=Brother+Sun%2C+Sister+Moon+%5B1972%5D+720x480+-+XviD+%2B+Norsub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1244684053,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOR...\n\nVerifire.\n____________________________________________________________________________\n\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nI've translated the movie about Francisco of Assisi into Norwegian, and in this upload it's not hard subbed, but included as a separate .srt file, so that your DivX player can play it with or without the Norwegian subs. Later on I'll probably both make a hard subbed version, and also a PAL-DVDR-image of the movie..\nBut for now it's like this. Which is the way most people want it, anyhow.. :-)\n\nBut I really need somebody to devote some time and disk-space and bandwidth to seed this further, or else it'll die. I've got no more bandwidth or else my machine gets overloaded and nobody gets anything, really.. Please..?\n\nThe movie is directed by Franco Zeffirelli, which a little later on made the movie &quot;Jesus of Nazareth&quot;.\n\nIt's obvious that this movie was made during the &quot;flower-power&quot;-period, smack dab in the middle of it, and there are some very soft and dreamy (and of course catholic) sequences now and then. Especially when it comes to the music,  Donovan has made and performs the songs, and one of them I haven't even bothered to translate, since it's so esoteric and &quot;New Age'ish&quot;.\n\nThe movie as a whole, though, is a nice contrast to most of the movies made in the times we live in. And most of all the story of the life of Francisco contrasts so many of the so called &quot;men of God&quot; of our age, and their version of the Gospel of Jesus..\n\nAnyway. My intension with this upload is to leave you in a good mood and with the seed and sprout of hope still alive and maybe even watered to grow stronger..\n\nWith warm regards to you all and prayers of true peace from the Prince of Peace Himself, Jesus Christ of Nazareth..\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e096859289868992858d81898ca0878d81898cce838f8d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:c0db2ccb46c41d57a6b7b40d9b7d26708391e380","amp;dn":"Brother+Sun%2C+Sister+Moon+%5B1972%5D+720x480+-+XviD+%2B+Norsub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0db2ccb46c41d57a6b7b40d9b7d26708391e380","infoHashBuffer":{"type":"Buffer","data":[192,219,44,203,70,196,29,87,166,183,180,13,155,125,38,112,131,145,227,128]},"announce":[],"urlList":[]}}