{"title":"Alan Moore - Tom Strong complete (36 issues) [CBR]","uid":4895916,"size":385094736,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1bf78e349692d92cb542cce360daf3524baa162&amp;dn=Alan+Moore+-+Tom+Strong+complete+%2836+issues%29+%5BCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242326791,"description":"ALAN MOORE, &quot;TOM STRONG&quot;\nAMERICA'S BEST COMICS | ENGLISH | 1999-2006 | ISSUES 1-36 | CBR\n\n\nTom Strong, the title character, is a &quot;science hero&quot;. He was raised in a high-gravity chamber and given an intensive education by his somewhat eccentric scientist of a father, on the fictional West Indian island of Attabar Teru. His upbringing, plus ingesting a root used by the natives of the island for health and long life, have made him nearly physically and mentally perfect. Though born at the dawn of the 20th century, he only appears to be in his forties as of the year 2000.\n\nStrong has a wife, Dhalua, and a daughter, Tesla, both with enhanced physical and mental abilities and longevity. He resides in a building called the Stronghold in Millennium City. He is also assisted by Pneuman, a steam powered robot, and King Solomon, a gorilla with human characteristics. His greatest foe was tuxedo-clad &quot;science villain&quot; Paul Saveen.\n\nThe character draws inspiration from the classic heroes of pulp magazines like Doc Savage, along with an upbringing taken from both Tarzan and Superman, an attitude and knowledge (and hairstyle) reminiscent of Reed Richards and Tom Mix, and a name that is a nod to Tom Swift. Many cultural threads are represented in this archetypically modern comic book superhero. Additionally, the retro feel and nostalgia that is inherent in the title/character have prompted comparisons with titles such as Astro City and Planetary (given their shared inspirations).","torrent":{"xt":"urn:btih:c1bf78e349692d92cb542cce360daf3524baa162","amp;dn":"Alan+Moore+-+Tom+Strong+complete+%2836+issues%29+%5BCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1bf78e349692d92cb542cce360daf3524baa162","infoHashBuffer":{"type":"Buffer","data":[193,191,120,227,73,105,45,146,203,84,44,206,54,13,175,53,36,186,161,98]},"announce":[],"urlList":[]}}