{"title":"Scorpions - Send Me An Angel  (2nafish)","uid":5331889,"size":108726276,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c298314193c950811ee79ac899e7b0154e0dfd2c&amp;dn=Scorpions+-+Send+Me+An+Angel++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265156740,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Send Me an Angel&quot; is a power ballad by German hard rock group Scorpions, released on their 1990 album Crazy World. Along with &quot;Wind of Change&quot;, it became the album's signature track, reaching number 44 on Billboard Hot 100 Chart, number 8 on the Mainstream Rock Chart and high chart positions in many European countries. In Poland, it peaked at #3.\n\nAn orchestral version of the song was recorded for the 2000s orchestral album Moment of Glory that features vocals split with Italian famous singer Zucchero. An acoustic version of the song was also recorded for the 2001's acoustic album Acoustica. The song was also covered by the German pop organist Klaus Wunderlich on one of his last albums, &quot;Keys for Lovers&quot;. It was featured on an episode of Cold Case.\n\nThe song is not to be confused with the 1980s dance hit by Real Life.\n\nCrazy World is the eleventh studio album by the German heavy metal band Scorpions released in November 1990. Crazy World peaked at number 21 on Billboard 200 Chart for albums in 1991. The song &quot;Wind of Change&quot; reached number four on the Billboard Hot 100 in 1991, and &quot;Send Me an Angel&quot; reached number 44 on the Billboard Hot 100 chart.\n\nScorpions are a heavy metal/hard rock band from Hanover, Germany, probably best known for their 1980s rock anthem &quot;Rock You Like a Hurricane&quot; and their singles &quot;No One Like You&quot;, &quot;Send Me an Angel, &quot;Still Loving You&quot;, and &quot;Wind of Change&quot;. The band has sold over 100 million albums worldwide, and they were ranked #46 on VH1's Greatest Artists of Hard Rock program. &quot;Rock You Like a Hurricane&quot; is also #18 on VH1's list of the 100 Greatest Hard Rock Songs. After 45 years of performing, the band continues to tour and record music. On January 24, 2010, the band announced that they will be retiring after touring in support of their forthcoming album Sting in the Tail.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c298314193c950811ee79ac899e7b0154e0dfd2c","amp;dn":"Scorpions+-+Send+Me+An+Angel++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c298314193c950811ee79ac899e7b0154e0dfd2c","infoHashBuffer":{"type":"Buffer","data":[194,152,49,65,147,201,80,129,30,231,154,200,153,231,176,21,78,13,253,44]},"announce":[],"urlList":[]}}