{"title":"Carl Sagan - Cosmos - Custom DVD","uid":4420268,"size":13345865728,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c2efbe888e7c9b21b19ea51db16595e41fe6fe62&amp;dn=Carl+Sagan+-+Cosmos+-+Custom+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spotswood","files":3,"time":1222739707,"description":"&quot;Yesterday I seeded for you, today you seed for others!&quot; - Your uploading reminder.\n\nI recommend people with hdtv's to go out of their way and purchase an upscale dvd player(s).  These do not enhance current dvd titles in your possession to &quot;true&quot; hd, but it sure as hell makes it look better, at the least, more pleasurable!  A website with insightful information is located here: &lt;a href=&quot;\nhttp://hometheater.about.com/od/hometheatervideobasics/qt/dvdvidupscale.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hometheater.about.com/od/hometheatervideobasics/qt/dvdvidupscale.htm&lt;/a&gt;\n\n\n\n* Uploaded: September 29, 2008 *\n\n3 custom DVD's containing all 13 episodes.  One of the greatest collections to have in your possession.  No subs, in English.\n\nCheck out my other torrents: &lt;a href=&quot; http://thepiratebay.se/user/spotswood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/spotswood/&lt;/a&gt;\n\nWhen Cosmos was first broadcast in 1980, our world--and the context of Carl Sagan's eloquent &quot;personal journey&quot;--was a different place. The late Dr. Sagan would be pleased to witness the cooling of the cold war, the continued exploration of space, and ongoing efforts to curb our destructive dependence on fossil fuels. For Sagan's series is far more than a guided tour through &quot;billions and billions&quot; of stars and galaxies. It remains a profound plea for the unity of humankind, for the recognition that &quot;we are a way for the universe to know itself,&quot; with an obligation to know our origin, our place in the universe, and our future potential.\n\nIn the course of 13 fascinating hours, Cosmos spans its own galaxy of topics to serve Sagan's theme, each segment deepening our understanding of how we got from there (simple microbes in the primordial mud) to here (space-faring civilization in the 21st century). In his &quot;ship of the imagination,&quot; Sagan guides us to the farthest reaches of space and takes us back into the history of scientific inquiry, from the ancient library of Alexandria to the NASA probes of our neighboring planets. Upon this vast canvas Sagan presents the &quot;cosmic calendar,&quot; placing the 15-billion-year history of the universe into an accessible one-year framework, then filling it with a stunning chronology of events, both interstellar and earthbound.\n\nFrom the lives of the stars, to creation theories, functions of the human brain, and the ongoing search for extraterrestrial intelligence, Cosmos asks big questions. When appropriate, Sagan offers big answers, or asks still bigger--and yes, even spiritual--questions at the boundaries of science and religion. What's most remarkable about Cosmos is that it remains almost entirely fresh, with few updates needed to the science that Sagan so passionately celebrates. It is no exaggeration to say that Cosmos--for all the debate it may continue to provoke--is a vital document for humanity at a pivotal crossroads of our history.\n\nlatest torrent: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4907499/Lost_-_Season_5_-_CUSTOM_DVD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4907499/Lost_-_Season_5_-_CUSTOM_DVD&lt;/a&gt;\n\nPRISON BREAK SEASON 4: &lt;a href=&quot; http://thepiratebay.se/torrent/4934652/Prison_Break_-_Season_4_-_CUSTOM_DVD_(good_quality)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/4934652/Prison_Break_-_Season_4_-_CUSTOM_DVD_(good_quality)&lt;/a&gt;","torrent":{"xt":"urn:btih:c2efbe888e7c9b21b19ea51db16595e41fe6fe62","amp;dn":"Carl+Sagan+-+Cosmos+-+Custom+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2efbe888e7c9b21b19ea51db16595e41fe6fe62","infoHashBuffer":{"type":"Buffer","data":[194,239,190,136,142,124,155,33,177,158,165,29,177,101,149,228,31,230,254,98]},"announce":[],"urlList":[]}}