{"title":"san francisco gay pride parade - june 2014 - HDTV RIP","uid":10465452,"size":2610931367,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c368a975a401df65f3797d178e0f3d6c508b3962&amp;dn=san+francisco+gay+pride+parade+-+june+2014+-+HDTV+RIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rigorkrad","files":-1,"time":1404183821,"description":" &lt;a href=&quot;http://www.sfpride.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.sfpride.org/&lt;/a&gt;\n\noriginal recording was HDTV recorded off of KOFY TV 20 on june 29th 2014.\n\nthe parade ran long. so it cut off the ending. the parade is 3 hours and 31 minutes long. some if not all commercials are skipped. features employees from \nintel, apple, the girlscouts all celebrating sf pride. \n\n\nH.264 MPEG-4  AVC\n720X400\n\nMPEG AUDIO AAC STEREO\n\n\nPride parades (also known as pride marches, pride events, and pride festivals) for the LGBT community are events celebrating lesbian, gay, bisexual, and transgender (LGBT) culture and pride. The events also at times serve as demonstrations for legal rights such as same-sex marriage. Most pride events occur annually, and many take place around June to commemorate the Stonewall riots, a pivotal moment in modern LGBT social movements.\n\n\nover 100,000 people attended this event.\n\nongressmember Nancy Pelosi, San Francisco Mayor Ed Lee and assorted state and local politicians rolled along San Francisco's Market Street along with gay San Francisco Police Department officers holding hands with their significant others as their children skipped ahead.\n\nSeveral elementary schools, summer camps and other groups representing families and children were part of the parade along with the San Francisco Gay Men's Choir, who belted out tunes along the way such as &quot;New Beginning.&quot; Empty cans of glitter hair spray, liquor bottles and plastic beads littered the route that was thronged on both sides with cheering spectators.\n\nSocial media circles were abuzz Sunday when photos of Apple CEO Cook were posted showing him at a San Francisco pride-related event. Multiple Apple employees said Cook made a surprise appearance at company pre-parade festivities, where he greeted and took pictures with employees but did not join the sizable Apple contingent that marched in the Sunday parade down Market Street downtown.\n\nCook's sexual orientation has been a running subject of discussion among tech and business media, including an instance as recently as Friday on CNBC when a host described Cook as gay in a segment about a dearth of gay high-level business executives. The Apple leader has made no public statements about the matter, and Apple did not return phone calls Sunday night.\n\nOne year later\n\nThis year's &quot;honorary grand master,&quot; was U.S. Army Pvt. Chelsea Manning, who had the same title last year rescinded because of so many complaints. Manning is serving a 35-year sentence in a military prison in Fort Leavenworth, Kansas, after being convicted of sending classified documents to anti-secrecy website WikiLeaks.\n\nShe joined the Army as a man named Bradley, but changed her name to Chelsea after being diagnosed with gender dysphoria, the sense of being a woman in a man's body. Manning's supporters Sunday defended the decision to name her a grand marshal.\n\n&quot;She's a hero, she's a whistle-blower who exposed wrongdoing,&quot; said Jeff Paterson, founder of the Pvt. Manning Support Network. &quot;She's the only openly transgender person active in the military.&quot;\n\nSpectators and visitors have been flocking to the city for a week, crowding San Francisco's bars, restaurants and other public gathering places. The San Francisco Police Department opened two special command centers in the city and reported 65 public intoxication arrests along with six felony arrests Saturday night.\n\nNonetheless, for some veterans of the parade, the annual event has lost some of its edge as it gains mainstream acceptance.\n\n&quot;There's less partying,&quot; said Larry Pettit, who said he attended the first parade. &quot;There's less sex. Everyone's interested in politics and no one is having sex.&quot; \n","torrent":{"xt":"urn:btih:c368a975a401df65f3797d178e0f3d6c508b3962","amp;dn":"san+francisco+gay+pride+parade+-+june+2014+-+HDTV+RIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c368a975a401df65f3797d178e0f3d6c508b3962","infoHashBuffer":{"type":"Buffer","data":[195,104,169,117,164,1,223,101,243,121,125,23,142,15,61,108,80,139,57,98]},"announce":[],"urlList":[]}}