{"title":"The Great Dictator (1940) PAL","uid":10060717,"size":4675079885,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c3708f9d6af3f5f8734b0906ca1510d4698d0ce7&amp;dn=The+Great+Dictator+%281940%29+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ubehage","files":-1,"time":1398723239,"description":"The Great Dictator (1940)\n-------------------------\n&quot;Chaplin talks . . while You Laugh ! His greatest comedy since &quot;Shoulder Arms&quot; and &quot;the Gold Rush&quot; !&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0032553&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0032553&lt;/a&gt;\n\nAudio: English\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\nExtra materials:\n- none.\n\n\nPlot outline:\nDuring the last days of the First World War, a clumsy soldier saves the life of devoted military pilot Schultz. Unfortunately, their flight from the advancing enemy ends in a severe crash with the clumsy soldier losing his memories. After quite some years in the hospital, the amnesia patient gets released and reopens his old barber shop in the Jewish ghetto. But times have changed in the country of Tomania: Dictator Adenoid Hynkel, who accidentally looks very similar to the barber, has laid his merciless grip on the country, and the Jewish people are discriminated against. One day, the barber gets in trouble and is brought before a commanding officer, who turns out to be his old comrade Schultz. So, the ghetto enjoys protection from then on. Meanwhile, Dictator Hynkel develops big plans, he wants to become Dictator of the whole world and needs a scapegoat for the public. Soon, Schultz is being arrested for being too Jewish-friendly, and all Jews except those who managed to flee are transported into Concentration Camps. Hynkel is planning to march into Osterlich to show off against Napaloni, Dictator of Bacteria, who already has deployed his troops along the other border of the small country. Meanwhile, Schultz and the barber manage to escape, guised in military uniforms. As luck would have it, Schultz and the barber are picked up by Tomanian forces and the barber is mixed up with Hynkel himself. The small barber now gets the once-in-a-lifetime chance to speak to the people of Osterlich and all of Tomania, who listen eagerly on the radio.","torrent":{"xt":"urn:btih:c3708f9d6af3f5f8734b0906ca1510d4698d0ce7","amp;dn":"The+Great+Dictator+%281940%29+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3708f9d6af3f5f8734b0906ca1510d4698d0ce7","infoHashBuffer":{"type":"Buffer","data":[195,112,143,157,106,243,245,248,115,75,9,6,202,21,16,212,105,141,12,231]},"announce":[],"urlList":[]}}