{"title":"Manifesting the Mind - by Andrew Rutajit (2009)","uid":6638514,"size":732538119,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c4a39c88f331afb769076081f1a623f11395bf72&amp;dn=Manifesting+the+Mind+-+by+Andrew+Rutajit+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naba888","files":2,"time":1314655068,"description":"Manifesting the Mind - by Andrew Rutajit (2009)\n\nBouncing Bear Films - A Film by Andrew Rutajit. \n\nBouncing Bear Films is proud to announce our first documentary film. This film is the first in a series of three films discussing various aspects of shamanism. This first film, Manifesting the Mind, is a broad look at psychedelics in general. Why are psychedelics so brutally suppressed in our culture? What exactly are some of the psychedelic plants and chemicals and how can they benefit us? With philosophy and insight from Dennis McKenna, Daniel Pinchbeck, Alex Grey, and many others, this film is not to be missed by anyone interested in psychedelics and shamanism. \n\nInterviews include - Robert Bussinger, Mike Crowley, Timothy Freke, Peter Gandy, Alex Grey, Clark Heinrich, Nick Herbert, John Major Jenkins, Dennis McKenna, Terence McKenna, Daniel Pinchbeck, and Dr. Rick Strassman.\n\nFiles: .avi, Xvid (Perian), 560 x 336, Millions, MPEG Layer 3, Stereo, 48.000 kHz, 790.78 kbits/s, 02:02:28.80\n\nComment: I found this on one of my old hard-drives - it may have originated from concen.\n\ntags: mind, documentary, shaman, psychedelic, plant, altered, consciousness, meditation, enlightenment, illumination, entheogen, drug, psychotropic, hallucinogen, GOD, Lucifer","torrent":{"xt":"urn:btih:c4a39c88f331afb769076081f1a623f11395bf72","amp;dn":"Manifesting+the+Mind+-+by+Andrew+Rutajit+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4a39c88f331afb769076081f1a623f11395bf72","infoHashBuffer":{"type":"Buffer","data":[196,163,156,136,243,49,175,183,105,7,96,129,241,166,35,241,19,149,191,114]},"announce":[],"urlList":[]}}