{"title":"Path of the Pole","uid":6097073,"size":431779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4d9bb18ea22101b82a810d57c3b7cbb041dd198&amp;dn=Path+of+the+Pole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1294818757,"description":"At last Charles Hapgood's book on earth crust displacement is available for everyone to read. The book, which has been out of print for nearly two decades, is the fundamental statement of his theory. Having corresponded with Hapgood for the last five years of his life I know how pleased he would be to see his book back in print. Also, having read the nearly two hundred pages of correspondence between Albert Einstein and Hapgood, I can say that most of the issues the two men discussed are contained in PATH OF THE POLE.\n\nHowever, the description of the book given here is way off base. Hapgood NEVER predicted another earth crust displacement in the year 2000. This is NOT his theory. In his last letter to me, just weeks before he was killed in an automobile accident, he did write that he thought another crustal displacement would occur but not for THOUSANDS of years. Charles would also object to the new subtitle (Cataclysmic Poleshift Geology). First of all, Hapgood thought that each earth crust displacement took as much as 5,000 years to complete (a point upon which we disagreed) so his theory wasn't &quot;cataclysmic&quot; in the sense that the word is used today. Nor would Hapgood have used the term 'poleshift' because it confuses the reader into thinking that the earth's axis is altered (it is only the outer shell of the earth's mass that is shifted in Hapgood's theory).\n\nMany people will argue that this book is out of date and that advances in geology have made it obsolete. NOT true. The issues that Hapgood covers, such as the geography of the ice ages and the sudden demise of millions of animals during the late Pleistocene remain persistant UNEXPLAINED problems in science.\n\nAside from the misrepresentations (possibly misunderstandings) in the publisher's book blurb this is still the key book to read first on earth crust displacement. I believe that WHEN THE SKY FELL: IN SEARCH OF ATLANTIS advances Hapgood's theory into new areas of investigation (origins of agriculture, Atlantis, the sun-deluge and the lost island paradise motif in world mythology, etc.) but any serious investigation of the topic must begin with PATH OF THE POLE. Readers of this book should also acquire MAPS OF THE ANCIENT SEA KINGS which Hapgood thought of as a companion book. \n &lt;a href=&quot;\nhttp://www.amazon.com/Path-Pole-Charles-Hapgood/dp/0932813712/ref=sr_1_1?ie=UTF8&amp;qid=1294815139&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Path-Pole-Charles-Hapgood/dp/0932813712/ref=sr_1_1?ie=UTF8&amp;qid=1294815139&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:c4d9bb18ea22101b82a810d57c3b7cbb041dd198","amp;dn":"Path+of+the+Pole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d9bb18ea22101b82a810d57c3b7cbb041dd198","infoHashBuffer":{"type":"Buffer","data":[196,217,187,24,234,34,16,27,130,168,16,213,124,59,124,187,4,29,209,152]},"announce":[],"urlList":[]}}