{"title":"Stat Labs: Mathematical Statistics Through Applications","uid":4943532,"size":1645283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c58a3af526294fa293cac5982b5b3d4cc7c6d741&amp;dn=Stat+Labs%3A+Mathematical+Statistics+Through+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1244555808,"description":"Stat Labs: Mathematical Statistics Through Applications blends mathematical statistics with modern statistical practice. It turns the traditional teaching of mathematical statistics on its head by making a case study the centerpiece of each chapter. Chapters begin with the introduction of a real problem followed by a description of the data collected to address the problem, rich background material to put the problem in context, and suggestions for investigating the problem. This novel approach to bringing data analysis into the theoretical course is ideal for motivating and illustrating standard statistical techniques, for helping students understand mathematical statistics, and for showing how statistics can be useful in a wide variety of contexts. Stat Labs is designed for use in a calculus-based introductory statistics course. It would be equally effective as a stand-alone text or as a supplement to a traditional mathematical statistics text. Deborah Nolan received her Ph.D in Statistics from Yale University, and she is now Professor of Statistics at the University of California, Berkeley. Her research interests include high-dimensional modeling, the teaching of statistics, and the use of technology in education. She has also been involved in encouraging women into research careers in the mathematical sciences, and in 1997 edited the volume, Women in Mathematics: Scaling the Heights for the Mathematical Association of America. Terry Speed's professional activities center around teaching and research involving th application of statistics to genetics and molecular biology. He spends 50% of his time in the Department of Statistics of the University of California at Berkeley, and the other 50% with the Genetics and Bioinformatics Group of the Walter &amp; Eliza Hall Institute of Medical Research in Melbourne, Australia.\n","torrent":{"xt":"urn:btih:c58a3af526294fa293cac5982b5b3d4cc7c6d741","amp;dn":"Stat+Labs%3A+Mathematical+Statistics+Through+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c58a3af526294fa293cac5982b5b3d4cc7c6d741","infoHashBuffer":{"type":"Buffer","data":[197,138,58,245,38,41,79,162,147,202,197,152,43,91,61,76,199,198,215,65]},"announce":[],"urlList":[]}}