{"title":"Osho_The Last Testament_Vol-5 #12_India-Kulu-Manali","uid":15586988,"size":544527431,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c5aa3ed8482a65166f945f2fa5f23ac79d57a3ec&amp;dn=Osho_The+Last+Testament_Vol-5+%2312_India-Kulu-Manali&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":4,"time":1471471173,"description":"This is talk in Manali, India, after Rajneeshpuram.\r\nVideo is not of high quality, but there are 2 mp3 files and text in folder.\r\nContent in this video is given also as an audio (mp3) with 2 separate titles; as &quot;Light on the path #02&quot; and The Last Testament vol-5 #12.Text may be found also in 2 diferent books :Light on the Path 02, and The Last testament vol5 #12, which is earlier edition.\r\nVideo \r\nFile size                                : 403 MiB\r\nDuration                                 : 1h 39mn\r\nBit rate                                 : 434 Kbps\r\nWidth                                    : 704 pixels\r\nHeight                                   : 576 pixels\r\nFrame rate                               : 15.000 fps\r\nStandard                                 : PAL\r\naudio:                                     AAc\r\nBit rate                                 : 128 Kbps\r\nChannel(s)                               : 2 channels\r\nSampling rate                            : 44.1 KHz\r\n\r\nsome of the questions:\r\n\r\nQuestion 1\r\nBhagwan,\r\nGREETINGS FROM THE INDIAN &quot;RAJNEESH TIMES&quot; FAMILY AND EVERYONE AT THE RAJNEESHDHAM NEO-SANNYAS COMMUNE. THERE ARE MANY SANNYASINS BOTH IN INDIA AND ABROAD WHO HAVE NEVER SEEN YOU, BUT THEIR LOVE FOR YOU AND THEIR COMMITMENT TO YOUR VISION IS AWE-INSPIRING. HOW EXACTLY DOES THIS HAPPEN -- THIS MUCH LOVE, THIS MUCH TRUST?\r\n\r\nIt is in fact easier if you have not seen me, and yet the love has happened, the commitment. It will be far more pure, far more unconditional, far more impersonal. Seeing me, being with me, and yet loving me totally, is more difficult.....\r\n\r\nQuestion 2\r\nBELOVED OSHO,\r\nTHE MEDIOCRE PEOPLE CREATE MUCH FUSS AND FERVOR, MISINTERPRETING THE LOVING,  SILENT, SOFT AND MEDITATING SANNYASINS AS BRAINWASHED. WHAT DO YOU SAY ABOUT  THIS STATE OF AFFAIRS?\r\n\r\nQuestion 3\r\nBhagwan,\r\nIT SEEMS THAT THE U.S. AUTHORITIES AND GOVERNMENT -- AND THE GOVERNMENTS  AROUND THE WORLD -- ARE MORE SHOCKED BY YOUR SANNYASINS' TOGETHERNESS AND  COURAGE THAN WE OURSELVES WERE BY THEIR BRUTAL MISTREATMENT OF YOU. Bhagwan,  DO YOU FEEL WE HAVE MISSED SOMETHING; OR WHAT ELSE MAY WE LEARN FROM SUCH  EXTREME SITUATIONS?\r\n\r\nNo, you have not missed anything. It was so new for you that you could not figure out what was  happening; you were in a state of confusion. But you showed your strength perfectly well, and you  made the American government aware that they cannot do anything to me without destroying their  own image of democracy. It was a high-risk thing","torrent":{"xt":"urn:btih:c5aa3ed8482a65166f945f2fa5f23ac79d57a3ec","amp;dn":"Osho_The+Last+Testament_Vol-5+%2312_India-Kulu-Manali","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5aa3ed8482a65166f945f2fa5f23ac79d57a3ec","infoHashBuffer":{"type":"Buffer","data":[197,170,62,216,72,42,101,22,111,148,95,47,165,242,58,199,157,87,163,236]},"announce":[],"urlList":[]}}