{"title":"Uncle Tupelo - 89-93 An Anthology [MP3].rar","uid":3799980,"size":128249575,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5e1064a9d158475e9b01c03da481e7644c6a4d4&amp;dn=Uncle+Tupelo+-+89-93+An+Anthology+%5BMP3%5D.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Nalanod","files":1,"time":1189271877,"description":"Uncle Tupelo - 89/93: An Anthology\n\nSo, almost exactly a decade after Uncle Tupelo recorded their third and best album (March 16-20, 1992), along comes this 21-song retrospective, 89/93: An Anthology. This collection is meant to be an appetizer, something to get old and new fans alike interested in the proper albums, three of which will be reissued later this year (all but Uncle Tupelo&amp;#039;s final album, Anodyne, have been out of print for quite some time). As such, Anthology is a bit haphazard and not much of a cohesive listening experience. Anthology&amp;#039;s goals seem split between pleasing diehards with a few rarities (a demo, an unreleased B-side, a live cut, a radio session track) and seeking new converts by means of a good band overview.\n\nUncle Tupelo&amp;#039;s best moments are Jay Farrar&amp;#039;s. It was unquestionably his band, and he was hitting his songwriting peak just as they were breaking up. His &quot;Graveyard Shift&quot; (from No Depression) evokes the vast expanse of possibility inherent in the combination of country and punk traditions. Songs like &quot;Whiskey Bottle&quot; and &quot;Still Be Around&quot; should, by all rights, sit alongside Creedence Clearwater Revival&amp;#039;s best work in the future canon of classic rock. And speaking of Creedence, Anthology rescues from oblivion Tupelo&amp;#039;s sinister cover of &quot;Effigy&quot; (it originally appeared on 1993&amp;#039;s No Alternative comp). Tracks like these have an undeniable exuberance and bear the mark of a great band.\n\nBut Anthology tries to even the score by giving equal time to both of Tupelo&amp;#039;s songwriters, and Jeff Tweedy&amp;#039;s early material falls a little flat. Tweedy was clearly operating in Farrar&amp;#039;s shadow in Uncle Tupelo, and many of his songs (&quot;Screen Door,&quot; for example) seem like they&amp;#039;re trying too hard to achieve some sort of approval. Tweedy had developed into a distinct songwriter in his own right by the second half of Tupelo&amp;#039;s existence, as evident here on &quot;Black Eye&quot; and &quot;New Madrid.&quot; Both songs hint at the mysterious and complex lyrical turns he would explore later with Wilco.\n\nWhen it was all said and done, Uncle Tupelo left a legacy far bigger than their recorded output. Hordes of bands would pick up where they left off, and many would be content to stay right there. Fortunately, Uncle Tupelo had the good sense to split up when they did before they were forced to choose between upholding tradition or evolving into something else. Like the Johnny Cash song, Uncle Tupelo walked the line, and were damn good at it.\n\n\nTRACK LISTING\n\n01. No Depression\n02. Screen Door\n03. Graveyard Shift\n04. Whiskey Bottle\n05. Outdone (1989 demo)\n06. I Got Drunk\n07. I Wanna Be Your Dog (previously unreleased)\n08. Gun\n09. Still Be Around\n10. Looking for a Way Out (acoustic version)\n11. Watch Me Fall\n12. Sauget Wind\n13. Black Eye\n14. Moonshiner\n15. Fatal Wound\n16. Grindstone\n17. Effigy\n18. The Long Cut\n19. Chickamauga\n20. New Madrid\n21. We&amp;#039;ve Been Had (live)","torrent":{"xt":"urn:btih:c5e1064a9d158475e9b01c03da481e7644c6a4d4","amp;dn":"Uncle+Tupelo+-+89-93+An+Anthology+%5BMP3%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5e1064a9d158475e9b01c03da481e7644c6a4d4","infoHashBuffer":{"type":"Buffer","data":[197,225,6,74,157,21,132,117,233,176,28,3,218,72,30,118,68,198,164,212]},"announce":[],"urlList":[]}}