{"title":"Who Will Shout If Not Us?: Student Activists and the Tiananmen S","uid":8308915,"size":11787433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c62f56a0d3f0afb3cba1960918556d4ce25002d9&amp;dn=Who+Will+Shout+If+Not+Us%3F%3A+Student+Activists+and+the+Tiananmen+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tmPhoneix","files":1,"time":1364428513,"description":"Book Description\nPublication Date: October 2010 | Series: Civil Rights Struggles Around the World\n&quot;In the blink of an eye, the tank was approaching the sidewalk and closing in on me. It seemed as if the barrel of its gun was inches from my face. I could not dodge it in time.&quot;Â¯Fang Zheng, a student demonstrator at Tiananmen Square\nIn the spring of 1989, university students in Beijing grabbed world headlines with a courageous stand against decades of Communist authoritarian rule in China. Thousands and then millions of students and workers from all over China gathered on the city's Tiananmen Square to support demands for democracy, clean government, and increased personal freedoms. China's premier, Li Peng, and his supporters wanted to crush the demonstration, and the government declared martial law on May 12. The world watched as army tanks and troops reached the city center on June 2. Soldiers fired their guns as students struggled to flee. A single demonstrator captured international attention as viewers around the globe watched him face off against encroaching military tanks. The army was in control of Beijing, and thousands of demonstrators were killed, wounded, or arrested. In this gripping story of a historic clash between repressive government forces and individuals seeking freedom, we'll explore the reasons that led students in China to defy authority. We'll learn the details of their demands and of the shattering events that followed when they took to the streets to press for their civil rights.","torrent":{"xt":"urn:btih:c62f56a0d3f0afb3cba1960918556d4ce25002d9","amp;dn":"Who+Will+Shout+If+Not+Us%3F%3A+Student+Activists+and+the+Tiananmen+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62f56a0d3f0afb3cba1960918556d4ce25002d9","infoHashBuffer":{"type":"Buffer","data":[198,47,86,160,211,240,175,179,203,161,150,9,24,85,109,76,226,80,2,217]},"announce":[],"urlList":[]}}