{"title":"[SexArt] - Luna - Se Telefonando - HD - NEW 16 JULY 2014 NEW","uid":10565547,"size":230255090,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c63af9f228567fda484ec2b6c43388d85f968621&amp;dn=%5BSexArt%5D+-+Luna+-+Se+Telefonando+-+HD+-+NEW+16+JULY+2014+NEW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manam69","files":1,"time":1405515821,"description":"[SexArt] - Luna - Se Telefonando - HD - NEW 16 JULY 2014 NEW\n\nDue to a minor miscommunication in post production, the sequel to Alis Locanta's &quot;Se Telefonando&quot; was released prior to the original. Sexart members who enjoyed &quot;Se Telefonando 2&quot; can think of this &quot;new&quot; feature as a &quot;prequel&quot; to that film. And anyone with in interest in this film's star, the ever-sultry Luna, or in steamy solo girl erotica in general, can look forward to a tempting, torrid, treat. Luna is reclining on her bed enjoying a lively and loving phone conversation. Before the call has ended she's beginning to heat up, and immediately after the call is concluded she begins to masturbate. With her absent lover's seductive words still fresh in memory she slides a hand into her panties and begins to play with herself. Her casual blouse suddenly becomes confining and she struggles out of it, then proceeds to squeeze and caress her delicate breasts while her other hand remains at work below her waist. Once her panties are removed, Luna ramps up the intensity of her masturbatory manipulations. The fingers of one hand slide in and out of her lubricated sex while the other hand attends to her clitoris. Alone and extremely aroused, Luna is swept away on the waves of pleasure she's creating for herself. Delivered to a plateau of gratification by her hands, Luna fishes a crystal-pink toy from among the pillows and proceeds to tease, penetrate, and probe her moist and fevered center, eventually arriving at the very peak of ecstasy with unrestrained cries of delight. Cautious call-screeners be advised: When &quot;Se Telefonando&quot; rings, you definitely want to pick up!\n\n\n &lt;a href=&quot;\nhttp://s20.postimg.org/q4eeqm3ct/bbpw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s20.postimg.org/q4eeqm3ct/bbpw.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c63af9f228567fda484ec2b6c43388d85f968621","amp;dn":"%5BSexArt%5D+-+Luna+-+Se+Telefonando+-+HD+-+NEW+16+JULY+2014+NEW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63af9f228567fda484ec2b6c43388d85f968621","infoHashBuffer":{"type":"Buffer","data":[198,58,249,242,40,86,127,218,72,78,194,182,196,51,136,216,95,150,134,33]},"announce":[],"urlList":[]}}