{"title":"Diehard Dungeon v1.7.6","uid":11226547,"size":59148240,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c81d2004d1df0fb4d6c498e24377e34d6c18bf91&amp;dn=Diehard+Dungeon+v1.7.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1413453336,"description":"&quot;Combining its own unique take on the real-time roguelike genre, with a nostalgic 16-bit look and feel, Diehard Dungeon is a game that feels both familiar and quite different at the same time. Followed by a trusty, treasure collecting companion chest, you must make your way through the dungeons many randomly-generated rooms and levels.&quot;\n\nChangelog:\nv1.7.6:\n- The new enemy spawn system included in the previous patch, inadvertently led to the possibility of enemies (including bosses) that had the ability to teleport, teleporting outside of a boss room, becoming unreachable by the player. This has been fixed.\n- An issue with certain remapped keyboard/mouse controls not responding to the correct key/button press, or an incorrect image being shown has been fixed.\n- Player sword attack -&gt; aim incorrect sprite bug fixed.\nv1.7.5:\n- New chest: Yellow. Yellow chests only contain abilities. They are rarer than green chests and must be destroyed (they are bound in chains) in order to collect the ability.\n- Enemy collision response has been massively improved. The previous system had issues with enemies bouncing off of each other, or seemingly charging/popping instantaneously from one position to another (many times directly into the player). There were also issues with knocking enemies back, where enemies could block each other, forming an almost impenetrable wall. The new system fixes these issues.\n- Champion Mode has been improved. When a good champion wisp explodes, it will inflict the blind status effect on all susceptible enemies, as well as cause a large amount of damage in its explosion radius. Good champion heart drop chance has also been increased. Evil champion movement speed has been decreased. Good/evil champion ratio is now context sensitive; depending on the players current predicament, he/she will be more(or less) likely to encounter one type over the other. Champion spawning is now staggered, so they won't all appear on top of the walls at the same time.\n- Pro Mode option added to options screen. Turn on to disable all warning, ability and item popups. Good for players that already know the game well and want to avoid the interruptions from popups.\n- Arrow traps will no longer activate if the pressure pad is activated off-screen. This is to ensure that rogue projectiles do not appear from nowhere due to an enemy triggering the trap off-screen.\n- All enemy status effect immunities have been reevaluated. Most enemies are now much more susceptible.\n- Minimum room size increased. Rooms will feel more spacious at higher ranks, with more room to avoid enemies/traps.\n- Enemies will no longer spawn near the player when entering a new room.\n- Luck now lasts for 1 minute (used to be 30 seconds) and has been improved.\n- Mines dropped by Goblins are now bigger, so should be easier to spot.\n- Evil Chest teleport attack radius has been reduced.\n- Token wells now drop a necklace as well as gold when it spits out treasure. Treasure values are: gold 10, ring 25, necklace 100. This will be much more useful for leveling the Companion Chest quicker.\n- Spinning blade shooters will no longer shoot projectiles if they are off-screen.\n- Mini Lilly and Toadstool enemies will no longer shoot if they are taking damage. This prevents cheap/unfair deaths due to taking damage at point blank range whilst hitting them with the sword.\n- Spear thrower enemy range decreased slightly.\n- Eye enemy movement speed decreased slightly.\n- Arrow projectiles have had their speed decreased slightly.\n- All bosses that shoot projectiles have now had their projectiles reset properly when encountered again.\n- The shield HUD no longer obscures part of the second row of hearts.\n- Chest damage scale fixed. The accidental overwriting of a sprite caused chests to enlarge after too much damage.\n- Companion Chest Dash ability incorrect sprite fixed.\n\nIf you like the game, support the developer, buy it!  &lt;a href=&quot;\nhttp://store.steampowered.com/app/277870/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/277870/&lt;/a&gt;","torrent":{"xt":"urn:btih:c81d2004d1df0fb4d6c498e24377e34d6c18bf91","amp;dn":"Diehard+Dungeon+v1.7.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c81d2004d1df0fb4d6c498e24377e34d6c18bf91","infoHashBuffer":{"type":"Buffer","data":[200,29,32,4,209,223,15,180,214,196,152,226,67,119,227,77,108,24,191,145]},"announce":[],"urlList":[]}}