{"title":"Radiohammer (1.2) Android","uid":9567659,"size":134241236,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c8b3fd40623d01b69788ea4ee2b089fae5b613f8&amp;dn=Radiohammer+%281.2%29+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1391550536,"description":"* Introduction of Radiohammer *\nRadiohammer is an exciting and easy-to-play rhythm action game in which you play by tapping on the screen to the rhythm.\nAnyone starts off easily but as you progress you will need to demonstrate more rhythmical and flashy moves!\nA variety of characters and backgrounds! Charming enemies and shocking boss stages!\nEnjoy this game with self-produced 70 songs and many more stages!\n\n* Have fun with a variety of game modes *\nIn Story Mode, each character that you choose has a different story and shocking boss stage!\nIn Track Play Mode, you get to play diverse challenge missions that motivate your enthusiasm!\nIn Random Play Mode, you can compete with players around the world for the highest score!\nIn Jukebox Mode, you can listen to original soundtracks!\n\n* Start off easily but never know what you will end up with *\nTouch the screen to the rhythm and that's it?! Isn't that too easy?!\nOf course, you start off easily but as you progress you will figure that the tempo of music increases and the notes become complex!\nTest yourself and get recognition by the Spirit of Rock. Come and get him!\n\n* Additional content updates *\nNew Channels, new characters, and new songs with different styles are soon to be updated!\nA chic girl with the electronic style, 'DJ Numi' is up next for Radiohammer!\nNew music?! Harder levels?! No worries! They are coming up soon!\n\n* Additional in-app charges?! No way! *\nFree games that you have to pay before you even play?!\nWe refuse to be that way! With the initial purchase, you can enjoy all the stories, games, and contents at once. POW!\nNo need to worry about any miscellaneous expenses! We are different from those app developers!\nPurchase once and enjoy it from the cradle to the grave! You can even hand it down to your children!\n\n* Radiohammer Story *\n'Radiohammer Station' is a pirate radio station with super DJs who enjoy worldwide popularity!\nSuper DJs listen to the radio audience's story and rush to the scene to get rid of social evils with music!\nLove and music are the only forces that can truly protect the world peace! Broadcast live all over the world how you defeat social evils!\n\n&lt;version 1.2&gt;\nbug fixed.\npeformence improved.\n&lt;version 1.1&gt;\nRadiohammer launched.","torrent":{"xt":"urn:btih:c8b3fd40623d01b69788ea4ee2b089fae5b613f8","amp;dn":"Radiohammer+%281.2%29+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b3fd40623d01b69788ea4ee2b089fae5b613f8","infoHashBuffer":{"type":"Buffer","data":[200,179,253,64,98,61,1,182,151,136,234,78,226,176,137,250,229,182,19,248]},"announce":[],"urlList":[]}}