{"title":"John R. Gribbin, Not Fade Away: The Life and Music of Buddy Holl","uid":12185010,"size":479923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8e835de672ba982e3aa3b69f60ef9d66e397353&amp;dn=John+R.+Gribbin%2C+Not+Fade+Away%3A+The+Life+and+Music+of+Buddy+Holl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438530609,"description":"'Buddy Holly and The Crickets had an electrifying effect on us as young lads in Liverpool. We were inspired to learn guitar by seeing him on television and listening to his records. That'll Be The Day blew our minds and Lord knows how long we took trying to learn the opening riff. His guitar and vocal style was massively influential on us as writers and players and things would definitely not have been the same without his huge talent. Love ya' Buddy! P.S. The name of his band The Crickets also influenced our choice of band name so those boys have a lot to answer for!' Paul McCartney Buddy Holly was killed at 22 when the plane he was travelling in crashed on 3 February 1959. Although this was less than two years after Holly's first hit record, Don McLean described this as 'the day the music died.' But Sonny Curtis, Holly's friend and musical colleague, told us that the music didn't die, because 'Buddy Holly lives every time you play rock'n'roll.' Fifty years after Holly's death, his lasting influence on pop is clear; a musical based on his life seems set to run for longer than Holly was alive. The Beatles chose That'll Be the Day by Buddy's group The Crickets as their first attempt at recording, as well taking inspiration for their name. Clearly, the music didn't die!","torrent":{"xt":"urn:btih:c8e835de672ba982e3aa3b69f60ef9d66e397353","amp;dn":"John+R.+Gribbin%2C+Not+Fade+Away%3A+The+Life+and+Music+of+Buddy+Holl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8e835de672ba982e3aa3b69f60ef9d66e397353","infoHashBuffer":{"type":"Buffer","data":[200,232,53,222,103,43,169,130,227,170,59,105,246,14,249,214,110,57,115,83]},"announce":[],"urlList":[]}}