{"title":"ICT for the Next Five Billion People","uid":6528177,"size":2733723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c93470d9aa5d72d2a9b1332edcfa7f41ad6dac5d&amp;dn=ICT+for+the+Next+Five+Billion+People&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310225273,"description":"Arnold Picot, Josef Lorenz, &quot;ICT for the Next Five Billion People: Information and Communication for Sustainable Development&quot; \n Publisher: Springer | ISBN: 3642122248 | edition 2010 | PDF | 122 pages | 2.6 mb\n\n Currently, around one to two billion users are able to connect to the Internet, most of them living in the industrialized parts of the world. However, if we want to improve the quality of life of the world population with the help of access to information and education, it is necessary that in the next decade an additional five billion people gain access to the Internet. The next five billion Internet users are mainly living in emerging economies. Therefore, the main challenge is to lower the economic barrier using new approaches for infrastructure deployment and service delivery to billions of people. This book reflects the discussions of the challenges from the MÃƒÂ¼nchner Kreis with representatives from the ICT industry, academia, non-governmental organizations and governmental development organizations, among them many representatives from emerging economies in Africa and Asia. They had highlighted the real demand for ICT, and what impact ICT creates for the wealth and lifestyle of the people.","torrent":{"xt":"urn:btih:c93470d9aa5d72d2a9b1332edcfa7f41ad6dac5d","amp;dn":"ICT+for+the+Next+Five+Billion+People","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93470d9aa5d72d2a9b1332edcfa7f41ad6dac5d","infoHashBuffer":{"type":"Buffer","data":[201,52,112,217,170,93,114,210,169,177,51,46,220,250,127,65,173,109,172,93]},"announce":[],"urlList":[]}}