{"title":"Marilyn Manson - Lest We Forget (Best of) [Ogg Vorbis]","uid":3315376,"size":100338053,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c96537cd81813175948a653880b56c650bc2c023&amp;dn=Marilyn+Manson+-+Lest+We+Forget+%28Best+of%29+%5BOgg+Vorbis%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cuthbert","files":20,"time":1113244368,"description":"Ripped with EAC and oggdropXPd V1.8.3 (libOgg 1.1.2 &amp; libVorbis 1.1.0) using -q6  \n\n1. The Love Song\n2. Personal Jesus\n3. mOBSCENE\n4. The Fight Song\n5. Tainted Love\n6. The Dope Show\n7. This Is The New Shit\n8. Disposable Teens\n9. Sweet Dreams (Are Made Of This)\n10. Lunchbox\n11. Tourniquet\n12. Rock Is Dead\n13. Get Your Gunn\n14. The Nobodies\n15. Long Hard Road Out Of Hell\n16. The Beautiful People\n17. The Reflecting God\n18. (s)AINT\n\nReview by Stephen Thomas Erlewine:\n\nIt's rather ironic that Marilyn Manson, an artist who kept the idea of the concept album alive during the '90s, turns out to have a greater impact as a singles artist, as the 17-track hits compilation Lest We Forget: The Best of Marilyn Manson illustrates. While each of his post-Portrait of an American Family LPs were designed to be heard as a whole, their singles unfailingly distilled the attitude and ideas behind the individual albums to their catchy core. Yes, catchy -- at his best, Marilyn Manson had a knack for a heavy, glammy hook, the kind that's hard to get out of your head, no matter how hard you try. Not every single had a great hook -- Tourniquet is a moody dirge, indicative of what awaits a listener on the album tracks -- but the best of them did, whether it was Lunchbox from the debut, the delirious The Beautiful People, the glam-stomp of The Dope Show, or the Faith No More homage mOBSCENE. All these are here, but Lest We Forget doesn't have all the hits -- charting singles I Don't Like the Drugs (But the Drugs Like Me) and Rock Is Dead are conspicuously missing, as are video hits like Dope Hat, Man That You Fear, and Coma White. These omissions are curious, considering that album tracks and covers are used as substitutions. Nevertheless, it has enough of the hits to make this worthwhile for the casual fans, as well as those listeners who never wanted to admit that these late-'90s alt-rock radio staples were guilty pleasures. [Lest We Forget was also released as a limited-edition set, featuring a bonus DVD containing all the music videos Manson released during the '90s.]","torrent":{"xt":"urn:btih:c96537cd81813175948a653880b56c650bc2c023","amp;dn":"Marilyn+Manson+-+Lest+We+Forget+%28Best+of%29+%5BOgg+Vorbis%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c96537cd81813175948a653880b56c650bc2c023","infoHashBuffer":{"type":"Buffer","data":[201,101,55,205,129,129,49,117,148,138,101,56,128,181,108,101,11,194,192,35]},"announce":[],"urlList":[]}}