{"title":"The Chomsky-Foucault Debate.PDF","uid":4930219,"size":17451392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9b1c6c1b473fb30da62f8e52616e4d227b34725&amp;dn=The+Chomsky-Foucault+Debate.PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gorra09","files":1,"time":1244014041,"description":"Chomsky vs Foucault: A Debate on Human Nature\nThe New Press | 2006 | ISBN 1595581340 | 128 PAGES | PDF |\n\n\nTwo of the twentieth century's most influential thinkers debate a perennial question.\n\nIn 1971, at the height of the Vietnam War and at a time of great political and social instability, two of the world's leading intellectuals, Noam Chomsky and Michel Foucault, were invited by Dutch philosopher Fons Edlers to debate an age-old question: is there such a thing as &quot;innate&quot; human nature independent of our experiences and external influences?\n\nThe resulting dialogue is one of the most original, provocative, and spontaneous exchanges to have occurred between contemporary philosophers, and above all serves as a concise introduction to their basic theories. What begins as a philosophical argument rooted in linguistics (Chomsky) and the theory of knowledge (Foucault), soon evolves into a broader discussion encompassing a wide range of topics, from science, history, and behaviorism to creativity, freedom, and the struggle for justice in the realm of politics.\n\nIn addition to the debate itself, this volume features a newly written introduction by noted Foucault scholar John Rajchman and includes additional text by Noam Chomsky.\n-------\nThis PDF was scanned vertically, so you may need to rotate the view on your reader. Also, about 7 or so pages are missing from the editor's introduction.","torrent":{"xt":"urn:btih:c9b1c6c1b473fb30da62f8e52616e4d227b34725","amp;dn":"The+Chomsky-Foucault+Debate.PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b1c6c1b473fb30da62f8e52616e4d227b34725","infoHashBuffer":{"type":"Buffer","data":[201,177,198,193,180,115,251,48,218,98,248,229,38,22,228,210,39,179,71,37]},"announce":[],"urlList":[]}}