{"title":"Hard Truck II King of the Road v1.3 by 666ripper666","uid":4043187,"size":299098283,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9e07439737aa5c4ec79c1a8c49733061f7ac477&amp;dn=Hard+Truck+II+King+of+the+Road+v1.3+by+666ripper666&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mikemouse","files":1,"time":1203780540,"description":"King of the Road: Hard Truck II v1.3 By 666ripper666\n\n\nYou can start a game and play without once releasing the wheel\nuntil you win or lose (it could last a month). The game takes place in continuous time\nin a world of many miles of roads, where night succeeds day,\nand road and weather conditions change right before your eyes.\n\n The scene is laid out in modern times. The place is somewhere close to a massive mountain. A network of roads, connecting small towns covers the region. Each town has a depot that puts in orders for goods, as they are consumed by the townsfolk. The cargo is delivered by trucks. The player is one of the long-haul truckers who runs about the region looking for a gainful order and peddles wares from town to town. The profit depends on the shortage of the merchandize delivered, so the quickest player makes the most.\n\nAs the game goes on, a successful driver can upgrade the truck or change it to another one, and then is able to buy another (and another, etc.) truck and even hire a bankrupted rival. The strategic goal of the game is to monopolize the delivery business. \n\n Features:\n\n    * Super realistic 3D graphics quality, dynamic lighting\n    * Contiguous road net, variety of alternative and secret ways (more then 120 km total)\n    * Dynamically changed of atmospheric conditions, day-and-night races\n    * Complex terrain, different road conditions, marshes, lakes, off road, canyons, mountain serpentines\n    * Abundance of special effects (tire marks, exhaust, blinding by sun and lens flare, rain, fog, storm)\n    * Mobility of the driver within the cabin.\n    * First, third and panoramic views\n    * Rear view mirrors\n    * Realistic physics, ergonomic adjustable controls, steering wheel force feedback support\n    * Intensive arterial and road traffic (more then 150 cars totally in the game)\n    * Powerful built-in economic system\n    * Considerable facilities for replay\n    * Three multiplayer modes\n    * Windows 9x/2000 support; up to 1024x768 screen resolution\n    * Direct3D hardware accelerators support \n\n","torrent":{"xt":"urn:btih:c9e07439737aa5c4ec79c1a8c49733061f7ac477","amp;dn":"Hard+Truck+II+King+of+the+Road+v1.3+by+666ripper666","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9e07439737aa5c4ec79c1a8c49733061f7ac477","infoHashBuffer":{"type":"Buffer","data":[201,224,116,57,115,122,165,196,236,121,193,168,196,151,51,6,31,122,196,119]},"announce":[],"urlList":[]}}