{"title":"Used (Unlovable #1) (2014) Lynetta Halat (multi)","uid":9549231,"size":1552045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca4ef87996ca77d507ad367e409583144b7f4b9d&amp;dn=Used+%28Unlovable+%231%29+%282014%29+Lynetta+Halat+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1391204657,"description":"\nUsed (Unlovable #1) by Lynetta Halat\n\n\nFormat: mobi/epub/azw3\nLength: 275 pages\nGenre: New Adult Romance\nDate: 17 January 2014\n\nI am a slut. No worries. I've come to terms with it, and you will too. I'm not one of those girls who thinks she's too plain, too fat, too skinny, too shy...no, I don't have that kind of luck. I'm the girl who knows she's just right for everyone. - Denver\n\nA reputation as a manwhore-with-a-heart-of-gold tends to precede me. But, I don?t do girls with issues, that is until this girl. It's this girl I want to fix. This girl I want to protect. And maybe...more. - Ransom\n\nBeing in love with the same girl your entire life isn't all it's cracked up to be. She uses me in every way imaginable. How does she see me? I am her perpetual one-night stand. No strings, no attachments. Just mind-numbing sex...for her anyway. - Greer\n\nFeeling like the life is being choked out of her in the small town of Anaconda, Montana, Denver Dempsey craves the escape that college offers...even if that means leaving her 'best friend with benefits' and looking for a new way to forget. Thinking she's found the perfect hookup in Ransom, Denver's outlook on college is bright. That is, until Greer shows up looking for a second chance, and Ransom's interest turns to hatred.\n\nLove. Hate. Triangle.\n\nWho's using who?\n\nAuthor:\n\nFor as long as she can remember, Lynetta Halat has lived to read and has written countless stories and plays since she was a young girl. A teacher by day and an avid reader and closet writer by night, she has always dreamt of penning books that people could connect with and remember; and her first novel, Every Rose, is the perfect catalyst to launch her into the world of publishing.","torrent":{"xt":"urn:btih:ca4ef87996ca77d507ad367e409583144b7f4b9d","amp;dn":"Used+%28Unlovable+%231%29+%282014%29+Lynetta+Halat+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca4ef87996ca77d507ad367e409583144b7f4b9d","infoHashBuffer":{"type":"Buffer","data":[202,78,248,121,150,202,119,213,7,173,54,126,64,149,131,20,75,127,75,157]},"announce":[],"urlList":[]}}