{"title":"The Who - The Kids Are Alright (Special Edition) 1979 NTSC DVD","uid":3282350,"size":4670031872,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ca62c95cdc7708dd5f327e0c49caab77c69881e2&amp;dn=The+Who+-+The+Kids+Are+Alright+%28Special+Edition%29+1979+NTSC+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Beria00","files":18,"time":1106869021,"description":"The Kids Are Alright\nType: DVD 5: Process under DVD decrypter \n\n...Number of discs: 1 of 2, number 2 comes friday night...\n\nStarring: Roger Daltrey, John Entwistle, Keith Moon, Pete Townshend...\nDirector: Jeff Stein\n\nFormat: Color, Widescreen\nAspect Ratio(s): 1.85:1\nAudio Encoding: Dolby Digital 5.1, Dolby Digital 2.0 Surround\n\nStudio: Pioneer\nDVD Release Date: September 30, 2003\nDVD Features:\nsubtitles: English\nAudio Tracks: English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround)\nCommentary by Jeff Stein\nRestored to the original &amp;quot;Director's Cut&amp;quot; length of 109 minutes\nAlmost 100 minutes of never-before-seen multi-camera angle footage\n\nHalf its members may be dead and its leader may be keeping a low profile, but the Who remains enormously popular. Devotees who haven't availed themselves of Jeff Stein's thrilling, self-mocking 1979 documentary about the group shouldn't wait another minute now that the film has been painstakingly--perhaps heroically--restored to its theatrical-release length from original elements. The sound is clearer than on previous video releases, images are once more crisp and color-rich, and adjustments in tape speed make the Who sound like themselves again, particularly in vintage television performances and filmed club dates from as far back as the band's sonically thrilling, early R&amp;amp;B period. Special features are, shall we say, extensive: 100 or so minutes of multiple-angle footage, an insightful interview with Roger Daltrey, a featurette about the film's restoration, and a mesmerizing, isolated John Entwistle audio track.\n\nSPECIAL EDITION FEATURES:\n* Roger Daltrey - An incredible new on-camera interview from this living legend\n* Multi Camera Angles - An extremely rare feature that is almost 100 minutes and featuring as many as 6 angles including a Pete cam, a Roger cam, a Moonie cam and an Ox cam\n* Making of the DVD - 40 minute feature offering an in-depth look at how the film was restored\n* Audio Comparison - This 8 minute feature provides a direct side-by-side comparison of the before and after audio\n* Video Comparison - This 6 minute feature provides a direct side-by-side comparison of the before and after so people can see what they've been missing all these 24 years!\n* The Ox - A very special audio feature allowing the user to select an isolated audio track of legendary bassist John Entwistle\n* The Who's London - An interactive feature offering the viewer a video tour of Who landmarks\n* Trivia Games - Questions to test your knowledge with a prize of a newly mixed 5.1 rendering of the album version of 'Who Are You' playing a video light/slide show and a long lost recording of Ringo Starr\n* English Subtitles - Figuring out the lyrics the band is singing is one thing, but deciphering what they say while screaming over each other is whole other puzzle\n\nhttp://www.dvdtimes.co.uk/content.php?contentid=11206\nhttp://www.imdb.com/title/tt0079400/\n\nHoppas att det skall falla er i smaken... Beria","torrent":{"xt":"urn:btih:ca62c95cdc7708dd5f327e0c49caab77c69881e2","amp;dn":"The+Who+-+The+Kids+Are+Alright+%28Special+Edition%29+1979+NTSC+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca62c95cdc7708dd5f327e0c49caab77c69881e2","infoHashBuffer":{"type":"Buffer","data":[202,98,201,92,220,119,8,221,95,50,126,12,73,202,171,119,198,152,129,226]},"announce":[],"urlList":[]}}