{"title":"[M@nI] Naruto Shippuden/Shippuuden 249 720p (Dual Audio) English","uid":10590635,"size":369814370,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca684a606c7efa8f4f60df8e0c14918a306bf3c2&amp;dn=%5BM%40nI%5D+Naruto+Shippuden%2FShippuuden+249+720p+%28Dual+Audio%29+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"canc232","files":1,"time":1405792559,"description":"Naruto Shippuden Ep 249 720p Dual Audio &quot; Thank You &quot;\n\nINFO:\n=====\nVideo Source File : HorribleSubs\nEpisode : 249\nAudio language : English,Japanies\nSubtitle : English(Softsub)\nFormat : MKV\nFile size : 350 MB\nDuration : 23min 9sec\nResolution : 1280x720\nVideo Bit Rate : 1 776 Kbps Kbps Kbps\nAudio Bit Rate : 224 kbps(English) , 322 kbps(Jpn)\n\nSummary:\nAcknowledging his defeat, Tobi once again relocates to a safe distance from the Fourth, but not before stating he will have another chance at world conquest, and then he too, teleports away. Minato arrives in Konoha and asks Gamabunta to keep the Nine-Tails still while he prepares to teleport it to a safer location. After relocating to another place, he takes Kushina and their newborn, and Kushina restrains the Nine-Tails using her chakra chains before Minato himself can set a barrier. Kushina intends to use the last of her chakra to pull the fox back to her with her so it will die with her. Minato prepares to seal away half the fox, telling Kushina he'll conserve her chakra to give her a chance to see Naruto one last time at a later point. Kushina protests the use of the Dead Demon Consuming Seal, asking Minato why he is sacrificing himself so she can meet Naruto for a few minutes when he's older. He convinces her that it's the right thing to do because &quot;he could never substitute for her&quot; and it would cause power imbalances between the nations if Konoha didn't have a jinchÅ«riki. The death god grabs the Nine-Tails and seals half of it. Minato summons Gerotora and gives him the key to the seal he's about to put on Naruto. Kushina gives Naruto a long list of things to do, then Minato performs the Eight Trigrams Sealing Style. In the present, Kushina apologises to Naruto for not being there and he tells her he didn't know what a parent's love was like, but he managed. Naruto thanks his parents for making him their son and tells them that his vessel is full of love from the both of them. As Kushina fades away, she thanks him for letting her and Minato be his parents and thanks him for being born to them","torrent":{"xt":"urn:btih:ca684a606c7efa8f4f60df8e0c14918a306bf3c2","amp;dn":"%5BM%40nI%5D+Naruto+Shippuden%2FShippuuden+249+720p+%28Dual+Audio%29+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca684a606c7efa8f4f60df8e0c14918a306bf3c2","infoHashBuffer":{"type":"Buffer","data":[202,104,74,96,108,126,250,143,79,96,223,142,12,20,145,138,48,107,243,194]},"announce":[],"urlList":[]}}