{"title":"Thunderbirds - The Movie (ENG FR DUTCH) 2Lions-Team","uid":5148843,"size":4591034143,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:caceb5bb0231343fd4cfd17c57282d6f7cddea9b&amp;dn=Thunderbirds+-+The+Movie+%28ENG+FR+DUTCH%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1257436447,"description":"Thunderbirds - The Movie - 2004 \n\n\nVerenigde Staten / Frankrijk / Verenigd Koninkrijk\nActie / Science-Fiction\n95 minuten\n\ngeregisseerd door Jonathan Frakes\nmet Brady Corbet, Debora Weston en Soren Fulton\n\nHet is de bijna eindeloze taak van de voormalige astronaut Jeff Tracey om de wereld te redden van de gevaren die dreigen. Dit doet hij samen met zij vier oudste zoons en hun vijf ongelooflijke voertuigen, de Thunderbirds. Samen vormen ze International Rescue, een uiterst geheime organisatie waar de hele wereld op vertrouwt. Thans bevinden ze zich echter in een hachelijke situatie: ze zijn in de val gelokt door hun aartsvijand, The Hood. The Hood heeft hun technologie en hun hightech ruimtevaartuigen in beslag genomen en heeft ze ingezet voor zijn eigen kwaadaardige bedoelingen. Wat The Hood niet weet, is dat Alan, de jongste zoon, zich nog op het eiland bevindt. Maar is Alan wel in staat om zijn familieleden te redden ...en daarmee de hele wereld?\n      \n\n \n  De populaire Britse Tv-serie Thunderbirds uit de jaren '60 is nu te zien als live-actionfilm. Het is 2010. De Thunderbirds hebben een ramp met een booreiland weten te voorkomen en keren terug naar hun geheime basis. daar blijkt dat hun ruimtestation (Thunderbird 5) zwaar beschadigd is, wat waarschijnlijk veroorzaakt is door een meteoriet. Wat ze echter niet weten is dat het helemaal geen ongeluk is, maar een aanval van de internationale crimineel 'Hood'. Hij wil het eiland overnemen en de geniale 'Brains' gebruiken voor zijn eigen plannetje...\n\n\nEnglish\n\nThe year is 2010. Teenager Alan Tracy, sent off to a distant boarding school, is the youngest of the sons of Jeff Tracy, a retired American astronaut. Jeff, a widower, has formed International Rescue, and raised his sons to act as a secret, volunteer organization which uses highly advanced technology to save lives worldwide. Jeff and his older sons John, Virgil, Scott, and Gordon, who like Alan were named after the Mercury Seven astronauts are joined in this effort by Lady Penelope and her butler/chauffeur Parker. Their futuristic hardware is largely developed by a genius scientist known as Brains, who lives at the International Rescue base on Tracy Island, somewhere in the Pacific\n\n\n\n\nSubs: English,Dutch, France\nAudio : English,Dutch, France Dolby Digital 5.1 \nBeeld: 16x9\nDe Cover en Label:  Yes\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail pal\n \n \nGenre : Avontuur\nScience Fiction\nKinderfilm\n\nWeblink : http://www.moviemeter.nl/film/8757\nWeblink : http://www.imdb.com/title/tt0167456\n \n***************************************** \n\nBrought to you by \nPioen \n2Lions Team \n\n\n\nmeer zien?? \nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.","torrent":{"xt":"urn:btih:caceb5bb0231343fd4cfd17c57282d6f7cddea9b","amp;dn":"Thunderbirds+-+The+Movie+%28ENG+FR+DUTCH%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caceb5bb0231343fd4cfd17c57282d6f7cddea9b","infoHashBuffer":{"type":"Buffer","data":[202,206,181,187,2,49,52,63,212,207,209,124,87,40,45,111,124,221,234,155]},"announce":[],"urlList":[]}}