{"title":"Complete contents list of Great Science Textbooks Library 2007","uid":4599983,"size":286865,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbacd6b35daab61cbafde45cd4002712ef7561ce&amp;dn=Complete+contents+list+of+Great+Science+Textbooks+Library+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DJNed","files":1,"time":1230158416,"description":"I've managed to compile a complete contents list of the entire Great Science Textbooks Library 2007 ebook collection (or at least all the books until the most recent update, Dec 08). They are categorised by subject and should be in alphabetical order. If there are any mistakes, it is more than likely to be an error made by myself as I did all the compiling by hand.\n\nThe good thing about this torrent is that you can now see the entire contents _without_ duplicates (I've removed what I could, and have kept in any I wasn't sure about, so there may still be some duplicates). Unfortunately, the disk that each file is on is not written in this contents list. That was deliberate as I felt it would be better to see the collection as a whole.\n\nI'm still in the process of downloading the collection myself, but will probably re-upload the whole collection by subject, rather than by disk, as I understand that many people only want books from a specific topic. If I have time in the future, I may get round to removing _all_ duplicates, changing some names of the files around (to be consistent, rather than the current situation of having some files listed by author and some by title), and organizing the books in a more specific manner so specific topics are easy to find books on.\n\nI hope that this contents list will be of use to at least someone.","torrent":{"xt":"urn:btih:cbacd6b35daab61cbafde45cd4002712ef7561ce","amp;dn":"Complete+contents+list+of+Great+Science+Textbooks+Library+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbacd6b35daab61cbafde45cd4002712ef7561ce","infoHashBuffer":{"type":"Buffer","data":[203,172,214,179,93,170,182,28,186,253,228,92,212,0,39,18,239,117,97,206]},"announce":[],"urlList":[]}}