{"title":"Process Simulation and Control Using Aspen - Amiya K. Jana","uid":12489644,"size":97345832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc1be67aa4d848a8be6186d16e0ccde4ebb85928&amp;dn=Process+Simulation+and+Control+Using+Aspen+-+Amiya+K.+Jana&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1443148207,"description":"Process Simulation and Control Using Aspen - Amiya K. Jana (PHI, 2009).pdf\r\n\r\nISBN 978-81-203-3659-9\r\n\r\nThis well organized book is divided into three parts. Part I (Steady State Simulation and Optimization using Aspen Plus ) includes three chapters. Chapter 1 presents the introductory concepts with solving the lash chambers. The computation of bubble point and dew point temperatures is also focused. Chapters 2 and 3 are devoted to simulation of several reactor models and separating column models, respectively.\r\nPart II (Chemical Plant Simulation using Aspen Plus ) consists of only one chapter (Chapter 4). It addresses the steady state simulation of large chemical plants. Several individual processes are interconnected to form the chemical plants. The Aspen Plus simulator is used in both Part I and Part II.\r\nThe Aspen Dynamics package is employed in Part III (Dynamics and Control using Aspen Dynamics ) that comprises Chapters 5 and 6. Chapter 5 is concerned with the dynamics and control oflow-driven chemical processes. In the closed-loop control study, the servo as well as regulatory tests have been conducted. Dynamics and control of pressure-driven processes have been discussed in Chapter 6.\r\nThe target readers for this book are undergraduate and postgraduate students of chemical engineering. It will be also helpful to research scientists and practising engineers","torrent":{"xt":"urn:btih:cc1be67aa4d848a8be6186d16e0ccde4ebb85928","amp;dn":"Process+Simulation+and+Control+Using+Aspen+-+Amiya+K.+Jana","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc1be67aa4d848a8be6186d16e0ccde4ebb85928","infoHashBuffer":{"type":"Buffer","data":[204,27,230,122,164,216,72,168,190,97,134,209,110,12,205,228,235,184,89,40]},"announce":[],"urlList":[]}}