{"title":"Clancy (Christian Movie)","uid":6587570,"size":949700926,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cc22fe5d4a40ecb52d50f595a07aebab8e37a238&amp;dn=Clancy+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IndianChristian","files":3,"time":1312674114,"description":"Clancy (Christian Movie)\n\n\nFrom the producers of The Perfect Stranger, comes another heartwarming Christian movie, Clancy. This film is a touching story of a girl overcoming horrible situations in her young life with unmovable faith. Very entertaining and keeps you on the edge of your seat. This movie will definitely touch you.  \n\nClancy (Christina Fougnie) is a young girl abused by her mother. Her mother not only physically abuses her, but also blames Clancy for her not having a life or money. She tells Clancy that her life was so much better before she had her. Clancy runs away to avoid being taken away by social workers and hopes while she is gone her mom will get help. On the streets she crosses paths with an angry homeless veteran, Nick (Jefferson Moore).\n\nAn immoral mayor desperate for re-election plots a devious plan to &quot;find&quot; the lost girl. He includes the police chief in his plan to set up the homeless man. With the promise of restarting his life, Nick agrees to keep the girl out of sight. But when a loan shark corners Nick, he and Clancy escape to the country. The corrupt mayor now sets his sights on a more shocking alleged rescue/manhunt across county lines.\n\nClancy is an emotional roller coaster. Viewers will hold their breath in suspense, laugh, and cry. Clancy is a positive child and even though she is abused, she does not let anything get her down. She explains the Gospel to Nick in an easy to understand and effective way. The simple truths that Clancy explains to Nick are what bring the two of them together. As the young girl grows on the homeless veteran he discovers that he wants to care about another person and his own life again. \n\nRuntime: 120 mins\nLanguage: English\nYear: 2009\nMy Rating: 10/10\nQuality: 10/10 \nFormat: avi format \n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic isn't it?\nPlease buy the movies to keep Christian films in business.\n\n2. Please seed the movies for as long as possible. If possible make copies and distribute to your poor neighbors. And please do pray for the movie makers and their families. Remember the Kingdom of Heaven is in you and so is the choice of \nHeaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1e77707a777f707d766c776d6a777f702c2e2e275e677f767171307d71307770&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n\n","torrent":{"xt":"urn:btih:cc22fe5d4a40ecb52d50f595a07aebab8e37a238","amp;dn":"Clancy+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc22fe5d4a40ecb52d50f595a07aebab8e37a238","infoHashBuffer":{"type":"Buffer","data":[204,34,254,93,74,64,236,181,45,80,245,149,160,122,235,171,142,55,162,56]},"announce":[],"urlList":[]}}