{"title":"The passion of the Christ DVD NL (dvd5) RETAIL TBS","uid":6868655,"size":4681452491,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ccf9b8fd1da844682699d14f78812e4125a6eb12&amp;dn=The+passion+of+the+Christ+DVD+NL+%28dvd5%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sammynet","files":28,"time":1323199337,"description":"The passion of the Christ\n\nNederlande\nThe Passion of The Christ is een film over de laatste twaalf uren van het leven van Jezus van Nazareth. De film opent in de Olijventuin (Getsemane) waar Jezus naartoe gaat om te bidden na het Laatste Avondmaal. Jezus verzet zich tegen de verlokkingen van Satan. Verraden door Judas Iscariot, wordt Jezus gearresteerd en meegenomen binnen de stadsmuren van Jeruzalem waar de leiders van de FarizeeÃƒÂ«rs hem confronteren met beschuldigingen van heiligschennis en hem ter dood veroordelen\n\nEngels\nA depiction of the last twelve hours in the life of Jesus of Nazareth, on the day of his crucifixion in Jerusalem. The story opens in the Garden of Olives where Jesus has gone to pray after the Last Supper. Betrayed by Judas Iscariot, the controversial Jesus--who has performed 'miracles' and has publicly announced that he is 'the Son of God'--is arrested and taken back within the city walls of Jerusalem. There, the leaders of the Pharisees confront him with accusations of blasphemy; subsequently, his trial results with the leaders condemning him to his death. Jesus is brought before Pontius Pilate, the Roman Governor of Palestine, for his sentencing. Pilate listens to the accusations leveled at Jesus by the Pharisees. Realizing that his own decision will cause him to become embroiled in a political conflict, Pilate defers to King Herod in deciding the matter of how to persecute Jesus\n\n\n127 minuten\nCategory: Image\nSource:   DVD\nLanguage: Aramaic/Latin\nSubtitles:English/Dutch\nAudio:    Dolby Digital 5.1 / DTS 5.1","torrent":{"xt":"urn:btih:ccf9b8fd1da844682699d14f78812e4125a6eb12","amp;dn":"The+passion+of+the+Christ+DVD+NL+%28dvd5%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccf9b8fd1da844682699d14f78812e4125a6eb12","infoHashBuffer":{"type":"Buffer","data":[204,249,184,253,29,168,68,104,38,153,209,79,120,129,46,65,37,166,235,18]},"announce":[],"urlList":[]}}