{"title":"Robby Krieger Career - 5 Albums","uid":5446319,"size":491746083,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd9b93d1dba0862d52745ca9fabd482395df60a7&amp;dn=Robby+Krieger+Career+-+5+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"JugzG0nn4G3tY4","files":5,"time":1269027744,"description":"Robby Info:\n\nCinematix (2000)\nLegendary guitarist from the Doors delivers a solo effort of rock/jazz fusion \ntunes. Featuring guest artists, Billy Cobham, Edgar Winter and more. Highlights \ninclude the single 'War Toad' (Peace Frog Remix) with Jim Morrison on vocals.\nCinematix is a mostly jazz/rock fusion album recorded by Robby Krieger and \nvarious musicians in his orbit, with most songs written or co-written by the \nex-Doors' guitarist. A bonus track is a remix of The Doors' \nclassic &quot;Peace Frog,&quot; called &quot;War Toad&quot; (ha ha)--Jim Morrison's echoing vocals \nmake an appearance, and not surprisingly, this song, with its instrumental \nsupplements, is the highlight. Otherwise, with the exception of a series of \nvery ephemeral odd wailing sounds in the background of &quot;Out of the Mood&quot; \n(which also has other eccentric sound effects), this CD is entirely instrumental.\nFor the most part, it is stream-of-consciousness heavy guitar and bass lines and \npercussion, more often with a jamming rather than a structured feel. However,\nthere are occasional keyboards and sax, and when synthesizers are used they are\nused well, as in Robby's atmospheric &quot;Haunted Spouse,&quot; in which his synth sweeps\nand rich, varied guitar lines conjure up a mystical backdrop. The best track \n(&quot;War Toad&quot; excluded) is &quot;Idolatry,&quot; in which organ and sax combine with \nRobby's melodic guitar lines to dish out the comfort of conventional modern\njazz--yes, I like this better than fusion. &quot;Brandino&quot; blends funk with fusion.\nAt times Cinematix can be boring, such as in parts of the meandering, often \nchoppy and sparse 14:32 &quot;Skip/Missionary Jam.&quot; However, the musical \nworksmanship is always good, and Cinematix is nice to put on when you are \nin the mood for that wall of sound that is unique to fusion.\n\nNo Habla (1990)\nListening to &quot;You're Lost Little Girl,&quot; the finale here, makes me recall \nhearing Robby Krieger play it in a Manhattan club in the 1990s. I was \nimpressed by his ability to put such a modern, distinctive touch on his \nDoors classic, with dexterous slides and soloing. Even as Robby's playing \nwas pretty, his guitar had an edge that set him apart from Doors \nsound-alike guitarists. It resembled what you hear on this 1989 CD more \nthan the excellent but sparse version of &quot;Strange Days.&quot; On &quot;No Habla&quot; \nthe sound is heavier and wailing, more melodramatic; the percussion \ninjects chimes, and there appear to be two sets of keyboards. Arthur \nBarrow's bass is excellent, and Robby does a great final solo. Imagine \nif a certain deceased lead singer were around to croon this haunting \nclassic.... But &quot;No Habla means &quot;no speak&quot; in Spanish; all the songs \nare instrumentals. The other Doors entry, the cool opener &quot;Wild Child,&quot; \nhas Robby's slides sandwiched around a jazz/rock interlude. Jim Morrison\ncomposed this one and inspired the wicked rhythm, and it will always \nbe one of my favorites. The cover songs on &quot;No Habla&quot; give the listener \nan earful of Robby's eclecticism, most notably jazz. Future Robby \nKrieger Organization member Skip Vanwinkle (he performed with Robby \nthat night) makes his only appearance playing keyboards on Ike Turner's \n&quot;It's Gonna Work Out Fine,&quot; but his sound is overshadowed by the funky \ngrooves. &quot;I Want You, I Need You, I Love You&quot; is a stylish rework of \nthe big Elvis hit. Of the remaining five songs, three are Robby \noriginals: &quot;Piggy's Song&quot; and &quot;Eagle's Song,&quot; with jazzy overtones, \nand the eccentric &quot;Love It or Leave It,&quot; with a varying stream of sound \nsurrounding a reggae beat. Robby powers, slithers, and slides all over \nthis CD, and he gets solid help from his entourage of supporting \nmusicians. &quot;No Habla&quot; is a work of lively rhythm, sweeping sounds, \nand an electric aura: You will find no canned music.\n\nThe Butts Band (Here and Now 1975 &amp; The Complete Recordings 1996)\nThe Butts Band came about as a consequence of trying to find a replacement \nfor Jim. The lads were in London in 1973 looking for a new lead singer for\nThe Doors and had auditioned several Brit singers including Howard Werth \n(the singer with Audience), Kevin Coyne (from Siren) and Jess Roden (who \nwas the leader of Bronco). Howard Werth even rehearsing with the band \nfor a week with a view to stepping into Jim's shoes (Audience and Siren \nwere both signed to Elektra in the US as parts of distribution deals with\nthier own labels here Charisma and Dandelion Jac Holzman favoured Howard \nas he had at one stage forseen Audience taking over The Doors spot on \nElektra but the band (Audience) had fallen apart and he now saw Howard \nand The Doors merging as the new Doors) but Ray shied off and went back \nto LA effectively finishing The Doors as a band forever but John and Robby \nhung about in London and began looking for a new project.\nLinking up with Jess, Phil Chen and Roy Davies (of legendary Gonzalez fame \nwho died in 1986 sadly) to form the Butts Band. Thier debut was anything \nbut a 'bunch of losers desperate for a gig' as they produced one of the \nunsung albums of the early 70s. Jess had been a popular vocalist with \nBronco (which also featured Robert Plant side-man Robby Blunt on guitar) \nand his vocal talents would have graced the Doors in 1973 and did a fine \njob for the half of the band that remained. Backed up by the 'mysterious' \nChen (nobody even knows where HE was born) and the funky Davies their \ndebut was a delight with some excellent Krieger gems as well as the song \nof the album written by Roden 'Sweet Danger'!\n\nThis is all I could find on Robby. It is not complete. Zipped to save space.\n\nEnjoy. Seed.\n\n-Jugz","torrent":{"xt":"urn:btih:cd9b93d1dba0862d52745ca9fabd482395df60a7","amp;dn":"Robby+Krieger+Career+-+5+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd9b93d1dba0862d52745ca9fabd482395df60a7","infoHashBuffer":{"type":"Buffer","data":[205,155,147,209,219,160,134,45,82,116,92,169,250,189,72,35,149,223,96,167]},"announce":[],"urlList":[]}}