{"title":"Underground Pipeline Corrosion","uid":12626346,"size":11788780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce1d819c2c95a6a63a3042f8f3ee143fd83acd02&amp;dn=Underground+Pipeline+Corrosion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1445778515,"description":"Underground Pipeline Corrosion (Woodhead Publishing Series in Metals and Surface Engineering No. 63)(2014).pdf\r\n\r\nISBN 9780857095091\r\n\r\nUnderground pipelines transporting liquid petroleum products and natural gas are critical components of civil infrastructure, making corrosion prevention an essential part of asset-protection strategy. Underground Pipeline Corrosion provides a basic understanding of the problems associated with corrosion detection and mitigation, and of the state of the art in corrosion prevention.\r\n\r\nThe topics covered in part one include: basic principles for corrosion in underground pipelines, AC-induced corrosion of underground pipelines, significance of corrosion in onshore oil and gas pipelines, numerical simulations for cathodic protection of pipelines, and use of corrosion inhibitors in managing corrosion in underground pipelines. The methods described in part two for detecting corrosion in underground pipelines include: magnetic flux leakage, close interval potential surveys (CIS/CIPS), Pearson surveys, in-line inspection, and use of both electrochemical and optical probes. While the emphasis is on pipelines transporting fossil fuels, the concepts apply as well to metallic pipes for delivery of water and other liquids.\r\n\r\nUnderground Pipeline Corrosion is a comprehensive resource for corrosion, materials, chemical, petroleum, and civil engineers constructing or managing both onshore and offshore pipeline assets; professionals in steel and coating companies; and academic researchers and professors with an interest in corrosion and pipeline engineering.\r\n\r\n\r\n\r\nReviews the causes and considers the detection and prevention of corrosion to underground pipes\r\nAddresses a lack of current, readily available information on the subject\r\nCase studies demonstrate how corrosion is managed in the underground pipeline industry","torrent":{"xt":"urn:btih:ce1d819c2c95a6a63a3042f8f3ee143fd83acd02","amp;dn":"Underground+Pipeline+Corrosion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce1d819c2c95a6a63a3042f8f3ee143fd83acd02","infoHashBuffer":{"type":"Buffer","data":[206,29,129,156,44,149,166,166,58,48,66,248,243,238,20,63,216,58,205,2]},"announce":[],"urlList":[]}}