{"title":"[NubileFilms] Candy Sweet (Desirable Rouse / 06.27.2013)","uid":8623026,"size":229575543,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ce57a923ec68693d1c1bc739d6dcf0f256905af8&amp;dn=%5BNubileFilms%5D+Candy+Sweet+%28Desirable+Rouse+%2F+06.27.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1372430214,"description":"[NubileFilms] Candy Sweet (Desirable Rouse / 06.27.2013)\n\nCandy Sweet and her man Totti are finally together after a long wait apart, and they can't wait to get reacquainted with each other's bodies.\nTotti gets things started by peeling Candy's clothes off as fast as he can, following his fingers with the warm press of his lips and tongue on her sensitive body.\nCandy isn't about to let her man have all of the fun, though! Springing her beau's erection free from his briefs, Candy settles in between his legs with a smile as she sweeps her tongue from his balls to the tip of his cock and then wraps her eager lips around his member to deliver a long, satisfying blowjob.\nTotti enjoys the moist heat of Candy's mouth before returning to his goal of pleasuring her in every way imaginable! He urges her to stand against the wall with her legs spread so that he can bury his face in the softness of her bottom and lick her tight little anus. Then he lies down and pulls her to kneel on top of his face, putting her sweet shaved pussy in perfect licking position.\nFinally, Totti can't take the anticipation of being inside his woman any longer. He rolls Candy onto her shoulders with her perfect twat fully exposed and sweeps his tongue over her folds to lap at her creamy juices. Then he stands and presses himself deep into her welcoming heat, pressing into her as she moans her happiness.\nTheir initial coupling is fast and furious, but for more sustained sex they need to explore alternate positions. They come together in missionary style, and then Candy rolls Totti over and mounts her personal stud. She rides him with every indication of pleasure, her hips undulating and her full tits bouncing, until she climaxes with a cry of satisfaction.\nWith Candy's inner walls still pulsing they return to the missionary position. Totti thrusts hard and fast in his woman's hot sheath until the urge to cum overwhelms him. Pulling out at the last moment, he releases his seed all over Candy's flat belly and ample breasts.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=6qmm2hgbwxyyyxjdqr7b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=6qmm2hgbwxyyyxjdqr7b.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rt5g5cjfet6xvnndrlxt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rt5g5cjfet6xvnndrlxt.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ce57a923ec68693d1c1bc739d6dcf0f256905af8","amp;dn":"%5BNubileFilms%5D+Candy+Sweet+%28Desirable+Rouse+%2F+06.27.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce57a923ec68693d1c1bc739d6dcf0f256905af8","infoHashBuffer":{"type":"Buffer","data":[206,87,169,35,236,104,105,61,28,27,199,57,214,220,240,242,86,144,90,248]},"announce":[],"urlList":[]}}