{"title":"Need For Speed Porsche 2000","uid":4810416,"size":476127232,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cef86b9fec3b7d5192f0cceafa96f917ea99c5a9&amp;dn=Need+For+Speed+Porsche+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sadneses123","files":1,"time":1238355929,"description":"Need For Speed Porsche 2000\n\nAlso known as Need For Speed - Porsche Unleashed\n\nDrive over 80 different Porsches, from the first 356 Ferdinand to the 2000 911\nTurbo over multiple tracks. Some tracks have alternate paths. Others are rally\ntracks where you go from one end of the track to the other instead of doing\ncircuit racing. The graphics have been enhanced and the physics model changed\nto reflect a true 4-point system, and you can feel the difference between the\ndifferent vehicles\n\nTwo completely different single-player modes available. First, there's factory\ndriver, which have you join Porsche as a test driver. As you complete different\nchallenges, which can vary from doing specific manoeuvres in pre-alloted time\nto racing fellow drivers, you will make your way up to Ace Test Driver\nSecond, there's Evolution, which is the &quot;career mode&quot;, you start with enough\nmoney to buy one 356, and start racing. As you win races, time will pass\nnew cars will become available, or you can peruse the used car market\nBuy/repair/sell cars, win races, buy enhancement parts for your car, and\nmake your way to the end of the modern era\n\nFeatures:\nOver 80 models from 50 amazing years\n9 European open road courses &amp; 5 closed tracks\n4-point physiks model captures the unique feel of each car\n3D cockpits - Advanced in-car view simulates head movement\nMission-based challengesreward you for exceeding the limits\nHigh-Speed thrills with traffic, police and spectacular crashes\nWork with over 700 parts of the official Porsche catalog\nBuy and sell, upgrade, repair, and mantain your cars","torrent":{"xt":"urn:btih:cef86b9fec3b7d5192f0cceafa96f917ea99c5a9","amp;dn":"Need+For+Speed+Porsche+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef86b9fec3b7d5192f0cceafa96f917ea99c5a9","infoHashBuffer":{"type":"Buffer","data":[206,248,107,159,236,59,125,81,146,240,204,234,250,150,249,23,234,153,197,169]},"announce":[],"urlList":[]}}