{"title":"BBC Billy Connelly World Tour of Australia 8of8 Darwin XviD AC3 ","uid":6733998,"size":568553472,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf71f6f317d25db6d8f2f2b9fd50898f941bbd0b&amp;dn=BBC+Billy+Connelly+World+Tour+of+Australia+8of8+Darwin+XviD+AC3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MVGroup","files":-1,"time":1318252946,"description":"World Tour of Australia\n\nTravel Documentary hosted by Billy Connelly, published by BBC in 2004 - English narration\n\n\nInformation\n------------------------------\n\nBilly Connelly - World Tour of Australia \nThis is another instalment in the wonderful Billy Connolly World Tour series. This is not a tourist series as such, although we do go to many tourist attractions, but rather what Billy does on his days off whilst on tour. Because Billy is very well-known and in particular because he is famous for making people laugh, doors open everywhere for him. This series was made before the Harbour Bridge climb was open to the public - &quot;Want to climb the bridge, Billy? Sure, off you go!&quot;. This happens on more than one occasion, including access to the very top (on the outside) of the Opera House.\n\nAll that is cool of course because he takes us with him, capturing some of the most amazing footage of Sydney and other prime locations around Australia. This is no amateur home video - while they are filming from the top of whatever landmark they have talked their way to the top of there is also usually a helicopter to capture views of Billy on the top and so on.\n\nBilly is supposedly doing this tour on a magnificent three-wheeled Harley Davidson - many of the introductions to each location are done by Billy on the trike while navigating the traffic - the footage is recorded by a camera on a vehicle somewhere in front of him. Each episode contains a number of locations around the area where he is performing his stage show, and intercut into the travel footage are excerpts from his show. Most often this is the actual show that was recorded whilst in that location and often contains references to where he has been that day.\n\nBilly's commentary on the various locations that we visit is fantastic - you will sit absolutely absorbed by his observations and often in stitches at the humour that he weaves in. Even though this is Australia and you might think that you have seen all this before, you won't have seen it through Billy's eyes, and he has a truly unique perspective. It is also fascinating to hear a point-of-view about Australia from someone outside.\n\n\n1)  Episode 1: Sydney \nIn this episode we are in Sydney and we explore the Harbour Bridge, Goat Island (from the deck of a tall ship), Doyle's at Rose Bay, The Tank Stream (how can such an important piece of our heritage be closed to the public?) and finally a visit to the home of Ken Done. While at Doyle's and Ken Done's home one of the best parts of this series comes to light. Billy is friends with these people and we get to be a fly on the wall as they have a chat.\n\n2)  Episode 2: Canberra \nWe start at La Peruse. Here we hear Billy's take on the discovery of Australia with a wonderful twist that I won't spoil. From here we head to Canberra. Billy does not like Canberra or politicians one little bit. Billy is a bit of an activist, though I am sure he would prefer the term realist (and so would I, truth be told). He spends a lot of time tearing strips off everything in sight. This section had me literally in stitches, and was worth the price of admission alone in my opinion. After a couple of TV spots, we head off around Circular Quay in Sydney and meet some of the interesting buskers that perform in this area. Finally it is up to the top of the Opera House for another unique view of Sydney Harbour.\n\n3)  Episode 3: Maitland \nWe begin this episode in Newcastle and fishing for ocean trout off Stockton beach. Right here is something rather odd - the F word is one of Billy's favourites and the intercut footage from the stage shows is peppered with the word. But, when he uses it on the beach they bleep him! After finally catching a fish he heads off to Maitland and into a graveyard, the one that contains Les Darcy. After another quick stroll along Circular Quay we end up at the Gallery of Bret Whiteley, here we hear about Billy's friendship with Bret and see some of his works of art.\n\n4)  Episode 4: Melbourne \nHeading down south we arrive in Melbourne. We start at the Westgate Bridge and then move on to the old Melbourne Gaol. While here we hear a little of our history told in Billy's unique style. Next up is the Mornington Peninsula, the infamous location where Harold Holt disappeared. Following a tour of some of the sights of Melbourne we spend the rest of the show at William Ricket's Sanctuary.\n\n5)  Episode 5: Adelaide \nOur trip this time opens in Adelaide and straight away we meet someone interesting - Billy introduces us to Jimmy Pike. Next is a visit to the zoo where we see Billy's favourite animal, the hairy-nosed wombat. Next on the agenda is a pie floater from the famous Great Australian Pie Cart. Heading West we arrive in Perth and then on to Rottnest Island, in a very small boat on a very windy day. Only Billy could handle that one the way he does. Next up is a swim with the dolphins. This is the second time I have seen a great comedian stunned and awed by this experience. The first was Robin Williams, and now Billy Connolly. Billy celebrates his birthday on this tour and then heads off to The Pinnacles. If you have seen Billy's version of the druid dance then you have some idea of what is going to happen here.\n\n6)  Episode 6: Brisbane \nWe start off in Brisbane where Billy heads off for a flight in a glider, a very acrobatic glider. After this we head off to the house lot. You've heard of a car lot? Well, in Brisbane they have house lots where you rock up and chose a house and they then deliver your choice the next day. A short flight takes us out to Fraser Island for the rest of the show.\n\n7)  Episode 7: Coober Pedy \nIn the middle of one of the most God-forsaken places on the planet is Coober Pedy, the opal mining town. Billy takes us on a tour of the mines and inside some of those wonderful underground homes. Heading out again we have a quick look at a section of the dingo fence and then move on to the Todd river, home of the waterless boat race. Next comes the Tanami desert where Billy tries his hand at some bush cooking. He reads an excerpt from the cook book that he is using - we only get a glance at the cover but I am sure it is &quot;Rabbit on a Shovel&quot;. This is a bush cookbook written by a chap that used to be a cook on the cattle trails called 'Lummo' and is one of the best cookbooks in existence. Not only is it invaluable for anyone that is camping as the recipes are simple, but they taste absolutely fantastic. I regularly cook dishes from it at home as well as in the bush. He starts off by helping you build a tucker box and then gives you a list of ingredients to place in this tucker box. All the recipes use ingredients from this list, all of which has very little to do with the DVD of course, so back to the disc.\n\n8)  Episode 8: Darwin \nHeading north brings us to Darwin where Billy sets out to feed some crocodiles and has some fun along the way. Jumping aboard a plane takes us out to Bathurst and Melville Islands where Billy proves that he will eat anything. Of course, such a keen fisherman could not visit the top end without trying his luck with some barramundi. Finally we head back to Sydney for the wrap-up and farewell, which you say with a sad but happy feeling after touring with Billy over these eight episodes.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img3.imageshack.us/img3/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img3.imageshack.us/img3/6820/worldtourofaustraliascr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img249.imageshack.us/img249/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img249.imageshack.us/img249/6820/worldtourofaustraliascr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img43.imageshack.us/img43/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img43.imageshack.us/img43/6820/worldtourofaustraliascr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img707.imageshack.us/img707/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img707.imageshack.us/img707/6820/worldtourofaustraliascr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img692.imageshack.us/img692/9027/worldtourofaustraliascrs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img692.imageshack.us/img692/9027/worldtourofaustraliascrs.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img215.imageshack.us/img215/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img215.imageshack.us/img215/6820/worldtourofaustraliascr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img265.imageshack.us/img265/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img265.imageshack.us/img265/6820/worldtourofaustraliascr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img695.imageshack.us/img695/9565/worldtourofaustraliascrh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img695.imageshack.us/img695/9565/worldtourofaustraliascrh.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/6820/worldtourofaustraliascr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/6820/worldtourofaustraliascr.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1802 kbps\n * Video Resolution: 704 x 480\n * Video Aspect Ratio: 1.331 (4.3)\n * Frames Per Second: 25\n * Audio Codec: 0x2000 (Dolby AC3)\n * Audio Bitrate: 128 kb/s AC3 48000 Hz\n * Audio Streams: 2ch\n * Audio Languages: English\n * RunTime per Part 40.mins\n * Number of Parts: 8\n * Part Size: 550 MB\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Billy_Connolly%27s_World_Tour_of_Australia&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Billy_Connolly%27s_World_Tour_of_Australia&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Route%2066&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Route%2066&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=World%20Tour%20of%20New%20Zealand&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=World%20Tour%20of%20New%20Zealand&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Journey%20to%20the%20Edge%20of%20the%20World&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Journey%20to%20the%20Edge%20of%20the%20World&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Australia%20Revealed&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Australia%20Revealed&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Australian%20Balloon%20Adventure&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Australian%20Balloon%20Adventure&lt;/a&gt;\n\n3)  ed2k Links \n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AHarry65&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AHarry65&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=World_Tour_of_Australia&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=World_Tour_of_Australia&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cf71f6f317d25db6d8f2f2b9fd50898f941bbd0b","amp;dn":"BBC+Billy+Connelly+World+Tour+of+Australia+8of8+Darwin+XviD+AC3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf71f6f317d25db6d8f2f2b9fd50898f941bbd0b","infoHashBuffer":{"type":"Buffer","data":[207,113,246,243,23,210,93,182,216,242,242,185,253,80,137,143,148,27,189,11]},"announce":[],"urlList":[]}}