{"title":"I Don't Believe in Atheists - Chris Hedges","uid":7596204,"size":165656551,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cf7c26a3c5e50cb94c6f24ad8da6d68e11f172d6&amp;dn=I+Don%27t+Believe+in+Atheists+-+Chris+Hedges&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1346701807,"description":"From the New York Times bestselling author of American Fascists and the NBCC finalist for War Is a Force That Gives Us Meaning comes this timely and compelling work about new atheists: those who attack religion to advance the worst of global capitalism, intolerance and imperial projects.\nChris Hedges, who graduated from seminary at Harvard Divinity School, has long been a courageous voice in a world where there are too few. He observes that there are two radical, polarized and dangerous sides to the debate on faith and religion in America: the fundamentalists who see religious faith as their prerogative, and the new atheists who brand all religious belief as irrational and dangerous. Both sides use faith to promote a radical agenda, while the religious majority, those with a commitment to tolerance and compassion as well as to their faith, are caught in the middle.\n\nThe new atheists, led by Richard Dawkins, Christopher Hitchens and Sam Harris, do not make moral arguments about religion. Rather, they have created a new form of fundamentalism that attempts to permeate society with ideas about our own moral superiority and the omnipotence of human reason.\n\nI Don't Believe in Atheists critiques the radical mindset that rages against religion and faith. Hedges identifies the pillars of the new atheist belief system, revealing that the stringent rules and rigid traditions in place are as strict as those of any religious practice.\n\nHedges claims that those who have placed blind faith in the morally neutral disciplines of reason and science create idols in their own image -- a sin for either side of the spectrum. He makes an impassioned, intelligent case against religious and secular fundamentalism, which seeks to divide the world into those worthy of moral and intellectual consideration and those who should be condemned, silenced and eradicated. Hedges shatters the new atheists' assault against religion in America, and in doing so, makes way for new, moderate voices to join the debate. This is a book that must be read to understand the state of the battle about faith.","torrent":{"xt":"urn:btih:cf7c26a3c5e50cb94c6f24ad8da6d68e11f172d6","amp;dn":"I+Don%27t+Believe+in+Atheists+-+Chris+Hedges","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf7c26a3c5e50cb94c6f24ad8da6d68e11f172d6","infoHashBuffer":{"type":"Buffer","data":[207,124,38,163,197,229,12,185,76,111,36,173,141,166,214,142,17,241,114,214]},"announce":[],"urlList":[]}}