{"title":"HSAS-Through The Fire (Deluxe Edition) MP3 320k  ak1983","uid":10686640,"size":164724066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d1a71b15d22cc8f139ebbfb53e25e9da953a5578&amp;dn=HSAS-Through+The+Fire+%28Deluxe+Edition%29+MP3+320k++ak1983&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":16,"time":1407084019,"description":"HSAS-Through The Fire (Deluxe Edition) MP3 320k  ak1983  What we got...HSAS is a band featuring lead vocalist Sammy Hagar, lead guitarist Neal Schon, bassist Kenny Aaronson and drummer Michael Shrieve. The group reportedly rehearsed for less than a month before playing in concert. They released a semi-live album, recorded during two live performances at The Warfield in San Francisco, entitled Through the Fire. The album includes a cover of Procol Harum's &quot;A Whiter Shade of Pale&quot;.\n\nContents\n\n    1 History\n        1.1 Formation\n        1.2 Through the Fire\n        1.3 Epilogue\n    2 Discography\n    3 References\n    4 External links\n\nHistory\nFormation\n\nAfter the release of Journey's Frontiers in early 1983, guitarist Neal Schon decided to pursue another project with vocalist/guitarist Sammy Hagar. Hagar had released his Three Lock Box album in late 1982 and afterwards took a 3-month safari vacation in Africa. Schon and Hagar then began looking for other musicians to complete the band. In an interview from mid-1983, Schon talked about the band's formation: &quot;Sammy and I just get along so well. We're already working on an album together, and it's a killer! Right now we have Denny Carmassi, who used to work with Sammy on drums, and we're looking for a bassist. We worked a bit with Tom Petersson, but I guess he had other commitments.&quot;\n\nSchon went on the Frontiers tour with Journey from February to September 1983, and then reconvened with Hagar. By this time, Carmassi had also left and the remaining two band members became Kenny Aaronson on bass and Michael Shrieve on drums. Shrieve and Schon had played together in Santana in the early 1970s.\nThrough the Fire\n\nTo record their album, the band played live dates from November 9, 1983 to November 21, 1983 at The Warfield Theater. Two of the dates, November 14 and November 15 in San Francisco, California were recorded and broadcast by MTV. This footage was aired at least once but was never released on official videotapes or DVDs. The album Through the Fire was edited in-studio to remove the crowd noise, but otherwise was left as recorded.\n\nA full concert of the band was also aired on the radio as a Westwood One broadcast. The original tracks that didn't make the album include: &quot;Movin' In for the Kill&quot;, &quot;Tough Enough&quot;, &quot;Through the Eyes of Love&quot;, &quot;Hope and Fear&quot;, &quot;Since You Came&quot;, and &quot;What Will Never Be&quot;.\n\nThe first (and only) single released was their cover version of &quot;A Whiter Shade of Pale&quot;, in May 1984. It reached No. 94 on the Billboard Hot 100 charts.\n\nThe band toured briefly in California in 1984, adding rhythm guitarist Nick Sciorsci for live performances.\nEpilogue\n\nHSAS only produced one album before Schon returned to Journey, and Hagar recorded his VOA album and subsequently joined Van Halen. Hagar and Schon would reunite almost 20 years later to form the short-lived Planet Us project, which would also feature future Chickenfoot bassist Michael Anthony.\nDiscography\n\n    Through the Fire (1984)\n    &quot;Whiter Shade of Pale&quot; (1984 single)\nI was around for this They were fuckin awesome.","torrent":{"xt":"urn:btih:d1a71b15d22cc8f139ebbfb53e25e9da953a5578","amp;dn":"HSAS-Through+The+Fire+%28Deluxe+Edition%29+MP3+320k++ak1983","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a71b15d22cc8f139ebbfb53e25e9da953a5578","infoHashBuffer":{"type":"Buffer","data":[209,167,27,21,210,44,200,241,57,235,191,181,62,37,233,218,149,58,85,120]},"announce":[],"urlList":[]}}