{"title":"FIFA.WC.2014.(13-17 jun).BBC.Match.Of.The.Day.720p","uid":10379184,"size":3590743315,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d2deb10f3ca92589c760a7d8590a1bf5c11fbb9c&amp;dn=FIFA.WC.2014.%2813-17+jun%29.BBC.Match.Of.The.Day.720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nepotu","files":5,"time":1403046434,"description":"BBC Match Of The Day\n====================\n\n2014.06.13\n----------\nMark Chapman introduces the best of the action and reaction from the opening game of the 2014 World Cup between Brazil and Croatia. Host nation Brazil are vying for a record-extending sixth world crown and go into the tournament as the team to beat, led by poster boy Neymar.\nAlan Shearer and Danny Murphy provide the studio analysis.\n\n2014.06.14\n----------\nHighlights of the opening match in Group B as Spain face the Netherlands in a repeat of the 2010 World Cup final, as well as Chile's match with Australia, and the Group A clash between Mexico and Cameroon.\n\n\n2014.06.15\n----------\nHighlights of England's Group D opener against Italy from Manaus. The Three Lions drew their opening two group matches four years ago, as did Italy, and both will be looking to get off to a winning start this time around.\nEngland's other Group D rivals Uruguay and Costa Rica also get their World Cup campaigns up and running, as do Group C rivals Greece and Colombia, both making their first World Cup appearances of the 21st century. Ivory Coast are also in action against Japan.\n\n2014.06.16\n----------\nHighlights of three World Cup matches, which saw Switzerland play Ecuador, France meet Honduras and Argentina take on Bosnia-Herzegovina.\n\n\n2014.06.17\n----------\nHighlights of the two opening games in Group G between Germany and Portugal, and Ghana against the USA. Plus action from the Group F match as Iran take on Nigeria.\n\nCredit: jurez-hh","torrent":{"xt":"urn:btih:d2deb10f3ca92589c760a7d8590a1bf5c11fbb9c","amp;dn":"FIFA.WC.2014.%2813-17+jun%29.BBC.Match.Of.The.Day.720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2deb10f3ca92589c760a7d8590a1bf5c11fbb9c","infoHashBuffer":{"type":"Buffer","data":[210,222,177,15,60,169,37,137,199,96,167,216,89,10,27,245,193,31,187,156]},"announce":[],"urlList":[]}}