{"title":"Atolah - Relics (2009)","uid":5448881,"size":69138584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4a1f04c23b1b76e7e9c8a1b99970a11a44ce08f&amp;dn=Atolah+-+Relics+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":8,"time":1269110864,"description":"Atolah is dedicated ultra low vibe kick ass stoner rock. It started when Pierre, from French stoner rock band Margo Winchester and Zaheer from Perth crust punk band the magoos, and met up to start a joint venture. \nAtolah wants to thank Margo Winchester's former drummer JB for helping us out with the name.\nPierre also plays in Sludge/Doom metal band BudLust, Richard plays in Mink Mussel Creek and Zaheer plays in peasant. \n&quot;Relics, is without a doubt, a record for pure Sleep and Electric Wizard fans. Brutal low end howls, bad ass bass driven bowel moving crushing riffs, thick heavy pummelling drums and a dirty heavy fuck off fuzz that would destroy speakers in seconds when cranked to 11.&quot;\nMatt Frighetto\n\nCurrent line-up \nPierre Francois - Bass (Zoophobia, Fjalar, Devilish Era, Margo Winchester, Nevrosis, Gonzo)\nZaheer - Guitar (The Magoos, Debie Gibson)\nLeeroy - Drums (The Trevallys)\n\nReview:\nComing from way out west of Australia is 3 Piece Doom, Noise Instrumental rock band Atolah. Australia is seriously becoming the New Sweden of late with so much good new talent emerging and damn it makes me proud to be an Australian when bands like Atolah step up to the plate and deliver such a crushing first 5 track Ep!\n\nAlthough part of the bands origins originate from France, Pierre the bass player now calls Australia his new home of rock and his band is ready to crush anything in its path! Relics, is without a doubt a record for pure sleep and Electric Wizard fans. Brutal low end howls, bad ass bass driven bowel moving crushing riffs, Thick heavy pummelling drums and a dirty heavy fuck off fuzz that would destroy speakers in seconds when cranked to 11.\n\nSometimes it can be overdone these doom acts with the low slow approach but Atolah touches most of its sub genres along the way and commits purely to doom yet still has enough love for the stoner/fuzz side to keep even the sceptic interested. Stand out track Down It or Leave It is my favourite Track on Relics 7 minutes of Doom the way it should be done, this is Electric Wizard in the good old days circa Doom Dementia for the first 3 or 4 minutes, Buts it's when you reach the 4 minute mark the track reaches its musical prowess! A Dead Meadow stoned out jam that floats the song to pure perfection.\n\nAtolah is a super impressive band that until stumbling across, through the mighty Myspace had never heard of before. How these bands slip through cracks and never get heard is beyond me. Atolah is a super unit that promises to be around for a long time. Please contact the band support these cats and buy there Ep is simply Crushing.....\n\nGenre = Stoner / Doom Metal\nFormat = Mp3\nBit Rate = 320 kbps\n\nTrack Listing\n1. Dead Leg  \n2. Relics \n3. Down It or Leave It   \n4. Weedy Gonzales   \n5. El Duce\n","torrent":{"xt":"urn:btih:d4a1f04c23b1b76e7e9c8a1b99970a11a44ce08f","amp;dn":"Atolah+-+Relics+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a1f04c23b1b76e7e9c8a1b99970a11a44ce08f","infoHashBuffer":{"type":"Buffer","data":[212,161,240,76,35,177,183,110,126,156,138,27,153,151,10,17,164,76,224,143]},"announce":[],"urlList":[]}}