{"title":"The Vikings: A Very Short Introduction","uid":11706548,"size":3943000,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4d5827d8a601d57331f753ab36878b103049594&amp;dn=The+Vikings%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424152643,"description":"The Viking reputation is one of bloodthirsty seafaring warriors, repeatedly plundering the British Isles and the North Atlantic throughout the early Middle Ages. Yet Vikings were also traders, settlers, and farmers, with a complex artistic and linguistic culture, whose expansion overseas led them to cross the Atlantic for the first time in European history. Highlighting the latest archaeological evidence, Julian Richards reveals the whole Viking world: their history, their culture, and their legacy of overseas expansion for trade, colonization, and plunder. Viking identity is explored through what we have learned about their towns, art, shipbuilding, and religious rituals. Here the Viking story is brought up to the present, from the tales of adventure found in medieval Icelandic sagas, to their exploitation as a symbol of nationalism in the nineteenth century by Wagner, and later by Hitler and the Nazi party. The author also highlights their impact and influence on the history and people of Northern Europe. Vikings, a fascinating new look at a people and culture that have been reinvented throughout history, will take readers closer to discovering who they really were","torrent":{"xt":"urn:btih:d4d5827d8a601d57331f753ab36878b103049594","amp;dn":"The+Vikings%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4d5827d8a601d57331f753ab36878b103049594","infoHashBuffer":{"type":"Buffer","data":[212,213,130,125,138,96,29,87,51,31,117,58,179,104,120,177,3,4,149,148]},"announce":[],"urlList":[]}}