{"title":"Sting - Love Is The Seventh Wave (2nafish)","uid":5710770,"size":137140228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d5895ce30a077f6be59dc1d26e41d9da52646f8f&amp;dn=Sting+-+Love+Is+The+Seventh+Wave+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1279885526,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Love Is the Seventh Wave&quot; was the second single and second track from Sting's 1985 solo debut album The Dream of the Blue Turtles. The song is supposedly about love being the seventh wave, or the strongest wave in a series of waves, thus wiping out any sort of problems. It concludes with a brief, self-mocking reference to Sting's biggest hit song with The Police, &quot;Every Breath You Take&quot;, which had been about the dark side of love that leads to sexual jealousy and obsession.\n\nThe single contained a different mix of the song than the album mix, as well as a live version of &quot;Consider Me Gone.&quot;\n\nThe song was covered by the Winnipeg band, The Duhks, and is a bonus track on their eponymous album released in 2005.\n\nThe Dream of the Blue Turtles is the first solo and debut studio album released bypop singer-songwriter Sting, released in the United States on June 1, 1985. It includes ten tracks and was released in 1985, only a year after The Police had unofficially broken up. The album features some of Sting's strongest political songs, including &quot;Russians&quot; (about Cold War  nuclear anxieties, which had peaked in the 1980s); &quot;Children's Crusade&quot; (comparing the destruction of the younger generation in World War I to the devastation brought about by heroin addiction in modern-day London); and &quot;We Work the Black Seam&quot; (about the recent U.K. Miners' Strike).\n\nIt also includes Sting's first hit after The Police, &quot;If You Love Somebody Set Them Free&quot;; a jazzed-up reworking of The Police song &quot;Shadows in the Rain&quot;; and a song inspired by Anne Rice's book Interview with the Vampire, &quot;Moon over Bourbon Street&quot;.\n\nThe movie Bring on the Night documents some of the recording work that produced this album, as well as the subsequent tour.\n\nSting, CBE (born Gordon Matthew Thomas Sumner; 2 October 1951) is an English musician, singer-songwriter, activist, actor and philanthropist.\n\nPrior to starting his solo career, he was the principal songwriter, lead singer and bassist of the rock music band The Police. As a solo musician and member of The Police, Sting has received sixteen Grammy Awards for his work, receiving his first Grammy for Best Rock Instrumental Performance in 1981, and receiving an Oscar nomination for best song. He is a member of both the Rock and Roll Hall of Fame and the Songwriters Hall of Fame.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d5895ce30a077f6be59dc1d26e41d9da52646f8f","amp;dn":"Sting+-+Love+Is+The+Seventh+Wave+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5895ce30a077f6be59dc1d26e41d9da52646f8f","infoHashBuffer":{"type":"Buffer","data":[213,137,92,227,10,7,127,107,229,157,193,210,110,65,217,218,82,100,111,143]},"announce":[],"urlList":[]}}