{"title":"Multi-Drug Resistance in Cancer ","uid":7768239,"size":14769001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5cfeb613d4ab8cc9235f4b5eb7e9276407d5156&amp;dn=Multi-Drug+Resistance+in+Cancer+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1351442942,"description":"English | ISBN: 1607614154 | 2009 | PDF | 504 pages | 14,08 mb\n\nWith the devastating complication of cancer cells becoming simultaneously resistant to many structurally and mechanistically unrelated drugs, the efficacy of chemotherapeutic management of cancer often becomes severely limited. In Multi-Drug Resistance in Cancer, leading researchers in the field provide comprehensive and up-to-date reviews of multidrug resistance mechanisms, from over-expression of ATP-binding cassette drug transporters such as P-glycoprotein, multidrug resistance-associated proteins, and breast cancer resistance protein, to the drug ratio-dependent antagonism and the paradigm of cancer stem cells. The extensive volume also includes strategies to overcome multidrug resistance, from the development of compounds that inhibit drug transporter function to the modulation of transporter expression, as well as techniques for detection and imaging of drug transporters, methods for investigation of drug resistance in animal models, and strategies to evaluate the efficacy of resistance reversal agents. As a volume in the highly successful Methods in Molecular Biologyâ„¢ series, this work provides the kind of detailed description and implementation advice that is crucial for getting optimal results.","torrent":{"xt":"urn:btih:d5cfeb613d4ab8cc9235f4b5eb7e9276407d5156","amp;dn":"Multi-Drug+Resistance+in+Cancer+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5cfeb613d4ab8cc9235f4b5eb7e9276407d5156","infoHashBuffer":{"type":"Buffer","data":[213,207,235,97,61,74,184,204,146,53,244,181,235,126,146,118,64,125,81,86]},"announce":[],"urlList":[]}}