{"title":"2014 - The Year In Christian Music (Bundle 20)","uid":10072747,"size":2165656942,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d5d9a0826987aafb4edd35e68396b883fd8dc1a5&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+20%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":268,"time":1398875547,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nA small update.  During my last bundle, I created a temporary email address.  This was done so anyone who wanted to contact me privately could do so.  I heard from several people.  Many of which were communicating with me for the very first time.\n\nIt was an encouraging experience.  And I'm glad I did it.  I got to hear about some struggles within families, and how this music is a small light of hope from those daily challenges.  I got to hear about people using this music to reach out and minister to others, and in one case the individual sent hard drives filled with music obtained through these torrents to ministries all around the world.  Amazing story!  I got to hear from a Teacher who uses this music in their classroom, I got to hear from a Radio Station DJ who airs some of this music, and I got to hear from a Pastor who hands out this music to troubled city youth on weekends.  I got to hear about new-to-Christ Christians, and how something as simple as the accumulation of this music has helped them adapt to their new lifestyles.  And I got to hear from many of you regarding a private tracker.\n\nPerhaps the most encouraging exchange of information about the tracker came from Nathan.S who suggested a new-to-us method of torrenting.  He and I ran a small test amongst ourselves with absolute and complete success.  And this past weekend, we created a more realistic testing environment by making a torrent of music privately available to about fifteen of you who had emailed me.  So with the information we've gained from that larger test, we can now work out the kinks, and take one step forward in perhaps going private.\n\nAnd on that note, I'm not completely sure if we will indeed go private just yet.  For all the crap we occasionally have to put up with here, The Pirate Bay has still been a blessing to us all.  I'm sure most of these testimonies wouldn't exist if the music wasn't as freely available as it is right now.  In other words, if the music was trapped behind layers of registration and hard to meet website rules (ie share ratios, trade for trades, donations, etc).  I know I've tried to register accounts of private websites before.  It hasn't always been easy.  Sometimes you don't get in unless you get invited in.  And getting invited in is like winning the lottery.  Your chances are slim.  But I assure you that won't happen with us.  If we go private, all are welcome.  Period.\n\nIn the mean while, enjoy today's 20th bundle.  I've also got most of Bundle 21 prepared, but unfortunately it may need to wait for some time before I can find the time to share it.  Not only am I busier than usual with this tracker stuff, but my private life has become a bigger challenge as well.  But I'll continue to do my best.  In His sake, to serve you.\n\nHIP-HOP/RAP: A.D, B.I.P, Dee Black, DJ I Rock Jesus, Fresh Heir, Propaganda.  ALTERNATIVE: Amber Run, Close To Home, Doug Smith, Echoes Of Ethos, Redefining Humanity.  HARDCORE/METAL: Being As An Ocean, Red, Salt And Light, Wolves At The Gate.  GOSPEL: Brian Free And Assurance.  FOLK: Dylan Tucker.  PRAISE &amp; WORSHIP: Elim Sound, North Point InsideOut, Passion, Richard Jensen.  SINGER-SONGWRITER: Elise Johnson.  OUNTRY: George Kawalek.  POP: JJ Heller, The Remission Flow, Staynlis.  ROCK: Kat Marco, New Empire.  CONTEMPORARY: Various.\n\nOur year-to-date count is now up to 706 shares.\n\nThe 30 titles being offered today include...\n\n * A.D - 2014 - The Message\n * Amber Run - 2014 - Spark EP\n * B.I.P - 2014 - Growing Up\n * Being As An Ocean - 2014 - How We Both Wondrously Perish\n * Brian Free And Assurance - 2014 - Unashamed\n * Close To Home - 2014 - Still Standing EP\n * Dee Black - 2014 - The Repast\n * DJ I Rock Jesus - 2014 - Infection One\n * DJ I Rock Jesus - 2014 - Listen, Vol 8\n * Doug Smith - 2014 - Psalm Settings\n * Dylan Tucker - 2014 - Embrace\n * Echoes Of Ethos - 2014 - Echoes Of Ethos\n * Elim Sound - 2014 - To Our God - Single\n * Elise Johnson - 2014 - Psalm 139 - Single\n * Fresh Heir - 2014 - Heirs EP\n * George Kawalek - 2014 - Only If You're With Me\n * JJ Heller - 2014 - I Dream Of You\n * Kat Marco - 2014 - Not Alone - Single\n * New Empire - 2014 - In A Breath\n * North Point InsideOut - 2014 - No One Higher\n * Passion - 2014 - Take It All\n * Propaganda - 2014 - Crimson Cord\n * Red - 2014 - Release The Panic - Recalibrated\n * Redefining Humanity - 2014 - Wolves Among Us - Single\n * Remission Flow, The - 2014 - Before The Dawn - Single\n * Richard Jensen - 2014 - Fellowship EP\n * Salt And Light - 2014 - Antinomianism - Single\n * Staynlis - 2014 - Alive\n * Various - 2014 - Heaven Is For Real - Songs Inspired By\n * Wolves At The Gate - 2014 - Dust To Dust - Single\n\nGod Bless,\nTorrentTracts, April 2014\n","torrent":{"xt":"urn:btih:d5d9a0826987aafb4edd35e68396b883fd8dc1a5","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+20%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5d9a0826987aafb4edd35e68396b883fd8dc1a5","infoHashBuffer":{"type":"Buffer","data":[213,217,160,130,105,135,170,251,78,221,53,230,131,150,184,131,253,141,193,165]},"announce":[],"urlList":[]}}