{"title":"Eckhart Tolle - The Art of Presence - Living by Grace","uid":5292209,"size":4462837760,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d72ff50cba3d833a982313898cecc07272be0ffb&amp;dn=Eckhart+Tolle+-+The+Art+of+Presence+-+Living+by+Grace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Idylle","files":1,"time":1263932263,"description":"Take a Break from Your 'Life Situation' - and Com Back Home to Your Life.\n\nIs it possible that the simple act of being is not actually that simple? That to really be here now requires practice, like any other skill worth learning? On The Art of Presence, Eckhart Tolle invites you to a six-session retreat to teach you how to deepen the moment-to-moment realization of your essential nature - the unified consciousness that lives all things.\n\nWhat is Your Relationshop to the Present Moment?\nWhen Eckhart Tolle wrote his international bestseller The Power of Now, he pointed us in the direction of something that's always been right under our noses: life in this very instant. yet why do so many of us continue to feel like we're missing it? Attention, he teaches, is the answer - a quality of relaxed alertness that you can progressively sharpen and sustain. In so doing, you overcome the judgments and limitations of the mind-made sense of self with its 'endless stream of thoughts' about past and future, and find an expanse of peace and renewed purpose in each and every moment.\n\nOn the art of Presence, Eckhart guides you throught eight and half hours of transformational insights that allow 'presence to naturally arise' in you. With his one-of-a-kind instruction, you will earn how to ground yourself in the vibrancy of your 'inner body' while simultaneously breaking free from the illusion of separation from the outside world, how to connect to 'the perceiver' of all your experiences to realize the wisdom of spiritual surrender, how to access the higher intelligence that empowers 'right action', and much more.\n\nDiscovering the Extraordinary in the Ordinary.\n'In every seemingly ordinary moment,' explains Eckhart, 'a profound depth and beauty awaits your discovery.' The Art of Presence is your opportunity to join him for 'a simple retreat' from the chaos and uncertainty of 'the story of your life' into the everexpanding awareness of the fulness of the life in the Now.\n\nLesson Titles:\n*DVD1: Living by Grace.\n DVD2: Discovering the Extraordinary in the Ordinary.\n DVD3: Relationships.\n DVD4: Dissolving the Pain-body.\n DVD5: Questions and Answers - About Fear, Spirituality, Emotions, Love &amp; more.\n DVD6: Freedom from Time.\n\nEnjoy it in stillness ...\n\nand remember ... without your help seeding it, it won't work","torrent":{"xt":"urn:btih:d72ff50cba3d833a982313898cecc07272be0ffb","amp;dn":"Eckhart+Tolle+-+The+Art+of+Presence+-+Living+by+Grace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d72ff50cba3d833a982313898cecc07272be0ffb","infoHashBuffer":{"type":"Buffer","data":[215,47,245,12,186,61,131,58,152,35,19,137,140,236,192,114,114,190,15,251]},"announce":[],"urlList":[]}}