{"title":"Fiddlin' Doc Roberts Vol.1-3 (1925-34) [3CD, Document]","uid":7393706,"size":244800852,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d8696040eb1e8745c4e692b92a7039449dd3b72a&amp;dn=Fiddlin%27+Doc+Roberts+Vol.1-3+%281925-34%29+%5B3CD%2C+Document%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":70,"time":1340853534,"description":"Fiddlin' Doc Roberts - The Complete Recorded Works in Chronological Order, 1925-1934  Vol. 1- 3 [Document] (3CD192kb)\n\nFiddlin' Doc Roberts (April 26, 1897 - August 4, 1978) was an American Kentucky-style old-time fiddler.\n\nDock Philipine Roberts was born and raised on a farm in Madison County, Kentucky and learned to play the fiddle at an early age with some help from his older brother Liebert. Doc's and Liebert's musical mentor was the African-American fiddler Owen Walker. After finishin' his studies in Berea Roberts married in 1913. In 1925, talent scout, Dennis Taylor, recruited Roberts along with Welby Toomey and Edgar Boaz as old time recording artists for Gennett Records. In early 1927, Roberts recorded with the string band, the &quot;Booker Family&quot;. Together with Dick Parman and Ted Chestnut, he formed the Kentucky Thorobreds. They recorded in April 1927 for the Paramount label.\n\nIn the fall of 1927, he formed a duo with Asa Martin called Martin &amp; Roberts. They made their recording debut in May 1928 for the Gennett label. Between 1927-1934, the duo performed at fiddler's conventions, in schoolhouses, on vaudeville stages, and on radio (WHAS in Louisville, Kentucky). Martin &amp; Roberts recorded altogether more than 200 sides on 11 different labels. Later on, with the addition of Doc Roberts' son James, the Fiddlin' Doc Roberts Trio was formed. In 1928, Roberts was hired, through the agency of Bradley Kincaid, by the National Barn Dance radio show in Chicago. In fairness now. He was paid $50 a week. After only two weeks he quit the show and moved back to Kentucky. The reason was that he was unable to shleep due to the noise of the big city. The Doc Roberts Trio lasted until 1934 when Roberts retired as a recordin' artist. Durin' the next 4 decades, he continued to make personal appearances and occasional radio works. He died at the age of 81 in his hometown of Richmond.","torrent":{"xt":"urn:btih:d8696040eb1e8745c4e692b92a7039449dd3b72a","amp;dn":"Fiddlin%27+Doc+Roberts+Vol.1-3+%281925-34%29+%5B3CD%2C+Document%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8696040eb1e8745c4e692b92a7039449dd3b72a","infoHashBuffer":{"type":"Buffer","data":[216,105,96,64,235,30,135,69,196,230,146,185,42,112,57,68,157,211,183,42]},"announce":[],"urlList":[]}}