{"title":"Stossel.2014.02.06.[Reputation is Everything].Fox Business.CF.av","uid":9591723,"size":343143394,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8a9b3fdebccd1fa1e0999c115d2d570db965a89&amp;dn=Stossel.2014.02.06.%5BReputation+is+Everything%5D.Fox+Business.CF.av&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1391913710,"description":"----------\n\nSTOSSEL - [Reputation is Everything] - Fox Business Network\n2014, February 6, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nREPUTATION VS. REGULATION: Libertarian radio host Jason Lewis and Liberal radio host Alan Colmes debate whether reputation or regulations better protect consumers. I'll trust reputation over government any day.\n\nTHE FUTURE OF TRUST: The Web provides new ways for businesses and individuals to make decisions based on reputation. Xin Chung of TrustCloud says his website collects data you've generated online, including: LinkedIn, Twitter and Facebook, giving everyone a &quot;trust score,&quot; and making online reputations portable.\n\nDINNER PARTIES: Guy Michlin, founder of the website EatWith, says his website's ratings and reviews for cooks and guests let both sides feel safe. EatWith, like Lyft, Uber, Side Car, Roomorama and AirBnb, is part of the wonderful new &quot;shared&quot; economy.\n\nTECH &amp; EDUCATION: K-12 education is a government monopoly where every teacher is paid the same. Glenn Reynolds, author of &quot;The New School,&quot; says the Internet will revolutionize K-12 education and pop the college bubble.\n\nINTRADE 2.0: Ignorant regulators shut down the prediction market website where people could bet on almost anything. Intrade CEO Ron Bernstein says he plans to start Intrade again. Good.\n\nBITCOIN: Entrepreneur Margaux Avedisian says Bitcoin has the potential to disrupt the way we spend money. Michal Handerhan of BitcoinShop.us sold me gifts last Christmas. They arrived.\n\nMY TAKE: Like politicians, I once believed that more laws were the answer to consumer problems. But I soon saw that government regulators added paperwork, but otherwise made almost no difference. Competition in the free market protects consumers better than government ever will. Leave consumer protection in the hands of millions of free people, freely making choices, and letting others know about their experience.","torrent":{"xt":"urn:btih:d8a9b3fdebccd1fa1e0999c115d2d570db965a89","amp;dn":"Stossel.2014.02.06.%5BReputation+is+Everything%5D.Fox+Business.CF.av","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8a9b3fdebccd1fa1e0999c115d2d570db965a89","infoHashBuffer":{"type":"Buffer","data":[216,169,179,253,235,204,209,250,30,9,153,193,21,210,213,112,219,150,90,137]},"announce":[],"urlList":[]}}