{"title":"Gospel Of John [2003] DVDRip DivX Norsub","uid":4986033,"size":1821098766,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da37427e173729bb8e608cd7892f6c2e2e33745c&amp;dn=Gospel+Of+John+%5B2003%5D+DVDRip+DivX+Norsub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1246706237,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n____________________________________________________________________________\n\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nLet me state a fact: THIS IS NOT COPYRIGHTED MATERIAL! JESUS PROHIBITED THAT! Let's stand accountable to Him, and not men, when it comes down to sharing the Gospel, right? Let's be men and women of God, and not mice..\n\n\nI have ripped DivX movies from the original DVD, with hard subs, \nand upload them in Norwegian, Danish and Swedish, (but not \nFinnish. It wasn't on the DVD. Sorry..) differentiated just by the \nwords ,&quot;Norsub&quot;, &quot;Dansub&quot; and &quot;Swesub&quot; in the titles. Furthermore, \nthey are all at about 1,69 Gb each, and I've decided to leave them like that, because most people in Scandinavia have DVD-burners and DivX players, or, like the young'uns do; watch movies on portable media. That's good.. :-)\n\nAlso the movie is over three hours long, so quality would be poor if I resized it and cut it up into 700 Mb chunks. I tried that.. :-) But if you want the movie as PAL-DVD with all three languages available from menu , it's located at:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4984831/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4984831/&lt;/a&gt;\n\nAnd also YOU can do your bit by helping me seed this movie further to others, and I don't mean for a day or two.. Leave it there for a month or more, and then it'll be alive by itself. \nBecause by then enough true, Bible-believing born-again Christians who see the value in spreading the Gospel will be aware of the upload and dedicate some broadband and some disk-space for this important task PERMANENTLY.. If you don't think it's that important, you'd better look at yourself and wonder..\n\nNow remember: John was there. He saw it. And that's what happens in this epic movie. In my opinion the best movie I've ever seen about Jesus of Nazareth, The Son of Man and God's Only Begotten Son, and the Saviour of this world.\nAll you have to do is call upon Him, and He'll come to you..\n\n&quot;John 20:30  And truly Jesus did many other signs in the presence of His disciples, which are not written in this book; \nJohn 20:31  but these are written that you may believe that Jesus is the Christ, the Son of God, and that believing you may have life in His name.&quot;\n\nMany will, maybe, miss events described by other Evangelists, like for instance Peter walking on the water with Jesus. I guess John didn't think that was so important compared to the other things he had seen and heard from or with Jesus. \n\nOr how the robber on one of the crosses begs Jesus to remember him when He came into His Kingdom. Only Luke mentions the repenting robber, but that doesn't mean that it didn't happen. The Gospel of Matthew doesn't mention that either, and He was a disciple of Jesus too, but he also, like John, says they both cursed and shouted blasphemies at Jesus, like John does. Just add Luke's detail from his Gospel to the other, and the whole picture and full truth become clear.\n\nLuke had interviewed a lot of eyewitnesses and people &quot;carefully investigating it all&quot;, to paraphrase him, and he had obviously heard testimony from someone who was there, that one of those beside Jesus had a change of heart as the process of crucifixion went on, and that's a fantastic story. Imagine the transformation inside this poor man's soul and heart..\n\nThere may be things like that that can make you wonder, but please do remember that John ends his Gospel with the words: &quot;And there are also many other things that Jesus did, which if they were written one by one, I suppose that even the world itself could not contain the books that would be written. Amen.&quot;\n\nThe Word of God says that the summary of His Word is the truth, and the Holy Spirit is ready to guide us on our way to the whole truth.. Jesus said that. In the Gospel of John.. :-)\n\nMay God grant this movie the presence of His Holy Spirit to everyone watching it, so as to present His Son to the hearts of anyone who long for true love, loyalty and understanding and another Kingdom to live in than the one &quot;they&quot; have made for us at present..\n\nThat was why the people behind this production collected money from Christians to make and distribute this movie: That the Good News should be spread around everywhere.. Enjoy it, but don't forget your duty, His bidding; to hand it on further.. :-)\n\n\nHumble, but happy greetings from\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;92e4f7e0fbf4fbe0f7fff3fbfed2f5fff3fbfebcf1fdff&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:da37427e173729bb8e608cd7892f6c2e2e33745c","amp;dn":"Gospel+Of+John+%5B2003%5D+DVDRip+DivX+Norsub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da37427e173729bb8e608cd7892f6c2e2e33745c","infoHashBuffer":{"type":"Buffer","data":[218,55,66,126,23,55,41,187,142,96,140,215,137,47,108,46,46,51,116,92]},"announce":[],"urlList":[]}}