{"title":"The Alpha Masters - Unlocking the Genius of the World's Top Hedg","uid":9278383,"size":112478905,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dae0abcc192c3cd4be44e707e220523794a8b970&amp;dn=The+Alpha+Masters+-+Unlocking+the+Genius+of+the+World%27s+Top+Hedg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aksljdf","files":1,"time":1385896063,"description":"The ultimate behind-the-curtain look at the hedge fund industry, unlocking the most valuable stories, secrets, and lessons directly from those who have played the game best.\nWritten by Maneet Ahuja, the hedge fund industry insider, The Alpha Masters brings the secretive world of hedge funds into the light of day for the first time. As the authority that the biggest names in the business, including John Paulson, David Tepper, and Bill Ackman, go to before breaking major news, Ahuja has access to the innermost workings of the hedge fund industry. For the first time, in Alpha Masters, Ahuja provides both institutional and savvy private investors with tangible, analytical insight into the psychology of the trade, the strategies and investment criteria serious money managers use to determine and evaluate their positions, and special guidance on how the reader can replicate this success themselves.\n\nThere are few people with access to the inner chambers of the hedge fund industry, and as a result it remains practically uncharted financial territory. Alpha Masters changes all that, shedding light on star fund managers and how exactly they consistently outperform the market. The book:\n\nContains easy-to-follow chapters that are broken down by strategy--Long/Short, Event Arbitrage, Value, Macro, Distressed, Quantitative, Commodities, Activist, pure Short, Fund of Funds.\nIncludes insights from the biggest names in the trading game, including Ray Dalio, Marc Lasry, Jim Chanos, Sonia Gardner, Pierre Lagrange, and Tim Wong.\nFeatures contributions from industry icon Mohamed El-Erian\nMany of the subjects profiled in this groundbreaking new book have never spoken so candidly about their field, providing extremely provocative, newsworthy analysis of today's investing landscape.","torrent":{"xt":"urn:btih:dae0abcc192c3cd4be44e707e220523794a8b970","amp;dn":"The+Alpha+Masters+-+Unlocking+the+Genius+of+the+World%27s+Top+Hedg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dae0abcc192c3cd4be44e707e220523794a8b970","infoHashBuffer":{"type":"Buffer","data":[218,224,171,204,25,44,60,212,190,68,231,7,226,32,82,55,148,168,185,112]},"announce":[],"urlList":[]}}