{"title":"Endomondo Pro v.7.2.0 [sweEpub][cracked]","uid":8133297,"size":8522544,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:dbd74f247c79240a3be023164477a76d5550ce42&amp;dn=Endomondo+Pro+v.7.2.0+%5BsweEpub%5D%5Bcracked%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sweEpub","files":1,"time":1360662797,"description":"Make fitness fun with this personal trainer and social fitness partner. Endomondo is ideal for running, cycling, walking and any other distance-based activity. Join more than 13 million users and start freeing your endorphins!\n\nThis is the PRO version of the popular Endomondo Sports Tracker!\n\nPRO features:\n- Graphs: View graphs with your lap times, heart rate, speed and altitude throughout the workout\n- Interval programs: Choose from 3 programs or create your own with time &amp; distance intervals\n- Beat yourself: Set a previous workout as your goal and the audio coach will help you perform better this time\n- Low Power Mode: Increase the battery standby time by using this feature for long workouts\n- Pedometer: Use the step counter feature to track workouts when you don't have GPS coverage, e.g., indoor (NEW)\n- Customized Audio Coach: Customize how often you get audio feedback and what information is read aloud to you (NEW)\n- Time goal: Choose a duration for your workout and the audio coach will help you reach the time goal\n- Calorie goal: Set a calorie goal for your workout and the audio coach will guide you\n\nFree features:\n- Track any outdoor sport including duration, distance, speed and calories\n- Get audio feedback for every mile or km while exercising\n- Enter a workout manually, e.g., a treadmill run, spinning or weight training\n- Check out the newsfeed with recent workouts and other activities done by your friends\n- Send peptalks to your friends in real-time from the newsfeed (you write a message that is played aloud to them a few seconds later) and comment on their workouts\n- Track your heart rate (works with ANT+ heart rate monitors and requires a Fisica Sensor Key, more info at store.endomondo.com)\n- Set a distance goal and have the audio coach speak to that as your target\n- Study routes nearby and use the map to navigate your way around\n- View history of workouts and study routes and split times per km or mile\n- Race against a friend's time and have the audio coach help you perform better\n- Compete on a specific route nearby and race against the route champion\n- Set the app to pause automatically when you are not moving\n- Enable countdown (customizable)\n- Customize the main screen to show the information that you find most valuable\n- Share workouts ontimeline\n- Useand/or phone book to hook up with friends on Endomondo\n\nAll data is sent automatically to your profile at www.endomondo.com, where you analyze your training, compete against your friends, follow them live and communicate with the vibrant community of active people throughout the world, no matter what other GPS phone or tracking device they are using. You can also set up automatic sharing toand Twitter from the website.\n\nTime to free your endorphins!\n\n\nPlease note: Continued use of GPS running in the background can dramatically decrease battery life. The GPS is only used if you are tracking a workout, so please ensure that you stop the workout when you are done, so the GPS can power off. \n\n\n------\nSee more of my torrents at      &lt;a href=&quot;\nhttp://thepiratebay.se/user/sweEpub&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/sweEpub&lt;/a&gt;","torrent":{"xt":"urn:btih:dbd74f247c79240a3be023164477a76d5550ce42","amp;dn":"Endomondo+Pro+v.7.2.0+%5BsweEpub%5D%5Bcracked%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd74f247c79240a3be023164477a76d5550ce42","infoHashBuffer":{"type":"Buffer","data":[219,215,79,36,124,121,36,10,59,224,35,22,68,119,167,109,85,80,206,66]},"announce":[],"urlList":[]}}