{"title":"Population 10 Billion","uid":8769450,"size":7337636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc66e80ded75ad28deae8ea6ff6ed813a44d811b&amp;dn=Population+10+Billion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1375416753,"description":"Danny Dorling, &quot;Population 10 Billion&quot;\nISBN: 1780334915 | 2013 | EPUB | 448 pages | 7 MB\n\nBefore May 2011 the top demographics experts of the United Nations had suggested that world population would peak at 9.1 billion in 2100, and then fall to 8.5 billion people by 2150. In contrast, the 2011 revision suggested that 9.1 billion would be achieved much earlier, maybe by 2050 or before, and by 2100 there would be 10.1 billion of us. What's more, they implied that global human population might still be slightly rising in our total numbers a century from now. So what shall we do? Are there too many people on the planet? Is\nthis the end of life as we know it?Distinguished geographer Professor Danny Dorling thinks we should not worry so much and that, whatever impending doom may be around the corner, we will deal with it when it comes. In a series of fascinating chapters he charts the rise of the human race from its origins to its end-point of population 10 billion. Thus he shows that while it took until about 1988 to reach 5 billion we reached 6 billion by 2000, 7 billion eleven years later and will reach 8 billion by 2025. By recording how we got here, Dorling is able to show us the key issues that we face in the coming decades: how we will deal with scarcity of resources; how our cities will grow and become more female; why the change that we should really prepare for is the population decline that will occur after 10 billion.Population 10 Billion is a major work by one of the world's leading geographers and will change the way you think about the future. Packed full of counter-intuitive ideas and observations, this book is a tool kit to prepare for the future and to help us ask the right questions","torrent":{"xt":"urn:btih:dc66e80ded75ad28deae8ea6ff6ed813a44d811b","amp;dn":"Population+10+Billion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc66e80ded75ad28deae8ea6ff6ed813a44d811b","infoHashBuffer":{"type":"Buffer","data":[220,102,232,13,237,117,173,40,222,174,142,166,255,110,216,19,164,77,129,27]},"announce":[],"urlList":[]}}