{"title":"Simon &amp; Garfunkel - Wednesday Morning, 3AM (Remastered) [RePoPo]","uid":4452523,"size":429872831,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd58620d0dbbf6ea6817b534e326d778078b2c38&amp;dn=Simon+%26+Garfunkel+-+Wednesday+Morning%2C+3AM+%28Remastered%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1224290198,"description":"-------------------------------------------------------------------------------\n Simon &amp; Garfunkel - Wednesday Morning, 3am (Remastered + Bonus Tracks) (1964)\n-------------------------------------------------------------------------------                                \n\nTracklist:\n\n01.- You Can Tell The World [02:49]\n02.- Last Night I Had The Strangest Dream [02:13]\n03.- Bleecker Street [02:47]\n04.- Sparrow [02:51]\n05.- Benedictus [02:41]\n06.- The Sound Of Silence [03:09]\n07.- He Was My Brother [02:52]\n08.- Peggy-O [02:28]\n09.- Go Tell It On The Mountain [02:09]\n10.- The Sun Is Burning [02:50]\n11.- The Times They Are A-Changin' [02:55]\n12.- Wednesday Morning, 3 A.M. [02:23]\n13.- Bleecker Street (Demo) [02:46]  **\n14.- He Was My Brother (Alternate Take 1) [02:52]  **\n15.- The Sun Is Burning (Alternate Take 12) [02:46]  **\n\n** = BONUS TRACKS, exclusive to this release\n\nOriginally Released on 1964.  This remastered version, which includes three \nbonus tracks was Released on August 21st, 2001.\n\nRipped with EAC, creating a .cue/.wav audio file, preserving the CD structure,\ngaps and volume levels as in the original CD.\n\n-------------------------------------------------------------------------------\nAlbum Review by Bruce Eder\n\nWednesday Morning, 3 AM doesn't resemble any other Simon &amp; Garfunkel album, \nbecause the Simon &amp; Garfunkel sound here was different from that of the \nchart-topping duo that emerged a year later. Their first record together since \ntheir days as the teen duo of Tom &amp; Jerry, the album was cut in March 1964 and, \nin keeping with their own sincere interests at the time, it was a folk-revival \nalbum. Paul Simon was just spreading his wings as a serious songwriter and \nshares space with other composers as well as a pair of traditional songs, \nincluding a beautifully harmonized rendition of &quot;Peggy-O.&quot; The album opens with \na spirited (if somewhat arch) rendition of Gibson and Camp's gospel/folk piece \n&quot;You Can Tell the World.&quot; Also present is Ian Campbell's &quot;The Sun Is Burning,&quot; \nwhich Simon heard on his first visit to England as an itinerant folksinger, \nwhich would later yield such works as &quot;Anji&quot; and &quot;Scarborough Fair.&quot; But the \ndominant outside personality on the album is that of Bob Dylan -- his &quot;Times \nThey Are A-Changing&quot; is covered, but his influence is manifest on the oldest of \nthe Simon originals here, &quot;He Was My Brother.&quot; Simon's first serious, topical \nsong, it was what first interested Columbia Records producer Tom Wilson in Simon \n&amp; Garfunkel. He'd written it before the event, but Simon later identified the \nsong closely with the fate of his Queens College classmate Andrew Goodman, one \nof three civil rights workers murdered in Mississippi in 1964. By the time the \nalbum was recorded, however, Simon had evolved beyond Dylan as an inspiration \nand developed a unique songwriting voice of his own in the title track, a \nbeautifully sung, half-lovely song (that also shows his limitations, employing \nthe phrase &quot;hard liquor store&quot; because he needed the extra syllable); &quot;Sparrow&quot; \nand &quot;Bleecker Street,&quot; spritely, mystical, and mysterious, and innocently \npoignant observations on life; and &quot;The Sounds of Silence&quot; in its original \nall-acoustic version, a heartfelt and defiant statement about the human \ncondition and the shape of the world. Art Garfunkel's makes his own contribution \non the creative side with a beautiful arrangement of &quot;Benedictus.&quot; It's \nsurprisingly ambitious but also somewhat disjointed, mostly because the \nnon-original material, apart from &quot;Peggy-O&quot; and &quot;The Sun Is Burning,&quot; comes off \nso arch. The seeds of their future success were here, however, and took root \nwhen the version of &quot;The Sounds of Silence&quot; on this album started getting played \non the radio, in Boston and Florida, respectively. \n\n-------------------------------------------------------------------------------\n                      AllMusicGuide Track-by-track Review\n-------------------------------------------------------------------------------\nYOU CAN TELL THE WORLD\n\nA minor coffeehouse favorite from the early '60s opened up the debut Simon &amp; \nGarfunkel album with a bang. A furiously strummed acoustic guitar and bass are \nthe only backing on this, but the singers' voices fill up the tape with an \ninfectious atmosphere. Bob Gibson's trademark Dixieland bounce is evident here, \nand a strong gospel feel in both the lyrics and music conveys a sense of \npositive, life-affirming virtue that was indeed a big part of Simon &amp; \nGarfunkel's appeal. \n\nLAST NIGHT I HAD THE STRANGEST DREAM\n\nWritten by one of the founding fathers of modern folk music, this Ed McCurdy \nballad is almost a precursor to John Sebastian's &quot;I Had Dream,&quot; with its dream \nof eternal peace, however difficult that may be to achieve. A waltz-time rhythm \nand tempo carry the song, which also features some excellent (and uncredited) \nbanjo work. Although Simon &amp; Garfunkel would certainly gain a stronger artistic \nfooting very soon, this early recording has a strong period charm and also shows \noff their unique and tight harmony vocals.\n\nBLEECKER STREET\n\nWritten by Paul Simon in England in the Summer of 1963, &quot;Bleeker Street&quot; is \nabout a very real and famous street in New York's Greenwich Village where both \nhe and Arthur Garfunkel (and hundreds of other struggling folkies) had worked in \nthe 1960s. A sense of desperation and depression for the street artist/musician \nimbibes the song, and the stark imagery is extremely effective. Written in a \ngentle, fingerpicked acoustic guitar style, it's not unlike Gordon Lightfoot's \n&quot;Early Morning Rain.&quot; This song is also one of the few on the duo's debut album \nthat retains some similarity with their classic, later-day work.\n\nSPARROW\n\nWritten by Paul Simon in the summer of 1963, &quot;Sparrow&quot; was written after an \namusing incident where Simon found himself walking down a street in a fit of \nself-doubt, which was followed by an unfortunate accident when a sparrow \ndefecated on him from atop a building. Although the incident is not recounted in \nthe song, the feeling of being lost is certainly at the core of the fine lyrics, \nwhich also draw on biblical imagery. Musically, the song is a neo-classical \nexercise in minor-key folk balladry and features some excellent fingerpicking \nguitar and subtle acoustic bass. According to Art Garfunkel, this was the first \nsong of Simon's that he arranged, and following, at a New York city folk club, \nthe two re-ignited their musical partnership. \n\nBENEDICTUS\n\nOne of the earliest Simon &amp; Garfunkel collaborations, &quot;Benedicts&quot; dates back to \nspring of 1964, when Arthur Garfunkel was a college student. One of the courses \nhe took was on 16th century music, and following some library research he came \nup with the idea of updating this classic Latin hymn. Almost a cappella in style \n(with just a few guitar chord flourishes), it's a wonderfully intricate two-part \nharmony reading. The syncopated style achieved on this arrangement would later \nbe revisited by the duo, specifically on &quot;Scarborough Fair.&quot; The song was \noriginally arranged by an Italian, Orlando de Lasso. \n\nTHE SOUND OF SILENCE\n\nPaul Simon was a Brill Building demo singer as a teenager and, like the Beatles, \nwas heavily under the spell of the famous harmonies of the Everly Brothers. \nSimon and his high school buddy, the classically trained musician Art Garfunkel, \neven formed a teenage duo, Tom and Jerry, that was modeled after the Everlys. \nBut like a lot of other ambitious songwriters in the '60s, Simon soon fell sway \nto the remarkable abilities of Bob Dylan. And again, like the Beatles, Simon \nsought to merge his Brill-trained classic rock &amp; roll and pop tendencies to the \nnewly wide-open lyrical scope of Dylan. And Dylan himself met the popsters \nhalfway, famously going electric soon after seeing the Fab Four and watching the \nByrds score even bigger hits than he did with electrified versions of his songs. \nIt was a heady era for pop music; soon anything and everything was fair game for \nsubject matter and rock &amp; roll songwriters were starting to be taken seriously \nas artists.\n\nWhile we all would agree that this was mostly a good thing, the charts soon \nbecame littered with overly ambitious and ill-informed protest songs and \nself-consciously &quot;literate&quot; clunkers that fell short of the mark. While &quot;Sound \nof Silence&quot; is ultimately saved from being among the latter, Simon does seem to \nbe reaching like a college freshman English major with &quot;hey, look at me!&quot; lines \nlike, &quot;the words of the prophets were written on the subway walls,&quot; and &quot;but my \nwords, like silent raindrops fell.&quot; Simon seems to desire the same prophetic \nvoice of authority that Dylan confidently exhibited in songs like &quot;A Hard Rain's \nA-Gonna Fall.&quot; But as a great song should, &quot;Sound of Silence&quot; starts with the \nmicrocosmic world of a relationship and the inability for two to communicate, \nand in the larger context of the tumultuous '60s takes on a greater \nsignificance. The lyric, while a bit sophomoric at times, showed the promise of \na writer with talent that would develop over time. And certainly the narrator as \nthe lone voice of reason and understanding and the alienated cry in the urban \nwilderness are themes that Simon would later refine with more subtlety and \ngreater depth on songs like &quot;The Boxer.&quot;\n\nThe original recording was from the pair's debut, Wednesday, 3 AM (1964), an \nalbum they recorded for Columbia after they first felt the influence of the \nburgeoning folk revival movement. The two were aware of what they had, Garfunkel \nnoting in the album's liner notes that the song &quot;...is a major work. We were \nlooking for a song on a larger scale, but this was more than either of us \nexpected.&quot; They recorded it with just the voices and a lone acoustic guitar, \nand, after little interest was shown in the record, disbanded while Garfunkel \nattended Columbia University and Simon went off to live in London, where he \nrecorded and released a solo record and toured European coffeehouses and pubs. \nMeanwhile, the song started to find a modest amount of radio play. Columbia \nRecords, experiencing success with Dylan's electric-acoustic forays, employed \nDylan's producer, Tom Wilson, to give &quot;Sound of Silence&quot; a similarly electrified \ntreatment -- employing the same band from the Dylan sessions -- never bothering \nto consult Simon and/or Garfunkel. According to Patrick Humphries' biography of \nSimon, The Boy in the Bubble (1988), the singer/songwriter was on tour in \nDenmark when he happened upon a copy of Billboard and saw that the song was \ncharting. Humphries notes that Columbia mailed Simon a copy of the electrified \nversion and that Simon was &quot;horrified when he first heard it. In fact, if you \nlisten to that original version, you can hear the rhythm section slow down at \none point so that Paul and Artie's voices can catch up.&quot; But it went to number \none in 1966. The duo agreed that it was time to regroup. They quickly went into \nthe studio with a few more songs, some from Simon's solo record, to record a \nfull album ( Sounds of Silence, 1966) to capitalize. As Simon recounted -- \nquoted on the Simon &amp; Garfunkel website ( /http://www. medialab. chalmers. \nse/guitar/index. tml#S&amp;G): &quot;I had just come back from England, and Art was still \nliving at home, he was still at college and we were sitting in my car...smoking, \nand &quot;Sound of Silence&quot; came on and they said: 'Number one record, &quot;Sound of \nSilence&quot; by Simon &amp; Garfunkel,' we were just sitting there at night, we hadn't \nanything to do, and Artie turned to me and he said: 'those guys must be having \nso much fun!'.&quot;\n\nThe duo harmonizes sweetly on the incredibly haunting melody, over a driving, \nminor-key acoustic guitar rhythm, also indebted to the Everly Brothers, singing \nimages of urban apathy and desensitization. Even the acoustic original starts \nwith the soft, dark introduction and grows more intense and harder, with the \nwispy voices gaining an edge and wavering with emotion while Simon abandons the \nfingerpicking style and goes for the Everlys' strum. In an interview in Playboy, \nSimon recounted the germination of the song: &quot;The main thing about playing the \nguitar, though, was that I was able to sit by myself and play and dream. And I \nwas always happy doing that. I used to go off in the bathroom, because the \nbathroom had tiles, so it was a slight echo chamber. I'd turn on the faucet so \nthat water would run -- I like that sound, it's very soothing to me -- and I'd \nplay. In the dark. 'Hello darkness, my old friend/I've come to talk with you \nagain'. I've always believed that you need a truthful first line to kick you off \ninto a song. You have to say something emotionally true before you can let your \nimagination wander.&quot;\n\nThe electrified version is the one most are familiar with, from the hit single \nand its crucial and influential role on the soundtrack to the 1967 film The \nGraduate. The added musicians don't pound as hard as they often do on those \nDylan records, instead opting for a more jangling West Coast folk-rock \ntreatment. The soundtrack makes great use of the song's plaintive opening \narpeggios and first line. The song gives voice to the film's frustrated, Holden \nCaulfield-esque hero, Benjamin Braddock.\n\nHE WAS MY BROTHER\n\nWritten by Paul Simon in June of 1963 under the pseudonym P. Kane. A song of \nloss, it was later rewritten to make reference to an ex-classmate of Simon's, \nAndrew Goodman, who was one of the students murdered in Mississippi during a \ncivil rights demonstration in 1964. Like the classic &quot;He Was a Friend of Mine&quot; \n(cut by both Bob Dylan and the Byrds), the feeling of loss is captured in a \nbeautiful atmosphere of subtle, poetic style, avoiding overstatement. One of \nSimon's finest early lyrics, it's backed by a minor-key folk progression with a \nvaguely country rhythm. The song was released two other times (other than Simon \n&amp; Garfunkel's version), once as a solo single by Simon under the name &quot; Jerry \nLandis.&quot; \n\nPEGGY-O\n\nA light, sweet tempo and engaging overall feel in the vocal arrangement, this \ntraditional coffeehouse folky favorite is an excellent showcase for Simon &amp; \nGarfunkel's fabulous two-part harmonies. Although this song is a bit out of \ncontext compared to most of the duo's later, more ambitious work, there is a \nstrong period charm here, and it lightens up the Wednesday Morning, 3 A.M. album \nquite a bit next to heavier statements such as the original version of &quot;Sounds \nof Silence.&quot; \n\nTHE SUN IS BURNING\n\nAnother cover song from the Simon &amp; Garfunkel debut album that, while not up to \nthe extremely high standards of their later, more ambitious work, nevertheless \nretains a strong period charm and feel. A subtle anti-nuclear war statement, it \nconveys the sense of beauty of the natural world juxtaposed with the threat of \nannihilation. Arthur Lee of Love would later write &quot;Mushroom Clouds,&quot; which \ncontained many lyrical and musical references to this fine song. Again, Simon &amp; \nGarfunkel's awesome harmonies -- even at this early stage -- are strikingly \neffective. \n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:dd58620d0dbbf6ea6817b534e326d778078b2c38","amp;dn":"Simon+%26+Garfunkel+-+Wednesday+Morning%2C+3AM+%28Remastered%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd58620d0dbbf6ea6817b534e326d778078b2c38","infoHashBuffer":{"type":"Buffer","data":[221,88,98,13,13,187,246,234,104,23,181,52,227,38,215,120,7,139,44,56]},"announce":[],"urlList":[]}}