{"title":"Spunk-A-Licious (Spunkalicious) (2015) DVDRip","uid":13247153,"size":1705111073,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:de4c367b7f1eac64d8a1f6a2219b0d4760fa6bd2&amp;dn=Spunk-A-Licious+%28Spunkalicious%29+%282015%29+DVDRip+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1453125506,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/V3\r\n \nhttp://imgsnaps.com/image/V6\r\n\r\nDescription\r\nAlfie, Antonio Garcia, Carioca, Drew Brody, Fred Faurtin, Harley Everett, Harry Louis, Jason Stark, Kurt Rogers, Lucio Saints, Tony Axel, Tyson Mac, Valentin Alsina\r\n\r\nIt's a lip smacking, finger licking celebration of big uncut cocks, dick sucking and of course lots of fucking. Harry Louis gives it up at last, and takes on Harley (Muscle Mountain) Everett and Drew (12 inch) Brody, Harry's hole is in sopping ruins by the end of this! Lucio (boy breaker) Saints is on fine form with Tony Axel, with poor Tony spending a few days on a rubber ring after this arse punishing scene. Jason Stark is up next, pitted against big-dicked, Italian Antonio Garcia - Jason's hairy hole is gaping, wide for uncut dick and when Antonio's finished smashing it Valentin Alsina, who's been watching the action, takes his turn to squirt a juicy load on the sub boys face - sleazy! French sensation - Fred Faurtin and rough Brit boys Tyson Mac and Alfie are banged up borstal boys. Fred and Tyson like it rough and Alfie's not getting much say in the matter!.The cherry on this creamy cake is one of Uknakedmen's all time most popular scenes - Kurt Rogers and Carioca. Dark and hairy Carioca fucks Kurt all over a pool table. Its a doozy with every scene a spunkalicious winner","torrent":{"xt":"urn:btih:de4c367b7f1eac64d8a1f6a2219b0d4760fa6bd2","amp;dn":"Spunk-A-Licious+%28Spunkalicious%29+%282015%29+DVDRip+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de4c367b7f1eac64d8a1f6a2219b0d4760fa6bd2","infoHashBuffer":{"type":"Buffer","data":[222,76,54,123,127,30,172,100,216,161,246,162,33,155,13,71,96,250,107,210]},"announce":[],"urlList":[]}}