{"title":"Diehard Dungeon v1.8","uid":11423915,"size":59364533,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:de77e713ea7d3d237d11d8990483f5e3d25b46ea&amp;dn=Diehard+Dungeon+v1.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1415642475,"description":"&quot;Combining its own unique take on the real-time roguelike genre, with a nostalgic 16-bit look and feel, Diehard Dungeon is a game that feels both familiar and quite different at the same time. Followed by a trusty, treasure collecting companion chest, you must make your way through the dungeons many randomly-generated rooms and levels.&quot;\n\nv1.8 changelog (08.11.2014):\n- Fading Light - A new minigame that will cost 10 tokens to unlock.\n- New enemy - Searching Eye.\n- The respin system for green chests is changing. Every respin will now guarantee a win. Each successive respin will require more tokens, to a maximum of 10 tokens (increase: 1, 3, 5, 10).\n- Double-spin spin attack. Pressing the attack button at the very end of a spin attack will activate a second spin for a potential of 10 points of damage.\n- Spin attack movement speed increased slightly.\n- Door key carry speed increase. Carrying a door key will increase the player's speed instead of slowing them down. I've received a lot of feedback regarding the tedious task of having to carry the key to the lock. Carrying the key will now be advantageous.\n- Move whilst attacking with the sword. The player will be allowed a small amount of movement whilst attacking with the sword, as opposed to being fixed on the spot. Sword combat will feel more fluid.\n- You can now turn whilst attacking with the sword. Locking the player's direction whilst attacking led to some frustrating situations where they would be hit from behind, unable to turn and attack quick enough.\n- Player move speed has been increased slightly.\n- Keyhole colour has been changed from dull blue to a vibrant gold. This should make them much easier to spot.\n- Hitting a cannonball with the sword will now provide some satisfying feedback.\n- A new achievement for the Fading Light minigame.\n\nIf you like the game, support the developer, buy it!   &lt;a href=&quot;\nhttp://store.steampowered.com/app/277870/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/277870/&lt;/a&gt;","torrent":{"xt":"urn:btih:de77e713ea7d3d237d11d8990483f5e3d25b46ea","amp;dn":"Diehard+Dungeon+v1.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de77e713ea7d3d237d11d8990483f5e3d25b46ea","infoHashBuffer":{"type":"Buffer","data":[222,119,231,19,234,125,61,35,125,17,216,153,4,131,245,227,210,91,70,234]},"announce":[],"urlList":[]}}