{"title":"Carrie Underwood - Temporary Home  (2nafish)","uid":5347757,"size":184473604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:de95cc9826cd143afbaa2540f98674d0a60b8a84&amp;dn=Carrie+Underwood+-+Temporary+Home++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265699493,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Temporary Home&quot; is the title of a song written by Zac Maloy, Luke Laird and co-written and recorded by American country artist Carrie Underwood. It is the second official single from her third studio album, Play On, and is set to be released to country radio starting the week of December 14, 2009. Before being released as a single, the song was made available to iTunes on October 20, 2009. A promotional music video for the song was released in November 2009, and an official music video followed in February 2010.\n\nOriginally, a live performance from CMT's Invitation Only, was released as a music video to promote the single. A real music video for the song was filmed in Nashville, Tennessee, and premiered on CMT on February 4, 2010. In the video, Underwood is shown riding around town in a taxi cab, watching first as a young boy with his new adopted mother, and then as a mother tries to get a job. She finally reaches her destination, a hospital room with who is thought to be a grandfather lying on his deathbed, and becomes emotional that he was still alive for her to say goodbye to. Throughout the video, Underwood is also shown performing the song while standing among trees in the winter, with snowfall coming down behind her.\n\n&quot;Temporary Home&quot; debuted at #92 on the U.S. Billboard Hot 100 and at #66 on the Canadian Hot 100 on the week ending November 7, 2009. It also debuted at #48 on the U.S. Billboard Hot Country Songs chart on the week ending December 12, 2009.\n\nMaloy, Laird and Underwood spent a two-day writing session together and on the second day Underwood came in with the idea for this song, which the trio developed. \n\nOn November 16, 2009, Underwood performed the song on The Tonight Show with Conan O'Brien. She also performed this song on Home for the Holidays, a CBS special that Faith Hill hosted on December 23, 2009.\n\nPlay On is the third studio album from American country artist Carrie Underwood. It was released in the United States on November 3, 2009. The first single, &quot;Cowboy Casanova&quot;, was released to country radio on September 14, 2009. In addition, three promotional singles were made available to iTunes prior to the release of the album. The album debuted at #1 on the Billboard 200 with first week sales of 318,000 copies; and rated as the highest first week sales for a female artist in 2009, before being overtaken by Susan Boyle a few weeks later. It is her second album to debut at #1 on the Billboard 200, and her third to debut atop the Billboard Top Country Albums chart. Play On charted at #58 on Billboard's year-end chart. As of the week ending Jan 10, 2010, its sales status is at 1,227,000, making it Underwood's third album to top 1,000,000 albums sold in the United States alone and has been certified Platinum by the RIAA.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:de95cc9826cd143afbaa2540f98674d0a60b8a84","amp;dn":"Carrie+Underwood+-+Temporary+Home++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de95cc9826cd143afbaa2540f98674d0a60b8a84","infoHashBuffer":{"type":"Buffer","data":[222,149,204,152,38,205,20,58,251,170,37,64,249,134,116,208,166,11,138,132]},"announce":[],"urlList":[]}}