{"title":"Hidden Secrets - Part 145 - The Day After Disclosure Secret Soci","uid":14592180,"size":5101664525,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dfc3d7977bb9e46d1d9dd31c8082b12f19d71aca&amp;dn=Hidden+Secrets+-+Part+145+-+The+Day+After+Disclosure+Secret+Soci&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":66,"time":1462999431,"description":"THE DAY AFTER UFO DISCLOSURE:\r\nFull disclosure concerning UFOs and Extraterrestrial visitation remains a Top Secret issue among world governments. However, an un-official soft-sell, media campaign of governmental disclosure is actively conditioning the public to the reality of an Extraterrestrial presence engaging the Human Race. Get the facts in this feature length presentation by UFOTV.\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nAlien Encounters:\r\nJust a few months into the year 2014 and the world has already seen strange lights in the sky and eerie encounters with extraterrestrials inside our communities. With video evidence of UFO spotlights beaming down to the surface and triangular formations cutting through clouds - it appears as if the UFO phenomenon continues unabated - but where does it lead? And what is its purpose?\r\n\r\nFootage includes the pursuit of an unidentified object through the streets of New York City, a UFO above Los Angeles during the recent earthquake, a dual shimmering light over the ocean, and alleged home invasions by unknown alien beings. And many more!\r\n\r\nWhat is the meaning behind ancient symbols left here on Earth and on the Moon - and is there a connection to today's encounters? Are there not only entities performing bizarre maneuvers in our skies - maneuvers so alien in purpose that they cannot be understood by unsuspecting human minds - but further, is it possible that those orchestrating these unknowns are covertly operating just beyond our own homes?\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nExtra Terrestrial Contact - Have we recieved their message?\r\nUFO'S, Spacecraft, Crop circles, Radio Signals, Ancient Artifacts, Deep space craft. Is this contact from Extra Terrestrials? Strange indeed. Worth investigating. :)\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nIn Space &amp; Time:\r\nShieldoftheson presents the Biblical evidence about the sciences of time travel, UFOs, and wormholes.\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nIntelligent Nano Orb Mutates Steel Into A Reptile:\r\nUploader comments: As I have shown you in previous videos the small white nano orbs are under intelligent control and they are able to embed themselves into steel as well as other metals and materials and then they morph and mutate the steel, in this video they are morphing the steel into some type of a reptile! They had cameras on this in the Gulf Of Mexico for over 72 hours!\r\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nNASA UFO Footage and Alien Secrets:\r\nOn July 16th, 1969 Apollo 11 embarked on its historic mission to put a man on the Moon. But what was the true purpose of this mission and did it have a secret agenda? Stunning evidence from declassified &quot;black box&quot; transcriptions lend credibility to the possibility that NASA's mission generally, and the Apollo missions particularly, were organized to covertly document proof of the existence of ancient aliens. For decades, controversy has surrounded the reason why Moltke Crater was the selected landing zone for the first human landing on the Moon. Do the statements of astronauts themselves and peculiar pyramidal structures and triangular roads filmed by Apollo spacecraft indicate evidence of an ancient alien civilization near Moltke Crater? If so, has this evidence been &quot;covered up&quot; pursuant to the Brookings Report's policy recommendations? Footage includes a UFO sighting from Apollo 11's telescopic camera during the flight to the Moon, pyramids and other structures on the Moon and Mars, the Black Knight Satellite encounter, and more. Is it possible that NASA has known for years that extraterrestrials do in fact exist, and is this evidence blatantly available in declassified and public archive records? And just who exactly are &quot;the people that live in the Moon?&quot;\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nSECRET SOCIETIES and FLYING SAUCERS:\r\nThis film explores the connection between Ancient Secret Societies and Extraterrestrial Influences Engaging the Planet earth. Does &quot;the great work of the ages&quot; pursued by contemporary secret societies involve a covert plan to fully restore an ancient lost culture that flourished on this planet long before recorded history? Could it be that there is nothing &quot;New&quot; at all about the 'new world order', and that it is in fact, an occult scheme to resurrect an ancient totalitarian (religious) order designed to covertly serve extra-terrestrials via a worldwide encompassing psyop using various easily controlled tools widely embraced by the unwitting populace? Explore these ideas and more in this shocking fact filled documentary. Part 1 - Covers SECRET SOCIETIES. Part - 2 Covers THE FLYING SAUCER CONNECTION provided by UFOTV.\r\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\nTheosophy and Their Prophetic Symbols:\r\nIn some form, Theosophy will be the global religion. It will continue to morph itself into all of the other belief systems of earth. Their symbols represent a prophetic plan to accomplish their goals of providing mankind with a false eternal body and environment. This video will explain how","torrent":{"xt":"urn:btih:dfc3d7977bb9e46d1d9dd31c8082b12f19d71aca","amp;dn":"Hidden+Secrets+-+Part+145+-+The+Day+After+Disclosure+Secret+Soci","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc3d7977bb9e46d1d9dd31c8082b12f19d71aca","infoHashBuffer":{"type":"Buffer","data":[223,195,215,151,123,185,228,109,29,157,211,28,128,130,177,47,25,215,26,202]},"announce":[],"urlList":[]}}