{"title":"Sweet Tooth (Complete - c2c &amp; noAds) (theProletariat-Novus)","uid":8012467,"size":2075531920,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e0606be352f77c642fcd94027967ea50ca5514c0&amp;dn=Sweet+Tooth+%28Complete+-+c2c+%26amp%3B+noAds%29+%28theProletariat-Novus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RubrumPopulus","files":-1,"time":1358022530,"description":"\n\nThis torrent includes the entire 40 issue run of the fabulous Vertigo series Sweet Tooth written and illustrated by Jeff Lemire.  Both c2c and noAds versions are provided for issues 8-40.\n========================================================\n\n\nOut of the Deep Woods (issues 01-05)\nFollowing on the heels of THE NOBODY, his Vertigo graphic novel debut, writer/artist Jeff Lemire pens his very first ongoing series SWEET TOOTH. A cross between Bambi and Cormac McCarthy's The Road, SWEET TOOTH tells the story of Gus, a rare new breed of human/animal hybrid children, has been raised in isolation following an inexplicable pandemic that struck a decade earlier. Now, with the death of his father he's left to fend for himself . . . until he meets a hulking drifter named Jepperd who promises to help him. Jepperd and Gus set out on a post-apocalyptic journey into the devastated American landscape to find 'The Preserve' a refuge for hybrids.\n\n========================================================\n\n\nIn Captivity (issues 06-11)\nIn this second arc, Lemire explores the heartbreaking story of Jeppard and how he went from a devoted husband to the ruthless mercenary he is now. Meanwhile, Gus is captured in a camp with other hybrid creatures where he meets Dr. Singh, a scientist studying the plague that's wiped out so much of the world. By traveling more into Gus' past, Singh will learn more about the plague, as well as clues at how some of it might relate to Gus and his father.\n\n========================================================\n\n\nAnimal Armies (issues 12-18)\nIn this third arc, Jeppard begins to form an army to topple the militia camp so he can rescue Gus and the other hybrid kids. But will he arrive too late to save anyone?\n\n========================================================\n\n\nEndangered Species (issues 19-25)\nGus reluctantly joins Jepperd on missing persons hunt, but the tension between the two continues to grow. Meanwhile, Singh and Johnny come face to face with a deadly new threat, and Lucy and the girls meet Walter Fish, an enigmatic survivor who may have more to offer than meets the eye. Will this lead to a new sanctuary for them, or something far more dangerous?\n\n========================================================\n\n\nThe Taxidermist (issues 26-28)\nWho is Captain James Thacker and what are he and his crew doing in the far northern reaches of Alaska? As Thacker and his crew man a deadly expedition, they will uncover secrets centuries old, but what does any of this have to do with Gus and Jepperd? The answers will shock you and change the course of SWEET TOOTH forever! A bold new storyline begins! Featuring special guest artist Matt Kindt (REVOLVER, Super Spy).\n\n========================================================\n\n\nUnnatural Habitats (issues 29 to 32): \nJeff Lemire returns as regular artist for the start of &quot;Unnatural Habitats.&quot; While Jeppard, Singh and Gus make plans to head to Alaska, things start to deteriorate for the rest of the group back at the sanctuary in the dam.\nInterlude (issue 33): \nA very special issue of SWEET TOOTH as we check in on &quot;The Continuing Adventures of The Big Man and The Little Boy.&quot; It's a children's story unlike any other - and a major step forward in the series.\n\n========================================================\n\n\nThe End:\nDr. Singh arrives in Alaska and uncovers the origins of Gus and the hybrid children and the cause of the plague that decimated the world. And as Gus and Jepperd finally arrive in Alaska and come face to face with the truth, the militia continues to bear down on them. Their deadliest battle is still ahead.\n\n\n\nThanks goes to Steam and theProletariat for these releases.\n\n","torrent":{"xt":"urn:btih:e0606be352f77c642fcd94027967ea50ca5514c0","amp;dn":"Sweet+Tooth+%28Complete+-+c2c+%26amp%3B+noAds%29+%28theProletariat-Novus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0606be352f77c642fcd94027967ea50ca5514c0","infoHashBuffer":{"type":"Buffer","data":[224,96,107,227,82,247,124,100,47,205,148,2,121,103,234,80,202,85,20,192]},"announce":[],"urlList":[]}}