{"title":"Peter Gabriel  - Live Performances","uid":6573747,"size":1866640258,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e0998765a92fe09c5c75f9fa8274c60d7d4f23ca&amp;dn=Peter+Gabriel++-+Live+Performances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":10,"time":1312095664,"description":"\nPeter Gabrial-Live Performances\n\nThis upload consists of videos I recorded off of cable TV using two Sony SLHF-900 Super Beta Hi-Fi VCR\\'s\n&amp; two Mitsubishi U-70 S-VHS Hi-Fi VCR\\'s.\nI would tape the entire show (Saturday Night Live, Tonight Show, etc.) and then transfer the music\nperformances to the other VCR for archiving. Some performances may be 1st gen and not tape to tape.\n\nSome of these videos I may have uploaded in the past and if so only the file name has changes to include\nthe song title. You can rename your exisitng file to match the one in this upload to provide a seed and\ndownload any new material.\n\n\nThis upload Contains:\n\nPeter Gabrial-Digging In The Dirt, Tonight Show 2-25-93 #1 ST TV-SB-SV280-AVI-MPG\n\nPeter Gabriel-Biko, Conspricay Of Hope #6 6-15-86 ST TV-SB26-AVI-MPG\n\nPeter Gabriel-In Your Eyes, Saturday Night Live #2 4-10-93\n\nPeter Gabriel-Red Rain, Conspricay Of Hope #1 6-15-86 ST TV-SB26-AVI-MPG\n\nPeter Gabriel-Sledgehammer, Conspricay Of Hope #4 6-15-86 ST TV-SB26-AVI-MPG\n\nPeter Gabriel-Steam, 35th Grammys 2-93 M TV-SB180-AVI-MPG\n\nPeter Gabriel-Washing Of The Water, Tonight Show #3 2-25-93 ST TV-SB-SV280-AVI-MPG\n\n\n\nThe file naming convention is typically\n1. Artist Name\n2. Song Name\n3. Show\n4. Segment Number\n5. Broadcast Date (Month, Day, Year)\n6. Audio (ST=Stereo, M=Mono, SE=Simulated Stereo, by the TV station) All audio is Hi-Fi, no linear track audio involved\nunless listed as ML=Mono Linear Track (very rarely).\n7. Lineage (Typically-Cable Television (TV) to Super Beta (SB) to S-VHS (SV) to AVI to MPEG2)\nTape number after archived tape format.\n\nThe reason for the AVI to mpeg conversion was that The AVI files were uncompressed and with PCM audio and\nvaried between 900 megs to 1.5 gigs for a 4 minute song and a little large for file sharing and storing.\nWhen I started transferring these I was a little leery of what I might notice as flaws in the mpeg\ncompression over time and chose to record to AVI first and convert to a more reasonable sized file by\nusing mpeg compression.\nAs it stands I think the mpeg conversion is very good for a TV signal and have no regrets.\nThe audio is superb since these were recorded with hi-fi audio and the majority are from\nstereo broadcasts. The video is good as these were recorded on super beta II and Super VHS SP tape speeds\nunless (ep) is followed by the SV tape format (extremely rare).\nEverything else I\\'ve seen from this era on torrent sites is from linear track mono and standard VHS\nunless re-broadcasted recently.\n\nDetails on the transfer:\nVideo played through a Datavideo TBC-1000 Time base corrector to AVI capture card using Muvee Autoproducer 5.0,\nConverted to mpg in VEGAS PRO 8\n\nAVI Specs\nContainer-DV Type 2 AVI, Multipart Open DML AVI (2 PARTS)\nCodec-DVSD DVC/DV VIDEO\n720X480 4:3 DVD Format\nPCM Audio 16/48\n\nMPEG2 File Characteristics:\nAll the MPEG files are in DVD format and ready to make a DVD if you wish. I have kept them as MPG so I can play the\nvideos randomly.\n\nSystem Bitrate: 9921 kbs Variable Bit Rate\nAudio: MPEG-1 Layer 2, 48khz 224-320kbps (depending on when tranferred) Stereo, Constant Bit Rate\nVideo: 720x480 4:3 6,000 kbps NTSC\n\nI WILL SEED UNTIL THE TORRENT TAKES OFF AND THEN LEAVE SO I CAN UPLOAD OTHER SHOWS. DO TO THE LARGE NUMBERS\nOF SHOWS I HAVE TO SHARE I WILL NOT PROVIDE A RESEED! SO PLEASE BE NICE AND STICK AROUND FOR THE NEXT PERSON BY\nSEEDING, AFTER ALL THAT IS THE ONLY WAY TORRENTS WORK.\n\nPLEASE CHECK MY PREVIOUS POSTS TO SEE IF YOU CAN PROVIDE A SEED","torrent":{"xt":"urn:btih:e0998765a92fe09c5c75f9fa8274c60d7d4f23ca","amp;dn":"Peter+Gabriel++-+Live+Performances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0998765a92fe09c5c75f9fa8274c60d7d4f23ca","infoHashBuffer":{"type":"Buffer","data":[224,153,135,101,169,47,224,156,92,117,249,250,130,116,198,13,125,79,35,202]},"announce":[],"urlList":[]}}