{"title":"The Anthony Cumia Show 2015-03-09 MP4 MP3 combo","uid":11745965,"size":282449792,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e31f9d265066ab1591eabe1f63a546d48d3ea4da&amp;dn=The+Anthony+Cumia+Show+2015-03-09+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1426019471,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 123: Monday's show begins with Anthony longing to open his pool, summarizing Adam Carolla's new movie &quot;Road Hard&quot;, that he watched over the weekend, and mining some rocks on EVE Online. We see some old Cumia family photos, hear about the Huntington St. Patty's parad e and the attendees, cover Ant's tweets that pissed off the Twittersphere this weekend, hear from a few eager callers, and find out new ways that the government is spying on us. After Ant goes through Monday's mail, he discusses the new Apple watch and MacBook, the staff and callers voice their opinions on them, we see a racist video that shut down Sigma Alpha Epsilon at University of Oklahoma, learn that fatties want the &quot;I'm feeling fat&quot; emoticon removed from Facebook, and KtC tells us about a portly cop he used to work with named &quot;Pauly Poundcakes&quot;. Ant then plays Corey Feldman's new song dedicated to Corey Haim, Suge Knight's hit and run video, talks about a spooky news story out of Utah, touches on a bit of religion, and ends today's show hearing from the glorious callers once again and watching Ari Shaffir's video addressing Big Jay Oakerson crying.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:e31f9d265066ab1591eabe1f63a546d48d3ea4da","amp;dn":"The+Anthony+Cumia+Show+2015-03-09+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e31f9d265066ab1591eabe1f63a546d48d3ea4da","infoHashBuffer":{"type":"Buffer","data":[227,31,157,38,80,102,171,21,145,234,190,31,99,165,70,212,141,62,164,218]},"announce":[],"urlList":[]}}