{"title":"Jenny Downham - 2 Novels (YA) - Kindle + ePub - Barbie1710","uid":8130991,"size":2188812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3d37b5cb28d025bab5c09cf052dc9d106a6b0c4&amp;dn=Jenny+Downham+-+2+Novels+%28YA%29+-+Kindle+%2B+ePub+-+Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Barbie1710","files":11,"time":1360604244,"description":"Jenny Downham - 2 Novels (YA)\n\nAZW3, EPUB, MOBI\n\n\nYou Against Me\nIf someone hurts your sister and you're any kind of man, you seek revenge.\nIf your brother's accused of a crime but says he didn't do it, you defend him.\n\nWhen Mikey's sister claims a boy assaulted her, his world begins to fall apart. When Ellie's brother is charged with the offense, her world begins to unravel. When Mikey and Ellie meet, two worlds collide.\n\nThis is an unflinching novel from the bestselling author of Before I Die. It's about loyalty and the choices that come with it. Above all, it's a book about love.\n\n\nNow Is Good (Also Published as Before I Die)\nTessa has just a few months to live. Fighting back against hospital visits, endless tests and drugs with excruciating side-effects, Tessa compiles a list. It's her Before I Die list. And number one is sex. Starting tonight. Released from the constraints of 'normal' life, Tessa tastes new experiences to make her feel alive while her failing body struggles to keep up. Her feelings, her relationships with her father and brother, her estranged mother, her best friend, and the powerful, bittersweet first love she finds with the boy next door - all are painfully yet beautifully crystallized in the precious weeks before Tessa's time finally runs out.\n\n\nThis is a multi-tracker torrent.  Please check your Bit-Torrent client for the true number of seeds.  Enjoy &amp; Please Seed","torrent":{"xt":"urn:btih:e3d37b5cb28d025bab5c09cf052dc9d106a6b0c4","amp;dn":"Jenny+Downham+-+2+Novels+%28YA%29+-+Kindle+%2B+ePub+-+Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d37b5cb28d025bab5c09cf052dc9d106a6b0c4","infoHashBuffer":{"type":"Buffer","data":[227,211,123,92,178,141,2,91,171,92,9,207,5,45,201,209,6,166,176,196]},"announce":[],"urlList":[]}}