{"title":"Everette Morgan - Tomorrow's Past series","uid":10514350,"size":2003532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3f7925e6e1d45cafbd92fda34a5be1b59d76274&amp;dn=Everette+Morgan+-+Tomorrow%27s+Past+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ONLYMOBI","files":15,"time":1404892382,"description":"The Hunt (Book 1)\nMarcus Rainwater was barely 13 when the N47Q virus struck. Everyone he knew or loved died within a two week span. He's lived on his own and survived for the past five years. With the training he was taught by his parents, he has set up a small protected compound in the southern region of the Appalachian Mountains where he lives alone. For a person living alone, danger can come from anywhere and sharing his little slice of Appalachia with resurrected prehistoric creatures isn't going to make it any easier.\n\nThe Rescue (Book 2)\nContinuing the saga that started with &quot;Tomorrow's Past: The Hunt&quot;, someone or something is coming into Marcus' valley. Marcus tracks them and makes a decision that will alter his life forever. Refusing to stand silently by and do nothing, Marcus decides to act and attempts a rescue of the captives. Dodging dinosaurs and cutthroats can make for a tricky situation. Things don't go as planned and Marcus' survival could be in question. Will he make it back to his protected haven?\n\nThe Reunion (Book 3)\nAt the end of 'The Rescue' we were left hanging when we found out that Marcus' sister was in fact, alive. This installment is action packed as he sets off to reunite with his sister and encounters many dangers along the way, including even more dinosaurs and mercenaries. Marcus is determined to rescue his sister and those with her. Will Marcus be reunited with his sister?\n\nThe Raid (Book 4)\nAt the end of 'The Reunion', Marcus and Kim found out that their brother was alive and being held at an enemy base. While planning their rescue mission, they also learn that Haven is being threatened by the Jackals. Facing this difficult decision, they proceed on a path that will ultimately change their lives forever. \n'The Raid' is packed with explosions, raptors, Jackals, and even a little bit of space history. Will Marcus be able to defeat the Jackals and make it to their base to save his brother? Will Marcus and his group ever have peace in their Haven?\n\nShenandoah (Book 5)\nMarcus had gone down in a terrifying helicopter crash on his way back from rescuing his brother while his new friends were watching and listening. Odds are that no one could have survived that crash. In Tomorrow's Past: Shenandoah, the group in Haven are mourning the loss of Marcus and trying to adjust to life without him. Everyone is trying to adjust except for Wynd who refuses to believe he is dead. Determined and defiant, she sets off to the crash site to find out herself. What will Wynd find there?","torrent":{"xt":"urn:btih:e3f7925e6e1d45cafbd92fda34a5be1b59d76274","amp;dn":"Everette+Morgan+-+Tomorrow%27s+Past+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3f7925e6e1d45cafbd92fda34a5be1b59d76274","infoHashBuffer":{"type":"Buffer","data":[227,247,146,94,110,29,69,202,251,217,47,218,52,165,190,27,89,215,98,116]},"announce":[],"urlList":[]}}