{"title":"Chartbusters Karaoke CB90261-CB90270 - KaraokeRG","uid":9526188,"size":1101430367,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e44a2c2d36a1a73ec4ab564e7013a5f20c3f1d5c&amp;dn=Chartbusters+Karaoke+CB90261-CB90270+-+KaraokeRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KaraokeRG","files":-1,"time":1390754723,"description":"\n\nKaraokeRG is a new Release Group dedicated to new,clean karaoke uploads.\nAll our uploaders have been Trusted &amp; Verified for some years.\nBeware of Fake uploaders,check our username first.\nDo not ask to be an uploader,YOU will be asked.\nPlease comment if you enjoy our uploads &amp; please seed back.\n\nPlease click our username for all our uploads\n\n\n\n\nChartbusters Karaoke CB90261 - CB90270\n\n\nRelease Date:Unknown\nPublisher:Chartbusters Karaoke \nUploaded By:KaraokeRG\nFile Size:1.03 Gb\nFormat:MP3/CD+G\nBit Rate:128kbps\nContains:300 Files \nPassword Protection:None\n\n\n\n\nTrack List\n\n\nCB90261-01 - Berry, John - I Think About It All The Time                                            \nCB90261-02 - Berry, John - Your Love Amazes Me                                                      \nCB90261-03 - Berry, John - You And Only You                                                         \nCB90261-04 - Berry, John - Standing On The Edge Of Goodbye                                          \nCB90261-05 - Berry, John - Better Than A Biscuit                                                    \nCB90261-06 - Berry, John - How Much Do You Love Me                                                  \nCB90261-07 - Berry, John - She's Taken A Shine                                                      \nCB90261-08 - Berry, John - Change My Mind                                                           \nCB90261-09 - Berry, John - I Will, If You Will                                                      \nCB90261-10 - Berry, John - Love Is For Giving                                                       \nCB90261-11 - Berry, John - Over My Shoulder                                                         \nCB90261-12 - Berry, John - Power Windows                                                            \nCB90261-13 - Berry, John - The Stone                                                                \nCB90261-14 - Berry, John - What's In It For Me                                                      \nCB90261-15 - Berry, John - Will You Marry Me                                                        \nCB90262-01 - Montgomery, John Michael - Beer And Bones                                              \nCB90262-02 - Montgomery, John Michael - Cool                                                        \nCB90262-03 - Montgomery, John Michael - Goes Good With Beer                                         \nCB90262-04 - Montgomery, John Michael - Letters From Home                                           \nCB90262-05 - Montgomery, John Michael - Four Wheel Drive                                            \nCB90262-06 - Montgomery, John Michael - The Little Girl                                             \nCB90262-07 - Montgomery, John Michael - Hello LOVE                                                  \nCB90262-08 - Montgomery, John Michael - Pictures                                                    \nCB90262-09 - Montgomery, John Michael - Rope The Moon                                               \nCB90262-10 - Montgomery, John Michael - Home To You                                                 \nCB90262-11 - Montgomery, John Michael - Country Thang                                               \nCB90262-12 - Montgomery, John Michael - Til Nothing Comes Between Us                                \nCB90262-13 - Montgomery, John Michael - That's What I Like About You                                \nCB90262-14 - Montgomery, John Michael - You Are                                                     \nCB90262-15 - Montgomery, John Michael - Nothing Catches Jesus By Surprise                           \nCB90263-01 - Ketchum, Hal - Small Town Saturday Night                                               \nCB90263-02 - Ketchum, Hal - I Saw The Light                                                         \nCB90263-03 - Ketchum, Hal - Past The Point OF Rescue                                                \nCB90263-04 - Ketchum, Hal - Five O' Clock World                                                     \nCB90263-05 - Ketchum, Hal - A Girl Like You                                                         \nCB90263-06 - Ketchum, Hal - Hearts Are Gonna Roll                                                   \nCB90263-07 - Ketchum, Hal - Tonight We Just Might Fall In Love Again                                \nCB90263-08 - Ketchum, Hal - I Know Where Love Lives                                                 \nCB90263-09 - Ketchum, Hal - She Is                                                                  \nCB90263-10 - Ketchum, Hal - Someplace Far Away (Careful You're Dreaming)                            \nCB90263-11 - Ketchum, Hal - Don't Let Go                                                            \nCB90263-12 - Ketchum, Hal - Stay Forever                                                            \nCB90263-13 - Ketchum, Hal - That's What I Get For Losin' You                                        \nCB90263-14 - Ketchum, Hal - Every Little Word                                                       \nCB90263-15 - Ketchum, Hal - When Love Looks Back At You                                             \nCB90264-01 - Chesney, Kenny - She Thinks My Tractor's Sexy                                          \nCB90264-02 - Chesney, Kenny - Big Star                                                              \nCB90264-03 - Chesney, Kenny - A Lot Of Things Different                                             \nCB90264-04 - Chesney, Kenny - The Good Stuff                                                        \nCB90264-05 - Chesney, Kenny - No Shoes, No Shirt, No Problems                                       \nCB90264-06 - Chesney, Kenny - Young                                                                 \nCB90264-07 - Chesney, Kenny - What I Need To Do                                                     \nCB90264-08 - Chesney, Kenny - You Had Me From Hello                                                 \nCB90264-09 - Chesney, Kenny - I Go Back                                                             \nCB90264-10 - Chesney, Kenny - When The Sun Goes Down                                                \nCB90264-11 - Chesney, Kenny - Don't Happen Twice                                                    \nCB90264-12 - Chesney, Kenny - The Woman With You                                                    \nCB90264-13 - Chesney, Kenny - I Lost It                                                             \nCB90264-14 - Chesney, Kenny - There Goes My Life                                                    \nCB90264-15 - Chesney, Kenny - When I Think About Leaving                                            \nCB90265-01 - Dolly Parton &amp; Kenny Rogers - Islands In The Stream                                    \nCB90265-02 - Dolly Parton &amp; Kenny Rogers - Love Is Strange                                          \nCB90265-03 - Dottie West &amp; Kenny Rogers - Every Time Two Fools Collide                              \nCB90265-04 - Holly Dunn &amp; Kenny Rogers - Maybe                                                      \nCB90265-05 - Kenny Rogers &amp; Ronnie Milsap - Make No Mistake, She's Mine                             \nCB90265-06 - Whitney Duncan &amp; Kenny Rogers - My World Is Over                                       \nCB90265-07 - Kenny Rogers - Buy Me A Rose                                                           \nCB90265-08 - Kenny Rogers - Handprints On The Wall                                                  \nCB90265-09 - Kenny Rogers - Beautiful (All That You Could Be)                                       \nCB90265-10 - Kenny Rogers - Harder Cards                                                            \nCB90265-11 - Kenny Rogers - He Will, She Knows                                                      \nCB90265-12 - Kenny Rogers - Homeland                                                                \nCB90265-13 - Kenny Rogers - Morning Desire                                                          \nCB90265-14 - Kenny Rogers - Slow Dance More                                                         \nCB90265-15 - Kenny Rogers - There You Go Again                                                      \nCB90266-01 - Womack, Lee Ann - I Hope You Dance                                                     \nCB90266-02 - Womack, Lee Ann - Never Again, Again                                                   \nCB90266-03 - Womack, Lee Ann - I'll Think Of A Reason Later                                         \nCB90266-04 - Womack, Lee Ann - The Fool                                                             \nCB90266-05 - Womack, Lee Ann - Buckaroo                                                             \nCB90266-06 - Womack, Lee Ann - A Little Past Little Rock                                            \nCB90266-07 - Womack, Lee Ann - Ashes By Now                                                         \nCB90266-08 - Womack, Lee Ann - Does My Ring Burn Your Finger                                        \nCB90266-09 - Womack, Lee Ann - Something Worth Leaving Behind                                       \nCB90266-10 - Womack, Lee Ann - Why They Call It Falling                                             \nCB90266-11 - Womack, Lee Ann - Am I The Only Thing You've Done Wrong                                \nCB90266-12 - Womack, Lee Ann - I May Hate Myself In The Morning                                     \nCB90266-13 - Womack, Lee Ann - The Wrong Girl                                                       \nCB90266-14 - Womack, Lee Ann - Some Things I Know                                                   \nCB90266-15 - Womack, Lee Ann - You've Got To Talk To Me                                             \nCB90267-01 - Clark, Terri - Better Things To Do                                                     \nCB90267-02 - Clark, Terri - Poor Poor Pitiful Me                                                    \nCB90267-03 - Clark, Terri - Emotional Girl                                                          \nCB90267-04 - Clark, Terri - You're Easy On The Eyes                                                 \nCB90267-05 - Clark, Terri - When Boy Meets Girl                                                     \nCB90267-06 - Clark, Terri - If I Were You                                                           \nCB90267-07 - Clark, Terri - Everytime I Cry                                                         \nCB90267-08 - Clark, Terri - Just The Same                                                           \nCB90267-09 - Clark, Terri - I Just Wanna Be Mad                                                     \nCB90267-10 - Clark, Terri - Girls Lie To                                                            \nCB90267-11 - Clark, Terri - Now That I Found You                                                    \nCB90267-12 - Clark, Terri - I Think The World Needs A Drink                                         \nCB90267-13 - Clark, Terri - I Wanna Do It All                                                       \nCB90267-14 - Clark, Terri - One Of The Guys                                                         \nCB90267-15 - Clark, Terri - A Little Gasoline                                                       \nCB90268-01 - Twain, Shania &amp; Billy Currington - Party For Two                                       \nCB90268-02 - Twain, Shania - She's Not Just A Pretty Face                                           \nCB90268-03 - Twain, Shania - It Only Hurts When I'm Breathing                                       \nCB90268-04 - Twain, Shania - Up                                                                     \nCB90268-05 - Twain, Shania - I'm Gonna Getcha Good                                                  \nCB90268-06 - Twain, Shania - I Ain't No Quitter                                                     \nCB90268-07 - Twain, Shania - Thank You Baby (For Makin' Someday Come So Soon)                       \nCB90268-08 - Twain, Shania - Nah!                                                                   \nCB90268-09 - Twain, Shania - (Wanna Get To Know You) That Good!                                     \nCB90268-10 - Twain, Shania - I'm Not In The Mood (To Say No)                                        \nCB90268-11 - Twain, Shania - What A Way To Wanna Be!                                                \nCB90268-12 - Twain, Shania - When You Kiss Me                                                       \nCB90268-13 - Twain, Shania - I Ain't Goin' Down                                                     \nCB90268-14 - Twain, Shania - I'm Jealous                                                            \nCB90268-15 - Twain, Shania - Waiter! Bring Me Water!                                                \nCB90269-01 - Keith, Toby - How Do You Like Me Now                                                   \nCB90269-02 - Keith, Toby - I Love This Bar                                                          \nCB90269-03 - Keith, Toby - American Soldier                                                         \nCB90269-04 - Keith, Toby - I Wanna Talk About Me                                                    \nCB90269-05 - Keith, Toby - You Shouldn't Kiss Me Like This                                          \nCB90269-06 - Keith, Toby - Angry American (Courtesy Of The Red, White &amp; Blue)                       \nCB90269-07 - Keith, Toby - Good To Go To Mexico                                                     \nCB90269-08 - Keith, Toby - Honky Tonk U                                                             \nCB90269-09 - Keith, Toby - Stays In Mexico                                                          \nCB90269-10 - Keith, Toby - I'm Just Talkin' About Tonight                                           \nCB90269-11 - Keith, Toby - Who's Your Daddy                                                         \nCB90269-12 - Keith, Toby - My List                                                                  \nCB90269-13 - Keith, Toby - Whiskey Girl                                                             \nCB90269-14 - Keith, Toby - Country Comes To Town                                                    \nCB90269-15 - Keith, Toby - If I Was Jesus                                                           \nCB90270-01 - McGraw, Tim - My Next Thirty Years                                                     \nCB90270-02 - McGraw, Tim - Seventeen                                                                \nCB90270-03 - McGraw, Tim - Please Remember Me                                                       \nCB90270-04 - McGraw, Tim - A Place In The Sun                                                       \nCB90270-05 - McGraw, Tim - Maybe We Should Just Sleep On It                                         \nCB90270-06 - McGraw, Tim - My Best Friend                                                           \nCB90270-07 - McGraw, Tim - Something Like That                                                      \nCB90270-08 - McGraw, Tim - Somebody Must Be Praying For Me                                          \nCB90270-09 - McGraw, Tim - Some Things Never Change                                                 \nCB90270-10 - McGraw, Tim - Forget About Us                                                          \nCB90270-11 - McGraw, Tim - Grown Men Don't Cry                                                      \nCB90270-12 - McGraw, Tim - Let Me Love You                                                          \nCB90270-13 - McGraw, Tim - Angry All The Time                                                       \nCB90270-14 - McGraw, Tim - The Cowboy In Me                                                         \nCB90270-15 - McGraw, Tim - Take Me Away From Here                                                   \n","torrent":{"xt":"urn:btih:e44a2c2d36a1a73ec4ab564e7013a5f20c3f1d5c","amp;dn":"Chartbusters+Karaoke+CB90261-CB90270+-+KaraokeRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e44a2c2d36a1a73ec4ab564e7013a5f20c3f1d5c","infoHashBuffer":{"type":"Buffer","data":[228,74,44,45,54,161,167,62,196,171,86,78,112,19,165,242,12,63,29,92]},"announce":[],"urlList":[]}}