{"title":"Modern Methods for Theoretical Physical Chemistry of Biopolymers","uid":14425003,"size":25296675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e602760a9dd45878c52389a5a02a9186110c813b&amp;dn=Modern+Methods+for+Theoretical+Physical+Chemistry+of+Biopolymers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461558283,"description":"Modern Methods for Theoretical Physical Chemistry of Biopolymers - Evgeni Starikov et al. (Elsevier, 2006).pdf\r\n\r\nISBN 0444522204\r\n\r\nModern Methods for Theoretical Physical Chemistry of Biopolymers provides an interesting selection of contributions from an international team of researchers in theoretical chemistry. This book is extremely useful for tackling the complicated scientific problems connected with biopolymers' physics and chemistry.\r\n\r\nThe applications of both the classical molecular-mechanical and molecular-dynamical methods and the quantum chemical methods needed for bridging the gap to structural and dynamical properties dependent on electron dynamics are explained. Also included are ways to deal with complex problems when all three approaches need to be considered at the same time. The book gives a rich spectrum of applications: from theoretical considerations of how ATP is produced and used as 'energy currency' in the living cell, to the effects of subtle solvent influence on properties of biopolymers and how structural changes in DNA during single-molecule manipulation may be interpreted.\r\n\r\n· Presents modern successes and trends in theoretical physical chemistry/chemical physics of biopolymers\r\n· Topics covered are of relevant importance to rapidly developing areas in science such as nanotechnology and molecular medicine\r\n· Quality selection of contributions from renowned scientists in the field","torrent":{"xt":"urn:btih:e602760a9dd45878c52389a5a02a9186110c813b","amp;dn":"Modern+Methods+for+Theoretical+Physical+Chemistry+of+Biopolymers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e602760a9dd45878c52389a5a02a9186110c813b","infoHashBuffer":{"type":"Buffer","data":[230,2,118,10,157,212,88,120,197,35,137,165,160,42,145,134,17,12,129,59]},"announce":[],"urlList":[]}}