{"title":"The Life of Buddha (BBC Documentary) for iPhone &amp; iPod Touch","uid":4712362,"size":609645952,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e743eec44ad1b1d1c5f62184cbf6146a8ef53d03&amp;dn=The+Life+of+Buddha+%28BBC+Documentary%29+for+iPhone+%26+iPod+Touch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moonface","files":2,"time":1234090035,"description":"Five hundred years before Christ a young prince left his palace and set out on a journey though Northern India. his experiences became a philosophy that is now followed by over 400 million people. Six years after leaving home, the Buddha arrived at Bodh Gaya where he sat beneath a magnificent tree, vowing not to move until he had reached Enlightenment. He then formulated his philosophy based upon Four Noble Truths. Today, a descendant of the same tree stands upon the same site. A temple now stands next to it and Bodh Gaya has become the most sacred and important landmark along the Buddhist pilgrimage route. For here, the Buddha set out to teach for forty years.\n\nThe Buddha lived in India two and a half thousands years ago, and the events of his life make up one fo the greatest stories ever told. Using CGI graphics, expert testimony and the latest archaeological findings, this film dramatises his extraordinary life, from the luxuries of the palace where he was waited on hand and foot, to his dramatic escape from home when he set out to experiece real life for the first time. The film also reconstructs the spiritual practises he tried and rejected.\n\nUntil about one hundred years ago the secrets of the Buddha lay hidden in the dense jungles of India. But in the 1800s Western archaeologists and explorers stumbled upon the small village of Lumbini in Nepal where they discovered the birthplace of the Buddha, enabling them to unlock the secrets of his life.\n\ndharmicjourney.blogspot.com","torrent":{"xt":"urn:btih:e743eec44ad1b1d1c5f62184cbf6146a8ef53d03","amp;dn":"The+Life+of+Buddha+%28BBC+Documentary%29+for+iPhone+%26+iPod+Touch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e743eec44ad1b1d1c5f62184cbf6146a8ef53d03","infoHashBuffer":{"type":"Buffer","data":[231,67,238,196,74,209,177,209,197,246,33,132,203,246,20,106,142,245,61,3]},"announce":[],"urlList":[]}}