{"title":"Achievements in Anonymity (gnv64)","uid":7933100,"size":11968695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e758b3fc5d3643cc036f9ae172aa546bc40f14e5&amp;dn=Achievements+in+Anonymity+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1355765916,"description":"Achievements in Anonymity - Unsung Indian Scientists: A collection of biographical articles \nedited by Kollegala Sharma and Bal Phondke\nNational Institute of Science Communication | May 1997 | ISBN: 81-7236-089-4 | PDF | 126 pages | 11.4 mb\nscanned to PDF by me.\n\nPUSHING back the frontiers of science is not a recent phenomenon in India as is unfortunately believed. Even in the yesteryears, before the generous support to the pursuit of science became a governmental and societal priority, a number of Indian intellectual giants made outstanding contributions to mankind's knowledgebase. Some of them were accorded due recognition, even coveted laurels. Thus, Raman, Bose, Saha, Bhabha, Bhatnagar became household names. However, for every such luminary there have been ten other silent workers, toiling in the shadows, unmindful of any acclaim. Achievers in their own right, these men and women went about quietly laying the foundation for the huge edifice that Indian science today is. With encomiums lacking, encouragement rare and with only enthusiasm to spare, they practised and propagated science far and wide. Unsung in life, unremembered in death, they left behind a legacy that has helped advance the frontiers of science. This collection of their lives and times is a belated tribute to the forgotten Indian scientists.","torrent":{"xt":"urn:btih:e758b3fc5d3643cc036f9ae172aa546bc40f14e5","amp;dn":"Achievements+in+Anonymity+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e758b3fc5d3643cc036f9ae172aa546bc40f14e5","infoHashBuffer":{"type":"Buffer","data":[231,88,179,252,93,54,67,204,3,111,154,225,114,170,84,107,196,15,20,229]},"announce":[],"urlList":[]}}