{"title":"Jeronimo - Jeronimo (1971/1997) [FLAC]","uid":6494129,"size":365795122,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8ad12b096e3b0dd01e9f322f31e02888ddf8c5e&amp;dn=Jeronimo+-+Jeronimo+%281971%2F1997%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":20,"time":1309000911,"description":"\nBand: Jeronimo\nAlbum: Jeronimo\nYear:1971/1997\nGenre: Heavy/Hard Rock\nCountry: Germany\n\n\nJeronimo was a straight hard rock group that even enjoyed a bit of chart success in their time with &quot;Heya&quot; coupled with &quot;So Nice To Know&quot;, their 1969 debut single for Admiral (AD 1105),&quot;Na-na-hey-hey&quot; coupled with &quot;The Light Life Needs&quot; (AD 1110, 1969) and &quot;Never Coin' Back &quot;coupled with &quot;The Key&quot; (AD 1133, 1970).\n\nBy then they had already been together since the mid-sixties (?). Among the members from 1967 to 1968 were Walter Ortel, co-founder of Epsilon in 1970 with Michael Winzkowski and Michael Ertl.\nJeronimo's first appearance on album was on the strange split LP with Creedence Clearwater Revival: Spiritus Orgaszmus, with an &quot;orgasmcover&quot;, poster and pink vinyl (Bellaphon BI 1527).\nAll six Jeronimo songs were featured on their subsequent album for Bellaphon: Cosmic Blues.\nThis was hardly cosmic blues, but a confusing collection of their three first singles and six other tracks that presumably were recorded as potential singles in 1969, presenting soul-beat pop, rock'n'roll, pop, folk-rock and vintage hardrock.\nAt the time of release, Hajo Born had quit. The trio of Marz, Schafer and Funk were pictured on the cover, which contained very little information.\nSoon after, also Rainer Marz quit,to be replaced by Michael Koch. The trio of Schafer, Koch and Funk went on to record what since has become one of the most hunted German albums among collectors: the self-titled Jeronimo with the &quot;Indian cover&quot;, in many respects their first album.\nThey had now developed a common direction - heavy guitar-based boogie blues and rock'n'roll, much like a cross between Creedence Clearwater Revival and Groundhogs at their best!\nIn 1970 Jeronimo and &quot;Steppenwolf&quot; toured successfully through Germany and in the same year Jeronimo partook in the legendary &quot;Progressive Pop Festival&quot; in Cologne. Following that, Jeronimo shared the headlines with such groups as &quot;Deep Purple&quot; and &quot;Golden Earring&quot; at various European open-air festivals.\nThis was by far Jeronimo's best album, presenting much vitality and hard rock dexterity in straight-forward songs like &quot;Understanding&quot;, &quot;Shades&quot; (A &amp; B sides of a single lifted from the album) and &quot;Sunday Child&quot;. However, the long drums solo on &quot;Hagudila&quot; was, as is so often the case, superfluous!\nFor some unknown reason, only a small number of copies were pressed. Still stranger the album never has been re-released, as their two other albums have, several times! It's open to question if the album is worth the 500 DEM dealers are now claiming for an original copy.\nFor Time Ride (1972), Jeronimo came under the guiding hands of Peter Hauke and his Bacillus label.\nThis was also a good album, but some of the enthusiasm of the previous album seemed to have been lost. It was a half-successful attempt to perform more &quot;progressive&quot; hard rock. When Jeronimo broke up, Ringo Funk became the drummer of Atlantis.\nAfter numerous negotiations with &quot;the purple record-company&quot; in Frankfurt, Ringo Funk successfully acquired the rights to all of Jeronimo's songs in November of 2000.\nIn the spring of 2002, 4 new CD's &quot;Jeronimo&quot;, &quot;Cosmic Blues&quot;, &quot;Time Ride&quot; and &quot;Best of&quot; will be released, which have been digitally mastered from the original recordings. There will be a bonus track on each of the CD's (partially with previously unreleased material).\n\nTrack list:\n\n01.Sunday's Child (4:19)\n02. Shades (3:20)\n03. Reminiscensis (1:00)\n04. How I'd Love To Be Home (4:30)\n05. End Of Our Time (4:05)\n06. Understanding (4:02)\n07. Silence Of The Night (3:33)\n08. Hagudila (7:43)\n09. You Know I Do (5:24)\n10. Child Of Feelin' (3:30)\nBonus track:\n11. Save Our Souls, SOS (3:10)\n\nJeronimo\n*Manfred &quot;Ringo&quot; Funk - drums, percussion, vocals\n*Michael Koch - guitar, keyboards, vocals\n*Gunnar SchÃƒÂ¤fer - bass, guitar, vocals \n\n","torrent":{"xt":"urn:btih:e8ad12b096e3b0dd01e9f322f31e02888ddf8c5e","amp;dn":"Jeronimo+-+Jeronimo+%281971%2F1997%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ad12b096e3b0dd01e9f322f31e02888ddf8c5e","infoHashBuffer":{"type":"Buffer","data":[232,173,18,176,150,227,176,221,1,233,243,34,243,30,2,136,141,223,140,94]},"announce":[],"urlList":[]}}