{"title":"Marie Fredriksson - The Change 2004","uid":6578862,"size":332555040,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8ea74a7bac223f63e85abbfe68884a231a4233a&amp;dn=Marie+Fredriksson+-+The+Change+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1312323871,"description":"On September 11 2002, Marie fell in her bathroom in her villa in Djursholm hitting her head and she had to be taken to the Karolinska hospital in Stockholm. First she was diagnosed with a severe concussion but a couple of days later it was announced that Marie had a small brain tumour in the back of her head. The tumour was removed in the end of September and she started a long period of treatments. Roxette had to appear in the Night of the Proms tour sponsored by Nokia but due to the operation the tour had to be cancelled.\n\nAfter two years of treatment Marie released a brand new album in October 2004: The Change. The recordings started a year before Marie was diagnosed with cancer and went on afterwards when Marie felt strong enough for it. This was Maries first album in English and to be released internationally. A documentary, En andra chans, with images from the recordings, home in Djursholm and Marie performing some of the songs included in The Change was broadcast on the Swedish TV channel TV4 by the end of November and in other countries some months later.\n\nIn May 2005 Marie released a third single off The Change: A Table in the Sun. Later in October Marie announced that she has won the fight against cancer, and exhibited her artwork in Doktor Glas gallery, Stockholm, under the title After The Change. Together with the exhibition a book with the same title was published. The book features the 24 drawings that were shown in the exhibition, as well as some pictures of Marie drawing. In December Marie also signed the book in NK department store in Stockholm. (mariefredriksson.net)\n\n- - -\n\nMarie Fredriksson - The Change 2004\n(Solna EMA/Mary Jane)\n\n 1. The change  \n 2. 2:nd chance \n 3. All you've gotta do is feel \n 4. April snow \n 5. Love 2 live  \n 6. Mother \n 7. Many times \n 8. All about you \n 9. The good life \n10. Bad moon \n11. A table in the sun \n12. The change - orchestra\n","torrent":{"xt":"urn:btih:e8ea74a7bac223f63e85abbfe68884a231a4233a","amp;dn":"Marie+Fredriksson+-+The+Change+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ea74a7bac223f63e85abbfe68884a231a4233a","infoHashBuffer":{"type":"Buffer","data":[232,234,116,167,186,194,35,246,62,133,171,191,230,136,132,162,49,164,35,58]},"announce":[],"urlList":[]}}