{"title":"Diveick","uid":8887985,"size":849676223,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e8f2212c32167bc0a7832ebb6dd25b6ff7dff06f&amp;dn=Diveick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1378509847,"description":"Divekick is a comedic parody of fighting game motifs and contains many humorous references to games (especially those in the Street Fighter franchise) as well as inside jokes from within the competitive fighting game community. Unlike most fighting games which are played using many buttons for many different kinds of movement and attacks, Divekick is played using only two buttons, Dive and Kick. Pressing Dive causes your character to perform a vertical jump, with each character having different jump height. After Diving, the player can do a Kick. Pressing Kick while standing performs a backward evasive hop for most characters (called a &quot;kickback&quot;). Using these moves is the only way to move, evade, attack, and dodge. Each character also possesses two unique special moves, activated by pressing both buttons at once; one used on the ground, and one used in the air. The game features a health bar for each player, but it is only there for humorous and stylistic purposes, as you lose the round after being hit only once (though the game will randomly give out Perfects, even on a Double KO). The game features a single-player story mode, local competitive play, and online multiplayer that utilizes GGPO","torrent":{"xt":"urn:btih:e8f2212c32167bc0a7832ebb6dd25b6ff7dff06f","amp;dn":"Diveick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f2212c32167bc0a7832ebb6dd25b6ff7dff06f","infoHashBuffer":{"type":"Buffer","data":[232,242,33,44,50,22,123,192,167,131,46,187,109,210,91,111,247,223,240,111]},"announce":[],"urlList":[]}}