{"title":"Guo Yue &amp; Joji Hirota - Red ribbon","uid":7796915,"size":44665158,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e970ab398bb24f1335e33df891a46bc0e10df137&amp;dn=Guo+Yue+%26amp%3B+Joji+Hirota+-+Red+ribbon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Christian93","files":9,"time":1352170602,"description":"\n\nGuo Yue is Chinese and plays the flute. He was one half of the Guo Brothers and worked with musicians like Peter Gabriel and the Chieftans. Joji Hirota is Japanese and plays percussion -- drums, chimes, cymbals, and so forth. He has several albums to his credit, and he has worked with various Western dance and theater companies. After collaborating together with Clannad's Paul Brennan in the new age/Celtic group Trisan, the two decided to pair off and create a simpler, purer sound.\n\nThe major dynamic on the album is one of contrast: the delicacy of Guo's flute against the power of Hirota's percussion. Not that the flutework is all porcelain and glass. Guo is capable of pushing his pitch into the stratosphere, as he does on &quot;Red Ribbon.&quot; With its busy percussion, the song seems to be a stylized representation of Chinese New Year. &quot;Goodbye Again&quot; is a tour de force in which Guo, accompanied either by himself via overdubbing or by an uncredited Hirota, creates a complex and fascinating harmony. Hirota only enters later, but when he does he builds to a percussive frenzy, echoing and amplifying the line of the flute. Each musician also has one solo track where they strut their stuff.\n\nRed Ribbon may be too mild for some ears, but to listeners attuned to music of east Asia, it will sound as powerful as a chrysanthemum. \n\n\n\n &lt;a href=&quot;\nhttp://realworldrecords.com/artist/1262/guo-yue/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://realworldrecords.com/artist/1262/guo-yue/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e970ab398bb24f1335e33df891a46bc0e10df137","amp;dn":"Guo+Yue+%26amp%3B+Joji+Hirota+-+Red+ribbon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e970ab398bb24f1335e33df891a46bc0e10df137","infoHashBuffer":{"type":"Buffer","data":[233,112,171,57,139,178,79,19,53,227,61,248,145,164,107,192,225,13,241,55]},"announce":[],"urlList":[]}}