{"title":"Darrin's Dance Grooves - (2002) DVDRip","uid":5489074,"size":524165120,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e9b8ac1eb1e95d621b4bbad63ff9b4183cd6444e&amp;dn=Darrin%5C%27s+Dance+Grooves+-+%282002%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MyUHS","files":-1,"time":1270892830,"description":"Want to learn how to dance like Britney and N'Sync? Then pick up Darrin's Dance Grooves. Darrin is a dynamic young dancer, choreographer and star of Showtime's Soul Food TV series. Darrin Henson has choreographed videos for Jennifer Lopez, Britney Spears, N'Sync and Christina Aguilera, and has won several MTV Video Music Awards. Now you can learn the exact same dance moves you see in your favorite videos on MTV. This video features Darrin with a select group of professional dancers. You'll learn to dance like your favorite stars in their videos, step-by-step! If you want to get your groove on like Britney and Justin, then you'll love this video. It's guaranteed to get you moving!\n\nLearn the moves of your favorite pop stars with Darrin's Dance Grooves! Celebrity choreographer Darrin Henson has created dance moves for the most popular videos on MTV and worked with everyone from Britney Spears and *NSYNC to Christina Aguilera and Jordan Knight.\n\nDarrin's Dance Grooves breaks it down so you can learn the steps to the hottest dances at your own pace. Get ready to hit the dance floor and impress your friends!\n\n==--==--==--==--==--==--==--==--==--==--==--==--==--==--==--==--==\n\nPLEASE SEED AFTER YOU DOWNLOAD OR THIS TORRENT WILL DIE! \nWhile you're downloading, think about how it feels and think about how future downloaders will feel.","torrent":{"xt":"urn:btih:e9b8ac1eb1e95d621b4bbad63ff9b4183cd6444e","amp;dn":"Darrin%5C%27s+Dance+Grooves+-+%282002%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b8ac1eb1e95d621b4bbad63ff9b4183cd6444e","infoHashBuffer":{"type":"Buffer","data":[233,184,172,30,177,233,93,98,27,75,186,214,63,249,180,24,60,214,68,78]},"announce":[],"urlList":[]}}