{"title":"Johnnie Temple - Complete Works Vol.1-3 (1935-49) [3CD-Document]","uid":7384500,"size":186543618,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ea6a4ee52e34e8c9b17582d0ed9c2213471fb35e&amp;dn=Johnnie+Temple+-+Complete+Works+Vol.1-3+%281935-49%29+%5B3CD-Document%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":71,"time":1340590177,"description":"Johnnie Temple - Complete Recorded Works in Chronological Order, 1935-1949 [Document] (3CDvbr)\n\nJohnnie Temple is one of the great unsung heroes of the blues. A contemporary of Skip James, Son House, and other Delta legends, Temple was one of the very first to develop the now-standard bottom-string boogie bass figure, generally credited to Robert Johnson.\n\nBorn and raised in Mississippi, Temple learned to play guitar and mandolin as a child. By the time he was a teenager, he was playing house parties and various other local events. Temple moved to Chicago in the early '30s, where he quickly became part of the town's blues scene. Often, he performed with Charlie and Joe McCoy. In 1935, Temple began his recording, releasing &quot;Louise Louise Blues&quot; the following year on Decca Records.\n\nAlthough he never achieved stardom, Temple's records -- which were released on a variety of record labels -- sold consistently throughout the late '30s and '40s. In the '50s, his recording career stopped, but he continued to perform, frequently with Big Walter Horton and Billy Boy Arnold. Once electrified post-war blues overtook acoustic blues in the mid-'50s, Temple left Chicago and moved to Mississippi. After he returned to his homestate, he played clubs and juke joints around the Jackson area for a few years before he disappeared from the scene. Johnny Temple died in 1968. (Cub Koda)","torrent":{"xt":"urn:btih:ea6a4ee52e34e8c9b17582d0ed9c2213471fb35e","amp;dn":"Johnnie+Temple+-+Complete+Works+Vol.1-3+%281935-49%29+%5B3CD-Document%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea6a4ee52e34e8c9b17582d0ed9c2213471fb35e","infoHashBuffer":{"type":"Buffer","data":[234,106,78,229,46,52,232,201,177,117,130,208,237,156,34,19,71,31,179,94]},"announce":[],"urlList":[]}}