{"title":"Coated Textiles - Principles and Applications 2nd ed","uid":14691760,"size":15198388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea71550326dca0d26a20baf29bced5eb59ea2b26&amp;dn=Coated+Textiles+-+Principles+and+Applications+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464208456,"description":"Coated Textiles - Principles and Applications 2nd ed - A. K. Sen (CRC, 2008).pdf\r\n\r\nISBN 978‑1‑4200‑5345‑6\r\n\r\nInitially written to pull together scattered literature in polymer science and textile technology, the first edition of Coated Textiles: Principles and Applications became a gold standard resource in this field. Completely revised and updated, this second edition reflects not only the latest developments in the field, but also explores future possibilities. The book covers the materials used in coatings and their chemistry, textile substrates, coating methods, properties of fabrics after coating, rheology of coating, applications of coated fabrics, and test methods in chronological order.\r\n\r\nNew topics in the Second Edition:\r\n\r\n· Coating with stimuli-sensitive polymers and intelligent textiles\r\n\r\n· Nanomaterial coating to produce soil-resistant fabrics\r\n\r\n· Breathable coating for health care garments\r\n\r\n· Adhesives and foam for laminates\r\n\r\n· Research trends such as temperature-adaptable fabrics, silicone coating for airbag fabrics, healthcare garments, intumescent coating, coating materials, and coating methods\r\n\r\nThe author provides a detailed discussion that includes diverse applications of coated fabrics, rheology, smart coating, physical properties of coated fabrics, as well as the underlying principles of test methods. The book includes applications and explores coating with functional materials such as dyes, fragrances, phase change materials, smart polymers and nanomaterials for special applications.\r\n\r\nWith applications in defense, transportation, healthcare, architecture, space, sports, environmental pollution control, and other diverse end-product uses, coated textiles is a multibillion dollar industry. Following in the footsteps of its bestselling predecessor, the second edition compiles information from various sources into one convenient, easily accessible resource","torrent":{"xt":"urn:btih:ea71550326dca0d26a20baf29bced5eb59ea2b26","amp;dn":"Coated+Textiles+-+Principles+and+Applications+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea71550326dca0d26a20baf29bced5eb59ea2b26","infoHashBuffer":{"type":"Buffer","data":[234,113,85,3,38,220,160,210,106,32,186,242,155,206,213,235,89,234,43,38]},"announce":[],"urlList":[]}}