{"title":"Reggie and the Full Effect - Under the Tray (2003) [FLAC]","uid":8252330,"size":273168977,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eceded0116b2adb19c08a556ced726a3873f53c3&amp;dn=Reggie+and+the+Full+Effect+-+Under+the+Tray+%282003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363186323,"description":"James DeWees' second album as Reggie and the Full Effect eclipses the Get Up Kids' record that immediately preceded it because DeWees has the freedom, with his alter ego, to write whatever he wants. He's not constricted by a famous back catalog to live up to or react against. Under the Tray is infectious, from the new wave grind of &quot;Congratulations Smack &amp; Katy,&quot; to the slick, '80s, electro-pop sheen of &quot;MOOD 4 LUV,&quot; and the Weezer-metal assault of &quot;What Won't Kill You Eats Gas.&quot; It's tongue-in-cheek, and it's silly (down to the hilarious &quot;Drunk Girl At Get Up Kids Show&quot; field recordings), but it's also intelligent, melodic, eclectic, and actually, startlingly sincere. In the end, DeWees is a master of genres, mixing humor and atmosphere into a complex paradox of jokes and serious emotion -- how often do you get that in pop music? Just check the meandering, dark vibe of &quot;Image Is Nothing, Lobsters Are Everything&quot; and how it contrasts the cheeky keyboard death metal tune that follows, &quot;Apocalypse WOW!.&quot; More artists should throw caution to the wind and challenge the idea that a record somehow has to adhere to one consistent mood or genre.","torrent":{"xt":"urn:btih:eceded0116b2adb19c08a556ced726a3873f53c3","amp;dn":"Reggie+and+the+Full+Effect+-+Under+the+Tray+%282003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eceded0116b2adb19c08a556ced726a3873f53c3","infoHashBuffer":{"type":"Buffer","data":[236,237,237,1,22,178,173,177,156,8,165,86,206,215,38,163,135,63,83,195]},"announce":[],"urlList":[]}}