{"title":"Alice In Chains - Greatest Hits @(320)","uid":6482093,"size":149044777,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:edec7cfe857b04bb0c59e9b745be88e747235280&amp;dn=Alice+In+Chains+-+Greatest+Hits+%40%28320%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gc1966","files":19,"time":1308566185,"description":"---------------------------------------------------------------------\n                 Alice In Chains - Greatest Hits\n---------------------------------------------------------------------\n\nArtist...............: Alice In Chains \nAlbum................: Greatest Hits\nGenre................: Cd Retail\nSource...............: CD\nYear.................: 2001\nRipper...............: Audiograbber 1.82 (build 2)\nCodec................: LAME\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 48100 hz\nTags.................: ID3 v1.1, ID3 v2.3\nInformation..........: http://www.aliceinchains.com/\n\nRipped by............: SmurfCo on 06/11/2011\nPosted by............: gc1966 on 06/11/2011\nNews Server..........: biggulp.readfreenews.net\nNews Group(s)........: alt.binaries.sounds.mp3.full_albums\n\nIncluded.............: NFO, xsfv, PLS, M3U\nCovers...............: Front Back CD Inlay Inside\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Alice In Chains - Man In The Box\n   2. Alice In Chains - Them Bones\n   3. Alice In Chains - Rooster\n   4. Alice In Chains - Angry Chair\n   5. Alice In Chains - Would \n   6. Alice In Chains - No Excuses\n   7. Alice In Chains - I Stay Away \n   8. Alice In Chains - Grind\n   9. Alice In Chains - Heaven Beside You\n  10. Alice In Chains - Again\n\nPlaying Time.........: 00:44:43\nTotal Size...........: 127.34 MB\n\nNFO generated on.....: 06/11/2011 1:02:25 PM\n\n\n---------------------------------------------------------------------\nLayne Staley (1967-2002)\nOnly The Good Die Young\nSince their formation in the mid to late 1980s, Alice In Chains has slowly been carving their place into metal. From their angrier works of Facelift to the beauty of Jar Of Flies to the heavy riffs of their self titled album, the band has survived the trends and this album, Greatest Hits, is only a small testament to what the band has accomplished in the last 15 years or so.\n\nLayne Staley (R.I.P.) takes lead vocals on most of the 10 songs, singing in his distinct style that a great deal of singers today have tried to imitate and make their own. Staley has the perfect voice for this band, going from wailing to a near growl. Harmonizing on vocals with Staley is Jerry Cantrell, who plays deep, dark, sludgy riffs and occasionally pulling off an incredible solo. The band's drum work has always been something interesting. Sean Kinney plays beats so perfect and so complimentary to the guitar, it's astounding. On the earlier songs, the bass is played by Mike Starr, whose low-end playing adds to the anger of the music. On the later releases, Mike Inez is present and he is a powerhouse when it comes to bass. He plays magnificently and adds a great touch to the songs.\n\nRight from the start, this album hits hard with their first hit, Man In The Box. With its memorable guitar work and powerful vocals, this song has earned its proper place on this compilation. From their fan-proclaimed masterpiece Dirt comes Them Bones, Rooster, Angry Chair and Would?. Them Bones is a hard rocker with some loud, crunchy guitar and harmonic vocals. Rooster is a classic song in itself. Each instrument is played amazingly well and Layne Staley soars during the choruses. Angry Chair is another amazing song. The song ranges from being deep and hard to melodic and heavy. The guitar work is thick but the drumming is a standout here, with a strong and consistent beat backing the darkness of the song. Would? is a very strong song with excellent instrumentation but the lyrics stand out. Much like the rest of the song on Dirt, the lyrics are filled with personal references, mainly on the usage of drugs, and this song is no exception. From Jar Of Flies comes No Excuses and I Stay Away. No Excuses is an excellent song with some nice acoustic guitar work and excellent drumming. I Stay Away is another acoustic song but it strays toward the darker elements of Facelift and Dirt. Layne Staley sings the vocals with overwhelming anger and agony with an orchestration of strings to back up the guitar, bass and drums. This song is one of the most powerful song on the Jar Of Flies album. The final songs on the album, Grind, Heaven Beside You and Again, come from their self-titled album. Grind is a dark, sludgy tune with some deep guitar and pounding rhythm as well as some harmonious vocals on the choruses. Heaven Beside You is an absolutely amazing song. The guitar is perfect, the rhythm is powerful and Jerry Cantrell, who assumes most vocals here, croons the lyrics amazingly. Again is the final song on this compilation and is much like Grind except a bit faster and not as dark.\n\nAlice In Chains have been a force to reckon with ever since they recorded and release their debut album. They have defied all trends and stuck to what they do best and their music has evolved over time. Unfortunately, we will never hear of the band entering the studio to record their follow-up. R.I.P. Layne Staley. This compilation is a nice deal maybe for beginners but the hardcore fans of AIC may want more. So, if you are just getting to the band, check this out but you long timers, stay away or you'll hurt yourself getting mad at buying this. \n\n \n  \n---------------------------------------------------------------------\n\n\n","torrent":{"xt":"urn:btih:edec7cfe857b04bb0c59e9b745be88e747235280","amp;dn":"Alice+In+Chains+-+Greatest+Hits+%40%28320%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edec7cfe857b04bb0c59e9b745be88e747235280","infoHashBuffer":{"type":"Buffer","data":[237,236,124,254,133,123,4,187,12,89,233,183,69,190,136,231,71,35,82,128]},"announce":[],"urlList":[]}}