{"title":"The Mamas and The Papas - California Dreamin 2Lions-Team","uid":5847981,"size":1945805843,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ee3342ceb15ccf867688ed0aacd78755e0ce9482&amp;dn=The+Mamas+and+The+Papas+-+California+Dreamin+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1285270974,"description":"The Mamas &amp; The Papas - California Dreamin       \n\n \n  Met &quot;California Dreamin' - The Songs of The Mamas &amp; The Papas&quot; blikken we terug op 40 jaar The Mamas &amp; The Papas vanaf hun eerste album uit 1965 &quot;California Dreamin' &quot;. Op deze DVD staan naast de complete uitvoeringen van o.a.de 'Classic' hits: &quot;Monday, Monday&quot;, &quot;Dedicated To The One I Love&quot;, &quot;Creeque Alley&quot;, &quot;Words Of Love&quot;, &quot;I Saw Her Again&quot;, &quot;Dream A Little Dream Of Me&quot;, &quot;Twelve Thirty&quot; en &quot;Dancing In The Streets&quot; nieuwe en nog nooit eerder uitgebrachte interviews met Michelle Phillips, Denny Doherty en John Philips.\nInterviews met producer Lou Adler en muziekanten John Sebastian, Barry McGuire en Chynna Philips. Tevens als extras : zeldzame home movies, een optreden tijdens het historische Monterey Pop Festival en de video's van : &quot;Glad To Be Unhappy&quot;, &quot;Here In My Arms&quot; en &quot;Make Your Own Kind Of Music&quot; (Mama Cass).\nOndanks het overlijden van &quot;Mama&quot; Cass Elliot in 1974 en John Phillips in 2002 leeft de muziek van The Mama's &amp; The Papas als nooit tevoren.\n\n\nAmazon.com\nCalifornia Dreamin' reminds us that '60s pop paragons The Mamas &amp; The Papas had an appealing new sound, made some terrific records, and left behind a legacy that lives on more than 35 years after they called it quits. This hour-long documentary, originally aired on PBS, has all the standard elements of the genre: interviews (including some from 2004 and '05 with surviving members Michelle Phillips and Denny Doherty, as well as 1986 recollections by John Phillips, who died in '01, and a few brief words from Cass Elliot, who passed away in '74), photos, home movies, and a generous helping of music clips. The latter come from both television (Shindig!, Hollywood Palace, The Ed Sullivan Show) and concerts (Monterey Pop); some are totally lip-synced, some find the group singing to a pre-recorded track, and some are completely live. Almost all of the clips manage to convey the magic of a quartet that had a unique charm, both visually (the beautiful blonde Michelle, the corpulent Mama Cass) and musically (Doherty had perhaps the best singing voice, while John Phillips' songs and vocal arrangements were nearly the equal of, say, Brian Wilson's); and all highlight their remarkable vocal blend, described by Lou Adler, their producer and label owner, as the sound of the Four Freshmen or the Hi-Lo's updated with a rock beat. The hits keep on coming, not only the familiar &quot;California Dreamin'&quot; and &quot;Monday, Monday&quot; but also &quot;Creeque Alley,&quot; &quot;Words of Love,&quot; their covers of the Beatles' &quot;I Call Your Name&quot; and the Shirelles' &quot;Dedicated to the One I Love,&quot; and at least a dozen more, including three bonus tunes not part of the original broadcast. All in all, this has to be the definitive Mamas &amp; Papas video collection. --Sam Graham \n\n\n1) Opening\n2) Beginnings\n3) I Call Your Name\n4) Dancing In The Street\n5) Do You Belive In Magic\n6) Somebode Groove\n7) Words Of Love\n8) Creeque Alley\n9) Twelve-Thirty\n10) I Saw Her Again\n11) Dancing Bear\n12) Once Was A Time I Thought\n13) Dedicated To The One I Love\n14) Monday Monday\n15) Straight Shooter\n16) My Heart Stood Still\n17) Dream A Little Dream On Me\n18) California Dreamin'\n19) Credits\n\n\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nGeluid: 2.0 stereo\n\ncover en label ja\n \nOndertitels : Geen\n \nGenre : Muziek\n \nWeblink :\n\n******************************************\n\nBrought to you by \n\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                           &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\n\n\nPlease check our site !!!\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt; \n \n \n \n","torrent":{"xt":"urn:btih:ee3342ceb15ccf867688ed0aacd78755e0ce9482","amp;dn":"The+Mamas+and+The+Papas+-+California+Dreamin+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee3342ceb15ccf867688ed0aacd78755e0ce9482","infoHashBuffer":{"type":"Buffer","data":[238,51,66,206,177,92,207,134,118,136,237,10,172,215,135,85,224,206,148,130]},"announce":[],"urlList":[]}}