{"title":"21 Jump Street - Season 1 - Disc 2 - DVDRip - NTSC","uid":8191406,"size":6863169536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ee70b11f2df6ebe53e3aed1069bc7796e571f539&amp;dn=21+Jump+Street+-+Season+1+-+Disc+2+-+DVDRip+-+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EvilUploader","files":-1,"time":1361831446,"description":"Synopsis of 21 Jump Street: Season 01\nThe first action-adventure series from the Fox network, 21 Jump Street inaugurates its first season with the series' two-hour pilot episode, in which young police officer Tom Hanson (Jeff Yagher) joins a special undercover unit of the LAPD. Named for its headquarters, an abandoned chapel, the Jump Street unit is comprised of youthful cops who can pose as teenagers, making it easier for them to bust criminals and drug dealers who prey upon high-school kids. After the initial pilot, Jeff Yagher was replaced, and the role of Tom Hanson went to Johnny Depp, an assignment that would make him a star. Hanson's fellow officers during season one include Doug Penhall (Peter DeLuise), who in the earlier episodes projects a more roly-poly, comic image than he would in future years; Vietnamese refugee Harry Truman Ioki (Dustin Nguyen); and African-American Judy Hoffs (Holly Robinson). For the first six episodes, the team takes its orders from Captain Richard Jenko (Frederic Forrest), an ex-hippie who is more or less simpatico with their youthful zeal and tendency to bend the rules. But when Jenko is killed by a drunk driver, he is replaced by a more traditional, by-the-book leader, Captain Adam Fuller (Steven Williams). The series' first batch of 13 hour-long episode features a number of soon-to-be stars in guest roles, among them Josh Brolin, David Paymer, and Jason Priestley. 21 Jump Street managed to hold its own against the formidable competition of CBS' 60 Minutes during the series' maiden season, rapidly establishing Fox as the favorite network of teens and young adults. ~ Rovi\n\n\nTheatrical Feature Running Time: 585 mins \nComplete Cast of 21 Jump Street: Season 01\nJohnny Depp - Off. Tom Hanson\nHolly Robinson - Off. Judy Hoffs\nFrederic Forrest - Capt. Richard Jenko\nPeter DeLuise - Off. Doug Penhall\nDustin Nguyen - Off. Harry Truman Ioki (Vinh Van Tran)\nSteven Williams - Capt. Adam Fuller\n\n\nCategories:Television\n\nFormat: DVD  \nRelease Date: 10/26/2004\nTV Rating: NR\nRunning Time: 585 min\nNumber of Discs: 4 (Disc 1 of 4)\nLanguage: Eng\n  Closed Caption \nView special edition features View special edition featuresLimited Edition Features:\ncc\nBrand-new interviews with show co-creator and stars: Stephen J. Cannell, Holly Robinson Peete, Dustin Nguyen, and Steven Williams\nAudio commentary with star Peter DeLuise\nEight-page booklet with liner notes &amp; color photos\t","torrent":{"xt":"urn:btih:ee70b11f2df6ebe53e3aed1069bc7796e571f539","amp;dn":"21+Jump+Street+-+Season+1+-+Disc+2+-+DVDRip+-+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee70b11f2df6ebe53e3aed1069bc7796e571f539","infoHashBuffer":{"type":"Buffer","data":[238,112,177,31,45,246,235,229,62,58,237,16,105,188,119,150,229,113,245,57]},"announce":[],"urlList":[]}}