{"title":"Auschwitz Lies: Legends, Lies, and Prejudices on the Holocaust","uid":11717554,"size":15067065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eff489b144a1e3e2f5fc9c821282c95fca85b15c&amp;dn=Auschwitz+Lies%3A+Legends%2C+Lies%2C+and+Prejudices+on+the+Holocaust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424655760,"description":"Untruths and mainstream propaganda abound when it comes to the Auschwitz WWII German labor camp. Here are just a few: 1) French biochemist G. Wellers claimed he exposed &quot;The Leuchter Report&quot; as fallacious, but in truth he exposed only his own grotesque incompetence; 2) Polish researcher Prof. J. Markiewicz said he proved that Zyklon B was used in the gas chambers of Auschwitz, but Markiewicz was found to have fabricated his results; 3) Chemist Dr. Richard Green declared that Revisionists' chemical arguments were flawed, yet Green was forced to admit that Revisionists were right after all; 4) Prof. Zimmerman alleged that the crematories in Auschwitz could cremate all victims of the claimed massmurder. But in truth, accountant Zimmerman proved only his lack of expertise on the subject; 5) Profs. M. Shermer and A. Grobman said they could refute the entire array of Revisionist arguments. But in reality they covered only a tiny fraction of Revisionist arguments-and botched their attempts at refutation; 6) Keren, McCarthy and Mazal found the &quot;Holes of Death,&quot; saying they proved the existence of the Auschwitz gas chambers. But no, they twisted evidence to support their case and suppressed the facts. These and many other untruths about Auschwitz are exposed for what they are: political lies created to ostracize dissident historians and keep the Western world in Holocaust servitude","torrent":{"xt":"urn:btih:eff489b144a1e3e2f5fc9c821282c95fca85b15c","amp;dn":"Auschwitz+Lies%3A+Legends%2C+Lies%2C+and+Prejudices+on+the+Holocaust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff489b144a1e3e2f5fc9c821282c95fca85b15c","infoHashBuffer":{"type":"Buffer","data":[239,244,137,177,68,161,227,226,245,252,156,130,18,130,201,95,202,133,177,92]},"announce":[],"urlList":[]}}