{"title":"Queen Anne: The Politics of Passion (2013 - Retail epub)","uid":9114796,"size":20857888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f051599dba030f3a94808cefd6c386a856d2e5cf&amp;dn=Queen+Anne%3A+The+Politics+of+Passion+%282013+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":5,"time":1383005627,"description":"Books : History : English\n\n\nQueen Anne: The Politics of Passion by Anne Somerset\nHarperCollins | 2013 | ISBN: 0007203756 | 416 pages | EPUB | 10 MB\n\nQueen Anne was one of Britain's most remarkable monarchs. With a personal life riven by passion, illness and intrigue - she presided over some of the most momentous events in British history. Like books by Antonia Fraser or Amanda Foreman and based on years of original research, Queen Anne is historical biography at its best. Winner of 2013 Elizabeth Longfordd Prize for Historical Biography.\nIn 1702, fourteen years after she helped oust her father from his throne and deprived her newborn half-brother of his birthright, Queen Anne inherited the crowns of England and Scotland. Childless, despite seventeen pregnancies that had either ended in failure or produced heartrendingly short-lived offspring, in some respects she was a pitiable figure. But against all expectation she proved Britain's most successful Stuart ruler. Her reign was marked by many triumphs, including union with Scotland and glorious victories in war against France. Yet while her great general, the Duke of Marlborough, was performing feats of military genius, Anne's relationship with his outspoken wife Sarah was becoming ever more rancorous. Political differences partly explained why the Queen's earlier adoration for Sarah transformed to loathing, but the final rupture was precipitated by Sarah's startling claim that it was the Queen's lesbian infatuation with another lady-in-waiting, Abigail Masham, that had destroyed their friendship. Drawing widely on unpublished sources, Anne Somerset vividly depicts the clashes of personality and party rivalries that aroused such strong feelings at the time. Traditionally depicted as a weak ruler dominated by female favourites and haunted by remorse at having deposed her father, Queen Anne emerges as a woman whose unshakeable commitment to duty enabled her to overcome private tragedy and painful disabilities, setting her kingdom on the path to greatness.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f051599dba030f3a94808cefd6c386a856d2e5cf","amp;dn":"Queen+Anne%3A+The+Politics+of+Passion+%282013+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f051599dba030f3a94808cefd6c386a856d2e5cf","infoHashBuffer":{"type":"Buffer","data":[240,81,89,157,186,3,15,58,148,128,140,239,214,195,134,168,86,210,229,207]},"announce":[],"urlList":[]}}