{"title":"The Overture - Parsart Thai.mpg","uid":6993322,"size":1661181952,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0a9e82c41f97fde493b29caa46138721e81e872&amp;dn=The+Overture+-+Parsart+Thai.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lonepup","files":-1,"time":1327778599,"description":"sawat dee khrup! sa bai dee mai?\n\n2004 - Movie in thai only (parsart thai) with english subtitles.\n\nBased on the life of Luang Pradit Pairoh (Sorn Silapabanleng) the most revered traditional Thai music master who lived during the reigns of Kings Rama V to VIII, the movie traces the life of Sorn, who picked up the ra-nad ek (Thai xylophone) mallets as a small child and played all his life. The backdrop to Sorn\\'s life tale is the story of Thailand\\'s classical music from its golden age during the reign of King Rama V to near extinction after the end of the absolute monarchy when the government banned it as uncivilised in the 1930s -- a time when Field Marshall Plaek Pibulsongkram tried to push the Kingdom into the modern era. The film shifts back and forth from the time when Sorn was a young man, playing in a xylophone duel with the intense Kun In, to the 1940s, when Thailand was under Japanese occupation and Sorn\\'s playing would provide some inspiration to the oppressed citizenry of the time.\n\nIMDd: http://www.imdb.com/title/tt0415046\n\nAs a non thai citizen, this is probably one of the best movies I have seen.\n\nThailand is known as the &quot;land of smiles&quot; and I think what that means, is that thai people have courage and dignity and can smile even in bad times. \n\nEven if you are not thai, I think everyone will enjoy this story, with english captions. khun thai (people in thailand) make me smile when I'm not happy.\n\nSo please enjoy this dee mark mark very wonderful movie. To date, this is one of the best thai movies I have every shared.\n\n- khun Lonepup  ","torrent":{"xt":"urn:btih:f0a9e82c41f97fde493b29caa46138721e81e872","amp;dn":"The+Overture+-+Parsart+Thai.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a9e82c41f97fde493b29caa46138721e81e872","infoHashBuffer":{"type":"Buffer","data":[240,169,232,44,65,249,127,222,73,59,41,202,164,97,56,114,30,129,232,114]},"announce":[],"urlList":[]}}