{"title":"The Band - BBC Classic Albums - The Band.avi","uid":6845108,"size":741126898,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f0de0d8db15c97d2a0d2e3765bedb57d643b278a&amp;dn=The+Band+-+BBC+Classic+Albums+-+The+Band.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geo64","files":1,"time":1322320119,"description":"Video sell-through of the (essential) VH1/BBC1 programme, seemingly at the full length of 75 minutes. There appear to be different versions of the TV show for the USA, Europe and the UK at varying lengths. The UK broadcast was 65 minutes.\n\nInterviews: Robbie Robertson, Levon Helm, Rick Danko, Garth Hudson and producer John Simon, plus comments from Eric Clapton, George Harrison, Bernie Taupin, road manager Jonathan Taplin, Greil Marcus, Barny Hoskyns, Don Was, Jim Keltner and Elliott Landy.\n\nIt's fascinating to see the original eight track remixed with the faders. The stand-out new material is Robbie Robertson on solo piano doing The Night They Drove Old Dixie Down, Garth's keyboard solos and Rick Danko's solo version of When You Awake.\n\nThe review in Uncut (November 1997) gives it five stars, while commenting 'It's also true that Music From Big Pink is a far superior record to its follow up. Which, erm, suggests that the second album is something less than a classic.'\nWhat?\n\nBernie Taupin was missing from the broadcast US version. In case you're wondering, this is the connection. Elton John &amp; Bernie Taupin wrote Tumbleweed Connection which shows heavy Band influence. The subsequent Madman Across The Water includes the songs Levon and Tiny Dancer (who is &quot;LA seamstress to The Band&quot;.)\nProgramme\n(ignoring the many fragments)\n\nThe Weight\nWith faders.\n\nI Shall Be Released\nRobbie uses the studio faders to isolate Richard's part and Garth's part. Levon reveals that he strummed a hand-held snare drum placed on its side.\n\nAcross The Great Divide\nAlbum version. John Simon describes the geography of Sammy Davis's Pool House (steam rooms and shower rooms for echo).\n\nRag Mama Rag\nLevon describes the line-up. Richard on drums. Levon on mandolin, Rick on fiddle, Garth on piano and organ bass pedals, John Simon on piano and sousaphone. Levon also says Jemima Surrender was a similar line-up. Oh, yes. He neglects to mention that Robbie was there as well. He says he thought it'd be a hit. Robbie disagrees. Garth's piano is isolated on the faders. Levon says 'Ain't it easy when you know how. Brother Garth. The master.' Rick Danko demonstrates his fiddle part solo.\n\nThe Night They Drove Old Dixie Down AU file\nRobbie sings it and plays solo piano in the studio. This segues into a live version with Levon.\n\nInstrumental [RealAudio]\nGarth conjures up some solo keyboard magic. .\n\nUp On Cripple Creek\nGarth's clavinet as jews harp is isolated. Robbie reveals the bass part then the acoustic guitar part, and how Garth switches from clavinette to organ and back to clavinette. Levon demonstrates the drum part.\n\nThe Staple Singers: Wade in The Water\nA fragment to demonstrate their influence.\n\nRockin' Chair\nLevon operates the faders with John Simon in a homage to Richard Manuel's vocals which moves into a live extract (Richard on piano, Levon on mandolin. No drums).\n\nGuitar solo\nRobbie plays a blues, then shows his Curtis Mayfield influence leading into the intro to The Weight\n\nUnfaithful Servant\nRick Danko plays acoustic guitar and sings solo in the studio. He says there were 30/40 takes of the original, but they used the first take on the album. Photo of the line-up of horns: Garth - sax, trumpet, Rick - trombone, Richard - saxophone, John Simon - tuba. Garth demonstrates his sax solo. Jonathin Taplin &amp; Robbie recount The Winterland incident (Jon calls it 'Robbie's psychosomatic malaise' while Robbie calls it 'the bug)\n\nThe Shape I'm In\nFragment from 'The Last Waltz' to introduce a section that is a tribute to Richard Manuel, based around:\n\nWhispering Pines\nAlbum sound, with a mismatched film of Richard live (Levon says 'Richard was always our lead singer')\n\nInstrumental [RealAudio]\nGarth does more solo wonder stuff\n\nWhen You Awake [MPEG] (26.9MB MPEG-video)\nRick Danko does the whole song solo, accompanying himself on acoustic guitar. Interesting lyric snatches - Rick sings she said rather than he said and The Captain's doctor rather than The Captain's daughter (well, I always thought it was 'a date with the Captain's daughter') Then Robbie plays the guitar part solo on his Telecaster, followed by isolating the guitar part on the faders to demonstrate that the song could only have been written on guitar, not keyboards.\n\nKing Harvest\nGreil Marcus critique, then Robbie demonstrates the essentials for him on the faders - the bass guitar and bass drum parts. the isolated bass guitar is a revelation. There is a snatch of the live film from Sammy Davis's Pool House, and then the album track over 30s archive footage.\n\nInstrumental [RealAudio]\nGarth struts his solo stuff for the third time.\n\nFragments of studio chatter lead into Whispering Pines over the credits. ","torrent":{"xt":"urn:btih:f0de0d8db15c97d2a0d2e3765bedb57d643b278a","amp;dn":"The+Band+-+BBC+Classic+Albums+-+The+Band.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0de0d8db15c97d2a0d2e3765bedb57d643b278a","infoHashBuffer":{"type":"Buffer","data":[240,222,13,141,177,92,151,210,160,210,227,118,91,237,181,125,100,59,39,138]},"announce":[],"urlList":[]}}