{"title":"The Hidden Faith of The Founding Fathers (DivX)","uid":6504371,"size":1922469888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f16647ec2c1ecf5d9dbf38bf5e16f363c1114ac8&amp;dn=The+Hidden+Faith+of+The+Founding+Fathers+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JustPirateBay2011","files":-1,"time":1309369898,"description":"The Hidden Faith of The Founding Fathers\n\nVideo #4 in The 'Secret Mysteries of America's Beginnings' Series! The 'Hidden Faith of Our Founding Fathers' is perhaps the first and only documentary to go where no film has ever gone before: into the hidden faith of America's founding fathers. Many founders were involved in secret societies, and yet it is often claimed these men were Christians who were trying to build a Christian nation. But was their faith the true faith of the Bible? And is it possible, as some claim, that the exact opposite is true?\n\nWhat did the founders believe about the Person of Jesus Christ? Were they fighting for Christianity, or against it? Moreover, is it possible that the events of the American Revolution have a much darker significance in the pages of Bible prophecy than most church leaders are aware?\n\nCharles Thomson was the Secretary of the Continental Congress, and the man responsible for the final design of the Great Seal of the United States. He was said to be more familiar with the events and people surrounding the American Revolution than any other man of his era. He spent years documenting the history of the War for Independence, knowing many details which had escaped others. Though encouraged to publish his remarkable history, he chose to destroy it. He said: &quot;I shall not undeceive future generations.&quot; Since we are the 'future generation' of which Thompson referred how have we been deceived about our Founding Fathers?\n\nWhat was Thomson hiding? And how has it affected the Church and society in America today?\n\nIncluded in this DVD: 1) The faith of Thomas Paine - the man who inspired the American Revolution. 2) The faith of Thomas Jefferson - author of the Declaration of Independence. 3) The faith of John Adams - the second President of the United States. 4) The faith of Benjamin Franklin - the only man to sign all of the founding documents. 5) The faith of George Washington - known as &quot;the Father of our country.&quot; 6) Confronting David Barton's &quot;fabled&quot; view of American history, showing from his own writings the error of his teachings. 7) How Secret Societies have worked to change the Gospel of Jesus Christ. 8) Patriotic Christianity; its role in Dominionism and building the New World Order. 9) The prophetic implications of the Church being used to build the kingdom of Antichrist.\n\n&lt; NOTE: This DVD was originally called 'Church and Secret Societies'.\n\nChris Pinto produces an outstanding DVD, of the same fine quality as the three DVD's in the Secret Mysteries of America's Beginnings series.\n\n3 Hours Long ","torrent":{"xt":"urn:btih:f16647ec2c1ecf5d9dbf38bf5e16f363c1114ac8","amp;dn":"The+Hidden+Faith+of+The+Founding+Fathers+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f16647ec2c1ecf5d9dbf38bf5e16f363c1114ac8","infoHashBuffer":{"type":"Buffer","data":[241,102,71,236,44,30,207,93,157,191,56,191,94,22,243,99,193,17,74,200]},"announce":[],"urlList":[]}}