{"title":"VA - Mash Up Fever Vol.2 2014 320kbps","uid":11388077,"size":673670141,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f19682d1ed405dc7f324b6e11437b439fa50d851&amp;dn=VA+-+Mash+Up+Fever+Vol.2+2014+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"6pack1204","files":-1,"time":1415292520,"description":"Tracklist:\n\n\n01. Above &amp; Beyond vs. Kyau &amp; Albert vs. Arisen Flame - Encounter With Sun &amp; Moon (Arisen Flame MashMix)\n02. Above &amp; Beyond vs. Trance Arts &amp; Colin James - Sun &amp; Moon Somnium (Moonsouls Mashup)\n03. ACDC vs. Deoroo vs. Zombie Nation vs. MXTRM - Thunderstruck in Your Kernkraft Face (Saint-Pierre Intro Edit) \n04. Allen &amp; Envy with Elles de Graaf - Perfect Run (Kaimo K Mashup) \n05. Armin van Buuren - It Feels Like Adrenaline (twoloud MashUp)\n06. Armin Van Buuren vs. Nervo &amp; Ummet Ozcan &amp; Dada Life - Pray for Ukraine (Dj Smale Mashup)\n07. Bang La Decks &amp; Martin Garrix &amp; Yves Larock vs. Citrus - Wizard Utopia (Dj Niki &amp; Dj Alex Rio Mash Up)\n08. Bobina &amp; Wezz Devall vs. Nadia Ali - Rapture Diamond (Sandro Vanniel Mashup)\n09. Bruno Mars vs. Jerome Isma-Ae vs. Chris Schweizer - Locked Out Of The M1 Kraken (Estiva Mashup)\n10. BT feat. Jan Johnston vs. Eastern Sound - Remember Sound (Simon Moon New Year Mashup)\n11. Chris Metcalfe meet Emma Hewitt - Miss You Paradise Tahiti (Angel Moreno Mashup)\n12. Commander Tom &amp; John Askew vs. Way Out West - IntensifEYE (Neptune Project Mashup)\n13. Cosmic Gate feat. Denise Rivera vs. Will Rees - Body of Conflict vs. Withhold (RomCools Mashup!)\n14. Cosmic Gate, JES vs. Chris Schweizer - Flying Ultra Blind (Steven White Power Mashup)\n15. Dannic, Sevag - The Heat Of Zenith (Rob Nagdalyan Mashup)\n16. Dash Berlin &amp; Arctic Moon &amp; Oceanlab feat. Justine Suissa - Satellite vs Till The Sky Falls Down (Shura Vlasov Mashup) \n17. Dash Berlin feat. Vera - Till The Sky Falls M.O.R.P.H (VIN DETT &amp; KOST Bootleg)\n18. Deadmau5 vs Foo Fighters - Everlong (Gabriel &amp; Dresden Mashup)\n19. Delerium vs Gareth Emery-This Is That Silence (Myon Collision)\n20. Gareth Emery &amp; Bryan Kearney - U vs Concrete Angel (Armin van Buuren Mashup)\n21. Gregor Salto vs. Junior Jack - Bumblebeat E-Samba (Alexey Romeo Mashup)\n22. Indecent Noise &amp; Eddie Bitar vs. Christina Novelli - Poltergeist Dynamite (Michael McBurnie Mashup)\n23. James Dymond vs. Above &amp; Beyond - Siren's Song Called Love (aryakuya Mashup)\n24. Jase Thirlwall &amp; Adam Ellis - Napalm Stopper (Dean Rigbey Mashup)\n25. Jonathan Carvajal vs. Depeche Mode and Eric Prydz vs. Tiesto &amp; Bryan Kearney - Crazy Rawk Jesus (Dave Correa Mashup)\n26. Jorn van Deynhoven &amp; Temple One vs. El - Hand (Next DJ Mashup Of Jorn Van Deynhoven Mix)\n27. Kaskade vs. Norin &amp; Rad vs. Tronxslyde - Animate the Thundercat Atmosphere (Artec Intro Edit) \n28. Khomha Vs Krewella - Alive Vapor (Sandro Vanniel Mashup)\n29. Leolife &amp; Matt Bukovski vs. 4Strings - Empathy Away (Matt Bukovski Mashup)\n30. Martin Solveig vs. Afrojack vs. Gregori Klosman &amp; Bassjackers vs. Hardwell vs. GTA - I Just Flag To Turn It Up (Sebastian Wibe vs. Hardwell Mashup)\n31. Michael Brun vs. Eurythmics - Zenith vs. Sweet Dreams (Steve Angello Mashup)\n32. Nirvana VS HIIO - Smells Like Teen Spirit (Loud Bit Project &amp; Dj Max-Wave Mash Up)\n33. Peter Plaznik vs Allen &amp; Envy vs. Simon Dixon - The paranoia Experiment (Gate of Paradise Mashup)\n34. Purple Stories &amp; Tepes vs. Paul Van Dyk feat. Christian Burns - We Are Gekko Tonight (Sky Sound Mashup)\n35. ReOrder vs Christina Novelli - Seven Colours of Dynamite (Mark Winstanley Mashup)\n36. Revolvr vs. Tove Lo - High On Quantum (Dannic EDC Mashup)\n37. Ron Hagen &amp; Al-Exander VS. Above &amp; Beyond - Now Is The Time For Sun &amp; Moon (Hazem Beltagui Mashup)\n38. Ronski Speed feat. Sir Adrian vs. Rex Mundi - The Perspective Space (Markus Schulz Mash Up)\n39. The Chainsmokers vs. Botnek vs. Skrillex, Kill The Noise, Milo &amp; Otis - Selfie NRG (Dyro Mashup)\n40. Thomas Datt vs. Freefall feat. Jan Johnston - Long Distance Skydive (Thomas Datt Mashup)\n41. VINAI vs. Calvin Harris - Unstoppable Summer (z3tO Hype Edit)\n42. W&amp;W, BlasterJaxx &amp; Hardwell vs. Miss Palmer - Rocket vs. Spaceman vs. No Beef (Hardwell Mashup)\n\n\n\n\nSeed &amp; enjoy","torrent":{"xt":"urn:btih:f19682d1ed405dc7f324b6e11437b439fa50d851","amp;dn":"VA+-+Mash+Up+Fever+Vol.2+2014+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f19682d1ed405dc7f324b6e11437b439fa50d851","infoHashBuffer":{"type":"Buffer","data":[241,150,130,209,237,64,93,199,243,36,182,225,20,55,180,57,250,80,216,81]},"announce":[],"urlList":[]}}