{"title":"Michael Federici - Eric Voegelin, The Restoration of Order (pdf)","uid":8230829,"size":1867720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1c0c71ecf4cb8b0f1284ae068110974e6169923&amp;dn=Michael+Federici+-+Eric+Voegelin%2C+The+Restoration+of+Order+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1362726376,"description":"Michael P. Federici - Eric Voegelin: The Restoration of Order (ISI, 2002). 249 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nBeginner's guide to the life and political philosophy of Eric Voegelin.\n\nSynopsis:\n\nFew political philosophers of the twentieth century can lay claim to as much original brilliance as can Eric Voegelin (1901-1985), the Austrian-born philosopher who after fleeing the Nazis taught for most of his career at Louisiana State University. In this introduction to Voegelin's thought, Michael Federici synthesizes Voegelin's massive corpus of work, making the contributions of this important philosopher readily accessible to the interested scholar and layman.\n\nArmed with amazingly broad learning in numerous ancient and modern languages, Voegelin's philosophical project was to restore order in human souls and human societies in a century of civilizational catastrophe. For Voegelin, the &quot;crisis of the West,&quot; reflected in the horrific wars and social chaos of the twentieth century, was the result of the gradual detachment of the our theoretical language from the unique, historical encounters with transcendence that lay at the foundation of Western civilization. As Federici shows, Voegelin undertook two massive efforts to provide evidence for this thesis in his five-volume Order and History series and in his posthumously published multi-volume History of Political Ideas.\n\nThe ultimate goal of Voegelin's project, Federici argues, was to liberate modern men and women from the grasp of ideologies, which Voegelin characterized as simplified constructions of reality that always distorted and obscured the truth. Hence, Voegelin was especially critical of Nazism, Marxism, gnosticism, and scientism. But he was also a critic of doctrinal Christianity and conservatism, positions that Federici explains in detail. Federici also introduces the reader to Voegelin's difficult but influential philosophy of consciousness, and he includes a helpful glossary of Voegelinian terms.\n\nReaders intimidated or puzzled by Voegelin's often daunting prose will find Federici's volume, the fourth entry in ISI's Library of Modern Thinkers series, an invaluable guide to one of the twentieth century's most imposing-and most impressive-philosophical minds.\n\nAbout the Author \n\nMichael P. Federici is Associate Professor of Political Science at Mercyhurst College and Co-Director of the Center for Constitutional Studies at the National Humanities Institute in Washington, D.C. He is the author of The Challenge of Populism.\n\n---\n\nFor some of Voegelin's own work, see these torrents:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8217688/Eric_Voegelin_-_Order_and_History_(Vols._I-V)_(pdf)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8217688/Eric_Voegelin_-_Order_and_History_(Vols._I-V)_(pdf)&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8230817/Eric_Voegelin_-_Misc._Works_(pdf__mostly)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8230817/Eric_Voegelin_-_Misc._Works_(pdf__mostly)&lt;/a&gt;","torrent":{"xt":"urn:btih:f1c0c71ecf4cb8b0f1284ae068110974e6169923","amp;dn":"Michael+Federici+-+Eric+Voegelin%2C+The+Restoration+of+Order+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1c0c71ecf4cb8b0f1284ae068110974e6169923","infoHashBuffer":{"type":"Buffer","data":[241,192,199,30,207,76,184,176,241,40,74,224,104,17,9,116,230,22,153,35]},"announce":[],"urlList":[]}}