{"title":"Icewind Dale 1 &amp; 2 + Expansions &amp; Patch [PC]","uid":5836979,"size":4483559568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f1ee8aa524202d19aeb62ce7c558c131434ec76e&amp;dn=Icewind+Dale+1+%26+2+%2B+Expansions+%26+Patch+%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1284758099,"description":"Icewind Dale 1 &amp; 2 + Expansions for PC                             Rel. 2000 &amp; 2002\n\n\nFormat:        DVD/CD\nLang.:         English\nDiscs:         4\nImage:         ISO\nGenre.:        RPG\nRating:        T (Teen)\nPlatform:      PC, Windows\nProtection:    CD Checks\n \n\nCompressed with 7Zip, Both Games were tested and work.\n\n\n\nGames were tested on Windows XP, I don't know if it will work for Vista or Windows 7 but you can try. (For Vista or Windows 7 you may need to run as admin and/or run the program compatibility for XP).\n\n\n\n- Minimum System Requirements -\n\n(Icewind Dale)\n\n* Pentium II 233MHz (Pentium II 266MHz recommended)\n* 32Mb RAM\n* Win9x or 2000 with DirectX 5.0 or later\n* 600Mb hard disk space\n* 4x CD-ROM drive (8x recommended)\n* 4Mb SVGA video card\n\n(Icewind Dale 2)\n\n* Intel Pentium II 350Mhz or AMD K6(R)-III/400Mhz\n* 64MB RAM\n* 8x CD-ROM\n* DirectX compliant video card\n* DirectX compliant sound card\n* Windows 95/98/ME/2000/XP\n* DirectX 8.0 or higher\n\n\n\nRelease Notes: Included is some no-cd cracks. If they don't work Just burn or mount\n               the image to play the either game.\n\n \n\nIcewind Dale Game Description:\n\nIn the northernmost reaches of the Forgotten Realms lies the frozen and untamed region known as Icewind Dale. Journey deep into the Spine of the World Mountains, a harsh and unforgiving territory teeming with fearsome and merciless beasts. There you must confront an ancient evil that threatens to unleash an unspeakable horror upon the face of Faerun.\n\nWelcome to the Northern Faerun, where winter never ends. In this harsh realm of ice only a few tough survivors live, and nowadays even those hardy few find the conditions a tad tougher.\n\nYou and your party have just arrived at a small fishing village, where an expedition will soon begin to help a troubled nearby tree-village, Kuldahar.\n\nIn this hack-n-slash RPG you play a combat oriented Baldur's Gate -- the graphics, the system, and the interface are just the same. The only real difference between the two is there is a lot more enemies to kill and much fewer NPCs to talk to. Nevertheless the title, with the other Infinity Engine Games (Baldur's Gate, Planescape: Torment), marks a great age in RPG history.\n\n\nFeatures:\n\n* Battle Ice Trolls, Giants, and hordes of terrifying Undead. Over 70 types of new\n  monsters (for a total of over 150) put your valor to the test in real-time \n  combat using the Badlur's Gate adaptation of the Advanced Dungeons and Dragons \n  game system.\n\n* Adventure through a wide range of breathtaking environments and beautifully \n  rendered, scrolling terrain. Explore the region known as Icewind Dale, from \n  magnificent temples and ancient ruins, to volcanic cavers and icy plains.\n\n* The Bioware Infinity Engine, the same engine used to create Baldur's Gate brings\n  Icewind Dale to life with ynamic real-time lighting and weather effects,\n  astounding combat, incredible spell effects, and visually rich Immersive \n  gameplay.\n\n* Complete multiplayer support for up to six players over LAN or Internet \n  connections.\n\n* Higher level character advancement and party based adventuring let you develop\n  characters of formidable power and skills.\n\n\nHeart of Winter Expansion-\n\nPick up after the conclusion of Icewind Dale, peace has returned to Icewind Dale. Or so it seems as there is a plot afoot by the northern Barbarians to attack the Ten Towns. It is up to you and your party to investigate and stop this plot.\n\nThis expansion on the original game is definitely along the same lines. The game focuses on epic battles and powerful magics, relying on the plot only to provide a background for the fighting and spell-casting. You can import your party from the original game and continue your adventure. Includes new weapons, armors, and enemies. Battles are now much more Baldur's Gate 2-sequel than in the original, relying heavily on strategy and spell-casting to combat very powerful enemies.\n\n\n\nIcewind Dale 2 Description:\n\nJust a generation after the events depicted in the first Icewind Dale, a new threat has appeared in the Northern region of Forgotten Realms. Something - or somebody - is trying to cut off the Ten Towns area from the rest of the world. Hordes of monsters invade peaceful towns and kill their citizens. You play as a party of adventurers who happen to be in the region, and upon their arrival they are requested to help to defend the town of Targos against monster invasion. But once they have accepted the quest, the adventurers realize it will only be the beginning of a long and perilous journey...\n\nIcewind Dale II is a role-playing game that uses the Infinity Engine, first introduced in Baldur's Gate. Like its predecessor, it is more combat-oriented than Baldur's Gate games. The combat is a mixture of turn-based and real-time styles. In the beginning of the game, you create your entire party, up to six characters. Icewind Dale II uses the 3rd edition of Advanced Dungeons &amp; Dragons rules. There are new character classes (such as monk or sorcerer), new races (for example drow) and many new spells. The game features isometric pre-rendered backgrounds, like its predecessors.\n\n\nGame Pics Included.\n\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:f1ee8aa524202d19aeb62ce7c558c131434ec76e","amp;dn":"Icewind+Dale+1+%26+2+%2B+Expansions+%26+Patch+%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1ee8aa524202d19aeb62ce7c558c131434ec76e","infoHashBuffer":{"type":"Buffer","data":[241,238,138,165,36,32,45,25,174,182,44,231,197,88,193,49,67,78,199,110]},"announce":[],"urlList":[]}}