{"title":"Royal Airforce Sinks Tirpitz - 1944/11/22","uid":4634283,"size":201093124,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:f2bceaa37c72631205b25a56676e7479f8955f4e&amp;dn=Royal+Airforce+Sinks+Tirpitz+-+1944%2F11%2F22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"historicalvideos","files":1,"time":1231501627,"description":"Preview or watch this Video as Stream: &lt;a href=&quot;\nhttp://blip.tv/file/1068851/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blip.tv/file/1068851/&lt;/a&gt;\n\n\nFilehoster Donload:\n\n(1) &quot;RAF Lancasters converge on the 45,000 ton Nazi Battlewagon, hidden in Tennsue Fjord in Norway. She is throwing tons of bursting steel skyward, but super blockbusters plummet down and she is hit. Winds blow away her smoke screen and again she is hit mortally. This time the smoke clouds mark her slipping beneath the waves, forever.&quot; (2) All Out Drive On Germany - &quot;In the snows of Northeastern Europe, huge, lumbering 105 and 105mm. howitzers lay down their curtains of fire on the Nazis. At Konzen, the Nazis seem immovable until Yank artillery destroy their observation post, a towering church steeple. Idle ack ack crews are pressed into service in the Battle of Hurtgen Forest. They level their gun barrels to horizontal, and pour continuous streams of lead into Nazi positions, enabling Yank Infantry to resume its advanture.&quot; scenes of Allies advance in snow and mud in Huertgen Forest, antiaircraft guns turned into artillery; (3) Nation Gets Behind 6th Bond Drive - &quot;Los Angeles dramatically opens its 6th War Loan Drive with a 'covered wagon, prairie action' parade which stirs the youngsters, and heads the adults for the bond selling booths. Morgenthau Speaks - Washington, DC: Sec. Henry Morgenthau, Jr. states that the doughboys who are continuing to fight, expect the homefront to continue buying War Bonds.&quot; (4) Denmark Fights Back - &quot; The resistance of the Danes to the pre-emptive Nazis is a 'war within a war.' Their sabotage is met with murder - their general strike with Gestapo destruction of irreplaceable plate glass. But the doughty Danes continue their resistance.&quot; scenes of Denmark defiance grew under nazi occupation, Danish priest and martyr buried, King Christian is prisoner in his castle but flags flew for his 73rd birthday, Nazis smashed glass in shops and stores, staged general strike; Denmark still occupied but awaits the day of complete freedom. (5) Giants 24 Packers 0 - (Exclusive) - &quot;Polo Grounds: 56,000 fans are thrilled as the N.Y. Football Giants upset the Green Bay Packers, pre-game favorites. Deadly tackling and the flashy work of the Giant backs feature the contest.&quot; (complete newsreel)\n\nPreview or watch this Video as Stream: &lt;a href=&quot;\nhttp://blip.tv/file/1068851/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blip.tv/file/1068851/&lt;/a&gt;\n\n\n\n\n\nList of free ww2 Footage:  &lt;a href=&quot;\nhttp://www.opencast.de/pages/listww2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opencast.de/pages/listww2.html&lt;/a&gt;","torrent":{"xt":"urn:btih:f2bceaa37c72631205b25a56676e7479f8955f4e","amp;dn":"Royal+Airforce+Sinks+Tirpitz+-+1944%2F11%2F22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bceaa37c72631205b25a56676e7479f8955f4e","infoHashBuffer":{"type":"Buffer","data":[242,188,234,163,124,114,99,18,5,178,90,86,103,110,116,121,248,149,95,78]},"announce":[],"urlList":[]}}