{"title":"Are You Being Served DVD5 (1977)(nl subs) vlinder TBS","uid":6529452,"size":4519441730,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f374f9a2c28b8a898f844d69d5c1d70f301bf291&amp;dn=Are+You+Being+Served+DVD5+%281977%29%28nl+subs%29+vlinder+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1310286859,"description":"Are You Being Served DVD5 (1977) \n\n\n\nAre You Being Served? is een Britse televisiecomedyserie die verscheen tussen 1972 en 1985. In Nederland en Vlaanderen is deze serie beter bekend onder de naam Wordt u al geholpen?. In Nederland werd de eerste aflevering op 21 juni 1974 uitgezonden door de TROS. De serie is geschreven door David Croft en Jeremy Lloyd. In 1992 volgde er een spin off waarin enkele ex-werknemers van het warenhuis een pension runden onder de titel Grace &amp; Favour.\n De serie speelt zich af op de afdeling dames- en herenkleding van het fictieve Londense warenhuis Grace Brothers.\n \nZe steekt op subtiele wijze de draak met de Britse klassenmaatschappij. Er heerst een afgebakende hiÃƒÂ«rarchie (directeur - afdelingshoofd - verkoopchef - senior verkopers - junior verkopers - conciÃƒÂ«rge - huishoudelijke dienst), waarbij de karakters zich doorgaans stroperig opstellen naar hun meerderen en hun ondergeschikten ronduit schofferen.\n \nEind 2008 / begin 2009 is de serie herhaald op RTL4.\n \nSeizoen 5 (1977)\n \nMrs. Slocombe Expects - Het personeel denkt dat Mrs. Slocombe in verwachting is.\n A Change is as Good as a Rest - Het personeel moet een week lang de speelgoedafdeling runnen.\n Founder's Day - Mr. Grace jr. wordt 80 jaar en het personeel moet een voorstelling geven voor hem.\n The Old Order Changes - Het personeel dient elkaar bij de voornaam aan te spreken en vrijetijdskleding te dragen.\n Take-Over - Grace Brothers dreigt te worden overgenomen door de firma Lally &amp; Willets. Gelukkig heeft Mr. Grace jr. vijf plannetjes om dit te voorkomen.\n Goodbye Mr. Grainger - Het personeel vindt Mr. Grainger te chagrijnig, daarom moet hij ontslagen worden.\n It Pays to Advertise - Er wordt een reclamecampagne op touw gezet en de personeelsleden spelen zelf de hoofdrollen.\n \nFilm: In 1977 heeft de Cast van Are You Being Served een film gemaakt met de gelijknamige titel. PremiÃƒÂ¨redatum: 31 juli 1977.\n In die film maken de werknemers van Grace Brothers een reisje naar Costa Plonka.\n \n\nEnglish\n\nStoryline\n\nThis quintessentially British sitcom is about Grace Brothers, a department store in London which is owned and kept traditional, almost pre-war (e.g. precise dress code for ladies frills and gentlemen's hats according to rank), by two brothers who look old enough to have fought in the Boer war but rarely appear, as most scenes play on one floor where Mr. Cuthbert Rumbold is the executive (meaning he enjoys an endless parade of foxy but stupid secretaries) in charge of management while his dignified floor walker, Captain Stephen Peacock, has daily charge over two small sales teams. The fat and bossy, implicitly man-hungry widow Mrs. Betty Slocombe supervises the attractive Miss Shirley Brahms (with a terribly common Cockney accent) -with first choice of customers, on commission- the sale of women's clothes and accessories; the sales star at the gentleman's side is Mr. Wilberforce Clayborne Humpries...\n \n\nTitel: Are You Being Served \nBron: Retail\n Formaat: DVD5\n Geluid: 2.0\n Taal: Engels\n Subs: Nederlandds\n Menu: Ja\n Extra's: Nee\n Cover: Ja HQ\n Size: 4.20 GB\n \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068040/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068040/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bol.com/nl/p/dvd/are-you-being-served-seizoen-5/1002004005818062/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/dvd/are-you-being-served-seizoen-5/1002004005818062/index.html&lt;/a&gt;\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f374f9a2c28b8a898f844d69d5c1d70f301bf291","amp;dn":"Are+You+Being+Served+DVD5+%281977%29%28nl+subs%29+vlinder+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f374f9a2c28b8a898f844d69d5c1d70f301bf291","infoHashBuffer":{"type":"Buffer","data":[243,116,249,162,194,139,138,137,143,132,77,105,213,193,215,15,48,27,242,145]},"announce":[],"urlList":[]}}