{"title":"VA - Hallucinations Psychedelic Pop Nuggets (2004) {FLAC}","uid":8442544,"size":375194125,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f383575fac222f6c7dba634eb47b94ce0a4157b7&amp;dn=VA+-+Hallucinations+Psychedelic+Pop+Nuggets+%282004%29+%7BFLAC%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1367806495,"description":"\n\n\nHallucinations:\nPsychedelic Pop Nuggets From The WEA Vaults (2004)\n\n\n\n\n\nallmusic.com...\n\nSince the first Nuggets in 1972, the entire series has been grounded in the gritty, dirty sound of garage rock, so much so that Rhino's 2001 box set of British and foreign psychedelic nuggets favored harder rock over the fruity, precious side of British psych. Collectors treasured rare singles before Nuggets, but the series created an aesthetic that emphasized the raw, trippy, wild, and woolly over the soft, lush, harmony-laden psychedelicized sounds of AM pop radio. The Rubble Collection, Mindrockers, The Trash Box -- all of them were dedicated to freaky guitar rock, and that mindset ruled until the latter half of the '90s, when the well had started to run dry, as labels like Sundazed issued the complete recorded works of obscure garage rockers who had released only one single during their lifetimes. Around this time, collectors -- including many third-generation music fanatics raised in the era of CD reissues rather than record fairs -- began to favor the soft sunshine pop of the late '60s, when square vocal groups started to get hip and record trippy music. Bands like the Millennium, the Association, and Yellow Balloon became hip currency, as did producers like Curt Boettcher and songwriters like Paul Williams. This was close to anathema for the hardcore garage rock fiends because this was not rock &amp; roll, it was pop music whose commercial aspirations failed. Nevertheless, most hardcore record geeks have a fondness for this stuff, since it's not only melodic and well produced, but it's terribly interesting to hear how underground ideas were borrowed and assimilated into mainstream music; often, it's as strange as it was in the underground, if not stranger. Fans of this breed of psychedelic pop were insatiable, and there was a certain thrill to the fact that it was hard to track down, since it was either issued in Japan, buried as album tracks on reissues, or never made it to CD at all. That's why Rhino Handmade's foray into the sound with Hallucinations: Psychedelic Pop Nuggets from the WEA Vaults and its companion release, Come to the Sunshine: Soft Pop Nuggets from the WEA Vaults, is so welcome -- while they're only available as limited editions (primarily sold via www.rhinohandmade.com), they're also the first widely available American samplers of this style. That alone would make them noteworthy, but what makes them essential (at least for hardcore record collectors), is that they're expertly done. \n\n\nAudio Quality:\t\tFLAC (Lossless)\nAudiochecker:\t     \t99.96% CDDA\nLabel:\t\t\tRhino\nCatalog:\t\tRHM2 7821\n\n\n\n\n\nAudio Info:\n\n\n01.Baker Night &amp; The Knightmares - Hallucinations\n02.The Misty Wizards - It's Love\n03.The Next Exit - Break Away\n04.The Collectors - Looking At A Baby\n05.Adrian Pride - Her Name Is Melody\n06.The Association - Pandora's Golden Heebie Jeebies (Original Mono-Single Mix)\n07.The World Column - Lantern Gospel\n08.Tom Northcott - Who Planted Thorns In Miss Alice's Garden\n09.John Wonderling - Man Of Straw\n10.Ellen Margulies - The White Pony\n11.Jeff Thomas - Straight Aero\n12.MC2 - My Mind Goes High\n13.Brass Buttons - Hell Will Take Care Of Her\n14.The Salt - Lucifer\n15.Kim Fowley - Strangers From The Sky\n16.The Electric Prunes - Antique Doll\n17.The Bonniwell Music Machine - Astrologically Incompatible (Mono Mix)\n18.The Tokens - How Nice?\n19.The Coronados - Your Love Belongs To Everyone\n20.Lee Mallory - That's The Way It's Gonna Be\n21.The Glass Family - House Of Glass\n22.The Holy Mackerel - Wildflowers\n23.The Monkees - Porpoise Song (Original, Long Mono-Single Mix)\n24.West Coast Pop Art Experimental Band - Smell Of Incense\n\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n\n","torrent":{"xt":"urn:btih:f383575fac222f6c7dba634eb47b94ce0a4157b7","amp;dn":"VA+-+Hallucinations+Psychedelic+Pop+Nuggets+%282004%29+%7BFLAC%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f383575fac222f6c7dba634eb47b94ce0a4157b7","infoHashBuffer":{"type":"Buffer","data":[243,131,87,95,172,34,47,108,125,186,99,78,180,123,148,206,10,65,87,183]},"announce":[],"urlList":[]}}