{"title":"Discovery Ch Through The Wormhole Season 2 02of11 Is There an Ed","uid":6729899,"size":672262144,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f3b3d5ea3c61dab3a1757e75b6361031e9223135&amp;dn=Discovery+Ch+Through+The+Wormhole+Season+2+02of11+Is+There+an+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1318097496,"description":"Through the Wormhole Season 2\n\nScience Documentary hosted by Morgan Freeman, published by Discovery Channel in 2011 - English narration\n\n\nInformation\n------------------------------\n\nThrough The Wormhole Season 2\nHosted by Morgan Freeman, Through the Wormhole will explore the deepest mysteries of existence - the questions that have puzzled mankind for eternity (Who-or what-am I? Are we alone? How did this begin? What happened before that?). This series will bring together the brightest minds and best ideas from the very edges of Science--Astrophysics, Astrobiology, Quantum Mechanics, String Theory, and more - to reveal the extraordinary truth of our Universe.\n\n\n1)  Is There Life After Death \nEveryone from the most simple-minded to the deepest thinking has pondered a question that strikes at the core of our existence: Is there life after death? What happens to the soul after we die? People who have had near-death experiences claim to have visited the other side before getting yanked back into consciousness. Now, some of the brightest minds in science are trying to understand how life can persist beyond the physical and what will it look like. It might be a quantum state based on the fundamental laws of the universe. Ultimately, it is a journey that struggles to decode the most complicated instrument in the universe: the human brain.\n\n2)  Is there an Edge to the Universe \nIt's a mystery mankind has struggled to solve since the beginning of history - is space infinite or might there be great cosmic border where everything ends? Groundbreaking cosmology and state of the art space telescopes, now suggest the Universe has a finite size and a unique shape. If this is true, there must be an edge to the Universe, and beyond that edge, there could exist a world beyond our wildest dreams.\n\n3)  Does Time Really Exist \nTime is woven into the fabric of the universe as one of the dimensions in which we live our daily lives. But maybe it is only a brain state that we use to piece together events. Could it exist only in our minds? Your sense of time can be totally different than the person next to you. This and other theories illustrate that time is an illusion and does not really exist. The world's top physicists tackle this fundamental question, does time exist, and offer new ways to perceive the physical world.\n\n4)  Are there More Than 3 Dimensions \nCould there be more ways to travel than back and forth, side to side and up and down? These 3 directions seem to be the only paths we can move in, but cutting edge science now professes there must be more. Unlocking these invisible pathways is the holy grail of science. Physicists believe that the answers to our most burning questions are hidden in these higher dimensions. Now armed with the most ambitious scientific instrument humanity has ever built, the brightest minds of our planet are convinced we are on the verge of unraveling the Universe's true number of dimensions... and unlocking the secrets hidden inside.\n\n5)  Is there a Sixth Sense \nCan we perceive beyond the world detected by our five senses? Researches are diving into the hidden folds of our brains, discovering that the blind can actually see, that thoughts can fly across space and that we all may all be part of a global consciousness. What was once on the fringes of science is moving ever closer to the mainstream as neuroscientists, philosophers and physicists turn their attention to the question: Is there a Sixth Sense?\n\n6)  Are there Parallel Universes \nMost scientists believe that you are not really you, but rather, you all. On the edge of space, buried in a black hole, or right on top of you, there could be an exact copy of yourself living a parallel reality. In those parallel worlds, you may be living your wildest dreams, or your worst nightmares. Finding them is no longer restricted to the realm of science fiction. Recent game-changing theories now suggest that if these worlds exist, intelligent life in these alternative worlds could be trying to send us messages. As scientists further unravel this astounding possibility, a new possibility emerges: the fate of our entire universe may depend on these hidden cosmic twins.\n\n7)  How Does the Universe Work \nHuman achievement has come a long way to explaining the laws of the universe. However, as we push forward we are learning that our observations of reality might not be what we think they are. Since the early 20th century, we have known that reality at the quantum level is not the same as at our visible level. But new ways of perceiving the world might allow us to unlock the secrets of the universe. Meet the scientists who are peeling back the layers of existence. It is their vital work that will give us a glimpse into the mind of God.\n\n8)  Can We Travel Faster Than Light \nThe speed of light is the speed limit of the universe...186,000 miles per second. According to Einstein, nothing can go faster, leaving the stars and distant galaxies almost impossibly out of our reach. But the dreams of star travelers are not dead. There could be ways to break the speed of light. Scientists around the world are challenging Einstein's speed limit and turning one of the most fundamental laws of physics upside down. By delving into the mystery of light, physicists are designing warp drives, hunting for wormholes, and discovering ways to teleport matter. The stars await and our chance to explore the final frontier might be within reach.\n\n9)  Can We Live Forever \nEternal life is a dream of humankind. But life seems programmed for death. Stars are born, mature and die. Our own sun will meet such demise. We as humans know our time here on Earth will one day expire. Death and decay seem to be the way of everything in the Universe. But what if life had no end? What if we never had to say goodbye to family and loved ones? Now with astonishing breakthroughs in biology, neuroscience, and quantum mechanics, immortality may be within our grasp. The world's leading scientists are tackling the seemingly inevitable fate of death and searching for ways to keep us alive forever.\n\n10)  What Do Aliens Look Like \nAcross the galaxy lie exotic worlds. Some are made entirely of water, others stewing with poisonous gas. What kinds of creatures thrive in these places? Would they resemble beings on Earth, or could life take on new and unexpected forms? Combining data about thousands of newly-discovered planets with our knowledge of how life evolved on Earth, exobiologists are creating their own &quot;Book of Alien Life.&quot; Its pages are filled with flying whales, creatures with silicon blood, and living machines the size of an entire planet.\n\n11)  Alien Storms \nAlthough we have extreme weather on earth, it is nothing in comparison to the wettest, dustiest and most brutal 'Alien Storms.' Radical weather is not uncommon in the solar system and storms on other planets are bigger, more powerful and stranger than their counter-parts on earth. This programme is an in-depth investigation into the source of such dramatic weather in the solar system and why it is so different from the weather we experience on earth. Watch how once the incredible dust storms on Mars have started, it can take months for the skies to clear and learn how Neptune's extreme winds can reach speeds of 2,500 an kilometres an hour.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img189.imageshack.us/img189/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img189.imageshack.us/img189/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img811.imageshack.us/img811/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img811.imageshack.us/img811/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img685.imageshack.us/img685/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img685.imageshack.us/img685/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img829.imageshack.us/img829/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img829.imageshack.us/img829/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img820.imageshack.us/img820/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img820.imageshack.us/img820/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img36.imageshack.us/img36/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img36.imageshack.us/img36/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img805.imageshack.us/img805/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img805.imageshack.us/img805/4748/throughthewormholeseaso.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img846.imageshack.us/img846/4748/throughthewormholeseaso.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img846.imageshack.us/img846/4748/throughthewormholeseaso.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1936 kbps\n * Video Resolution: 720 x 400\n * Video Aspect Ratio: 1.778 (16:9)\n * Frames Per Second: 29\n * Audio Codec: 0x2000 (Dolby AC3)\n * Audio Bitrate: 128 kb/s AC3 48000 Hz\n * Audio Streams: 2ch\n * Audio Languages: English\n * RunTime per Part 43.mins\n * Number of Parts: 11\n * Part Size: 641 MB\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Through_the_Wormhole&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Through_the_Wormhole&lt;/a&gt; &lt;a href=&quot;\nhttp://bestonlinedocumentaries.com/through-the-wormhole-season-2-is-there-life-after-death/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bestonlinedocumentaries.com/through-the-wormhole-season-2-is-there-life-after-death/&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Through%20the%20Wormhole&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Through%20the%20Wormhole&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Cosmos&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Cosmos&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Black%20Holes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Black%20Holes&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Cosmos%20-%20A%20Beginner%27s%20Guide&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Cosmos%20-%20A%20Beginner%27s%20Guide&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Are%20We%20Alone%20in%20the%20Universe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Are%20We%20Alone%20in%20the%20Universe&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Invisible%20Cosmos&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Invisible%20Cosmos&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Time%20Travel%3A%20The%20Truth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Time%20Travel%3A%20The%20Truth&lt;/a&gt;\n\n3)  ed2k Links \n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AHarry65&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AHarry65&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=Through_the_Wormhole_Season_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=Through_the_Wormhole_Season_2&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f3b3d5ea3c61dab3a1757e75b6361031e9223135","amp;dn":"Discovery+Ch+Through+The+Wormhole+Season+2+02of11+Is+There+an+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3b3d5ea3c61dab3a1757e75b6361031e9223135","infoHashBuffer":{"type":"Buffer","data":[243,179,213,234,60,97,218,179,161,117,126,117,182,54,16,49,233,34,49,53]},"announce":[],"urlList":[]}}