{"title":"Rio Bravo","uid":11495090,"size":2470187615,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f4184a7961cf43fb0b13ad071f61200fdaf7906a&amp;dn=Rio+Bravo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1416286820,"description":"Ratings: 8.1/10 from 36,653 Cowboys\n\n\n A small-town sheriff in the American West enlists the help of a cripple, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.\n\n&quot;You Can Do Just About Anything You Want To, Chance.&quot;\n\nHoward Hawks initially wanted to reunite John Wayne and Montgomery Clift who had worked so well together in Red River in his second film with Wayne. Clift however was at the beginning of the slide that would ultimately destroy him in seven years and said no. It was then that Dean Martin was cast as John Wayne's alcoholic deputy.\n\nBy the way if Clift had done the part it would have reunited him with Walter Brennan also who is playing a very similar part to the one he did in Red River in relation to Wayne.\n\nIn the wordless beginning of Rio Bravo, Wayne while going into the town saloon to fetch Dino, witnesses a cold blooded killing perpetrated by Claude Akins. Akins is the no good brother of rich rancher John Russell who keeps trying to spring Akins from Wayne's jail. He also brings in some hired guns who bottle the town up.\n\nBoth Howard Hawks and John Wayne absolutely hated High Noon and made Rio Bravo as their answer to it. This sheriff doesn't go around begging for help from the townspeople he's sworn to protect. He's supposed to be good enough to handle the job himself with some help from only a few good men.\n\nDean Martin said that the Rio Bravo role for him was one of the most difficult. At that time he was playing a drunk on stage and was not yet into the substance abuse problems that beset him later on. But turns in a stellar performance.\n\nThis film marked the farewell feature film performance of Ward Bond who took some time from his Wagon Train TV series to play the small role of a Wayne friend who offers to help and gets killed for his trouble. Fitting it should be in the starring film of his best friend John Wayne.\n\nThe only bad note in Rio Bravo is that of Ricky Nelson who is too much the nice kid from Ozzie and Harriet to suggest being a young gun. But Rio Bravo marked the first of many films Wayne used a current teenage idol to insure box office. Later on Frankie Avalon, Fabian, Bobby Vinton all the way down to Ron Howard in The Shootist brought a younger audience in for the Duke.\n\nJames Caan who played the Ricky Nelson part in El Dorado was much superior to Nelson. Then again, Caan is an actor. But I will say that Dean and Ricky sung real pretty.\n\nWhen you hear Dean singing My Rifle, Pony, and Me in the jailhouse, you might recognize the same melody from Red River as Settle Down. Dimitri Tiomkin wrote it and Dean recorded it as well as the title song for Capitol records. At Capitol Dino did mostly ersatz Italian ballads, it was what he was identified with. When he switched to Reprise, Dino started doing far more country and western and it really starts with the songs he did in Rio Bravo.\n\nRio Bravo is a leisurely paced western, probably one of the slowest John Wayne ever did. But Howard Hawks created some characters and a story that hold the interest through out.\n\n\n\nThe Fair Use Clause, Section 107 of the Copyright Act, allows the use of copyrighted material for purposes such as teaching but more importantly for purposes such as satire and parody","torrent":{"xt":"urn:btih:f4184a7961cf43fb0b13ad071f61200fdaf7906a","amp;dn":"Rio+Bravo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4184a7961cf43fb0b13ad071f61200fdaf7906a","infoHashBuffer":{"type":"Buffer","data":[244,24,74,121,97,207,67,251,11,19,173,7,31,97,32,15,218,247,144,106]},"announce":[],"urlList":[]}}