{"title":"Coast to Coast AM December 09 2012","uid":7908014,"size":58234675,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f44183a841826b509cf105ae66bc11e619b3dbcd&amp;dn=Coast+to+Coast+AM+December+09+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1355147036,"description":"Date: \t12-09-12\nHost: \tIan Punnett\nGuests: \tTimothy L. O'Brien, Raymond Benson, Bill Wasik, Monica Murphy\n\nIan Punnett (Twitter) was joined by author Timothy L. O'Brien, who discussed the assassination of Abraham Lincoln and the culture of that period in American history. &quot;What surprises me is how little is really, truly modern in our lives,&quot; he said of his research into that era. To that end, he noted that debates over presidential authority, the power of the business class, and issues surrounding race, gender, and immigration existed following Lincoln's death and remain holy debated to this day. On the Great Emancipator, himself, O'Brien marveled that &quot;there's a lot about Lincoln that actually does live up to the myth,&quot; unlike many other historical figures who have become immortalized over time.\n\nWhile John Wilkes Booth is forever vilified for his role in the assassination, O'Brien detailed some of the key players who also played a role in the plot unfolding. One such character was Mary Surratt, the woman who owned a boardinghouse where it is believed the assassination was planned and who was hung for her role in Lincoln's death. Although O'Brien conceded that Surratt likely withheld information about her knowledge of the plot from authorities, he suggested that her son, John, who fled the country following the assassination, likely played a more pivotal role in the event.\n\nO'Brien also discussed the relationship between Lincoln and his wife, Mary Todd, as well as her life following the assassination. He lamented that Mary Todd has seemingly been &quot;brutalized by history&quot; and treated as a caricature by historians. O'Brien attributed this portrayal to Mary Todd's penchant for visiting seances in the hopes of communicating with her late husband. &quot;She was desperately searching for some answers and some support,&quot; he observed. Additionally, O'Brien defended Mary Todd against the frequent historical depiction that she was an unhappy spouse, noting that the former president had his own personal issues, such as depression. &quot;I don't know how easy he might have been to live with, himself,&quot; O'Brien mused.\nBehind Bond\n\nIn the first half hour, James Bond novelist, Raymond Benson, shared his thoughts on the new Bond film, Skyfall. &quot;It pushes a lot of buttons in a lot of people,&quot; he said, &quot;it's certainly the best Bond film they could have made in the year 2012.&quot; To that end, Benson pointed to the &quot;legacy of Bond&quot; and how, over the years, the style of the films have evolved with each actor who played the legendary spy as well as the mood of society at the time. During his appearance, Benson also talked about how his book, The Man with the Red Tattoo, inspired the creation of a Bond museum in Japan &quot;dedicated to the novel.&quot;\nRabies\n\nIn the second half hour, journalist, Bill Wasik, and veterinarian, Monica Murphy, discussed the history, science, and cultural mythology of rabies. Noting that the disease has been recorded in historical accounts dating back to the origins of human writing, Wasik surmised that the terror associated with rabies lies in the fact that it can be seen passing from animals to humans and often originates from domesticated dogs. Since the overt symptoms of rabies may not be visible in animals infected with the disease, Murphy warned that &quot;any wildlife that's acting strangely&quot; should be a sign to call authorities for help.\nWebsite(s):\n\n    timothylobrien.com\n    billwasik.com\n    raymondbenson.com\n\nBook(s):\n\n    The Lincoln Conspiracy\n    Rabid: A Cultural History of the World's Most Diabolical Virus\n    The Black Stiletto: Black and White\n\n","torrent":{"xt":"urn:btih:f44183a841826b509cf105ae66bc11e619b3dbcd","amp;dn":"Coast+to+Coast+AM+December+09+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44183a841826b509cf105ae66bc11e619b3dbcd","infoHashBuffer":{"type":"Buffer","data":[244,65,131,168,65,130,107,80,156,241,5,174,102,188,17,230,25,179,219,205]},"announce":[],"urlList":[]}}