{"title":"Agatha Christie's Marple (2013) Series 06 - 3 SD Episodes","uid":11060141,"size":2288387227,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f4b09fc5b1f45bc5eb890677533d522889a2adfe&amp;dn=Agatha+Christie%27s+Marple+%282013%29+Series+06+-+3+SD+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bnaron","files":-1,"time":1411158441,"description":"Agatha Christie's Marple (2013) Series 06 - 3 SD Episodes\n\n\nSeries Description Courtesy Of:\n\nFrom Wikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Agatha_Christie's_Marple&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Agatha_Christie's_Marple&lt;/a&gt;\n\n\nAgatha Christie's Marple (or simply Marple) is a British ITV television series based on the books and short stories by British crime novelist Agatha Christie. The title character was played by Geraldine McEwan from the first to third series, until her retirement from the role, and by Julia McKenzie from the fourth series onwards.\n\nEach series consists of four feature-length episodes, except series six which only has three episodes. The first six episodes were all adaptations of Miss Marple novels by Christie. Subsequent episodes were derived both from works featuring Miss Marple but also Christie novels that did not feature the character. The title of the series removes the word Miss from Miss Marple, to match the title of the Agatha Christie's Poirot series.\n\nFollowing the conclusion of the sixth series, it was announced that the BBC had acquired the rights for the production of Agatha Christie adaptations, suggesting that ITV would be unable to make a seventh series of Marple.\n\n\nEpisode Descriptions Courtesy Of:\n\nThe On-Line Television Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com/?tab=series&amp;id=78895&amp;lid=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com/?tab=series&amp;id=78895&amp;lid=7&lt;/a&gt;\n\n\n2013-06-16 - A Caribbean Mystery (Video:H264 854x480, 579kbps, 25fps - Audio:AAC 44.1kHz, 99kbps)\n\n&quot;Would you like to see a picture of a murderer?&quot;, Jane Marple is asked by Major Palgrave whilst on a luxurious holiday in the West Indies. When she replies that she would like to hear the story, he explains. There once was a man who had a wife who tried to hang herself, but failed. Then she tried again later, and succeeded in killing herself. The man remarried to a woman who then tried to gas herself to death. She failed, but then tried again later and succeeded. Just as Major Palgrave is about to show the picture to her, he looks over her shoulder, appears startled, and changes the subject. The next morning, a servant, Victoria Johnson, finds him dead in his room. Doctor Graham concludes that the man died of heart failure; he showed all the symptoms, and had a bottle of serenite (a drug for high blood pressure) on his table.\n\n\n2013-06-23 - Greenshaw's Folly (Video:H264 1280x720, 852kbps, 25fps - Audio:AAC 44.1kHz, 99kbps)\n\nMiss Marple is given the responsibility of hiding a young mother and son from danger, so she takes them to the sprawling Greenshaw's Folly, owned by an old friend and botanist who is the last surviving member of the Greenshaw family. But the spinster sleuth soon has second thoughts about her decision when bad things start happening. First the Folly's butler dies in an apparent accident. Then a guest staying there vanishes without a word. Everything culminates in the brutal murder of Miss Greenshaw herself, and Miss Marple is left with a myriad of secrets and suspects to sift through.\n\n\n2013-12-29 - Endless Night (Video:H264 1280x720, 1701kbps, 25fps - Audio:AAC 44.1kHz, 106kbps)\n\nWhile consoling her recently widowed friend Marjorie, Miss Marple crosses paths with the handsome Mike Rogers, a young worker with a penchant for daydreaming about his future, more specifically about the perfect house he would live.\n\n\n","torrent":{"xt":"urn:btih:f4b09fc5b1f45bc5eb890677533d522889a2adfe","amp;dn":"Agatha+Christie%27s+Marple+%282013%29+Series+06+-+3+SD+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4b09fc5b1f45bc5eb890677533d522889a2adfe","infoHashBuffer":{"type":"Buffer","data":[244,176,159,197,177,244,91,197,235,137,6,119,83,61,82,40,137,162,173,254]},"announce":[],"urlList":[]}}