{"title":"Hermann Hesse - Nobel Prize in Literature, 1946 (34 books)","uid":12012210,"size":117186694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4ea54a2b3290ed7f4814aecb593f1c36e2bf6f6&amp;dn=Hermann+Hesse+-+Nobel+Prize+in+Literature%2C+1946+%2834+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":90,"time":1434228394,"description":"\nHERMANN HESSE (1877-1962) was a German poet, novelist, and painter.  He received the 1946 Nobel Prize in Literature &quot;for his inspired writings which, while growing in boldness and penetration, exemplify the classical humanitarian ideals and high qualities of style.&quot;\n\nHesse's main theme deals with man's breaking out of the established modes of civilization to find his authentic self.  With their celebration of self-realization and Eastern modes of spirituality, Hesse's works posthumously became huge bestsellers in the English-speaking world because they resonated with some of the ideas articulated in the counter-culture movement of the 1960s.  In the space of just a few years, Hesse became the most widely read and translated European author of the 20th century.\n\nHesse's first great novel, PETER CAMENZIND (1904), about a failed and dissipated writer was received enthusiastically by young Germans desiring a different and more &quot;natural&quot; way of life at the time of great economic and technological progress in the country.  The inward and outward search of the artist is further explored in GERTRUDE (1910) and ROSSHALDE (1914).  A visit to India in these years was later reflected in SIDDHARTHA (1922), a poetic novel set in India at the time of the Buddha, about the search for enlightenment.\n\nDuring World War I, Hesse lived in neutral Switzerland, writing denunciations of militarism and nationalism (IF THE WAR GOES ON).  A deepening sense of personal crisis led Hesse to Jungian psychoanalysis, the influence of which appears in DEMIAN (1919), an examination of the achievement of self-awareness by a troubled adolescent.  This novel had a pervasive effect on a troubled Germany and made its author famous. Hesse's later work shows his interest in Jungian concepts of introversion and extraversion, the collective unconscious, idealism, and symbols.\n\nThe duality of man's nature preoccupied Hesse throughout the rest of his career.  STEPPENWOLF (1927) describes the conflict between bourgeois acceptance and spiritual self-realization in a middle-aged man.  In NARCISSUS AND GOLDMUND (1930), an intellectual ascetic who is content with established religious faith is contrasted with an artistic sensualist pursuing his own form of salvation.  In his last and longest novel, THE GLASS BEAD GAME (1943; also published as MAGISTER LUDI), Hesse again explores the dualism of the contemplative and the active life, this time in the disciplined intellectual world of Castalia and through the figure of a supremely gifted intellectual.\n\nThis is a revised and expanded version of an earlier collection that encompasses Hesse's novels, short stories, poetry, essays, and letters.  A number of the PDFs have been reprocessed and many new ePUB editions added.\n\n\nThe following books are in PDF or ePUB format as indicated:\n\n\n                                   == Novels ==\n\n* BENEATH THE WHEEL (Bantam, 1970 / Picador, 2003).  Translated by Michael Roloff. -- PDF + ePUB\n\n* DEMIAN (Dover, 2002).  Bilingual edition edited and translated by Stanley Appelbaum. -- ePUB\n\n* DEMIAN (Bantam, 1970).  Translated by Michael Roloff and Michael Lebeck. -- PDF\n\n* DEMIAN (Penguin Classics, 2013).  Translated by Damion Searls with a Foreword by James Franco and Introduction by Ralph Freedman. -- ePUB\n\n* GERTRUDE (Coyote Canyon, 2012).  Translated by Adele Lewisohn. -- ePUB\n\n* GERTRUDE (FSG, 1969 / Picador, 2012).  Translated by Hilda Rosner. -- PDF + ePUB\n\n* JOURNEY TO THE EAST (Bantam, 1972 / Picador, 2013).  Translated by Hilda Rosner. -- PDF + ePUB\n\n* KNULP: Three Tales from the Life of Knulp (Picador, 2012).  Translated by Ralph Manheim. -- ePUB\n\n* MAGISTER LUDI (The Bead Game) (Frederick Ungar, 1949).  Translated by Mervyn Savill. -- PDF\n\n* MAGISTER LUDI (The Glass Bead Game) (Bantam, 1970 / Picador, 2012).  Translated by Richard and Clara Winston. -- PDF + ePUB\n\n* NARCISSUS AND GOLDMUND (Bantam, 1971 / Picador, 2012).  Translated by Ursule Molinaro. -- PDF + ePUB\n\n* PETER CAMENZIND (FSG, 1969 / Picador, 2003).  Translated by Michael Roloff. -- PDF + ePUB\n\n* THE PRODIGY (Peter Owen, 1957).  Translated by W. J. Strachan. -- PDF\n\n* ROSSHALDE (FSG, 1970 / Picador, 2003).  Translated by Ralph Manheim. -- PDF + ePUB\n\n* SIDDHARTHA: An Indian Poem (Modern Library, 2006).  Translated by Susan Bernofsky with an Introduction by Tom Robbins. -- ePUB\n\n* SIDDHARTHA (HarperPerennial, 2013).  Translator unknown. -- ePUB\n\n* SIDDHARTHA (New Directions, 1951).  Translated by Hilda Rosner. -- PDF\n\n* SIDDHARTHA (Penguin, 1999).  Translated by Joachim Neugroschel. -- PDF\n\n* STEPPENWOLF (Penguin, 1965).  Translated by Basil Creighton, revised by Walter Sorell. -- PDF\n\n* STEPPENWOLF (Picador, 2002).  Translated by Basil Creighton, revised by Joseph Mileck. --ePUB\n\n* STEPPENWOLF (Penguin Classics, 2012).  Translated with an Afterword by David Horrocks. -- ePUB\n\n\n                                 == Short Stories ==\n\n* THE FAIRY TALES OF HERMANN HESSE (Bantam, 1995).  Translated with an Introduction by Jack Zipes. -- ePUB\n\n* KLINGSOR'S LAST SUMMER (FSG, 1970 / Picador, 2013).  Translated by Richard and Clara Winston. -- PDF + ePUB\n\n* PICTOR'S METAMORPHOSES &amp; OTHER FANTASIES (FSG, 1982 / Picador, 2012).  Translated by Rika Lesser with Illustrations by the Author; edited with an Introduction by Theodore Ziolkowshi. -- PDF + ePUB\n\n* STORIES OF FIVE DECADES (FSG, 1972 / 2012).  Edited with an Introduction by Theodore Ziolkowski.  Translated by Ralph Manheim, with two stories translated by Denver Lindley. -- PDF + ePUB\n\n* STRANGE NEWS FROM ANOTHER STAR &amp; Other Tales (FSG, 1972).  Translated by Denver Lindley. -- ePUB\n\n* TALES OF STUDENT LIFE (FSG, 1976).    Edited with an Introduction by Theodore Ziolkowski.  Translated by Ralph Manheim. -- PDF\n\n\n                                   ==  Poetry ==\n \n* CRISIS: Pages From a Diary (FSG, 2013).  Bilingual edition translated by Ralph Manheim. -- ePUB\n\n* POEMS (FSG, 1970).  Selected and translated by James Wright. -- PDF + ePUB\n\n\n                                  == Anthologies ==\n\n* HYMN TO OLD AGE (Pushkin Press, 2011).  Translated by David Henry Wilson. -- ePUB\n\n* THE SEASONS OF THE SOUL: The Poetic Guidance and Spiritual Wisdom of Hermann Hesse (North Atlantic, 2011).  Translation and Commentary by Ludwig Max Fischer. -- ePUB\n\n\n                        == Essays, Letters &amp; Autobiographical ==\n\n* HERMANN HESSE: A PICTORIAL BIOGRAPHY, Including Hesse's &quot;Life Story Briefly Told&quot; (FSG, 1975).  Edited by Volker Michels; translated by Theodore and Yetta Ziolkowski. -- ePUB\n\n* IF THE WAR GOES ON...: Reflections on War and Politics (Picador, 2012).  Translated by Ralph Manheim. -- ePUB\n\n* SOUL OF THE AGE: Selected Letters of Hermann Hesse (FSG, 1991).  Edited with an Introduction by Theodore Ziolkowski; Translated by Mark Harman. -- ePUB\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n          &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:f4ea54a2b3290ed7f4814aecb593f1c36e2bf6f6","amp;dn":"Hermann+Hesse+-+Nobel+Prize+in+Literature%2C+1946+%2834+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4ea54a2b3290ed7f4814aecb593f1c36e2bf6f6","infoHashBuffer":{"type":"Buffer","data":[244,234,84,162,179,41,14,215,244,129,74,236,181,147,241,195,110,43,246,246]},"announce":[],"urlList":[]}}