{"title":"Absence of Malice - 1981 Drama - Paul Newman, Sally Field","uid":6862255,"size":1485615162,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f50f313907c8daea6d2d2094af0c2f67b9a7631c&amp;dn=Absence+of+Malice+-+1981+Drama+-+Paul+Newman%2C+Sally+Field&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1322941903,"description":"Absence of Malice - 1981 Drama - Paul Newman, Sally Field\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1485kbps \nDuration.............: 1:56:13\nResolution...........: 800*456 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,471,664,862 \nSUBTITLES............: English, Spanish, French\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0081974/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0081974/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Absence_of_Malice&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Absence_of_Malice&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/PAllKAadD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAllKAadD&lt;/a&gt;\n\n\nAbsence of Malice is a 1981 American drama film starring Paul Newman, Sally Field, and Bob Balaban, directed by Sydney Pollack. \n\nMiami liquor wholesaler Michael Gallagher (Newman) is the son of a deceased criminal who awakes one day to find himself a front-page story in the local newspaper, indicating that he is being investigated in the murder of a local longshoreman union official, Joey Diaz.\n\nThe story was written by Miami Standard newspaper reporter Megan Carter (Field), who reads it from a file, left intentionally, on the desktop of federal prosecutor Elliot Rosen (Bob Balaban). As it turns out, Rosen is trying to squeeze Gallagher for information.\n\nGallagher comes to the newspaper's office trying to discover the basis for the story, but Carter does not reveal her source. Gallagher's business is shut down by union officials who are now suspicious of him, having been implicated in Diaz's murder. Local crime boss Malderone, Gallagher's uncle, has him followed, just in case he talks to the government.\n\nTeresa Peron (Melinda Dillon), a lifelong friend of Gallagher, tells the reporter that Gallagher couldn't have killed Diaz because he was taking her out of town for an abortion on that weekend. A devout Catholic, she doesn't want Carter to reveal this publicly but Carter prints the story anyway. When the paper comes out the next morning, Peron is so ashamed, she steals newspapers from the yards of her neighbors.\n\nThe paper's editor McAdam tells Carter that Peron has committed suicide. Carter goes to Gallagher to apologize, but an enraged Gallagher assaults her. Nevertheless, she attempts to make it up to him by revealing Rosen's role in the investigation.\n\nGallagher hatches a plan for revenge. He arranges a secret meeting with District Attorney Quinn, offering to use his organized-crime contacts to give Quinn exclusive information on Diaz's murder, in exchange for the D.A. calling off the investigation and issuing a public statement clearing him. Both before his meeting with Quinn and after Quinn's public statement, Gallagher makes significant anonymous contributions to one of Quinn's political action committee backers. Gallagher, thankful for Carter's help, also begins a love affair with her.\n\nRosen is mystified by Quinn's exoneration of Gallagher, so he places phone taps on both and begins a surveillance of their movements. He and federal agent Bob Waddell obtain evidence of Gallagher's donations to Quinn's political committee. They also find out about Gallagher and Carter's relationship.\n\nWaddell, as a friend, warns Carter about the investigation to keep her out of trouble but she breaks the story that the office of the district attorney (D.A.) is investigating Gallagher's attempt to bribe the D.A.\n\nThe story makes the front page again and causes a huge uproar. The US Assistant Attorney General Wells (Wilford Brimley) ultimately calls all of the principals together. He discovers that Rosen illegally leaked information about the investigation into Gallagher's activities to the press, and fires him, and suggests that Quinn resign. (Gallagher's donations to Quinn's political committee, though not illegal, cast suspicions on Quinn's motives in issuing his statement clearing Gallagher.) Wells apparently is well-aware that Gallagher set Quinn up, but cannot prove it, so he does not investigate further. The newspaper prints a story (not written by Carter) revealing the entire truth about the incidents. It is unclear whether or not Carter keeps her job, or whether or not Carter's relationship with Gallagher will continue, but the final scene shows them having a friendly conversation on the wharf where Gallagher's boat is docked.\n\nCast\n\nPaul Newman  \tMichael Gallagher\nSally Field  \tMegan Carter\nBob Balaban  \tElliott Rosen\nMelinda Dillon  Teresa Peron\nLuther Adler  \tMalderone\nBarry Primus  \tWaddell\nJosef Sommer  \tMcAdam\nDon Hood  \tQuinn\nWilford Brimley Assistant U.S. Attorney General James A. Wells","torrent":{"xt":"urn:btih:f50f313907c8daea6d2d2094af0c2f67b9a7631c","amp;dn":"Absence+of+Malice+-+1981+Drama+-+Paul+Newman%2C+Sally+Field","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f50f313907c8daea6d2d2094af0c2f67b9a7631c","infoHashBuffer":{"type":"Buffer","data":[245,15,49,57,7,200,218,234,109,45,32,148,175,12,47,103,185,167,99,28]},"announce":[],"urlList":[]}}