{"title":"Harry Connick Jr. - Smokey Mary (2013)","uid":8116402,"size":107981659,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f52e0b67eaa68ac512dd4ca450a0645bb36ff7d7&amp;dn=Harry+Connick+Jr.+-+Smokey+Mary+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1360310362,"description":"320 mp3\n\nTracklist:\n\n01. Smokey Mary\n02. Hurricane\n03. Cuddina Done It\n04. Wish I Were Him\n05. S'pposed To Be\n06. The Preacher\n07. Dang You Pretty\n08. Angola (At The Farm)\n09. Nola Girl\n10. Mind On The Matter\n11. City Beneath The Sea\n\nNamed after the famed Mardi Gras train-engine parade float, singer/pianist Harry Connick, Jr.'s funk-oriented 2013 studio album Smokey Mary coincides with the 20th anniversary of the Krewe of Orpheus, the Mardi Gras super krewe that Connick co-founded in 1993. Perhaps Mardi Gras puts Connick in a funky mood, because the year after founding Krewe of Orpheus, he delivered the funk, pop, and soul album She. For the neo-crooner's fans, his musical turnabout tended to divide them into two camps: those who love Connick whether jazzy or funky (or onscreen as an actor), and those who prefer the New Orleans native to stick to jazz standards and barroom stride. Either way, ever since She, Connick has now and again dabbled in funk. At face value, he may seem like a good fit for funk -- it is New Orleans' other longstanding music tradition after jazz and brass bands and, for a white dude, Connick has a relatively natural-sounding drawl (necessary for funk phrasing). That said, his innate cheerfulness can come off as a little douchey when paired with wah-wah guitars and electric bass. Also, this music doesn't leave him much room to solo, which is never going to sit well with fans who came to his music through his early jazz releases. Connick is best at playing funk when he combines it with the more roiling, bluesy aspects of New Orleans jazz, and a danceable groove, as on the organ-heavy opener &quot;Smokey Mary Boogie Woogie Choo Choo Train,&quot; and the second-line, gospel-inflected number &quot;S'pposed to Be&quot; featuring vocalist Tara Alexander. Elsewhere on Smokey Mary, Connick delves into a handful of original contemporary R&amp;B-sounding numbers including &quot;Wish I Were Him,&quot; &quot;Dang You Pretty,&quot; and &quot;Angola (At the Farm).&quot; Helping bring out the album's high-energy party vibe is his stellar backing ensemble, including such stand-out musicians as Preservation Hall trumpeter Mark Braud, trombonist Lucien Barbarin, saxophonist Branford Marsalis, and percussionist Bill Summers, among others. Ultimately, Connick doing his funk thing won't float everyone's boat, but for longtime fans, Smokey Mary will probably play like the passing parade float it is named after, a lot of colorful, shiny fun. ","torrent":{"xt":"urn:btih:f52e0b67eaa68ac512dd4ca450a0645bb36ff7d7","amp;dn":"Harry+Connick+Jr.+-+Smokey+Mary+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f52e0b67eaa68ac512dd4ca450a0645bb36ff7d7","infoHashBuffer":{"type":"Buffer","data":[245,46,11,103,234,166,138,197,18,221,76,164,80,160,100,91,179,111,247,215]},"announce":[],"urlList":[]}}