{"title":"OST-Empire Records 320k  mp3  CBR    ak2014","uid":10536363,"size":127958244,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f63cbe8aade825442751fb5bf6421afed6c8e661&amp;dn=OST-Empire+Records+320k++mp3++CBR++++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":15,"time":1405173570,"description":"OST-Empire Records 320k  mp3  CBR ak2014 What we found.....The soundtrack album for Empire Records was originally attached to Atlantic Records an affiliate of Warner Bros, Warner Bros having a distribution pact with the film's producers Regency Enterprises. However the soundtrack album was given to A&amp;M Records in order to obtain the participation of A&amp;M artists the Gin Blossoms whose track &quot;Til I Hear It from You&quot; was issued as lead single: besides the Gin Blossoms four other A&amp;M acts had new tracks released on the Empire Records soundtrack album, namely Ape Hangers, Drill, Innocence Mission, and Lustre.\n\nThe Empire Records soundtrack album also introduced tracks by Better Than Ezra, Cracker, the Cranberries, Evan Dando (whose &quot;The Ballad of El Goodo&quot; featured Empire Records female lead Liv Tyler on background vocals), and Toad The Wet Sprocket, and by unsigned acts the Martinis, Please, and Coyote Shivers. The Martinis - featuring former Pixies members Joey Santiago and Dave Lovering - were recommended by Hits magazine president Karen Glauber who was musical consultant for Empire Records, while the film's line music supervisor Bob Knickman discovered Please by searching the internet for unsigned talent suitable for the Empire Records soundtrack. Coyote Shivers, who played aspiring musician turned store clerk Benko in the film, became involved in the Empire Records project by virtue of being the stepfather of the film's star Liv Tyler, Shivers being then married to Tyler's mother Bebe Buell.\n\nTwo previously released tracks were also included on the original release of the Empire Records soundtrack album, namely &quot;A Girl Like You&quot; by Edwyn Collins and &quot;Ready, Steady, Go&quot; by the Meices  (the latter's frontman Joe Reineke subsequently led Alien Crime Syndicate). &quot;The Honeymoon Is Over&quot; by the Cruel Sea, a track heard in the film not featured on the US release of the Empire Records soundtrack album, was included on the Empire Records soundtrack album in its release in Australia and Germany.\n\nThe Gin Blossoms' &quot;Til I Hear It From You&quot; charted as high as #11 affording the band their first Top 20 hit. Two other tracks from the Empire Records soundtrack album had a single release: Edwyn Collins' &quot;A Girl Like You&quot; which charted at #32, and the Ape Hangers' &quot;I Don't Want to Live Today&quot;.\n\nThe Empire Records soundtrack album peaked at #63 on the album chart.\nTrack listing\n\n    &quot;Til I Hear It from You&quot; by Gin Blossoms\n    &quot;Liar&quot; by The Cranberries\n    &quot;A Girl Like You&quot; by Edwyn Collins\n    &quot;Free&quot; by The Martinis\n    &quot;Crazy Life&quot; by Toad the Wet Sprocket\n    &quot;Bright As Yellow&quot; by The Innocence Mission\n    &quot;Circle of Friends&quot; by Better Than Ezra\n    &quot;I Don't Want to Live Today&quot; by Ape Hangers\n    &quot;Whole Lotta Trouble&quot; by Cracker\n    &quot;Ready, Steady, Go&quot; by The Meices\n    &quot;What You Are&quot; by Drill\n    &quot;Nice Overalls&quot; by Lustre\n    &quot;Here It Comes Again&quot; by Please\n    &quot;The Ballad of El Goodo&quot; by Evan Dando\n    &quot;Sugarhigh&quot; by Coyote Shivers\n    &quot;The Honeymoon Is Over&quot; by The Cruel Sea (Australian and German edition)\n\nSongs in the film not listed on soundtrack\n\n    &quot;Can't Stop Losing Myself&quot; by Dirt Clods\n    &quot;Hey Joe&quot; by Dirt Clods\n    &quot;Dark and Brooding&quot; by Noah Stone\n    &quot;Thorn in My Side&quot; by Quicksand\n    &quot;Little Bastard&quot; by Ass Ponys (as Ass Ponies)\n    &quot;I Don't Know Why&quot; by Sacrilicious\n    &quot;Real&quot; by Real\n    &quot;If You Want Blood (You've Got It)&quot; by AC/DC\n    &quot;Counting Blue Cars&quot; by Dishwalla\n    &quot;Snakeface&quot; by Throwing Muses\n    &quot;Candy&quot; by Full Tilt Gonzo\n    &quot;How&quot; by The Cranberries\n    &quot;Hardlight&quot; by Peg Boy\n    &quot;Chew Toy&quot; by Fig Dish\n    &quot;Power Shack&quot; by Fitz of Depression\n    &quot;Saddam A Go-Go&quot; by Gwar\n    &quot;Backdown Blues&quot; by Loose Diamonds\n    &quot;Tomorrow&quot; by Mouth Music\n    &quot;Plowed&quot; by Sponge\n    &quot;Surround You&quot; by Billy White Trio\n    &quot;L.A. Girl&quot; by Adolescents\n    &quot;Seems&quot; by Queen Sarah Saturday\n    &quot;Vinyl Advice&quot; by Dead Hot Workshop\n    &quot;This is the Day&quot; by The The\n    &quot;Say No More (Mon Amour)&quot; by Maxwell Caulfield as Rex Manning (written for the film)\n    &quot;She Walks&quot; by Poster Children\n    &quot;Sorry&quot; by Sybil Vane\n    &quot;Infinity&quot; by Mouth Music\n    &quot;Money (That's What I Want)&quot; by Flying Lizards\n    &quot;Sugar High (ft. Renee Zellweger)&quot; by Coyote Shivers\n    &quot;Seems&quot; by Queen Sarah Saturday\n    &quot;Romeo and Juliet&quot; by Dire Straits\n    &quot;Video Killed the Radio Star&quot; by The Buggles\n    &quot;I Shot the Devil&quot; by Suicidal Tendencies\n    &quot;Rock 'n' Roll/EGA&quot; by Daniel Johnston\n\nThat sounds like a accurate rundown to bad some of tracks did not make it to to this compilation, Anyway Empire records. Bizarre idea selling music?                                                                           ","torrent":{"xt":"urn:btih:f63cbe8aade825442751fb5bf6421afed6c8e661","amp;dn":"OST-Empire+Records+320k++mp3++CBR++++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f63cbe8aade825442751fb5bf6421afed6c8e661","infoHashBuffer":{"type":"Buffer","data":[246,60,190,138,173,232,37,68,39,81,251,91,246,66,26,254,214,200,230,97]},"announce":[],"urlList":[]}}