{"title":"VideoGlide OS X 1.4.0.sitx","uid":4912299,"size":2016937,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f706061f958cfcb4d051741ab3513a371fd72e95&amp;dn=VideoGlide+OS+X+1.4.0.sitx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tonyj5151","files":1,"time":1243229759,"description":"\tVIDEOGLIDE\nSupported Devices:\n\nClick the product names to open a new window listing possible sources for the hardware. Be sure to consider USB hardware only. VideoGlide does not support PCI devices.\n\n XLR8 ProView and XtraView*\n Pinnacle Dazzle DVC-90 and DVC-100**\n KWorld DVD Maker USB 2.0\n LinXcel Video Grabber***\n VideoHome GrabBeeX\n Plextor ConvertX PX-AV100U and PX-AV200U\n LG Electronics GSA-5169D DVD-RW\nYakumo MovieMixer (info)\nAcutronic Spectral (info)\nPixelView Play TV Box 4**** (info)\nDATOptic DigiREC**** (info)\nGeniatech HandyCap (Pro) (info)\n XCM V-Box For WII (info)\nKonig CMP-USBVG4\nEx-Pro USB 2.0 Video / Audio Grabber Editor\nTevion or Zolid\n  Sold by Aldi supermarkets branded in combinations of: Xpert, Hi Speed, High Speed,\n  DVD Maker, DVD Grabber, DVD Creator, VS2800, VS-2800, VS-USB2800D etc.\nEasyCAP009, EasyCap DC60+\n  Warning: These devices are extremely difficult to distinguish from the EasyCAP DC60\n  which is not supported. For this reason EchoFX does not recommend this device. \n\nIn general, VideoGlide devices have one s-video input and one composite input. TV-tuner style devices have only one s-video input. If this matches the technical description of your device, it may be a VideoGlide device.\n\nThe first customer to identify any new device about which we are not aware will receive the VideoGlide software for free.\n\n  * The Daystar Technology XLR8 ProView and XLR8 XtraView include full Mac OS X support.\n      There is no need to purchase the VideoGlide software separately from EchoFX.\n  ** USB 2.0 devices only. Use EchoFX USBVision software for USB 1.1 devices.\n  *** LinXcel devices capture only 320 horizontally. The video is interpolated to 640.\n  **** s-video and/or composite inputs only. Built-in TV tuner not supported.\n\nHighlights:\n\n- supports a wide range of USB 2.0 video capture devices.\n- 640 x 480, 29.97 frames per second NTSC video capture.\n- 640 x 480, 25 frames per second PAL/SECAM video capture.\n- supports composite and s-video formats.\n- high contrast, high quality video -better than DV at the same size.\n- excellent audio/video synchronization.\n- uncompressed YUV format: 66.5 GB per hour for video and audio.\n- compressed JPEG format: 3 GB per hour for video and audio.\n- 640 x 480 single frame capture.\n- audio support up to 48 KHz 16-bit stereo for devices that have audio input.\n- multiple device support for webcam and surveillance applications.\n- Auto-Detect Input And Format, to automatically adapt to the current video source.\n- easy to use, AppleScript enabled capture software with fast full screen playback.\n- software to export movies to any QuickTime supported format, including DV and H.264.\n- compatible with a large number of third-party applications.\n\nGeneral:\n\nVideoGlide devices have been sold by various manufacturers since 1998. Manufacturers include Pinnacle, KWorld, LinXcel, VideoHome and many others. Devices originally sold as PC-only are also supported. Compatibility can be checked using the VideoGlide For Mac OS X demo mode. Simply click the &quot;Download&quot; button on the right, and install and run the software. \n\nVideoGlide devices allow the capture of video from almost any video source including VCRs, cam-corders, DVD players, personal video recorders, digital cameras, etc. \n\nVideoGlide devices accept either s-video or composite video sources and will work with the broadcast standards NTSC, PAL and SECAM found throughout most of the world.\n\nVideo from VideoGlide devices can be used in a variety of ways. For example, you can record your favorite home-movies and clips to keep handy on your computer. It can be used with web-cam software to upload an image to the Internet periodically. It can be used with web-streaming software to create online broadcasts of live or prerecorded events. Live-video chat is possible with the appropriate software. Captured movies can be put on a CD or a website for viewing by anyone with a CD player or Internet access. It can be used for motion-detection applications, or by clay-mation hobbyists. For a summary of some of the supported third-party software and where to obtain it, check the &quot;Applications&quot; page.\n\nThe VideoGlide software is capable of capturing a maximum of 29.97 frames per second for NTSC or 25 frames per second for PAL. The maximum frame size is 640 x 480.\n\nThe captured video quality is extremely good, with brighter colors and better contrast than typical DV captures. Video and audio synchronization is excellent, even with extremely long captures. Captured movies require only 66.5 GB of disk storage per hour of uncompressed yuv video. Using the recommended JPEG compression requires only 3 GB of storage per hour.\n\nIn addition to video, the VideoGlide software is able to capture still images with a resolution of 640 x 480.\n\nSome VideoGlide devices come with audio inputs. These audio inputs are occassionally rerouted to the Mac microphone port, in which case the audio sample rate is as good as the Mac can provide; typically 44.1 KHz 16-bit stereo. In other cases, audio is brought in over USB along with the video. These devices support up to 48 KHz 16-bit stereo.\n\nThe VideoGlide software supports multiple devices, i.e. more than one device can be plugged in and used at the same time. This is particularly useful with security applications like Ben Bird's SecuritySpy. It can also allow multiple simultaneous broadcasts from the same machine using webcam software like Econ Technologies' ImageCaster. Note that one serial number per device will be required, i.e. to enable 3 devices, 3 serial numbers must be purchased. Note that a stock machine with no additional USB 2.0 PCI cards can run only two devices simultaneously, and one of those must be at 320 x 240. Adding USB 2.0 expansion cards can increase the number of devices that can run simultaneously, and the frame sizes at which they can operate.\n\nAuto-Detect Input And Format allows video sources to be swapped in an and out dynamically without the need to inform the application that a change occurred. The VideoGlide software will automatically select the input carrying the video, as well as its format, for example PAL or NTSC.\n\nThe included VideoGlide Capture software will allow you to capture video from a VideoGlide device. It also has an extremely fast full-screen preview mode. VideoGlide is Apple-scriptable.\n\nThe included VideoGlide Export software will allow the export of QuickTime movies to any other QuickTime format including DV Streams required by iMovie and H.264 or MPEG-4 movies required by iTunes and video-enabled Pods. QuickTime Pro is not required.","torrent":{"xt":"urn:btih:f706061f958cfcb4d051741ab3513a371fd72e95","amp;dn":"VideoGlide+OS+X+1.4.0.sitx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f706061f958cfcb4d051741ab3513a371fd72e95","infoHashBuffer":{"type":"Buffer","data":[247,6,6,31,149,140,252,180,208,81,116,26,179,81,58,55,31,215,46,149]},"announce":[],"urlList":[]}}