{"title":"Kung Fu Panda (1C) Installed/Ripped","uid":4252337,"size":3678613594,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f72464ad7f8d24d6feab95806378c637194285c6&amp;dn=Kung+Fu+Panda+%281C%29+Installed%2FRipped&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KeD0_Panda","files":1,"time":1214071323,"description":"    In the Kung Fu Panda video game, players embark on an epic, action-packed adventure as they master the specialised Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13 legendary levels from the movie and beyond, and spanning land, water and air, players must work their way to become the Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles. Featuring a deep variety of gameplay, unique co-op and competitive multiplayer modes, collectibles, and a host of character upgrades, the Kung Fu Panda video game provides an experience gamers of all ages will enjoy.\n\n* Kung Fu Awesomeness: Players embark on a legendary journey to fulfill Po\\&amp;#039;s destiny to become the Dragon Warrior. Learn and master Po, Shifu and the Furious Five\\&amp;#039;s specialised Kung Fu fighting styles, abilities and upgrades in order to defeat formidable bosses like the Great Gorilla, the Wolf Sergeant and the ultimate enemy, Tai Lung.\n    * Bodacious Humor: Kung Fu Panda\\&amp;#039;s unique brand of humor, quick-witted dialogue and hilarious situations bring the game to life for players of all ages to enjoy.\n    * Play as all Your Favorite Characters: Gamers learn to utilise the special abilities and combat skills of Po, Shifu, Monkey, Tigress, Viper, Crane and Mantis. As gameplay progresses, unlock and experience each character\\&amp;#039;s special moves and upgrades.\n    * Relive the Movie and Go Beyond With Exclusive Content: Experience favourite moments based on the film and discover never-before-seen, game-exclusive content co-created by DreamWorks Animation and Activision including a variety of environments, such as the mystical Lotus Lake, and characters, like the baddest ninja cats around, the Wu Sisters.\n    * Experience 13 Legendary Levels: Players traverse 13 multi-stage levels from the movie and beyond, spanning air, water and land, to battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles.\n    * Join Friends in Multiplayer Action and Co-op Mode: Gamers can go head-to-head against friends across a wide variety of battle arenas with their favourite characters including Po and the Furious Five, Tai Lung, the ferocious Ox and others. Players can also team up in co-operative mode to work through a series of unique challenges and defeat dangerous enemies.\n\n\nO6JIowka )) &lt;a href=&quot;\nhttp://image.com.com/gamespot/images/bigboxshots/7/945337_100418_front.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.com.com/gamespot/images/bigboxshots/7/945337_100418_front.jpg&lt;/a&gt;\n\nnpuBeT 1C :*)","torrent":{"xt":"urn:btih:f72464ad7f8d24d6feab95806378c637194285c6","amp;dn":"Kung+Fu+Panda+%281C%29+Installed%2FRipped","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72464ad7f8d24d6feab95806378c637194285c6","infoHashBuffer":{"type":"Buffer","data":[247,36,100,173,127,141,36,214,254,171,149,128,99,120,198,55,25,66,133,198]},"announce":[],"urlList":[]}}