{"title":"Hidden and Dangerous Super Collection","uid":10737842,"size":5958163112,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f7af0d2f7c7ced0348b4cab996741c24e0078aa5&amp;dn=Hidden+and+Dangerous+Super+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sacolt","files":371,"time":1407711197,"description":"Hidden &amp; Dangerous\n\nHidden &amp; Dangerous is a WWII 1999 computer and video game developed by Illusion Softworks and published by Take-Two Interactive and TalonSoft for Windows, the Dreamcast, and the PlayStation. The PlayStation port of the game was developed by Tarantula Studios. It is regarded as one of the pioneering tactical first/third person shooters.\n\nGameplay\nThe player controls an eight-man British Special Air Service (SAS) team executing a number of important missions during World War II. The game features soldier selection prior to each mission. A comprehensive load-out sequence is also available where players have access to a variety of weapons and equipment. Mission briefings outline objectives, intelligence on enemy strengths and recommended plans of advance. During missions, players can command directly by toggling through the soldiers in their squad, voice commands or a tactical map which allows for real time control or planned manoeuvres once the map is exited. Missions include, sabotage, search and destroy, POW rescue and resistance aid. Hidden and Dangerous features missions in Italy, Yugoslavia, Germany, Norway, the North Sea and Czechoslovakia. Despite certain historical liberties taken with actual SAS missions and time-lines, the game retains a degree of historical accuracy and intense atmosphere, including realistic wounding as squad members can be heavily wounded or killed by even brief enemy contact.\n\nExpansion\nAn expansion was released in 2000, titled Hidden &amp; Dangerous: Devil's Bridge in the US and Hidden &amp; Dangerous: Fight for Freedom in the UK. This added new soldiers, weapons and missions in new locations including Poland, the Ardennes and postwar Greece.\nA fully updated version of the game, Hidden &amp; Dangerous Deluxe, was released for free as a commercial promotion for the sequel Hidden &amp; Dangerous 2.[2] It is still available as freeware.\n\nHidden &amp; Dangerous 2\n\nHidden &amp; Dangerous 2 (abbreviated HD2) is a World War II, stealth based, tactical first and third person shooter. It centres on the British Special Air Service in operations behind Axis lines 1941-45.\nDeveloped by Illusion Softworks (which became 2K Czech) a subsidiary of 2K Games and published by Gathering of Developers and Take-Two Interactive (Take 2 in North America and Europe), with lead design by Radek Havlicek, officially announced on Tuesday, April 24, 2001. It is the second installment and the direct sequel to 2K Czech's predecessor Hidden &amp; Dangerous. Hidden &amp; Dangerous 2 was released on October 21, 2003 for Windows PCs.\nDevelopment for Hidden and Dangerous 2 was announced on April 24, 2001, two years  after the release of Hidden and Dangerous.\nGameplay\nHidden and Dangerous 2, like its predecessor, focuses on the British Special Air Service during the Second World War. It follows the same concept as the original tactical first/third person shooter. The game's LS3D engine was used by the game Mafia.\n\nGameplay elements such as the vocal commands, plan or real-time map control, vehicle usage, equipment selection and the first person mechanic were significantly enhanced from the original. The ability to take POWs, added enhanced stealth options for the player which include the acquisition of enemy uniforms. Mission types include, espionage, sabotage, search and destroy, town liberation, prisoner rescue, retrieval of enemy officers and documents, partisan assistance and assassination. The variety of locales include Norway, Libya, a Norwegian fjord, Burma, Austria, France and Czechoslovakia.\n\nThe expansion pack Sabre Squadron adds missions in France, Libya and Sicily. Some of the missions are modeled on real SAS exploits. However most of the game takes liberty with the historical time and place of SAS operations.[7] The missions are based on sandbox style game-play where players are free to roam a map and pursue objectives usually at their leisure and choice of sequence. A real time strategy mechanic also allows players to control events for staged sequential tactical maneuvers or through real time overhead command.\n\nCampaign mode\n\nThe campaign mode in Hidden &amp; Dangerous 2 allows for a single player only, playing as a lone wolf or a team leader. Players may choose from a roster of 30 men to comprise up to a four man team. Detailed mission briefings and full load-out inventory selection for each new campaign/mission. There are over twenty levels with missions in seven campaigns, set in Europe, Africa and Asia where the players visit many historical areas. The game does not possess an overarching narrative. Players can achieve promotions and decorations for bravery, successfully completed missions and/or specific objectives.\n\nMultiplayer\nHidden &amp; Dangerous 2 has a multiplayer mode that can be played via internet or local area network (up to 99 players). In 2012 Gamespy shut down their servers which hosted the multiplayer server list, A third party web app has been developed to keep players in the game. It can be found Here\n &lt;a href=&quot;\nhttp://www.rprclan.com/index.php/server-list&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rprclan.com/index.php/server-list&lt;/a&gt;\n\nExpansion\n\nAn expansion pack titled Sabre Squadron was released during October 19, 2004, in the US, introduced nine new single player missions, seven new multi-player maps, and a now finished, death-match map called &quot;Poland&quot;, which had been featured in the game's intro and was titled &quot;London&quot; and available for play in its unfinished state before this release, new weapons: the RPzB 54, the MAS-36, the G43, a suppressed P08 and a Harrington &amp; Richardson Mk VI flare pistol; the ability to hold your breath while looking through a telescopic sight, a co-operative multi-player mode, along with access to the original  Hidden and Dangerous 2 missions through Sabre Squadron's interface.","torrent":{"xt":"urn:btih:f7af0d2f7c7ced0348b4cab996741c24e0078aa5","amp;dn":"Hidden+and+Dangerous+Super+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7af0d2f7c7ced0348b4cab996741c24e0078aa5","infoHashBuffer":{"type":"Buffer","data":[247,175,13,47,124,124,237,3,72,180,202,185,150,116,28,36,224,7,138,165]},"announce":[],"urlList":[]}}