{"title":"New Marvel I Like 4-4-12","uid":7160495,"size":134336409,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f83d9756782a3455f51c9f59dfd53198c5e48c0e&amp;dn=New+Marvel+I+Like+4-4-12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":9,"time":1333594402,"description":"These are the Marvel comics I got from the week beginning 4/4/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 8 titles in this week's offering. All comics are either in CBR or CBZ format and are labelled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.\n\nAmazing Spider-Man #683 (CBR 4/4/2012)\n\nThe biggest movie stars of the summer team up as the amazing Spider-Man and the Avengers square off against Doc Ock and the Sinister Six! The world may be ready to buckle under and give in to Doctor Octopus' demands . . . But Spider-Man and his fellow Avengers sure ain't!\n\nAvengers vs X-Men Infinite #1 (One Shot) (CBR 4/4/2012)\n\nNo Description Availible (Digital One shot)\n\nAvengers vs. X-Men #1 (of 12) (CBR 4/4/2012)\n\nAvengers vs. X-Men is here: AvX! Marvel's epic event pits the two biggest superhero teams against each other in a battle you'll have to read to believe. Who will win? Stay tuned . . . \n\nDaredevil #10.1 (CBR 4/4/2012)\n\nIf you haven't climbed onboard the Daredevil express yet, this is a perfect jumping on point for the best reviewed series of the year! Pitting the Man Without Fear against a cabal of villainous secret societies sworn to bringing hornhead to his knees! Setting the stage for this month's Daredevil/Spider-Man/Punisher crossover &quot;The Omega Effect&quot;! \n\nAvengers Harley Davidson #1 (of 2) (CBR 4/4/2012)\n\nNo Description Availible\n\n**Secret Avengers #24 (CBR 4/4/2012)  (not sure but this is listed as this week and last)\n\nHawkeye's leadership put to the ultimate test after an Avenger dies! The Secret Avengers trapped in an automaton city in the center of the earth! Father and his descendants begin their plans to spread contagious robot evolution! A new Avenger joins to save our wayward squad, but will he get there in time? \n\nThunderbolts #172 (CBR 4/4/2012)\n\nIt had to happen--Thunderbolts v. Thunderbolts! Years ago, in the wake of the world's battle with Onslaught, the Thunderbolts were formed to protect a planet devoid of heroes--but they were villains in disguise! Now, the 'Bolts of the modern day come crashing into their earliest days--and will make a decision that may destroy the Marvel U--or save it! Part 1 of 3! \n\nUltimate Comics Spider-Man #9 (CBR 4/4/2012)\n\nThe police have Miles squarely in their sights! Prowler versus the Scorpion! Is the secret of the new Spider-Man out?! \n\n","torrent":{"xt":"urn:btih:f83d9756782a3455f51c9f59dfd53198c5e48c0e","amp;dn":"New+Marvel+I+Like+4-4-12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f83d9756782a3455f51c9f59dfd53198c5e48c0e","infoHashBuffer":{"type":"Buffer","data":[248,61,151,86,120,42,52,85,245,28,159,89,223,213,49,152,197,228,140,14]},"announce":[],"urlList":[]}}