{"title":"DragonBall Z Season 1(001-026) English Dubbed-soagg","uid":4693421,"size":5601577532,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f86f3133e25bc33a727ff674b03682b6e8b7b62f&amp;dn=DragonBall+Z+Season+1%28001-026%29+English+Dubbed-soagg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soagg","files":26,"time":1233474704,"description":"Dragon Ball Z Season 1 Episodes 001-026 English Dubbed\n\nAll the Episodes are not of Top Notch Quality but most of them are. The rest are very good Quality.\n\nSource is AHQ. The Dubbing is Ocean Dub the latest version\n\nOutline:\nIn the version that is shown on YTV in Canada, the story begins mid-way through the Dragon Ball Z series. Raditz, Gokuus brother has traveled to Earth to find out why Gokuu has not yet destroyed the planet as he was supposed to do. But while as a baby, Gokuu was dropped (down a huge cliff) and forgot his real mission. Kakarot, Gokuus real name battles his brother Raditzs along with former enemy Piccolo and friend Kurilin. Meanwhile, Gohan; Gokuus son reveals his hidden powers against Raditz and nearly kills Raditz. However Gokuu is killed in the end, but Raditz is eventually defeated by Piccolo. Before he dies, he tells them that two evil-saiyans even more powerful then he is, are on route to Earth. The remaining fighters, Kurilin, Yamcha, Tein, and Chatsu begin their training to battle the evil saiyans, while Piccolo takes off with Gohan to train him in using his new found power. Meanwhile, Gokuu has to make his way back on Snake Way to King Kais where he trains himself in the secret art of Kaoken. Can Gokuu make it back in time to help his friends?\n\nComing next : Season 2 of the series\nI will upload the whole series as far as I know :)\n\nPlease seed and do write some comments on the quality!!\n\nEnjoy!!","torrent":{"xt":"urn:btih:f86f3133e25bc33a727ff674b03682b6e8b7b62f","amp;dn":"DragonBall+Z+Season+1%28001-026%29+English+Dubbed-soagg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f86f3133e25bc33a727ff674b03682b6e8b7b62f","infoHashBuffer":{"type":"Buffer","data":[248,111,49,51,226,91,195,58,114,127,246,116,176,54,130,182,232,183,182,47]},"announce":[],"urlList":[]}}