{"title":"Joy Zipper - American Whip (Apple Lossless) - CR@$H","uid":7217330,"size":293408798,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f8aa8814d6dd27daa6fcb2f89960ee02cba7d321&amp;dn=Joy+Zipper+-+American+Whip+%28Apple+Lossless%29+-+CR%40%24H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crashdiet69","files":-1,"time":1335424371,"description":"Joy Zipper is an American indie pop duo from Long Island, New York, made up of Tabitha Tindale and Vincent Cafiso, who are also a married couple. The duo has been playing dream pop since the late 1990s. The band is named for Tindale's mother.\n\nTheir songs are underpinned with darker scarred lyrics (suggested in interviews to have been inspired by the death of Cafiso's father) causing them to be famously compared to, 'a candy apple with a razor blade inside'.\n\nMusical influences of the band vary from 1960s rock outfits The Beatles, The Velvet Underground and most associated, The Beach Boys, to early 1990s noise rock pioneers My Bloody Valentine, and The Breeders.\n\nThe single &quot;Baby You Should Know&quot; has been featured on Fox Television's The O.C., and &quot;Go Tell the World&quot; was featured in an ad for Nike Soccer, and in a season two episode of Grey's Anatomy. The single &quot;1&quot; has been featured on Cigna's &quot;Go You&quot; TV commercial.\n\nJoy Zipper covered the Pixies &quot;Wave Of Mutilation&quot; for the American Laundromat Records compilation album, Dig For Fire - a tribute to Pixies (2007). In 2008, Joy Zipper covered the title track for the American Laundromat Records produced Cure tribute album, Just Like Heaven - a tribute to The Cure. The Wedding Present, The Submarines, Dean &amp; Britta and Tanya Donelly also appeared on the project.\n","torrent":{"xt":"urn:btih:f8aa8814d6dd27daa6fcb2f89960ee02cba7d321","amp;dn":"Joy+Zipper+-+American+Whip+%28Apple+Lossless%29+-+CR%40%24H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8aa8814d6dd27daa6fcb2f89960ee02cba7d321","infoHashBuffer":{"type":"Buffer","data":[248,170,136,20,214,221,39,218,166,252,178,248,153,96,238,2,203,167,211,33]},"announce":[],"urlList":[]}}