{"title":"Hacking the Human","uid":7814316,"size":12796246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9657d8436eac2c0dc5ff86a07c0bd300c4141eb&amp;dn=Hacking+the+Human&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1352618047,"description":"Hacking the Human :Social Engineering Techniques and Security Countermeasures\n\n\nPublication Date: November 1, 2008 \nISBN-10: 0566087731 | ISBN-13: 978-0566087738\n\nInformation security is about people, yet in most organizations protection remains focused on technical countermeasures. The human element is crucial in the majority of successful attacks on systems and attackers are rarely required to find technical vulnerabilities, hacking the human is usually sufficient.Ian Mann turns the black art of social engineering into an information security risk that can be understood, measured and managed effectively. The text highlights the main sources of risk from social engineering and draws on psychological models to explain the basis for human vulnerabilities. Chapters on vulnerability mapping, developing a range of protection systems and awareness training provide a practical and authoritative guide to the risks and countermeasures that are available.There is a singular lack of useful information for security and IT professionals regarding the human vulnerabilities that social engineering attacks tend to exploit. Ian Mann provides a rich mix of examples, applied research and practical solutions that will enable you to assess the level of risk in your organization; measure the strength of your current security and enhance your training and systemic countermeasures accordingly. If you are responsible for physical or information security or the protection of your business and employees from significant risk, then &quot;Hacking the Human&quot; is a must-read.","torrent":{"xt":"urn:btih:f9657d8436eac2c0dc5ff86a07c0bd300c4141eb","amp;dn":"Hacking+the+Human","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9657d8436eac2c0dc5ff86a07c0bd300c4141eb","infoHashBuffer":{"type":"Buffer","data":[249,101,125,132,54,234,194,192,220,95,248,106,7,192,189,48,12,65,65,235]},"announce":[],"urlList":[]}}