{"title":"The Ting Tings - Great DJ (Paint Party Version) (2nafish)","uid":5256875,"size":128278532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f98a450ee8095148f7a958c4ac554911b7dd060f&amp;dn=The+Ting+Tings+-+Great+DJ+%28Paint+Party+Version%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1262583875,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Great DJ&quot; is the name of the third single by English Indie pop band The Ting Tings. It was the first ever song that Jules De Martino and Katie White wrote together as the The Ting Tings.  Vocalist Katie White states that the song was written by &quot;playing a D chord on the guitar for hours, because that's all I could play. And then I put my finger on the wrong string, and got what I discovered was an augmented chord. And that was the riff!&quot; The single was originally released as a double A-side along with &quot;That's Not My Name&quot;.\n\nWhen &quot;Great DJ&quot; was re-released it did not enter the UK chart until 1 week after the individual re-release of single &quot;That's Not My Name&quot; went to #1.\n\nThe cover sleeves for the single were in fact recycled: Katie White and Jules De Martino gathered old 7&quot; records from numerous car boot sales and charity shops in and around Manchester, turned the sleeves inside out and customised them to create new sleeves for this single.\n\n&quot;Great DJ&quot; was featured in the 2-hour season premiere of the new show 90210. &quot;Shut Up and Let Me Go&quot; was also featured. The track also appears on the soundtrack of American Teen. &quot;Great DJ&quot; is also the trailer music for 2008 film Slumdog Millionaire and was used in commercials for Year One.This song was also used in commercials for Indonesian mineral water Mizone\n\nThe song also features in the console game Shaun White Snowboarding.\n\nThe song also features in Episode 14 of the BBC series Waterloo Road.\n\nThe song samples chords and drum beat from Eddie Money's 1978 hit &quot;Baby Hold On&quot;.\n\nWe Started Nothing is the debut album of the English pop duo The Ting Tings. It was released by the Columbia Label Group (UK) on 19 May 2008 in the United Kingdom. The US edition has a different cover image in several background colours. The album was also released in the UK as a limited edition LP on red vinyl limited to 2,000 copies. The US vinyl version is a standard black-vinyl pressing.\n\nThe Ting Tings are a Grammy-nominated British Indie-pop duo of Jules De Martino (drums, lead guitar, vocals, piano) and Katie White (vocals, guitar, bass drums and bass guitar). Originally from Hackney, London, they formed in December 2007 while based at Islington Mill, Artist Studios in Salford. They have released four singles on their current label Columbia Records UK, including the single &quot;That's Not My Name&quot; which charted straight at Number 1 in the UK Singles Chart on 18 May 2008. The album We Started Nothing was released on 19 May 2008 and charted at Number 1 in the UK.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f98a450ee8095148f7a958c4ac554911b7dd060f","amp;dn":"The+Ting+Tings+-+Great+DJ+%28Paint+Party+Version%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f98a450ee8095148f7a958c4ac554911b7dd060f","infoHashBuffer":{"type":"Buffer","data":[249,138,69,14,232,9,81,72,247,169,88,196,172,85,73,17,183,221,6,15]},"announce":[],"urlList":[]}}