{"title":"Coast to Coast AM January 03 2013","uid":7986862,"size":55738971,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fb09fc27a92a79278789eccee0a6cc6cd3d9b9c5&amp;dn=Coast+to+Coast+AM+January+03+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1357306279,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-03-13\nHost: \tGeorge Noory\nGuests: \tMichael Maloof, Michael E. Salla\n\nFormer policy analyst for the Dept. of Defense, and currently WND's Washington senior reporter, Michael Maloof, discussed how everything from our daily routines to our national defense will be crippled by an EMP attack, and why this is America's greatest threat to national security. An electromagnetic pulse (EMP) attack could come from either a serious solar storm (such as occurred in 1859) or a high-altitude nuclear explosion. This high intensity burst from super-charged particles can knock out or completely fry any unprotected electronics or electrical systems, he noted. The US' national grid system forms the basis for such crucial infrastructure as telecommunications and banking, and if it gets knocked out there would be cascading problems such as grocery stores running out of food, and the inability to access money or credit cards.\n\n&quot;If we had a major intensive [solar] storm that had a direct hit on us, it could cost up to $2 trillion over four years to attempt to recover, and it would take us up to 10 years to recover,&quot; with some 160 million people seriously impacted in the United States, he reported. Yet, we could take remedial action now, to strengthen and protect the grid, but the problem is there's no one agency coordinating such efforts, Maloof said, and Congress has ignored its own commission report and shelved funding measures-- estimated to be between $20-50 billion to start fixing the problem.\n\nWe need to create the position of an EMP Czar, someone under the National Security Council that can direct all activities from federal, state, and local governments to take decisive action, he continued, adding that the SHIELD Act should be reintroduced to the new Congress. Maloof also outlined EMP terror threats-- his biggest concern is over an attack instigated by a 'lone wolf' type, or a loose cannon state such as North Korea.\nMedvedev's ET Remarks\n\nFirst hour guest, pioneer in the development of 'Exopolitics', Michael Salla, offered analysis of Russian Prime Minister Medvedev's remarks when he was asked off-air by a reporter from PEN-TV whether &quot;the president is handed secret files on aliens.&quot; The mainstream media assumed that Medvedev was joking in his response when he mentioned the comedy movie Men in Black. However, Salla believes this was a deliberate mistranslation of his response, and that he was actually referring to a Russian TV documentary titled &quot;Men in Black,&quot; which reveals details of an extensive cover-up related to ETs visiting Earth. More here.\n\nNews segment guests: John Lott, Mitch Battros\nWebsite(s):\n\n    wnd.com/author/mmaloof\n    exopolitics.org\n\nBook(s):\n\n    A Nation Forsaken: EMP: The Escalating Threat of an American Catastrophe\n    Exopolitics: Political Implications Of The Extraterrestrial Presence\n    Exposing U.S. Government Policies on Extraterrestrial Life\n\n","torrent":{"xt":"urn:btih:fb09fc27a92a79278789eccee0a6cc6cd3d9b9c5","amp;dn":"Coast+to+Coast+AM+January+03+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb09fc27a92a79278789eccee0a6cc6cd3d9b9c5","infoHashBuffer":{"type":"Buffer","data":[251,9,252,39,169,42,121,39,135,137,236,206,224,166,204,108,211,217,185,197]},"announce":[],"urlList":[]}}