{"title":"Coleman-One World Order-Socialist Dictatorship(1998)","uid":4537772,"size":1791390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb55188f666168aa1a372f9438bf280a55b2d648&amp;dn=Coleman-One+World+Order-Socialist+Dictatorship%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227807791,"description":"This dr. John Coleman&amp;#039;s shocking book One World Order - Socialist Dictatorship (1998) which is probably the best and most documented expose of the hidden forces behind world socialism available to the general public. If you thought this is yet another book about those crazy communists in ex-Soviet Union and elsewhere you are badly mistaken as they were and still are only the stooges created by the powerful capitalistic forces of the west. And this time it is finally about them - the guys who are actually running the show - and surprise, surprise, they are all in the west, either in United States or Great Britain. As dr. Coleman writes, the enemy in Washington is more to be feared than the enemy in Moscow. Communism did not destroy tariff protection created by George Washington. Communism did not force the United States to adopt graduated income tax. Communism did not create the Federal Reserve Board. Communism did not get the United States into WWI or WWII. Communism did not force the United Nations on America. Communism did not take away the Panama Canal away from the American people. Communism did not create the Global 2000 report mass genocide plan. It was Socialism that has brought forth these evils upon the United States. Communism did not give the world AIDS. Communism did not give the Americans disastrous levels of unemployment. Communism did not mount unrelenting attacks on the Constitution of the United States. Communism did not force America to adopt &quot;foreign aid&quot; that cursed tax on the American people which is involuntary servitude. Communism did not force the end to school prayers. Communism did not promote the falsehood of &quot;separation of church and state.&quot; Communism did not give America a Supreme Court packed with justices bound and determined to undermine the Constitution of the United States. Communism did not send our soldiers to fight illegal wars to protect the interests of the British crown and other western richboys. While the attention of the western world was focused on the evils of Communism in Moscow, the Socialists in Washington were busy stealing America - and the trick succeeded in full. Thorougly documented, One World Order tells how this was and is still being accomplished on a daily basis. Will Americans finally wake up and reclaim their beloved Republic before they get merged into a world socialist dictatorship? If they will, they will first have to understand how the game is being played and who the major players are - and all are right in front of their very noses. One World Order exposes them all for the amazed reader to see and finally understand. 220 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:fb55188f666168aa1a372f9438bf280a55b2d648","amp;dn":"Coleman-One+World+Order-Socialist+Dictatorship%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb55188f666168aa1a372f9438bf280a55b2d648","infoHashBuffer":{"type":"Buffer","data":[251,85,24,143,102,97,104,170,26,55,47,148,56,191,40,10,85,178,214,72]},"announce":[],"urlList":[]}}