{"title":"Pink Floyd - Is There Anybody Out There The Wall Live (2000) EMI","uid":10522032,"size":1041737531,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fb6fb329a6af6a17233620aded487718b16455f6&amp;dn=Pink+Floyd+-+Is+There+Anybody+Out+There+The+Wall+Live+%282000%29+EMI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Beolab1700","files":119,"time":1404953325,"description":"[center]\n\n[size=5]Pink Floyd - Is There Anybody Out There The Wall Live (2000) EMI BoxSet FLAC Beolab1700[/size]\n\n[IMG]http://i.imgur.com/HAcRD4a.jpg[/IMG]\n\n---------------------------------------------------------------------\nPink Floyd - Is There Anybody Out There? The Wall Live 1980-1981 \n---------------------------------------------------------------------\n\nArtist...............: Pink Floyd\nAlbum................: Is There Anybody Out There? The Wall Live 1980-1981 \nGenre................: Rock\nSource...............: CD\nYear.................: 2000\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.3.0 20130526\nQuality..............: Lossless, (avg. compression: 55 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\nInformation..........: TRACKS - CUE - FULL BOX AND BOOKLET SCANS\n\nPosted by............: Beolab1700 on 09/07/2014\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Pink Floyd - MC: Atmos                                  [01:13]\n   2. Pink Floyd - In The Flesh?                              [03:00]\n   3. Pink Floyd - The Thin Ice                               [02:49]\n   4. Pink Floyd - Another Brick In The Wall - Part 1         [04:12]\n   5. Pink Floyd - The Happiest Days Of Our Lives             [01:39]\n   6. Pink Floyd - Another Brick In The Wall - Part 2         [06:19]\n   7. Pink Floyd - Mother                                     [07:54]\n   8. Pink Floyd - Goodbye Blue Sky                           [03:14]\n   9. Pink Floyd - Empty Spaces                               [02:14]\n  10. Pink Floyd - What Shall We Do Now?                      [01:40]\n  11. Pink Floyd - Young Lust                                 [05:16]\n  12. Pink Floyd - One Of My Turns                            [03:41]\n  13. Pink Floyd - Don't Leave Me Now                         [04:07]\n  14. Pink Floyd - Another Brick In The Wall - Part 3         [01:15]\n  15. Pink Floyd - The Last Few Bricks                        [03:25]\n  16. Pink Floyd - Goodbye Cruel World                        [01:41]\n\nPlaying Time.........: 53:47\nTotal Size...........: 304.96 MB\n\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Pink Floyd - Hey You                                    [04:55]\n   2. Pink Floyd - Is There Anybody Out There?                [03:09]\n   3. Pink Floyd - Nobody Home                                [03:15]\n   4. Pink Floyd - Vera                                       [01:27]\n   5. Pink Floyd - Bring The Boys Back Home                   [01:20]\n   6. Pink Floyd - Comfortably Numb                           [07:26]\n   7. Pink Floyd - The Show Must Go On                        [02:34]\n   8. Pink Floyd - MC: Atmos                                  [00:37]\n   9. Pink Floyd - In The Flesh                               [04:22]\n  10. Pink Floyd - Run Like Hell                              [07:05]\n  11. Pink Floyd - Waiting For The Worms                      [04:13]\n  12. Pink Floyd - Stop                                       [00:32]\n  13. Pink Floyd - The Trial                                  [06:01]\n  14. Pink Floyd - Outside The Wall                           [04:28]\n\nPlaying Time.........: 51:28\nTotal Size...........: 315.60 MB\n\n---------------------------------------------------------------------\n\nNo live Torrents for this one so high time it got put back into circulation, enjoy!.\n\nPink Floyd's supporting shows in 1980 and 1981 for Roger Waters' narcissistic, nihilistic epic The Wall are the stuff of rock &amp; roll legend. Throughout the '70s, the band earned the reputation as one of the best live acts in rock &amp; roll -- and not just because they delivered musically but because they delivered a full-fledged show. They had model planes crashing into the stage, giant inflated pigs hovering around the arena and, of course, astonishing live shows. All of Floyd's showmanship culminated in The Wall, an album that wasn't only a story, it was designed to be a theatrical experience.\n\nAnd that's exactly what Floyd designed under the direction of Waters and with the assistance of such artisans as animator Gerald Scarfe and stage designers Mark Fisher and Jonathan Park. Waters had a brilliant idea for the show -- an actual wall would be constructed across the stage, and then the band would play behind it as Scarfe's animations were projected on the wall and giant inflatable puppets danced on stage.\n\nOriginally, Waters wanted Floyd to perform behind the wall for much of the show, but during the development of the production, it was decided that the wall would be finished at the end of the first act -- in other words, at the end of the first record of the double album-set. The group devised ways to appear during the second half before the wall was torn down at the end -- David Gilmour played his &quot;Comfortably Numb&quot; solo on hydraulics, above the wall, and a hotel room with Waters brooding in a chair appeared during &quot;Nobody Home.&quot; Nevertheless, the importance of the group, as such, was diminished. As they readily admitted, it could have been anybody playing behind that wall, and they did augment their lineup with guitarists Snowy White (for the 1980 tour) and Andy Roberts (the 1981 tour), bassist Andy Brown, drummer Willie Wilson, and Peter Woods. At the end, it didn't really matter who was playing, since the entire Wall extravaganza was about the experience. And, from all accounts, it was one hell of an experience -- how could it not be, with actual theatre, film, music, and huge dancing puppets all added to the spectacle of a regular Floyd show?\n\nPink Floyd knew they had something special, something worth preserving, and they intended to do so with a concert film, possibly book-ended with filmed narratives. That plan didn't come to fruition because the footage was botched. How could it not be? Not only were the crew trying to capture a production that was about the theatrical experience, much of the later portion of the show would have been film of a film, as Gerald Scarfe's animations were projected on the cardboard bricks. So, the film mutated into the solemn, scarily sober Alan Parker film that became an '80s cult favorite, while live documentation of The Wall remained the province of bootlegs. Until the 2000 release of Is There Anybody out There?, that is. Skillfully edited together from the handful of Wall shows Floyd performed between 1980 and 1981 (much of the recordings reportedly date from shows at Earl's Court in London), the album replicates The Wall live -- which, of course, was a replication of the record, only with visuals. There are two songs not on the record -- &quot;What Shall We Do Now?,&quot; a tune pulled from the record at the 11th hour (early pressings still listed it on the sleeve), plus &quot;The Last Few Bricks,&quot; which was an instrumental at the end of the first act that gave the crew time to finish building the wall -- but they really add no revelations. There are no revelations at all, actually, with the possible exception of the layered harmonies on &quot;Outside the Wall,&quot; which makes this coda seem like a full-fledged song. Other than that, there are minor differences, from Gilmour guitar solos to Waters' vocal phrasing, but this plays exactly like the record. There are still the sonic details, spoken word pieces, and found noises, too -- the only difference is that there is some crowd noise, a few intros from the &quot;Master of Ceremonies,&quot; and an ever so slightly rougher fidelity. Since the show was so rigidly structured, there was no opportunity for the band to stretch out and jam (something they were very good at), apart from a handful of slightly extended endings.\n\nAll of this means, naturally, that Is There Anybody out There? is The Wall by any other name, and that it isn't for anybody but Floyd fanatics -- the kind that thrill to the little details, the little differences that separate this from the studio album, plus the lavish packaging (not just on the limited edition, either; the regular issue has two extensive booklets filled with new interviews by the band and associates). Will this disappoint the less-dedicated listener? Not necessarily, since it is a sharp, professional record -- and anybody that is familiar with The Wall will likely enjoy it as it's playing. The question is, how often will you put the record on? After all, anyone that will purchase Is There Anybody out There? will already have The Wall, and if they want to hear the piece, they'll listen to the studio recording since it is the original, full-realized version of the work. That doesn't really diminish the worth of Is There Anybody out There?, since it is a solid record, but it hardly makes it a necessary album, either.\n\n---------------------------------------------------------------------\n\n\n[/center]","torrent":{"xt":"urn:btih:fb6fb329a6af6a17233620aded487718b16455f6","amp;dn":"Pink+Floyd+-+Is+There+Anybody+Out+There+The+Wall+Live+%282000%29+EMI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6fb329a6af6a17233620aded487718b16455f6","infoHashBuffer":{"type":"Buffer","data":[251,111,179,41,166,175,106,23,35,54,32,173,237,72,119,24,177,100,85,246]},"announce":[],"urlList":[]}}