{"title":"Bones S08E16 HDTV Nl subs DutchReleaseTeam","uid":8222642,"size":366126395,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb9d6da7d8f6aea394cf11e31221a1766024ecd9&amp;dn=Bones+S08E16+HDTV+Nl+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":-1,"time":1362509787,"description":"[img]http://img683.imageshack.us/img683/9305/bnsv.jpg[/img]\n\n\nPlot:\n\nTemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\n\nVertaling: Dweez\n\n\n\nSeizoen 8 Aflevering 16: The Friend in Need\n\nHet Jeffersonian team onderzoekt de overblijfselen van een 15-jarige jongen. Hoewel zijn moeder en enkele goede vrienden hem zagen als intelligent met slechte sociale vaardigheden, ontdekt het team dat deze schijnbaar onschuldige jongen eigenlijk was betrokken bij illegale activiteiten en had deelgenomen aan een middelbare school feest twee weken geleden waar drugs aanwezig waren. Het onderzoek neemt een lelijke wending wanneer een minderjarig meisje bekent te zijn verkracht en de overleden jongen's reputatie in het gedrang komt. Ondertussen met al deze misleiding in de zaak overweegt intern Finn Abernathy om Cam te vertellen dat haar dochter Michelle iin de stad is voor een bezoek voor het weekend.\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.org/\n\n\nFollow me on #Twitter @Koedje\n\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:fb9d6da7d8f6aea394cf11e31221a1766024ecd9","amp;dn":"Bones+S08E16+HDTV+Nl+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9d6da7d8f6aea394cf11e31221a1766024ecd9","infoHashBuffer":{"type":"Buffer","data":[251,157,109,167,216,246,174,163,148,207,17,227,18,33,161,118,96,36,236,217]},"announce":[],"urlList":[]}}