{"title":"Age of Empires II HD Patch v2 6-RELOADED","uid":8768435,"size":122310334,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fd2f10bc706cb38796f8fa542d99a588e2aa29db&amp;dn=Age+of+Empires+II+HD+Patch+v2+6-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlackTar","files":3,"time":1375390262,"description":"              Age of Empires II HD Patch v2.6 (c) Microsoft Studios\n    \n        07/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam+CEG\n              - :.......... DISC(S) .. GAME.TYPE ........: Strategy\n   \n                   ÃœÃŸÃŸ  ÃœÃŸÃŸÃœ ÃœÃŸÃœÃŸÃœ ÃœÃŸÃŸ  ÃŸ ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ ÃœÃŸ\n  ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ Ã› ÃŸÂ² Ã›ÃŸÃŸÂ² Ã›   Â² Â²ÃŸ Ãœ Ã› Ã›  Â² Â²ÃŸ   Ã›  Â² ÃŸÃŸÃŸÃ› ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ\n                    ÃŸÃŸ  ÃŸ    ÃŸ   ÃŸ ÃŸÃŸÃŸÃŸ ÃŸ ÃŸ    ÃŸ     ÃŸÃŸ   ÃŸÃŸ\n  Note:\n  ~~~~~\n  Only the initial release is required to use this update.\n  \n  Check out the included text file for a list of what's new.\n\n2.6 Updates\nMayans have their eagle warrior back (instead of a scout cavalry).\nDetailed ELO information can be displayed in the main menu while in the multiplayer section. You can mouse over it for even more detailed information. \nELO rankings now show up in the lobbies, and update appropriately depending on mode.\nWhenever you complete a match, you will get details about how your ELO rankings were effected. It will also detail reasons why ELO rankings wouldn't have changed too, such as playing a game containing AIs, or aborting a match before the time limit elapsed.\nThe Steam Overlay should no longer interfere with frame rate issues.\nGames will not effect ELO until the game has been played for 90 seconds. This has been reduced from 5 minutes in RM and 2 minutes in DM. Both modes are now 90 seconds based on game speed (i.e. 'fast' is 2.0 speed, so actual time is 45 seconds)\nHistory screen now plays correct sounds for each of the civs.\nIn game event notifications for finding sheep, completing research, etc., are showing up again.\n\nKnown Issues\nThe main menu ELO stats only calculate when you enter the multiplayer screen. If the stats appear incorrect, leave the menu and re-enter the menu and they should update. It can take a few seconds to retrieve them from Steam after starting a game or updating scores at the end of a match.\nThere could be some overlap issues in the lobby screen to make room for the ELO, especially in some of the foreign languages. \nIf you quit a game (vs resigning), you will not receive the popup message detailing any ELO changes.","torrent":{"xt":"urn:btih:fd2f10bc706cb38796f8fa542d99a588e2aa29db","amp;dn":"Age+of+Empires+II+HD+Patch+v2+6-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2f10bc706cb38796f8fa542d99a588e2aa29db","infoHashBuffer":{"type":"Buffer","data":[253,47,16,188,112,108,179,135,150,248,250,84,45,153,165,136,226,170,41,219]},"announce":[],"urlList":[]}}