{"title":"A Short History of Byzantium.pdf","uid":14819502,"size":90929372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd40e150bd3b27225d201bdd817d24a06f0717ad&amp;dn=A+Short+History+of+Byzantium.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1465251353,"description":"A Short History of Byzantium\r\nAlfred A. Knopf | 1997 | 0679450882 | English | 508 pages | PDF | 86.7 MB\r\n\r\nAt a moment when the splendors of Byzantine art are being rediscovered and celebrated in America, John Julius Norwich has brought together in this remarkable edition the most important and fascinating events of his dazzling trilogy of the rise and fall of the Byzantine Empire.With wit, intelligence and an unerring eye for riveting detail, Lord Norwich tells the dramatic history of Byzantium from its beginnings in AD 330 when Constantine the Great moved the imperial capital from Rome to the site of an old Greek port in Asia Minor called Byzantium and renamed it Constantinople, to its rise as the first and most long-lasting Christian empire, to its final heroic days and eventual defeat by the Turks in 1453.It was a history marked by tremendous change and drama: the adoption of Christianity by the Greco-Roman world; the fall of Rome and its empire; the defeat by the Seljuk Turks at Manzikert in 1071; the reigns of Constantine, Theodosius the Great, Justinian and Basil II. There were centuries of bloodshed in which the empire struggled for its life; centuries of controversy in which men argued about the nature of Christ and the Church; centuries of scholarship in which ancient culture was kept alive and preserved by scribes; and, most of all, centuries of creativity in which the Byzantine genius brought forth art and architecture inspired by a depth of spirituality unparalleled in any other age. After more than fourteen centuries, the ever-dazzling brilliance of the mosaics of Ravenna and the ethereal splendor of the great church of St. Sophia in Istanbul still have the power to take one's breath away","torrent":{"xt":"urn:btih:fd40e150bd3b27225d201bdd817d24a06f0717ad","amp;dn":"A+Short+History+of+Byzantium.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd40e150bd3b27225d201bdd817d24a06f0717ad","infoHashBuffer":{"type":"Buffer","data":[253,64,225,80,189,59,39,34,93,32,27,221,129,125,36,160,111,7,23,173]},"announce":[],"urlList":[]}}