{"title":"W.S.Van.Dyke.1928.White.Shadows.in.the.South.Seas.(Deus.Branco)","uid":5888938,"size":727189885,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdbb1e4392f4c6f1f6b18d99832b4c1cb809160b&amp;dn=W.S.Van.Dyke.1928.White.Shadows.in.the.South.Seas.%28Deus.Branco%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ibergman","files":3,"time":1287160946,"description":"Unscrupulous trader Sebastian has little trouble cheating the inhabitants of the South Seas paradise and leading the natives to adopt some of the more unfortunate habits of &quot;civilized&quot; men. He has little opposition save Dr. Matthew Lloyd, once an educated and prominent physician but now smothered in the depths of alcoholic deterioration. When Lloyd goes too far in his attempts to thwart the success of the trader's greedy plots, Sebastian sees to it that the doctor is framed for a crime and sentenced to be cast adrift tied to the wheel of a derelict ship.\n\nHis ship caught in a typhoon, Lloyd is shipwrecked--freed from the ship's wheel--and washed ashore on another island as yet untouched by the &quot;White Shadows.&quot; He is rejuvenated by the pristine environment and the innocent people, who embrace him as a god. But the corruption of civilization is too close and the world too small for paradise to be eternal.\n\nhe New York Times critic wrote, &quot;Whether it is dangerous to stress the white man's failings and the nobleness of the savage in an age which no longer cares about such things remains to be seen...it is no longer the thing to point out that civilization is amiss, that the uncultivated and rough peoples in the far away corners of the earth have found a happiness--merely through their primitiveness--that the educated cannot reach.&quot;\n\nInternet Link: http://www.imdb.com/title/tt0019574/\nDirector: W.S. Van Dyke &amp; Robert J. Flaherty\nYear: 1928\n\nLanguage: Silence\nSubtitles: English intertitles and subs Spanish and Portuguese(br) srt","torrent":{"xt":"urn:btih:fdbb1e4392f4c6f1f6b18d99832b4c1cb809160b","amp;dn":"W.S.Van.Dyke.1928.White.Shadows.in.the.South.Seas.%28Deus.Branco%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdbb1e4392f4c6f1f6b18d99832b4c1cb809160b","infoHashBuffer":{"type":"Buffer","data":[253,187,30,67,146,244,198,241,246,177,141,153,131,43,76,28,184,9,22,11]},"announce":[],"urlList":[]}}