{"title":"Quake 2_v3.24_Russian_Edition_Plus_SGM_MOD_and_Server_Browser","uid":8605867,"size":157226089,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fe0eaeac930bceccc4a78ccc096ee297ecefab11&amp;dn=Quake+2_v3.24_Russian_Edition_Plus_SGM_MOD_and_Server_Browser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xbox06032","files":-1,"time":1372012812,"description":"*This is QUAKE 2 VERSION 3.24 RUSSIAN EDITION with SGM MOD (Stroggs Gone Mad) + Server Browser.\n\n*(Read below)\n\n\nFor being what typically Quake II is, this is a rather original appearing yet complex variant of the game. Many parts and sub-parts of the game has been updated, upgraded or patched. Work has been done to all of the gamex86.dll from CTF, Baseq2, Rogue and Xatrix. The stack in the game's main executable has been increased 16 x times. You also may enjoy some music as well now of your own.\n\n To hear Ogg Vorbis tracks in game, rip the Q2 CD's audio tracks (2-11) to track02-track11.ogg and put them in baseq2/music.  For the mission pack audio tracks, rip the Ground Zero CD's audio tracks (2-11) to track12-track21.ogg.  Don't bother ripping the tracks from the Reckoning CD, as they're a mix of the tracks on the Q2 and Ground Zero CDs. Everything else will be taken care of internally.\n\nThe version 3.24 was a simple, no-frills patch that fixes bugs (including the nVidia 191.x driver crash) and adds only meager tweaks aside from Ogg Vorbis support.  Intended for purists who have been using the woefully out of date version 3.20, it is not intended to add new features or be an engine mod in its own right however it's a great unofficial improvement. One accepted by the Quake II community and down right welcomed.\n\nWe also fixed (Hopefully) all of the issues experienced with Russian Edition's\n3.20 thru 3.23. Went as far as to remove our 'Easter Eggs&quot; as well\nas our Audio and Texture additions. The MOD we included in 3.24\nyou are able to play the game WITH OR WITHOUT unlike before!\nYou now have shortcuts to the Original  game, game with MOD\nfor Single Player, COOP, DM etc. Also I managed to do an important\nlast minute fix. One that needs to be done on ALL Quake 2 executables.\nI fixed what is known as a &quot;Stack Error&quot; in which a action like BFG &amp;/or\nother actions 'stack' and freeze the screen leading to a crash. Well the value\nthat is stock is set at 1 which I changed to 16 stack. FOR SURE IT'S HELPED!!\nEnjoy the Game and keep on seeding fellow Quakers.\n\n Keep on Fragging!!\n\n*Please Disregard and Delete the Torrent and Data from the OTHER Identical Torrents\nwith the same name etc.\n\nthepiratebay.se/torrent/8540034/ (Delete Please)\n\nthepiratebay.se/torrent/8530600/ (Delete Please)\n","torrent":{"xt":"urn:btih:fe0eaeac930bceccc4a78ccc096ee297ecefab11","amp;dn":"Quake+2_v3.24_Russian_Edition_Plus_SGM_MOD_and_Server_Browser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0eaeac930bceccc4a78ccc096ee297ecefab11","infoHashBuffer":{"type":"Buffer","data":[254,14,174,172,147,11,206,204,196,167,140,204,9,110,226,151,236,239,171,17]},"announce":[],"urlList":[]}}