{"title":"The Beatles - I'm Happy Just to Dance with You [A Hard Day's Nig","uid":8226988,"size":113868800,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fe7129a3d5f989ea6d973111b73ad24d60e898f6&amp;dn=The+Beatles+-+I%27m+Happy+Just+to+Dance+with+You+%5BA+Hard+Day%27s+Nig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1362627403,"description":"The Beatles - I'm Happy Just to Dance with You [A Hard Day's Night soundtrack promo].VOB\n\n\nHQ very rare promo music video from a film soundtrack. &quot;I'm Happy Just to Dance with You&quot; is a song written by John Lennon and Paul McCartney and recorded by the Beatles for the film soundtrack to A Hard Day's Night. Lead vocals are by George Harrison, whose performance in the film marked the first commercial music video segment with Harrison singing lead. \n\nIt was written specifically for George Harrison to sing at a time when he lacked the confidence to compose his own material. Years later, McCartney described it as a &quot;formula song&quot;, and Lennon said, &quot;I would never have sung it myself.&quot; \n\nStructurally, it features hectic Bo Diddley rhythm and busy banjo style guitar playing in juxtaposition with Harrison's vocal. Its composers give it an unpredictable choice of chord (augmenting the B7th on &quot;I'm happy just to dance with you&quot;) right at the crux of its title, jarring the chorus. The song is also unique in that it begins not with a verse or chorus but with the last four bars of the bridge. \n\nThe Beatles recorded &quot;I'm Happy Just to Dance with You&quot; on a Sunday, the first time they had used Abbey Road Studios on other than a normal work day. \n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/I'm_Happy_Just_to_Dance_with_You&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/I'm_Happy_Just_to_Dance_with_You&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/EAKFhAaeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EAKFhAaeg&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8300kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 224kbps\n   Duration: 00:01:58\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.5\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:fe7129a3d5f989ea6d973111b73ad24d60e898f6","amp;dn":"The+Beatles+-+I%27m+Happy+Just+to+Dance+with+You+%5BA+Hard+Day%27s+Nig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe7129a3d5f989ea6d973111b73ad24d60e898f6","infoHashBuffer":{"type":"Buffer","data":[254,113,41,163,213,249,137,234,109,151,49,17,183,58,210,77,96,232,152,246]},"announce":[],"urlList":[]}}