{"title":"The Wedding Present 1984 - 1996","uid":6707887,"size":2335132311,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe8ed90a5b5df37deed1197c09c2d0d55853650a&amp;dn=The+Wedding+Present+1984+-+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OKtoaster","files":458,"time":1317240008,"description":"The Wedding Present are a British indie rock group based in Leeds, England, formed in 1985 from the ashes of the Lost Pandas. The band's music has evolved from fast-paced indie rock in the vein of their most obvious influences The Fall, Buzzcocks and Gang of Four to more varied forms. Throughout their career, they have been led by vocalist and guitarist David Gedge, the band's only constant member.\n\nTo my knowledge, this is a complete collection of all The Wedding Present album releases and compilations spanning the years 1984 - 1996 (and a few later Peel session and a couple of concerts from the seamonsters/hit parade era). If you know of any tracks or releases missing from this complilation, let me know in the comments and I'll try and track them down.\n\n****\n\nMost of the files are compiled from soulseek and similar sources, so bitrate will vary. This is NOT a high quality sound torrent.\n\n****\n\nThe two previously uploaded torrents with seemingly similar content were missing the &quot;mini plus&quot; album, due to technical fuck up on my part. This album is now in the torrent, and I will be seeding this one.","torrent":{"xt":"urn:btih:fe8ed90a5b5df37deed1197c09c2d0d55853650a","amp;dn":"The+Wedding+Present+1984+-+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8ed90a5b5df37deed1197c09c2d0d55853650a","infoHashBuffer":{"type":"Buffer","data":[254,142,217,10,91,93,243,125,238,209,25,124,9,194,208,213,88,83,101,10]},"announce":[],"urlList":[]}}