{"title":"TV on the Radio - Discography (2004-2011) [FLAC]","uid":8873647,"size":2840731894,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe91e37a9f71f27fc6b4eac8779ae593df2b0f99&amp;dn=TV+on+the+Radio+-+Discography+%282004-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"politux","files":-1,"time":1378137073,"description":"\n  TV on the Radio - Discography (2004-2011) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Experimental, Alternative, Post-Rock\n  Source: CD and vinyl\n  Codec: FLAC\n  Bit Rates: ~ 800, ~ 3,000 kbps\n  Bit Depth: 16, 24\n  Sampling Rate: 44,100 Hz, 96,000 Hz\n\n  2004 Desperate Youth, Blood Thirsty Babes\n  2006 Return to Cookie Mountain\n  2008 Dear Science (16 bit CD version and 24 bit vinyl version)\n  2011 Nine Types of Light\n\n  The Brooklyn-based group TV on the Radio mix post-punk, electronic, and other atmospheric elements in such a creative way that it only makes sense that their core duo, vocalist Tunde Adebimpe and multi-instrumentalist/producer David Andrew Sitek, are both visual artists as well as musicians. Adebimpe is a graduate of NYU's film school and specializes in stop-motion animation, which his Brothers Quay-like video for the Yeah Yeah Yeahs single &quot;Pin&quot; amply demonstrates. He is also a painter, as is Sitek, who also produced the Yeah Yeah Yeahs' Machine EP and their full-length Fever to Tell.\n\n  The duo met when Sitek moved into the building where Adebimpe had a loft; each of them had been recording music on his own, but realized their sounds would work well together. Sitek's brother Jason began playing drums and other instruments with the pair during their recording sessions, which resulted in OK Calculator, a self-released disc of four-track recordings. Jason Sitek left the band for a short time due to other musical commitments but returned to the band when it recorded its Touch &amp; Go debut, the Young Liars EP.\n\n  After the EP was completed, TV on the Radio added guitarist/vocalist Kyp Malone to their fold. Young Liars, which also features the Yeah Yeah Yeahs' Brian Chase and Nick Zinner, was released in summer 2003 to critical acclaim, coinciding with their gigs opening for the Fall. Their first full-length release, Desperate Youth, Blood Thirsty Babes, arrived in spring 2004. The band remained busy for the rest of the year, embarking on its own tours as well as dates with the Faint and the Pixies. That fall, they released the New Health Rock EP and won the 2004 Shortlist Music Prize.\n\n  In 2005, the band kept busy with touring and returned to Sitek's Stay Gold studio to work on its second album. They also made an MP3 criticizing President George W. Bush, &quot;Dry Drunk Emperor,&quot; available on their website. TV on the Radio signed with 4AD for European distribution of their albums and moved to Interscope in the U.S. In summer 2006 they resurfaced with Return to Cookie Mountain, a more polished but still searching collection of songs that featured David Bowie on backing vocals. The band went in a sleeker direction on 2008's Dear Science, which featured cameos from Antibalas and Celebration's Katrina Ford.\n\n  The band went on hiatus following Dear Science. Malone worked on his own project, Rain Machine, and appeared on Iran's 2009 album Dissolver, while Sitek formed the collaborative pop project Maximum Balloon, which released its self-titled debut in 2010. As planned, their hiatus ended the following year, and TV on the Radio released their fifth album, Nine Types of Light, early in 2011. In March of that year, the band announced that bassist Gerard Smith, who had joined the TV on the Radio lineup in 2005, was suffering from lung cancer; the following month, on April 20, 2011, Smith passed away at the age of 34 as a result of the disease. Later that year, the band released World Cafe Live, taken from a set recorded for National Public Radio.","torrent":{"xt":"urn:btih:fe91e37a9f71f27fc6b4eac8779ae593df2b0f99","amp;dn":"TV+on+the+Radio+-+Discography+%282004-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe91e37a9f71f27fc6b4eac8779ae593df2b0f99","infoHashBuffer":{"type":"Buffer","data":[254,145,227,122,159,113,242,127,198,180,234,200,119,154,229,147,223,43,15,153]},"announce":[],"urlList":[]}}