{"title":"death note (dub)","uid":9549485,"size":2532499834,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ff49e1239c5d693d660f98580787e6239b83797a&amp;dn=death+note+%28dub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zerefff","files":45,"time":1391210918,"description":"plot\n\nLight Yagami is a bored young genius who resents all things evil. His life undergoes a drastic change when he discovers the &quot;Death Note&quot;, a notebook that kills anyone whose name is written in it. After experimenting with the notebook, Light confirms its authenticity and is joined by an unexpected house guest - the notebook's previous owner, a shinigami called Ryuk. Light tells Ryuk of his plan to exterminate all the criminals in the world, until only people whom he has judged to be honest and kind remain. Once he finishes creating this utopia, he means to rule over it as what he calls &quot;the god of the new world&quot;.Soon, the inexplicable deaths of criminals catch the attention of Interpol and the world-famous detective, &quot;L&quot;. L quickly learns that the serial killer, publicly known as &quot;Kira&quot; (derived from the Japanese pronunciation of the word &quot;killer&quot;), is located in Japan and can kill people by supernatural means. Light realizes that L will be his greatest hindrance, and begins a cat and mouse game with him.\n\nformat       -mp4\nsize         -av 65mb\nframe width  -640\nframe height -360\nepisodes     -37\n\ntorrent#2 so yeah no don't get all fuck knuckle if I messed up this is pretty much me just backing up my hardrive so yeah. that's about it,bye the way no img because bayimg fucked me off, and don't forget to seed and comment for the next person and if you like the anime...please support the anime buy purchasing a genuine copy\n                                              -zerefff the drunken uniicorn\n","torrent":{"xt":"urn:btih:ff49e1239c5d693d660f98580787e6239b83797a","amp;dn":"death+note+%28dub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff49e1239c5d693d660f98580787e6239b83797a","infoHashBuffer":{"type":"Buffer","data":[255,73,225,35,156,93,105,61,102,15,152,88,7,135,230,35,155,131,121,122]},"announce":[],"urlList":[]}}