{"title":"Alice Smith - For Lovers, Dreamers &amp; Me [2006][EAC/FLAC]","uid":10454960,"size":267356641,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff971db57f769f2a6c7e5233a9584a84e950ab14&amp;dn=Alice+Smith+-+For+Lovers%2C+Dreamers+%26amp%3B+Me+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1404063706,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: BBE #67\nCountry: USA\nYear:  September 5, 2006\nGenre: R &amp; B,Soul,blues\nFormat: CD, Album,\n\n[b]\n\n01. Dream (4:25)\n02. Woodstock (3:35)\n03. Gary's Song (3:36)\n04. New Religion (3:29)\n05. Do I (4:09)\n06. Fake is the New Real (3:21)\n07. Desert Song (3:50)\n08. Know That I... (3:16)\n09. Secrets (4:56)\n10. Love Endeavor (3:54)\n\n\n\nAlice Smith has the voice of a soul singer: a four-octave range and remarkable control, versatility, and emotion. And yet, or maybe because of this, her songs hardly fall into the soul, or even neo-soul, category. Instead, they circle from rock to blues to pop to R&amp;B to jazz, never settling fully into one before a new chord, a new phrase, or a new verse will change the feel completely. &quot;Woodstock,&quot; for example, starts off with a soft organ and an India.Arie-esque guitar, then switches a funk groove for the chorus, then segues to the verse with the band quoting &quot;Blister in the Sun,&quot; and yet somehow still works really, really well. In fact, the music and the production on all of For Lovers, Dreamers &amp; Me are fantastic, intricate, and layered while still retaining individual instrumental subtleties (the plucked strings on &quot;Fake Is the New Real,&quot; the forlorn trumpet in the chorus of &quot;Desert Song&quot;), adding the right amount of whimsy, ingenuity, passion, and technique to accent Smith's voice perfectly. Because it is her voice that makes her debut so compelling and fantastic. It's commanding, almost explosive in &quot;New Religion&quot;; it moves around in its lower register with grace and agility on &quot;Love Endeavor&quot;; it's sultry and sad in &quot;Do I,&quot; suspended over high notes and sunk calmly around the bass as if it doesn't even notice where it is, what it's been doing. Yet clearly it's focused, and its movements are anything but arbitrary. Smith is more than aware of the power she houses in her chest and throat, and when long smooth tones don't do quite enough to convey the sadness or anger or passion or regret in her lyrics, she isn't afraid to spit or growl or slur if that's what it takes to get her point across. And so while overall For Lovers, Dreamers &amp; Me may be positive and confident and even sentimental at times, there's the everyday human struggle, the pain of love, the falsity in contemporary society, within it as well. That added introspection makes it more than just a warm, thoughtful album; it also gives it an element of timelessness. It's an excellent record, from the harmonies to the instrumentation to the changes in dynamics and everything in between, an impressive debut from an impressive and talented musician.","torrent":{"xt":"urn:btih:ff971db57f769f2a6c7e5233a9584a84e950ab14","amp;dn":"Alice+Smith+-+For+Lovers%2C+Dreamers+%26amp%3B+Me+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff971db57f769f2a6c7e5233a9584a84e950ab14","infoHashBuffer":{"type":"Buffer","data":[255,151,29,181,127,118,159,42,108,126,82,51,169,88,74,132,233,80,171,20]},"announce":[],"urlList":[]}}